{"id": "0M6BfcAVMW", "number": 20069, "cdate": 1758302070963, "mdate": 1759897003397, "content": {"title": "TusoAI: Agentic Optimization for Scientific Methods", "abstract": "Scientific discovery is often slowed by the manual development of computational\ntools needed to analyze complex experimental data. Building such tools is costly\nand time-consuming because scientists must iteratively review literature, test mod-\neling and scientific assumptions against empirical data, and implement these in-\nsights into efficient software. Large language models (LLMs) have demonstrated\nstrong capabilities in synthesizing literature, reasoning with empirical data, and\ngenerating domain-specific code, offering new opportunities to accelerate com-\nputational method development. Existing LLM-based systems either focus on\nperforming scientific analyses using existing computational methods or on de-\nveloping computational methods or models for general machine learning without\neffectively integrating the often unstructured knowledge specific to scientific do-\nmains. Here, we introduce TusoAI, an agentic AI system that takes a scientific task\ndescription with an evaluation function and autonomously develops and optimizes\ncomputational methods for the application. TusoAI integrates domain knowledge\ninto a knowledge tree representation and performs iterative, domain-specific op-\ntimization and model diagnosis, improving performance over a pool of candidate\nsolutions. We conducted comprehensive benchmark evaluations demonstrating\nthat TusoAI outperforms state-of-the-art expert methods, MLE agents, and scien-\ntific AI agents across diverse tasks, such as single-cell RNA-seq data denoising\nand satellite-based earth monitoring. Applying TusoAI to two key open problems\nin genetics improved existing computational methods (40% power improvement\nto scDRS in associating cells to disease in simulations and 10.5% enrichment im-\nprovement to pgBoost for identifying ground-truth variant-gene pairs) and uncov-\nered novel biology, including 9 new associations between autoimmune diseases\nand T cell subtypes (e.g., primary biliary cirrhosis with central memory T cells)\nand 7 previously unreported links between disease variants linked to their target\ngenes (e.g., glucose/HbA1c risk variant rs138917529 with GCK). Our code will\nbe publicly available upon publication.", "tldr": "We present TusoAI, an agentic approach to constructing scientific methods, either from scratch, or improving upon a state-of-the-art tool.", "keywords": ["AI for Science", "Agentic AI", "Code Optimization", "AutoML"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/5026f0ba0bf14fb95f91ee300a5aa963faafa3ef.pdf", "supplementary_material": "/attachment/2e08d6cb4f785073b282eacf6936793a24c1372e.zip"}, "replies": [{"content": {"summary": {"value": "## Summary\n- The paper introduces TusoAI, an LLM agent for developing computational methods for domain-specific scientific tasks. They apply it to several biological and deep learning problems and demonstrate improvement over other agentic and LLM models. They also demonstrate its performance on iterating on existing state-of-the-art methods and show new scientific insights.\n\n## Recommendation\n- Reject. While results comparing with other agentic models are there, the actual performance isn't that much better compared to existing models on the specific tasks. The most interesting result is the case studies, but the other models were not run on the same case studies. There is a lack of case studies in other domains. Code is poorly written and not amenable to open source."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "## Strengths\n- Model architecture is properly motivated and described in sufficient detail.\n- The utility of a model is conveyed properly, I can see the usefulness of this.\n- Code is provided."}, "weaknesses": {"value": "## Weaknesses\n- TusoAI is designed to work with any domain as long as domain knowledge is provided, however, there is a strong focus on biological applications. This paper would benefit from showing TusoAI's performance in other scientific domains similar to the two biological case studies. I see that it worked on deep learning but only a cold start was performed. I am specifically asking for a warm start case study in a non-biology domain.\n- Diversity in methods produced is a core architecture consideration, but it is not substantiated in the text. While evidence is provided that TusoAI writes diverse code, there are no references supporting the assumption that generating more diverse code is better.\n- Code is poorly written / formatted."}, "questions": {"value": "## Questions\n- Was an ablation study performed on the number of points saved for each paper's methods in Step 1 \"Gather domain knowledge\"? How does increasing/ descresing point summaries affect the final model performance?\n- Why were other models not tested on the case studies? A lot seems to be riding on TusoAI's new findings, but other models were not given a chance.\n- How is the iterative refinement done for \"The initialization agent Ainit drafts 5 candidate solution descriptions from T and iteratively refines them using each paper summary in P\"? It is not clear and appears to be super important.\n- How many hyperparameters are there total for this agent? It appears to have a lot, and I would be curious how those hyperparameters affect the solutions. (ie. run time, integer values used in various places, utility scalars, probabilities, bug-fix attempts, etc..)\n- Which hardware is used for all of this? 8 hours means a totally different thing on a laptop vs. a data center. Are all models tested on the same hardware? I see some models are only accessible on the web: how do you account for different compute capabilities?\n- How many runs were used for ablation analysis (Table 3)? Was it just run once, or several times with mean score? If it was run once then it needs to be run more times, since LLMs are very stochastic and the results can vary significantly.\n- Where is the conclusion/future work section? The paper seems to end abruptly.\n\n## Feedback\n- The code is a mess. There are import statements all over the place, comments are unstructured and lacking in many places, and there are no clear instructions on how to reproduce results. Please fix this so I can take a look at the code myself and run things locally.\n- I_{diag} is not updated in Algorithm 1, it appears to remain as an empty list. Please consider removing or correct this.\n- Line 265: Change \"instruction by first uniformly draws\" to \"instruction by first uniformly drawing\".\n- The claims (line 297, first paragraph in section 4.1) that TusoAI provides \"novel\" and \"computationally efficient\" methods are not substantiated. Provide quantitative results for computational efficiency and a better empirical comparison of the results across all models. Simply stating the method TusoAI came up with does not mean it's novel.\n- Please make it clear which model is presented in figure 2B in the caption. This specific sub-figure would benefit from a better description in general.\n- Please provide motivation for why we care about generating diverse code. I would argue that if an agent can produce better methods, then it doesn't matter how diverse the methods produced along the way are. This is a central point studied in the paper that needs to be substantiated. In fact, producing lots of diverse models is at odds with the 8 hour time limit, since I can also imagine a model would benefit from trying to iterate on a model that works decently well instead of making smaller changes to a larger amount of models in the same period of time.\n- Line 386, please correct: \"Table ??\".\n- Line 430: \"This improvement reflects TusoAI’s ability...\", is not really a fair comparison. TusoAI started from the work the original authors had already done. Please correct this sentence to show how TusoAI expands upon the original work in a short amount of time, instead of making it seem it tested 167 unique versions _from scratch_.\n  - Same comment for line 464 for the second case study.\n- The text in the figures are tiny. Please make the text larger so it's easier to read instead of having to zoom in 300% to make out what it says.\n- Line 1244: \"It's samples\" change to \"Its samples\"."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QAi3jXBAQ0", "forum": "0M6BfcAVMW", "replyto": "0M6BfcAVMW", "signatures": ["ICLR.cc/2026/Conference/Submission20069/Reviewer_x86D"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20069/Reviewer_x86D"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20069/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760736311716, "cdate": 1760736311716, "tmdate": 1762932959565, "mdate": 1762932959565, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents TusoAI, a method that hand designs a set of steps for automated model discovery using LLMs. The authors compare their method against baseline methods on set of task and find that their approach achieves good performance with high diversity in the suggested solutions."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "- the problem of automated computational model design is important \n- ablation studies are provided to reveal some insight into the importance of the methods components\n- strong results are achieved on a set of tasks"}, "weaknesses": {"value": "- the paper lacks any discussion or conclusion\n- the Bayesian update step is unclear and not described\n- the method seems overall very heuristic. A (theoretic) justification of the algorithm would be of great value.\n- additionally the algorithm is rather complex and the explanation are difficult to follow at times\n- figure are sometimes unclear and would need re-working"}, "questions": {"value": "- what does your acronym TusoAI stand for?\n- Table 1 and 2: How is performance defined in these tasks?\n- Is the comparison in the experimental section fair in terms of computational load? How long are baseline methods run compared to the 8h for TusoAI?\n- Figure 2, 3 and 4: font size is too small and hard to read.\n- line 323: How were the text embeddings computed?\n- Figure 2B: Does this \"optimization trajectory\" look similar for all other tasks? Are there examples where the algorithm converges fast and then does not find a better solution?\n- In the methods there is no explanation of how the Bayesian update is performed. Can you explain where and how exactly a Bayesian update is performed and what the prior and posteriors involved are?\n- Table 3: Do the ablations only disable one of the parts (i.e. \"No Bayesian\" only disables the Bayesian part but keeps all other parts)?\n- line 380: How do you define the mean time to optimize? What is the criterion that optimization is achieved?\n- line 385: \"Results are shown in Table ??\"\n- Figure 3 B/C: What does the circles show? How should we read and interpret those figures?\n- Figure 4:\n  - what does the distance threshold mean?\n  - How should read and interpret figure 4C?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "iC15MmDccv", "forum": "0M6BfcAVMW", "replyto": "0M6BfcAVMW", "signatures": ["ICLR.cc/2026/Conference/Submission20069/Reviewer_kn4q"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20069/Reviewer_kn4q"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20069/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761475330779, "cdate": 1761475330779, "tmdate": 1762932958988, "mdate": 1762932958988, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper develops TusoAI, an agentic AI system that, given a scientific task description and an evaluation function, autonomously develops and optimizes computational methods for the application. TusoAI is tested across several single-cell tasks and some general deep learning tasks."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1) Mixing Bayesian optimization in the loop of an agentic AI system is interesting. I wish the paper had substantiated whether this is the first agent of this type or whether the idea is inspired by existing agents. \n\n2) The results show that some of the methods constructed by TusoAI are novel rather than simple re-implementation of existing approaches or calls to standard packages.\n\n3) The agentic system is tested in many scenarios, from final performance to behavior over time.\n\n4) Single-cell results show promising biological results."}, "weaknesses": {"value": "1) The writing can be improved. For example, the Abstract is excessively long. Instead of listing all results, please summarize the key points and condense the Abstract's opening.\n\n2) While the evaluations involve tasks beyond a single cell, it seems like TusoAI's performance is more pronounced in the single cell case, which might suggest the paper could have made that the central focus rather than a general-purpose multi-agent AI.\n\n3) The code is not available for a full review of the paper.\n\n4) Narrow scope to problems that can be solved using off-the-shelf ML models and strategies rather than those that need in-depth model development (e.g., new deep learning models rather than say fine-tuning Restnet). \n\n5) As discussed in the *LLM-based general learning agents* section, there are already agents developed for ML engineering. This work differentiates itself from those by focusing on scientific domains, but some baselines are still missing (R&D, DS, etc).\n\n6) Limitation in scale: only 10 papers retrieved from Semantic Scholar.\n\n7) I have some concerns about model selection and evaluation, which I have asked in the box below."}, "questions": {"value": "1) The key motivation behind TusoAI is to develop new computational solutions to existing problems in science.  Do the results show a new computational method developed beyond your expectations? One that is far beyond the reach of human ML engineers?\n\n2) Is there an underlying optimization problem that the Bayesian framework is solving? \n\n3) What is the convergence criterion of the system? Figure 2A and 2B suggest that TusoAI never really converges, as code diversity oscillates and performance dips. Is this expected or desired? How did you pick when the algorithm should be terminated? Are there any prompting guardrails that avoid oscillations?\n\n4)  Does increasing the number of papers retrieved from Semantics Scholar (from 10) improve the results?\n\n5) Can you elaborate on how the paper ensures the model selection has been done in an apples-to-apples way across the datasets/baselines? Is model evaluation also handled by TusoAI or externally?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "dgld1o6Txt", "forum": "0M6BfcAVMW", "replyto": "0M6BfcAVMW", "signatures": ["ICLR.cc/2026/Conference/Submission20069/Reviewer_SvJ8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20069/Reviewer_SvJ8"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20069/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761750945507, "cdate": 1761750945507, "tmdate": 1762932958578, "mdate": 1762932958578, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces TusoAI, an agentic AI framework that automatically develops and optimizes computational methods for scientific tasks. Given task descriptions and evaluation functions, it can generate new algorithms rather than just run existing analysis pipelines. The main idea is to structure domain knowledge into a “knowledge tree,” combine it with Bayesian-guided iterative optimization and diagnostic feedback, and iteratively generate, implement, and evaluate candidate solutions. On 11 benchmarks, TusoAI achieved a higher average rank compared to expert-designed methods and existing AI agents."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- Clear motivation and problem framing. The paper focuses on creating methods rather than just executing pipelines. It specifies the objective and agent loop, including the task description and the evaluator $h(\\cdot)$, with cold/warm start.\n- Breadth of benchmarks with application case study. Empirical scope spans 11 tasks across two domains (six single-cell, five scientific deep learning).\n- The warm-start improvements on scDRS and pgBoost are interesting. It is interesting to consider concrete empirical deltas and biological findings (e.g., new T-cell disease associations; rs138917529→GCK link)."}, "weaknesses": {"value": "- Too many symbols in Algorithm 1. If the authors want to introduce these annotations, they should include an appendix table.\n- Baseline coverage is insufficient, mainly including general-purpose agents (AIDE, Biomni, ChatGPT-Agent) and simple expert or AutoML models. It lacks domain-specific, publication-level baselines for each scientific task. Including parts of the leaderboard is recommended.\n- Ablation and diagnosis analyses lack depth. The ablation study in Table 3 mixes tasks from unrelated domains. It omits per-task variance or statistical testing, making it impossible to isolate the contribution of each component (knowledge tree, Bayesian updates, diagnosis). \n- No detailed analysis of failure cases or performance drops is provided, so readers cannot understand when the system fails or regresses.\n- Case studies serve as illustrations but lack control. The genetic applications (scDRS, pgBoost) show improvements, yet they lack independent validation or error analysis."}, "questions": {"value": "- Can the authors clearly specify what metric is used in each column of Tables 1 and 2, and how the “Avg” and “Avg rank” values are computed across heterogeneous tasks? If normalization was applied (e.g., 1 – MSE, scaled decomposition R²), please make this explicit in the main text or table captions.\n- How do the qualitative examples, such as NMF with dropout/Poisson modeling and Satellite ensembling, support the narrative of the methods being \"distinct\" or \"custom\"?\n- Is using text similarity (Fig. 2A) a sufficient proxy for diversity, or should a more principled novelty metric be employed in the evaluation?\n- This work’s broad, application-driven scope and descriptive evaluation would be better suited for an applied-science journal rather than a methodology-focused venue like ICLR."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Sxi9r5PMSP", "forum": "0M6BfcAVMW", "replyto": "0M6BfcAVMW", "signatures": ["ICLR.cc/2026/Conference/Submission20069/Reviewer_aNYX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20069/Reviewer_aNYX"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20069/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762120857796, "cdate": 1762120857796, "tmdate": 1762932958041, "mdate": 1762932958041, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces TusoAI, an LLM-based agentic system for automatically developing and optimizing computational methods for scientific applications. The system structures domain knowledge into a hierarchical knowledge tree, uses Bayesian updates to sample optimization strategies across categories, and incorporates diagnostic feedback during iterative refinement. The authors evaluate TusoAI on 11 scientific benchmarks (6 single-cell analysis tasks and 5 deep learning tasks), showing consistent improvements over baselines including AIDE, Biomni, and expert-designed methods. Two case studies in genetics demonstrate practical utility by improving existing methods (scDRS and pgBoost) and uncovering novel biological insights."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper evaluates TusoAI on 11 tasks spanning single-cell analysis and scientific deep learning, demonstrating broad applicability. The inclusion of both cold-start and warm-start settings, along with real-world case studies in genetics, strengthens the practical relevance.\n\n2. The knowledge tree representation provides a structured way to organize domain knowledge, and the Bayesian update mechanism offers a principled approach to balancing exploration and exploitation. The diagnostic-based optimization is a nice addition that grounds the system in empirical data patterns.\n\n3. TusoAI consistently outperforms strong baselines including AIDE and domain-specific expert methods. The ablation studies effectively demonstrate that each component (categories, Bayesian updates, diagnostics, domain knowledge) contributes meaningfully to overall performance."}, "weaknesses": {"value": "1. The core algorithmic components are largely existing techniques (LLM agents, tree-based search, iterative optimization), and the main contribution is their combination for scientific method development. The concurrent work by Aygun et al. (2025) appears to address very similar problems, but the paper dismisses direct comparison due to unavailable code without sufficiently differentiating the approaches conceptually.\n\n2. The 8-hour optimization budget is relatively short and may favor methods that converge quickly over those requiring longer refinement. The diversity analysis (Figure 2A) shows TusoAI explores more than AIDE, but it's unclear whether this translates to better generalization. The selection strategy (shortest code within 0.1% of best performance) seems ad-hoc and could inadvertently favor simpler but less robust solutions.\n\n3. The paper doesn't discuss when TusoAI fails or performs poorly, nor does it address practical concerns like how to set appropriate evaluation functions for novel scientific problems, how sensitive the system is to task description quality, or how to validate generated methods when ground truth is unavailable. The computational cost analysis is limited to one brief mention ($0.37-$0.41 for case studies).\n\n4. The case studies claim to discover \"9 new associations\" and \"7 previously unreported links,\" but these are computational predictions that would require experimental validation to be considered true biological discoveries. The statistical methodology for declaring associations as \"novel\" versus \"missed by previous methods\" is not clearly described.\n\n5. While the authors promise to release code upon publication, key details are missing: which specific LLM API versions were used, how were papers selected from Semantic Scholar (just citation count?), what are the exact prompts for different agents, and how stable are results across different random seeds beyond the reported 95% CIs?"}, "questions": {"value": "1. How does TusoAI handle the cold start problem for truly novel scientific domains? The knowledge tree construction relies on retrieving papers from Semantic Scholar based on task descriptions. For emerging research areas with limited literature, how does the system bootstrap domain knowledge? Have you tested TusoAI on tasks where relevant literature is scarce or the task description is deliberately vague?\n\n2. Can you provide more details on the comparison with Aygun et al. (2025) and clarify the key technical differences? Beyond the unavailability of their code, what are the conceptual and methodological differences between your approach and theirs? This seems critical for establishing the novelty of your work."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "bm7p4aXvDv", "forum": "0M6BfcAVMW", "replyto": "0M6BfcAVMW", "signatures": ["ICLR.cc/2026/Conference/Submission20069/Reviewer_ff1y"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20069/Reviewer_ff1y"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission20069/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762122120079, "cdate": 1762122120079, "tmdate": 1762932957383, "mdate": 1762932957383, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}