{"id": "1FEm5JLpvg", "number": 2930, "cdate": 1757302445740, "mdate": 1759898118619, "content": {"title": "Projected Coupled Diffusion for Test-Time Constrained Joint Generation", "abstract": "Modifications to test-time sampling have emerged as an important extension to diffusion algorithms, with the goal of biasing the generative process to achieve a given objective without having to retrain the entire diffusion model. However, generating jointly correlated samples from multiple pre-trained diffusion models while simultaneously enforcing task-specific constraints without costly retraining has remained challenging. To this end, we propose Projected Coupled Diffusion (PCD), a novel test-time framework for constrained joint generation. PCD introduces a coupled guidance term into the generative dynamics to encourage coordination between diffusion models and incorporates a projection step at each diffusion step to enforce hard constraints. Empirically, we demonstrate the effectiveness of PCD in application scenarios of image-pair generation, object manipulation, and multi-robot motion planning. Our results show improved coupling effects and guaranteed constraint satisfaction without incurring excessive computational costs.", "tldr": "A test-time framework enabling multiple pretrained diffusion models to generate joint samples enforcing task-specific constraints.", "keywords": ["diffusion model", "constrained diffusion"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/901e3c0151e36e27fba56e44d7a47c5a85c359e7.pdf", "supplementary_material": "/attachment/02d2788cdb9744fafd9df12fc94bd2fe44feae6e.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes a method to jointly sample two independent variables coupled using a joint cost function. Practically, given the independent denoising score functions of each variable, the goal is to couple their denoising process directly at test time to sample them jointly. The paper introduces some variants: (1) standard LMC/DDPM based: perform one step-denoising, use classifier guidance using the gradient of the cost function and then perform projection to map the noisy latents to the safe-set. (2) use tweedie clean estimates to calculate the gradient of the cost function. Overall the paper claims that the proposed method generalizes the formulation of classifier-guidance, projected diffusion, compositional diffusion and joint diffusion.\n\nI am familiar with a concurrent work in this line of research: https://arxiv.org/abs/2509.08775\nWhile my concerns are based on the concurrent work, my judgment of this paper will be independent of it."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper's unified formulation of classifier-guidance, projected diffusion, compositional diffusion and joint diffusion is very impactful and timely. The authors have provided exhaustive results to analyze the performance of their algorithm on toy-domain, a planar robotics task and an image generation task as well.\n\n2. PCD can impose hard constraints in addition to joint diffusion while being computationally efficient."}, "weaknesses": {"value": "1. Data fidelity vs projection: Since the cost function and projection operation hold for the clean distribution, data fidelity is of primary importance here. The more realistic the clean estimates are, the better evaluation and guidance can be done. However, as the authors acknowledge as well, the projection operation hurts data fidelity, as also observed by the concurrent work, when applied to low-quality clean estimates (particularly at higher noise levels). \n\n2. Differentiability of cost function: This is a considerably strong assumption (which is also used by many prior works like MPD, DPCC). For example, the signed distance based indicator function in SHD might not be differentiable everywhere. This is a case, especially for collision checking objectives for real robot executions. I agree that effective engineering design can mitigate this, but this limits the scalability of the approach.\n\n3. convexity of constraints: Since two experiments in the paper deal with navigation and manipulation, it is worth noting that non-convex safe sets are pretty common in these two settings, most commonly arising from obstacle avoidance constraints. For example, in the highway task if the trajectories are trained without the rectangle in between and forced to avoid it at test time, the resulting safe-set becomes non-convex. This again limits the scalability."}, "questions": {"value": "1. How feasible is designing a projection operator for every task? How sensitive is the overall quality of samples to projection hyperparameters?\n\n2. How is the cost function in general defined for noisy latents? It seems from the algorithms that the method always uses the clean estimates for projection and using the same for cost function also empirically results in the best performance."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hmcWI5zFuQ", "forum": "1FEm5JLpvg", "replyto": "1FEm5JLpvg", "signatures": ["ICLR.cc/2026/Conference/Submission2930/Reviewer_DJcn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2930/Reviewer_DJcn"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2930/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761515465722, "cdate": 1761515465722, "tmdate": 1762916448425, "mdate": 1762916448425, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Projected Coupled Diffusion (PCD), a novel test-time framework for generating jointly correlated samples from multiple pre-trained diffusion models while simultaneously enforcing hard, task-specific constraints. The core problem is that generating from a joint distribution $p(x, y)$ is difficult, especially when $x$ and $y$ must be correlated in a specific way and satisfy some given hard constraints. PCD addresses this by modifying the reverse diffusion sampling process. At each step, the update for each variable is guided by three components:\n\n1. The score from its own pre-trained model (e.g., $s_X^\\theta(x_t, t)$).\n\n2. A gradient from a coupling cost function $c(x, y)$ that encourages the desired correlation between variables.\n\n3. A projection operator $\\Pi_{\\mathcal{K}}$ that forces the updated sample back into the feasible set of hard constraints.\n\nThis approach requires no retraining and unifies compositional generation with hard-constraint enforcement at test time. The authors demonstrate PCD's effectiveness across three distinct domains: multi-robot motion planning, diverse robot manipulation, and constrained image-pair generation."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper unifies two important aspects in diffusion sampling: coupled generation and constrained generation through a clear and effective way. The proposed PCD provides a general, test-time-only framework to address this. PCD operates over multiple pre-trained models and costs (analytic or learned), requiring no retraining of the base diffusions, which enables the method applicable to a wide variety of settings, for example, where paired data and costs are scarce or proprietary.\n\n2. This paper is well written, easy-to-follow, and conducts extensive studies across various domains, including multi-robot planning, Push-T trajectory pairs, and paired face generation."}, "weaknesses": {"value": "1. PCD relies on projection and gradient-based updates to enforce constraints. How does it handle test-time constraints that are non-differentiable, for instance, a logic-based rule where a sample is accepted only if it passes some non-differentiable verification? A concrete example would help.\n\n2. The performance of the proposed method might require the estimated Tweedie to be of high-quality. Otherwise, the further guidance term might likely be inaccurate or even compromise the overall sampling process.\n\n3. This paper introduces gradient-based guidance and per-step projections, which can increase wall-clock latency compared with non-gradient based baselines. In appendix C.1, the authors also mention \"PCD is approximately 4 ∼ 7× slower than vanilla diffusion mainly due to the per-step projection operation.\" Are there any potential ways to enable faster sampling with PCD?\n\n4. Could the authors provide a curve of performance v.s. the number of sampling steps to illustrate how will the quality of the estimated Tweedie term affect performance? An intuition is that with more sampling steps, the Tweedie estimate will be more accurate, which could facilitate better guidance.\n\n\n5. I would encourage the authors to include discussion on the limitations of PCD along with failure analysis with qualitative examples."}, "questions": {"value": "See the Weakness above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "3VWLF78VAu", "forum": "1FEm5JLpvg", "replyto": "1FEm5JLpvg", "signatures": ["ICLR.cc/2026/Conference/Submission2930/Reviewer_XYUt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2930/Reviewer_XYUt"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2930/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761949553504, "cdate": 1761949553504, "tmdate": 1762916448184, "mdate": 1762916448184, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The submission proposes a test-time framework to sample from multiple pre-trained diffusion models while (1) promoting some notion of joint \"correlation\" across variables and (2) enforcing constraints on the individual outputs of each model. PCD augments the usual Langevin / DDPM updates with (1) a user-specified  coupling cost between variables and (2) projections at every diffusion step to guarantee individual constraint satisfaction. Their framework  several existing methods (e.g., classifier guidance, projected diffusion, and some forms of compositional diffusion) as special cases. Empirical demonstrations cover three domains: multi-robot navigation (collision avoidance coupling cost, velocity constraints), robot manipulation on PushT (diverse, non-intersecting trajectories  as a coupling cost with velocity constraints), and ``paired'' face generation (age-contrast coupling with gender/attribute constraints)."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "The paper is well structure and clearly written. The problem of composing several trained diffusion models at test time under constraints is indeed relevant, and prior work has aimed to tackle similar problems when sampling a single variable (e.g. a single image). The main novelty, in my understanding, is the ability to compose diffusion models potentially defined over different variables. The approach is widely applicable and requires minimal modifications of standard sampling algorithms. The use case in muti-robot systems is well motivated, since constraints arise naturally in physical systems and training joint distributions can be computationally costly as the number of agents grows. The toy-example in images -- although artificial -- showcases the applicability of the framework in a totally different setting."}, "weaknesses": {"value": "I think that the notion of \"correlated\" variables, which is emphasized throughout the paper, could be better defined/explained/motivated. Since the framework is flexible to accommodate arbitrary coupling costs, correlations are in my view an understatement with respect to the practical utility and applicability of the proposed method and underlying problem it is tackling.\n\nIn PushT trajectory dissimilarity appears to me as a contrived objective/task, there might be manipulation examples (e.g. bimanual over multiple objects) that lend themselves more naturally/directly to the framework."}, "questions": {"value": "Can you scale the approach beyond two variables/agents? \n\nCan you numerically verify that the two coupling limits match known methods (classifier guidance, projection), at least in a toy experiment?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "Q4hN4vArxp", "forum": "1FEm5JLpvg", "replyto": "1FEm5JLpvg", "signatures": ["ICLR.cc/2026/Conference/Submission2930/Reviewer_fLqz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2930/Reviewer_fLqz"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2930/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761954216322, "cdate": 1761954216322, "tmdate": 1762916447984, "mdate": 1762916447984, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper studies the problem of combining pretrained diffusion models while enforcing task-specific constraints. The authors present a projected coupled diffusion framework for constrained joint generation. This framework introduces two generative dynamics with coupled  guidance terms, and use projection to impose hard constraints. Several experiments are used to show the effectiveness."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- This paper studies the problem of generating samples from pretrained diffusion models while satisfying task-specific constraints. This problem is important because pretrained diffusion models are often available, but sample constraints are typically not enforced during training.\n\n- The authors formulate a new problem of generating correlated samples under hard constraints.\n\n- They propose a generation method based on coupled dynamics, combining a coupled cost with projection onto hard constraints. This approach generalizes projected diffusion to coupled dynamics.\n\n- The authors further show that several existing methods can be viewed as special cases of the proposed coupled dynamics framework.\n\n- Several experiments show benefits from both projected diffusion and cost guidance."}, "weaknesses": {"value": "- The projected coupled dynamics are intuitively designed by combining cost and projection. However, the conditions under which this method converges have not been studied, and to where. \n\n- The effect of coupled costs has not been analyzed, and costs may not always be differentiable.\n\n- The projection step is not discussed in detail. It can be infeasible when the constraints are non-convex. It is also not clear how to do projection for latent diffusion models. \n\n- All special cases correspond to degenerate forms of the projected coupled dynamics. New application scenarios for the projected coupled dynamics have not been explored.\n\n- Experiments demonstrate the effectiveness of combining cost and projection, which is expected since it benefits from both projected diffusion and reward guidance. However, it remains unclear to what extent the experiments reveal the advantages of the coupled dynamics."}, "questions": {"value": "See comments in Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "NAzLyaks3D", "forum": "1FEm5JLpvg", "replyto": "1FEm5JLpvg", "signatures": ["ICLR.cc/2026/Conference/Submission2930/Reviewer_Emdc"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2930/Reviewer_Emdc"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2930/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762283037624, "cdate": 1762283037624, "tmdate": 1762916447805, "mdate": 1762916447805, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}