{"id": "1MHZGpvSDJ", "number": 17909, "cdate": 1758281916703, "mdate": 1759897146107, "content": {"title": "Target Drift in Multi-Constraint Lagrangian RL: Theory and Practice", "abstract": "Lagrangian-based methods are one of the dominant approaches for safe reinforcement learning (RL) in constrained Markov decision processes, commonly used across domains with multiple constraints. While some implementations combine all constraints into a mixed penalty term and others use one estimator per constraint, the fundamental question of which design is theoretically sound has received little scrutiny. We provide the first theoretical analysis showing that the mixed-critic architecture induces a persistent bias due to target drift from evolving Lagrange multipliers. In contrast, dedicated-critic design—separate critics for reward and each constraint—avoids this issue. We also validate our findings in a simulated but realistic energy system with multiple physical constraints, where the dedicated-critic method achieves stable learning and consistent constraint satisfaction, while the mixed-critic method fails. Our results offer a principled argument for preferring dedicated-critic architectures in multi-constraint safe RL problems.", "tldr": "", "keywords": ["Energy System Operation", "Safe", "RL"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/65f5d5514ffc8ef7b839eb6c94bdc94f110f621b.pdf", "supplementary_material": "/attachment/7c5778287b51df12aae72aff5f9c8149738fe95d.zip"}, "replies": [{"content": {"summary": {"value": "This paper studies the target drift problem in multi-constraint reinforcement learning, where the interference among constraints leads to unstable or biased policy learning. The authors identify that the coupling of multiple cost critics causes conflicting value estimation and investigate two architectures: dedicated-critic design, where each constraint has an independent critic, and mixed-critic design, where all constraints share a critic. Through theoretical analysis and empirical evaluation, the paper shows that the dedicated-critic design improves constraint satisfaction and accelerates convergence, outperforming existing multi-constraint RL methods."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper provides a clear and well-motivated analysis of the target drift problem in multi-constraint RL, a practically important yet underexplored issue.  \n2. The distinction between dedicated-critic and mixed-critic designs is insightful, with solid theoretical justification and intuitive explanations for the difference regarding target drift.  \n3. Theoretical analysis is well presented, linking critic coupling to bias propagation and constraint interference.  \n4. Experimental results are comprehensive and consistently demonstrate the superiority of the dedicated-critic design.  \n5. The paper is well written, conceptually clear, and contributes meaningful guidance for better multi-constraint RL algorithms."}, "weaknesses": {"value": "1. **Limited theoretical novelty*:* The main theorems (Theorem 4.7 and 4.9, pp. 6–7) quantify bias under standard stochastic approximation assumptions but remain restricted to linear critics.  \n2. **Restricted scope of analysis:** The theoretical results are limited to linear function approximation (p. 12, Appendix B). It is unclear how the findings generalize to nonlinear or deep critic architectures.  \n3. **Limited empirical diversity:** The experiments (CMDP bandit in §5.1, pp. 7–8, and multi-constraint power system in §5.2, pp. 8–9) are informative but not diverse enough to establish generality. Both setups are relatively low-dimensional and deterministic."}, "questions": {"value": "1. **Extension to nonlinear critics:** How would the bias analysis (Theorem 4.7 vs. 4.9, pp. 6–7) extend to nonlinear or partially shared neural-network critics?  \n2. **Sample efficiency:** Since each constraint has its own critic, does this design require more samples to achieve comparable performance to mixed-critic methods?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7x6VOlyZxj", "forum": "1MHZGpvSDJ", "replyto": "1MHZGpvSDJ", "signatures": ["ICLR.cc/2026/Conference/Submission17909/Reviewer_MmuH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17909/Reviewer_MmuH"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17909/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761387501862, "cdate": 1761387501862, "tmdate": 1762927727874, "mdate": 1762927727874, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper shows that in Lagrangian-based safe reinforcement learning with multiple constraints, using separate critics for each constraint leads to more stable and reliable learning than the common mixed-critic design. The authors provide theoretical analysis and experiments on an energy system to support this finding."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper provides theoretical justification for preferring the dedicated-critic design over the mixed-critic approach in multi-constraint safe RL."}, "weaknesses": {"value": "1. The paper does not provide practical algorithmic implementations to demonstrate the applicability of the theoretical findings. \n2. The empirical results are limited and insufficient to support the claimed advantages of the proposed design."}, "questions": {"value": "1. The authors approximate the state value as $\\mathcal{E}^x_{\\pi_\\theta}(s) = \\phi(s)^\\top \\omega^x$, and the theoretical results rely on this linear assumption. While it simplifies analysis, the paper does not justify this choice or clarify whether the implementation follows the same approximation.\n\n2. The theorems establish error bounds in the limit, but during training the transient errors can be large. How do the authors ensure training stability and convergence in such cases?\n\n3. In the experiments, the baseline Lag-PPO variant that satisfies Assumption 4.1 is missing. According to Theorem 4.7, this baseline should perform similarly to DC-Lag-PPO, and including it would better support the theoretical claims.\n\n4. The paper reports only the constraint violation ratio, which does not directly indicate whether the expected cumulative cost $J_{c_i}(\\pi)$ remains below the threshold $d_i$. Can the authors provide plots comparing the actual costs and thresholds during testing to verify constraint satisfaction?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "J6lJWWGXUh", "forum": "1MHZGpvSDJ", "replyto": "1MHZGpvSDJ", "signatures": ["ICLR.cc/2026/Conference/Submission17909/Reviewer_XsdP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17909/Reviewer_XsdP"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17909/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761412633638, "cdate": 1761412633638, "tmdate": 1762927727322, "mdate": 1762927727322, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper consider the problem of bias in estimators for constraints in CMDPs with multiple constraints. It evaluates mixed critic vs dedicated critic estimators and presents theoretical guarantees showing that mixed critic introduces a persistent target drift due to evolving Lagrangian multipliers hence making them inferior to dedicated critics that do not face this issue. The theory is supported by experiments in a toy CMDP bandit and a realistic multi-constraint energy system."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "- The identification of dual-induced drift as a source of bias in mixed critics is novel and provides a principled justification for using dedicated critics in multi-constraint problems\n- The analysis leads directly to a practical design guideline of using dedicated critics in multi-constraint CMDPs which is immediately applicable in existing safe RL frameworks\n- The experiments, though limited, are carefully designed. The bandit experiment serves as a minimal diagnostic test verifying the bias empirically, while the power system control problem adds realism and complexity. The results align tightly with the theory."}, "weaknesses": {"value": "- The target drift mechanism, while formally articulated here by quantification of the bias, is not entirely surprising. The observation that lagrangian updates introduce nonstationarity is intuitive and prior RL techniques exist that deal with timescale separation and nonstationary targets\n- The proposed dedicated-critic architecture scales linearly with the number of constraints, which can become problematic for high-dimensional or dynamically changing constraint sets. The paper acknowledges this but does not quantify the trade-off or explore mitigation strategies\n- The analysis could benefit from connecting target drift to broader notions of nonstationarity and meta-gradient bias (e.g., in off-policy correction, multi-agent RL, or risk-sensitive learning)"}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "qvvHEgbvNL", "forum": "1MHZGpvSDJ", "replyto": "1MHZGpvSDJ", "signatures": ["ICLR.cc/2026/Conference/Submission17909/Reviewer_A9po"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17909/Reviewer_A9po"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17909/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761796974429, "cdate": 1761796974429, "tmdate": 1762927726895, "mdate": 1762927726895, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work analyzes the impact of integrating the Lagrange multipliers within the critic estimator.\nThey show both theoretically and empirically that this leads to a bias and propose a separated critic structure which they show overcomes this issue.\n\nThe issue stems from the critic not only needing to estimate the cumulative cost (penalty of constraint violations) under the changing policy which it can bootstrap etc... but also the reward itself (of the constraint) is non-stationary due to changes in the lagrange multiplier.\nWhen the critic only estimates E^\\pi [\\gamma^t C(t)] we get the standard actor-critic loop which is stable."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The problem statement is very clear, it's presented very well.\nThe theoretical analysis shows strong justification for both the issues and the solution."}, "weaknesses": {"value": "The experimental proofs are minimal.\nThere exist a large set of constraint-centric RL environments that can be easily adapted to multi-critic to test this theorem.\nEven in single constraint problems, separating to two critics with one for the reward and the other for the constraint it seems (theoretically) that it should lead to improvements."}, "questions": {"value": "Have the authors tried additional tasks?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "F6HXIyfOix", "forum": "1MHZGpvSDJ", "replyto": "1MHZGpvSDJ", "signatures": ["ICLR.cc/2026/Conference/Submission17909/Reviewer_Lnts"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17909/Reviewer_Lnts"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission17909/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762281471262, "cdate": 1762281471262, "tmdate": 1762927726404, "mdate": 1762927726404, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}