{"id": "1va4BerB97", "number": 16009, "cdate": 1758258602847, "mdate": 1759897267632, "content": {"title": "ResearchArcade: Graph Interface for Academic Tasks", "abstract": "Academic research generates diverse data sources, and as researchers increasingly use machine learning to assist research tasks, a crucial question arises: Can we build a unified data interface to support the development of machine learning models for various academic tasks? Models trained on such a unified interface can better support human researchers throughout the research process, eventually accelerating knowledge discovery. In this work, we introduce RESEARCHARCADE, a graph-based interface that connects multiple academic data sources, unifies task definitions, and supports a wide range of base models to address key academic challenges. RESEARCHARCADE utilizes a coherent multi-table format with graph structures to organize data from different sources, including academic corpora from ArXiv and peer reviews from OpenReview, while capturing information with multiple modalities, such as text, figures, and tables. RESEARCHARCADE also preserves temporal evolution at both the manuscript and community levels, supporting the study of paper revisions as well as broader research trends over time. Additionally, RESEARCHARCADE unifies diverse academic task definitions and supports various models with distinct input requirements. Our experiments across six academic tasks demonstrate that combining cross-source and multi-modal information enables a broader range of tasks, while incorporating graph structures consistently improves performance over baseline methods. This highlights the effectiveness of RESEARCHARCADE and its potential to advance research progress.", "tldr": "", "keywords": ["research data integration; multi-modal data; heterogeneous graph; large language model; graph neural network"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/415ed053243055094a1cd1b80b1ff8a13b8ea258.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes ResearchArcade, a unified graph interface that integrates heterogeneous academic data from ArXiv and OpenReview. It uses a graph neural network to aggregate multi-source information (papers, reviews, figures, etc.) into node embeddings, which are then combined with textual inputs and processed by a large language model (Qwen3) for various academic tasks. Experiments show that incorporating graph-structured embeddings leads to consistent improvements over text-only baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Heterogeneous information integration. The paper explores an interesting and valuable idea, using heterogeneous academic information (papers, reviews, figures, tables, revisions) to assist language-model–based prediction and generation tasks, which is a meaningful direction.\n\n2. Clear pipeline design. The integration of graph neural networks and large language models is implemented in a clear, modular way: the GNN aggregates multi-source context into embeddings that are passed to the LLM, demonstrating a solid and technically sound pipeline design.\n\n3.  Comprehensive empirical evaluation. The framework is comprehensive and empirically validated, covering six academic tasks and showing consistent, though moderate, improvements over text-only baselines, suggesting contribution to the community as a shared research infrastructure."}, "weaknesses": {"value": "1. Limited methodological innovation.\nThe proposed Graph World Model (GWM) simply concatenates GNN-derived embeddings with textual inputs to the LLM, without introducing new learning mechanisms or joint optimization strategies.\n\n2. Incomplete reproducibility.\nThe graph construction process, particularly the alignment between ArXiv and OpenReview papers is under-specified. There are no quantitative statistics on entity-matching accuracy, no discussion of handling multiple paper versions, duplicate author names, or conflicting metadata, and no validation against human-curated samples.\n\n3. Shallow empirical analysis and lack of ablation. \nWhile six tasks are included, the results are reported mainly as aggregate performance scores without in-depth ablation or interpretive analysis. The authors claim that incorporating graph structure improves performance, yet there is no investigation into which graph components or modalities (figures, tables, reviews) contribute to these gains.\n\n4. Overstated “unified interface” claim.\nAlthough positioned as a universal academic graph, each task is trained independently, and no cross-task transfer or shared representation is demonstrated. The claimed “unification” remains conceptual."}, "questions": {"value": "Q1: How are the graph embeddings and text features integrated inside the LLM input? Are they concatenated at the embedding level or combined through an attention-based adapter?\n\nQ2: How reliable is the mapping between ArXiv and OpenReview entities? Are there quantitative metrics validating the paper-to-paper alignment?\n\nQ3: Does the framework support incremental updates as new papers and reviews are added, or is the graph static?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "mo6rTZH3bU", "forum": "1va4BerB97", "replyto": "1va4BerB97", "signatures": ["ICLR.cc/2026/Conference/Submission16009/Reviewer_dTwN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16009/Reviewer_dTwN"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16009/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761917717510, "cdate": 1761917717510, "tmdate": 1762926216455, "mdate": 1762926216455, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents ResearchArcade, a graph-based interface that connects ArXiv and OpenReview into a heterogeneous, temporally aware graph spanning text, figures, tables, reviews, and revisions. Tasks are defined in two steps: (1) pick a target entity and label, (2) retrieve the entity’s multi-hop neighborhood as input. \n\nBased on this graph, authors introduce six tasks: figure/table insertion, paragraph generation, revision retrieval, revision generation, acceptance prediction, and rebuttal generation."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Compared to previous datasets, ResearchArcade covers multiple sources and modalities. It also provides a unified interface for tasks defined on academic graphs.\n- The writing is clear and easy to follow."}, "weaknesses": {"value": "- As an academic graph, the dataset’s coverage of papers is still limited. It includes around 45k papers from arXiv and about 28k from ICLR, which may restrict the generalizability of conclusions derived from it.  \n- For the paragraph generation and revision generation tasks, the authors rely solely on semantic similarity metrics. However, such metrics may not capture aspects like clarity or appropriateness of the generated text (e.g., generated paragraphs and revisions). Using LLM-as-a-judge evaluations could better reflect quality.  \n- The paper would benefit from a more detailed discussion on why the proposed tasks are important and why they are worth studying within an academic graph framework. For instance, prior work exists for some of these tasks, such as revision generation (e.g., https://aclanthology.org/2025.wraicogs-1.4/). I think connecting to previous literature would help readers understand what new advantages graph-based approaches offer."}, "questions": {"value": "1. How are the embeddings for figure nodes generated?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ALJjaHtFUi", "forum": "1va4BerB97", "replyto": "1va4BerB97", "signatures": ["ICLR.cc/2026/Conference/Submission16009/Reviewer_iAbw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16009/Reviewer_iAbw"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16009/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761971877222, "cdate": 1761971877222, "tmdate": 1762926216031, "mdate": 1762926216031, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces ResearchArcade, a graph-based interface designed to unify multi-source, multi-modal, and temporally evolving academic data for supporting a wide range of machine learning tasks in academic research. It integrates data from ArXiv and OpenReview, including text, figures, and tables, and models academic activities as heterogeneous graphs.\n\nKey contributions include:\nUnified graph interface for academic data across sources and modalities;\nTwo-step task definition scheme (identify target entity + retrieve neighborhood) to standardize academic tasks;\nSix benchmark tasks (e.g., paragraph generation, revision retrieval, acceptance prediction) and four promising future tasks (e.g., idea generation, review generation);\nEmpirical validation showing that graph-based models outperform non-graph baselines, and multi-modal inputs improve performance;\nOpen-source release of data, pipeline, and evaluation protocols."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "S1: This paper addresses a real need for unified academic data interfaces to support ML models across diverse research tasks.\n\nS2: This paper integrates ArXiv and OpenReview with text, figures, tables, and temporal evolution, offering a holistic view of academic knowledge.\n\nS3: The two-step scheme (target entity + neighborhood) of this paper is simple yet general, enabling both predictive and generative tasks.\n\nS4: This paper evaluates 6 tasks across 4 model types (EMB, GNN, LLM, GWM), showing consistent gains from graph structure and multi-modal inputs.\n\nS5: This paper releases data, code, prompts, and splits, making the work usable and extensible for future research.\n\nS6: This paper includes a thoughtful ethics statement and reproducibility checklist, which is rare and commendable."}, "weaknesses": {"value": "W1: The graph construction and task definition are engineering-heavy; no new modeling techniques or architectures are proposed.\n\nW2: Tasks of this paper, like figure insertion or paragraph generation are reconstruction-style and may not reflect real-world academic needs (e.g., idea quality, scientific discovery).\n\nW3: Best accuracy is only 0.55, barely above random — raises questions about whether the graph is rich enough for high-level reasoning.\n\nW4: All metrics are automatic (SBERT, BLEU, etc.); no expert judgment on scientific validity, coherence, or usefulness of generated content.\n\nW5: Data is CS-heavy (ArXiv + ICLR); no evaluation on how well the interface generalizes to other fields (e.g., biology, physics).\n\nW6: This paper does not compare with larger SOTA LLMs (e.g., GPT-4, Claude, Qwen3-70B) or retrieve-augmented systems — limits external validity."}, "questions": {"value": "Q1: How would ResearchArcade perform on open-ended scientific tasks like hypothesis generation, experiment design, or novel discovery?\n\nQ2: Can the graph structure support more complex reasoning, such as causal chains, contradiction detection, or theory synthesis?\n\nQ3: What is the human-perceived quality of generated paragraphs, rebuttals, or reviews? Are they scientifically sound or just fluent?\n\nQ4: How scalable is the pipeline to larger corpora (e.g., PubMed, Semantic Scholar) or real-time updates (e.g., daily ArXiv dumps)?\n\nQ5: Why does acceptance prediction fail even with rich graph data? Is it inherently unpredictable, or is the signal too weak?\n\nQ6: How does ResearchArcade compare to retrieval-augmented LLMs or tool-augmented systems (e.g., ChatPDF, Elicit) on real user tasks?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "0JLeznPGtk", "forum": "1va4BerB97", "replyto": "1va4BerB97", "signatures": ["ICLR.cc/2026/Conference/Submission16009/Reviewer_zZ9E"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16009/Reviewer_zZ9E"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16009/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762065379482, "cdate": 1762065379482, "tmdate": 1762926215329, "mdate": 1762926215329, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This submission proposes RESEARCHARCADE, a graph-based interface that integrates multi-source data—computer science papers from ArXiv and peer reviews/submissions from OpenReview—and multi-modal information (text, figures, and tables) to support the development of machine learning models for diverse academic tasks. It adopts a two-step scheme—“identify target entity and retrieve neighborhood”— to unify the definitions of six academic tasks(e.g., Figure/Table Insertion, Paragraph Generation) and is compatible with various models, including embedding-based models (EMB, e.g., Longformer), graph neural networks (GNN, e.g., HANConv). However, critical resources are unavailable in this submission: no accessible code, related dataset samples, or key preprocessing details are provided. The authors only commit to releasing these materials upon publication. Furthermore, this work functions more like a data preprocessing pipeline than an innovative contribution—no novel technical approaches are proposed."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "S1. This submission accurately identifies key pain points in academic AI. From a data perspective, it targets the complexity of academic data, sourced from diverse platforms (ArXiv’s computer science papers, OpenReview’s ICLR submissions) and spanning multiple modalities (text, figures, tables). From a task perspective, it decreases the unnecessary effort required for data. By focusing on these gaps, the work directly responds to the demand for a unified data interface, as proposed in its core design.\n\nS2. The heterogeneous graph structure effectively encompasses diverse entities and their relationships. Entities include not only papers, reviews, figures, and tables but also ArXiv paragraphs and OpenReview revisions. Key relationships are explicitly modeled: e.g., \"paper-paragraph\" and \"paper-figure/table\". \n\nS3. The framework demonstrates good adaptability to different model types. It supports embedding-based models, graph neural networks, large language models, and the Graph World Model. This compatibility enables it to handle both predictive tasks and generative tasks."}, "weaknesses": {"value": "W1. Data used in the experiment is restricted to the computer science (CS) field (ArXiv data) and ICLR conferences (OpenReview data). However, no testing was conducted in other domains such as biology, chemistry or materials science.\n\nW2. Critical preprocessing steps are not explained. For example, how to extract paragraphs and figures from ArXiv’s LaTeX and how to align OpenReview reviews with paper paragraphs—these details remain untackled.\n\nW3. Novel academic-related contributions are limited, such as mechanisms for rapidly updating the graph when new paper revisions are added."}, "questions": {"value": "1. Do you plan to conduct cross-domain validation in some non-CS fields? \n\n2. Could you add academic-oriented optimizations (e.g., methods to resolve ambiguity in OpenReview review comments)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "1cTv73uKV0", "forum": "1va4BerB97", "replyto": "1va4BerB97", "signatures": ["ICLR.cc/2026/Conference/Submission16009/Reviewer_NgQe"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16009/Reviewer_NgQe"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16009/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762136506062, "cdate": 1762136506062, "tmdate": 1762926214830, "mdate": 1762926214830, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}