{"id": "24QKU4iqft", "number": 21090, "cdate": 1758313659245, "mdate": 1759896942586, "content": {"title": "SynCoGen: Synthesizable 3D Molecule Generation via Joint Reaction and Coordinate Modeling", "abstract": "Ensuring synthesizability in generative small molecule design remains a major challenge. While recent developments in synthesizable molecule generation have demonstrated promising results, these efforts have been largely confined to 2D molecular graph representations, limiting the ability to perform geometry-based conditional generation. In this work, we present SYNCOGEN (Synthesizable Co-Generation), a single framework that combines simultaneous masked graph diffusion and flow matching for synthesizable 3D molecule generation. SYNCOGEN samples from the joint distribution of molecular building blocks, chemical reactions, and atomic coordinates. To train the model, we curated SYNSPACE, a dataset containing over 600K synthesis-aware building block graphs and 3.3M conformers. SYNCOGEN achieves state-of-the-art performance in unconditional small molecule graph and conformer generation, and the model delivers competitive performance in zero-shot molecular linker design and pharmacophore conditioning for protein ligand generation in drug discovery. Overall, this multimodal formulation represents a foundation for future applications enabled by non-autoregressive molecular generation, including analog expansion, lead optimization, and direct structure conditioning.", "tldr": "multimodal model generates synthesizable molecules with their 3D coordinates, new SOTA across metrics and can perform conditional generation such as pharmacophore conditioning", "keywords": ["molecule", "generation", "flowmatching", "diffusion", "chemistry", "synthesizable"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/545f327e79f5b0320da9958ec12b3bfb9f4df344.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces SynCoGen, a framework that jointly generates synthesizable reaction graphs and 3D molecular coordinates using masked discrete diffusion and flow matching. The paper also introduces SynSpace, a new dataset with 600k synthesis-aware molecules. Experiments show strong results in unconditional 3D generation, fragment linking, and pharmacophore-conditioned tasks."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Novel idea of coupling synthesizability with 3D coordinate generation.\n2. The dataset is well-curated and likely useful for future work.\n3. Results are convincing and demonstrate clear improvements over baselines."}, "weaknesses": {"value": "1. There are many node/edge modeling constraints, heavy notation, and complex noise processes that make the method difficult to follow and reproduce. It’s also unclear which components contribute most to the final performance — the paper did not provide sufficient ablation studies or analysis isolating the impact of individual design choices (e.g., compatibility masking, visibility-aware noise, joint time coupling). As a result, the practical necessity of the full system remains uncertain.\n2. The reaction vocabulary is fixed and limits diversity. The model relies on a predefined set of 93 building blocks and 19 reaction templates, where each reaction involves at most one leaving group per reagent. While this makes synthesis simulation simpler and chemically reliable, it also restricts the model’s capacity to explore more diverse or complex chemical spaces."}, "questions": {"value": "1. How scalable is SynCoGen to larger or more diverse reaction vocabularies? Would the framework still function if reactions involved multiple leaving groups or more complex coupling patterns?\n2. The paper claims unified discrete–continuous time coupling. However, it seems that diffusion or flow updates on edge types may not take effect until the corresponding nodes are decoded. Did the authors experiment with decoupled or asynchronous schedules across modalities, and if so, how did that affect performance?\n\nI would consider raising my scores if authors could give some resonable explanations to the questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WWaDdToi8c", "forum": "24QKU4iqft", "replyto": "24QKU4iqft", "signatures": ["ICLR.cc/2026/Conference/Submission21090/Reviewer_t7Yp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21090/Reviewer_t7Yp"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission21090/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761751788606, "cdate": 1761751788606, "tmdate": 1762941249789, "mdate": 1762941249789, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors introduce.  SYNCOGEN, a multimodal generative framework that jointly models 3D molecular geometry and synthetic accessibility through reaction templates. The key idea is to integrate masked graph diffusion and flow matching into a unified generative process that simultaneously samples both the reaction graph over molecular building blocks and the corresponding atomic coordinates. This coupling enables SYNCOGEN to generate 3D molecules that are not only conformationally realistic but also chemically synthesizable via known reaction templates. To support this framework, the authors curate SYNSPACE, a large-scale dataset of over 600K synthesizable molecules and 3.3M associated low-energy conformations, represented as building-block reaction graphs. The model supports conditional generation tasks such as linker design and pharmacophore-guided generation, showcasing its utility in practical drug discovery."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "The paper tackles one of the central challenges in molecular generative models i.e. providing accessible synthetic routes for generated candidates. Additionally the proposed method is able to generate favourable conformers."}, "weaknesses": {"value": "- The writing of the paper is convoluted makes it difficult to follow and appreciate the methodology. It would be beneficial if the authors explain their method more clearly. For example, there are several components in the proposed workflow, a better workflow diagram explaining end-to-end working of SYNCOGEN will be helpful to the readers. \n- for a complicated method as yours, with so many components, a more detailed workflow will he helpful. The message in current fig1 is unclear\n- To better understand the method, code could have helped. However the url provided (https://anonymous.4open.science/r/SynCoGen-13F7) does not have the code. Please provide reproducible code. \n- Another major issue I have that authors should benchmark their work against Shen et al (2025). It is the closest baseline to their work however haven't been benchmark against. I understand Shen et al, is conditional SBDD generation but their attempt to generate conformers while simultaneously providing reaction pathway is most similar to this work. In theory, the authors unconditional generation should be able to outperform Shen et al. Please include this experiment in your paper."}, "questions": {"value": "- Fig 1 caption, what does non-linear node in this context mean?\n- why do authors disallow macrocycles?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "htA9KtSMo8", "forum": "24QKU4iqft", "replyto": "24QKU4iqft", "signatures": ["ICLR.cc/2026/Conference/Submission21090/Reviewer_1Mne"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21090/Reviewer_1Mne"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission21090/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761952700859, "cdate": 1761952700859, "tmdate": 1762941248989, "mdate": 1762941248989, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces SYNCOGEN, a generative framework for designing synthesizable small molecules directly in 3D Cartesian space. The core idea is to jointly model molecular building blocks and chemical reactions alongside the continuous 3D atomic coordinates. The method combines a masked graph diffusion model for the reaction graph with a flow matching model for the coordinates, trained on a newly curated dataset called SYNSPACE. The authors demonstrate SYNCOGEN's capabilities through experiments in unconditional generation, where it achieves state-of-the-art performance in both 3D geometry and synthesizability metrics, as well as in conditional tasks like fragment linking and pharmacophore-conditioned generation, where it shows competitive results."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The primary contribution is the novel formulation of jointly generating a synthesizability-aware reaction graph and the corresponding 3D molecular conformation. This elegantly bridges two previously disconnected lines of research: 2D synthesizable generation and 3D all-atom generation. If successful, this approach could significantly accelerate drug discovery pipelines by producing spatially-aware designs that are also practically achievable in the lab. \n2. The technical execution is of high quality. The choice to combine masked discrete diffusion for the building block graph and equivariant flow matching for the 3D coordinates is a sophisticated and well-suited generative paradigm for this multimodal task. Furthermore, the curation of the SYNSPACE dataset, which explicitly links reaction graphs with low-energy 3D conformers, is a valuable resource contribution that could enable future research in this direction. \n3. The paper is well-written, clearly structured, and generally easy to follow. The methodology is explained with sufficient detail, and Figure 1 provides an excellent conceptual overview of the generative process. The experimental setup and evaluation metrics are well-defined."}, "weaknesses": {"value": "1. While the creation of SYNSPACE is a commendable effort, its presentation as a key contribution is not fully supported by an analysis within the paper. The manuscript lacks a characterization of the dataset's properties. To understand the model's behavior and potential biases, it is crucial to see distributions of key molecular properties (e.g., molecular weight, logP, scaffold diversity) and how they compare to standard benchmarks like ZINC or GEOM-Drugs. It is difficult to assess the complexity and chemical scope of the space the model has learned.\n2. The de novo generation experiments (Table 1) compare SYNCOGEN only against all-atom 3D generative models. While this is a necessary comparison for evaluating 3D conformer quality, it omits a critical class of baselines: state-of-the-art synthesizable generators that operate on fragments in 2D or 3D.  Does the added complexity of generating 3D coordinates come at the cost of performance on the core task of synthesizable graph generation? This comparison is needed to fully contextualize the paper's contribution.\n3. A central motivation of the paper is the advantage of generating 3D coordinates alongside the synthesis plan. However, the experiments do not provide a clear, causal link demonstrating this advantage. The work successfully shows that it can be done, but not why it is better than alternative pipelines. For synthesizability alone, 2D methods suffice. \n4. The evaluation for pharmacophore-conditioned generation is performed on only three target proteins. This small sample size is insufficient to establish statistical significance or to claim general applicability. The results are promising but can be treated as anecdotal case studies rather than a robust validation of the method's capability.\n5. The model generates molecules conditioned on a pharmacophore without any information about the target protein pocket. It is therefore surprising that it produces molecules with docking scores superior to the native ligand and other baselines. A deeper analysis is needed to convince the reader that this is not a coincidental finding."}, "questions": {"value": "1. Could you please add an analysis of the SYNSPACE dataset's chemical property distributions to the appendix? This would help in understanding the chemical space your model operates in.\n2. Could you comment on the feasibility of adding an experiment that explicitly highlights the synergy of your joint approach? For example, a task involving conditioning on a 3D property where a 2D-first pipeline would likely fail. \n3. Could you comment on the generalizability of your findings, given the small number of targets?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "gYH1Xj6eb3", "forum": "24QKU4iqft", "replyto": "24QKU4iqft", "signatures": ["ICLR.cc/2026/Conference/Submission21090/Reviewer_7GM3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21090/Reviewer_7GM3"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission21090/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761982924842, "cdate": 1761982924842, "tmdate": 1762941248372, "mdate": 1762941248372, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a multimodal generative framework that jointly samples a reaction graph with masked graph diffusion and 3D atomic coordinates with flow matching under a unified time schedule. To enable training, the authors curate SYNSPACE, comprising synthesis-aware building-block graphs with associated low-energy conformations. Empirically, SYNCOGEN achieves strong validity and retrosynthetic solve rates while producing low-energy, PoseBusters-plausible conformers. It further demonstrates fragment linking and pharmacophore-conditioned generation with competitive docking scores and markedly higher retrosynthesis success than baselines."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- Well-motivated co-generation: Jointly models reaction graphs and 3D coordinates, explicitly aligning “makeability” with structural plausibility in one framework.\n- Diversified application scenarios: Demonstrates fragment linking and pharmacophore-guided design, suggesting practical utility beyond unconditional generation.\n- Technical contribution: Clear integration of chemistry-aware constraints and templated reaction modeling that improve validity and retrosynthesis success. SYNSPACE is substantial, pairing reaction-level structure with optimized conformers, and includes pharmacophore annotations to support structure-informed tasks."}, "weaknesses": {"value": "- Fixed reaction vocabulary: Reliance on fixed building blocks and templates restricts chemical diversity and may limit generalization performance.\n- Baseline comparability: Many 3D baselines reported are not synthesis-aware. Stronger comparisons with synthesis-aware methods would be more convincing.\n- Hard edge constraints can preclude valid chemotypes such as macrocycles."}, "questions": {"value": "1. SYNCOGEN shows lower diversity and novelty. Is this mainly due to using fixed 93 building blocks and 19 reaction templates? How were these number chosen?\n2. Can the model generate molecules with more building blocks than seen in training? How does performance changes for larger N?\n3. For a fairer baseline, it would be more convincing to compare with other synthesis-aware models, such as CGFlow.\n4. In SAMPLEEDGES, the authors draw parents stochastically. Did the authors test deterministic sampling for example argmax? How does this affect diversity and validity?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "lM6aWSLIav", "forum": "24QKU4iqft", "replyto": "24QKU4iqft", "signatures": ["ICLR.cc/2026/Conference/Submission21090/Reviewer_8SMJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21090/Reviewer_8SMJ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission21090/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762163290713, "cdate": 1762163290713, "tmdate": 1762941247743, "mdate": 1762941247743, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}