{"id": "2caVSG6NJD", "number": 7798, "cdate": 1758036704336, "mdate": 1759547620297, "content": {"title": "PHAROS+: Non-invasive Longitudinal Monitoring of Pulmonary Hypertension with Unimodal and Multimodal Learning", "abstract": "Pulmonary hypertension is a disease characterized by elevated pressures in the blood vessels that supply the lungs.  It is a progressive and incurable disease that can lead to right heart failure and premature death if improperly managed.  Close monitoring plays an important role in management of patients with pulmonary hypertension, as it facilitates the timely detection of disease progression and enables the prompt administration of therapies that can alter the course of the disease.  The gold standard for monitoring disease progression is a right heart catheterization (RHC) -- a procedure that involves the insertion of a catheter, attached to a pressure transducer, into the pulmonary vasculature to measure the pulmonary pressures. This procedure is typically repeated several times during the course of a patient's life to monitor the response to therapies designed to reduce pulmonary pressures.  Although RHC is an important tool that can help guide the care of patients with pulmonary hypertension, the procedure itself entails some risk to the patient and can only be performed in hospitals that have the needed equipment and trained personnel. Prior attempts to  develop non-invasive alternatives for measuring pulmonary pressures have primarily focused on the task of initial diagnosis, rather than long-term monitoring of patients that have already been diagnosed. In this work, we propose a novel deep learning paradigm for the non-invasive assessment of pulmonary artery pressures.  The method leverages electrocardiographic signals and, when available, cardiac ultrasound data to enable long-term monitoring in these patients. We demonstrate that our method achieves strong performance on an internal dataset from one hospital and generalizes well to the MIMIC-III Waveform Database from a different hospital.  Our approach provides a cheap and accessible method that can be used to monitor patients with pulmonary hypertension at home. To the best of our knowledge, this work is the first to address the task of longitudinal monitoring in patients with pulmonary hypertension.", "tldr": "", "keywords": ["healthcare", "multimodal", "non-invasive monitoring", "pulmonary hypertension"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "", "supplementary_material": ""}, "replies": [], "withdrawn": true}