{"id": "2qnpyNBCYH", "number": 18277, "cdate": 1758285956397, "mdate": 1759897114695, "content": {"title": "Dynamic Dual-Feedback Conformal Inference for Time series Forecasting", "abstract": "Quantifying uncertainty in time series forecasting is particularly demanding because sequential data exhibit temporal dependence and are prone to distributional changes. Conformal inference has emerged as a powerful uncertainty quantification approach for evaluating the reliability of predictive models through the construction of prediction sets. Recent advances have introduced online conformal methods that adaptively adjust prediction thresholds through feedback mechanisms. However, the existing feedback mechanism typically relies solely on miscoverage indicators (actual feedback) — whether the true label falls within the interval at each time step — while overlooking the empirical prediction threshold (estimated feedback) that is derived from the oracle conformal method. In this paper, we propose $\\textit{Dynamic Dual-feedback Conformal Inference}$ (DDCI), which incorporates a dual-feedback mechanism consisting of $\\textit{actual feedback}$ and $\\textit{estimated feedback}$. The former drives the primary adjustment of the intervals based on true observations, while the latter dampens excessive expansions or contractions by leveraging empirical thresholds from conformal inference during updates. By balancing these two signals, DDCI achieves more stable and narrower prediction intervals in sequential settings while preserving the coverage validity.", "tldr": "", "keywords": ["conformal prediction; uncertainty quantification; time-series forecasting"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/cb2d055db12f81d440397ba73571dfe6f27ef8f8.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces Dynamic Dual-feedback Conformal Inference (DDCI), a new online conformal prediction method for time series forecasting. DDCI enhances standard adaptive conformal inference by incorporating two feedback signals: actual coverage error and an estimated threshold from conformal inference. This dual-feedback design stabilizes the update process, producing narrower prediction intervals while maintaining target coverage, as validated theoretically and empirically across multiple datasets and forecasting models."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea of incorporating estimated feedback from conformal inference into the online update process is well-motivated. \n 2. The mathematical proofs are easy to follow and the notations are clear.\n 3. The experiment section is well-presented."}, "weaknesses": {"value": "1. A recurring issue in this line of work, including the present paper, is the treatment of parameters. While this work introduces an additional parameter, a more thoughtful approach to parameter selection would have strengthened the contribution.\n 2. Although DDCI shows significant improvements on stock datasets, the gains on the Delhi temperature and electricity demand datasets are less pronounced. This suggests that the method may be more suited to certain types of non-stationarity, and a deeper analysis of its limitations across different time series characteristics would be beneficial.\n 3. See questions."}, "questions": {"value": "1. Although it is reasonable to utilize the estimated threshold to stablize and counterbalance the intervals, is there any theoretical intuition on why choosing the estimated feedback in the form of (5), or theoretical results on the impact of added feedback terms compared to OGD? For example, why not simply take the estimated feedback function as $-|x|/2B*tanh(cx)$? \n2. The experimental results of ECI with AR model seems consistently outperforms DDCI (except for Microsoft data). How do the authors comment about this?\n3. Since the main contribution lies in the estimated threshold part, can you provide a more specific way on how to choose $\\epsilon$?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "sgPsQ5TLJy", "forum": "2qnpyNBCYH", "replyto": "2qnpyNBCYH", "signatures": ["ICLR.cc/2026/Conference/Submission18277/Reviewer_dyja"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18277/Reviewer_dyja"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18277/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761651392160, "cdate": 1761651392160, "tmdate": 1762927999801, "mdate": 1762927999801, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new online conformal prediction method by adding an \"Estimated Feedback\" to the ECI method, which incorporates more information from historical data. The experiment results show the superiority of the proposed method over the existing baselines."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The estimated feedback is new in the online CP, which helps construct more stable and potentially shorter prediction intervals."}, "weaknesses": {"value": "**1. The new method introduces more tuning parameters.**\n\nCompared with ECI, there is an additional parameter $\\epsilon$ in the update rule. According to Figure 3, the size is very sensitive to the choice of $\\epsilon$. However, choosing $\\epsilon$ is challenging in the online task.\n\n**2. About the role of the estimated feedback**.\n\nThe estimated feedback has an opposite sign to the actual feedback, intending to smooth the update. To achieve this goal, we can choose any positive sequence to replace $h(c e_t^* \\ )$, e.g., $h(c e_t)$. Why do we use $e_t^*\\ $? \n\n Also, the statement in Lines 213-214 seems incorrect. Even though $q_t^* \\ $ is the true $1-\\alpha$ quantile of  $s_t$, the difference $e_t^* = |s_t - q_t^*|$ can be very large. \n\nOverall, the role of estimated feedback is not well discussed, which makes it like a tuning trick. I suggest the authors provide a fundamental explanation based on a working data model."}, "questions": {"value": "1. The actual feedback in (4) is not consistent with that in ECI.\n\n2. What if we only use the estimated feedback $h(c e_t^* \\ )$ to replace the actual feedback in ECI."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "fF3A33eL3b", "forum": "2qnpyNBCYH", "replyto": "2qnpyNBCYH", "signatures": ["ICLR.cc/2026/Conference/Submission18277/Reviewer_4pSB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18277/Reviewer_4pSB"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18277/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761808439022, "cdate": 1761808439022, "tmdate": 1762927998905, "mdate": 1762927998905, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Dynamic Dual-feedback Conformal Inference (DDCI), a new online conformal prediction method for time series forecasting. DDCI implements the control-theory concept of dual feedback, which incorporates two feedback signals: (1) error / miscoverage - normalized and squashed error magnitude, and (2) a stabilizing signal derived from empirical quantiles of previous scores."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is clearly written and well organized. I understood the method and the experiment well. \n\n- The dual-feedback idea is nice and a nice fit for dynamic control of coverage. Some adaptability is sacrificed for stability, but the stability of quantile updates results in more efficient intervals. \n\n- The tasks used in the experiment section is diverse and the baseline selection is very up-to-date. DDCI achieves coverage and sharpness on all datasets, verifying the theory.\n\n- I think the experiment section is overall quite thoughtful. The natural extension to weighted quantiles (DDCI-Nex) is reasonable and well-explored, and the sensitivity analysis on epsilon is explained clearly."}, "weaknesses": {"value": "The flip side of spending 3.5 pages on comprehensive experiments is the lack of depth on theoretical discussions. As the dual-feedback concept is clearly inspired by control theory (fast and slow feedback loops), the paper would benefit for more detailed analysis on adaptation speed, coverage stability, computational cost, etc explicitly compared to ACI (pure P control) and Conformal PID. Specifically: \n \n- How is dual-feedback related to PID's three terms (P, I, D)? Could DDCI be expressed as a PID controller with specific tuning?\n- Are there advantages to dual-feedback over PID, or vice versa? Under what situations would PID control outperform DDCI and vice versa?\n- Is there a specific setup where you can prove that the DDCI has smaller interval than other methods? by what magnitude? what does this magnitude depend on? \n- Can these concepts guide the setting of the hyperparameters such as $\\epsilon$?"}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "SBgPpC71Iu", "forum": "2qnpyNBCYH", "replyto": "2qnpyNBCYH", "signatures": ["ICLR.cc/2026/Conference/Submission18277/Reviewer_CFC4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18277/Reviewer_CFC4"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18277/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761857983577, "cdate": 1761857983577, "tmdate": 1762927998538, "mdate": 1762927998538, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The work proposes a conformal method for time series forecasting. The proposed method employs a dual-feedback system, not previously used, to obtain conformal regions that are more efficient than existing baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The update rule to adapt the conformal set provides a flexible mechanism. The experiments demonstrate the efficacy of the proposed methods in the chosen settings."}, "weaknesses": {"value": "The presentation can be improved. Many times, the terminology just sounds a bit odd, or there is repetition of ideas already mentioned.\n\nThe novelty seems limited over the existing methods. \n\nSee \"Questions*\" below for more"}, "questions": {"value": "1. Line 037: Conformal Inference was introduced before the 2005 book cited here. Consider rephrasing the sentence or citing the earlier work from Vovk.\n\n2. Line 072: Upper Limitation? Maybe the authors meant an upper bound here. \n\n3. The first paragraph in the Related Work section seems unnecessary; the work is a conformal work, and the mentioned uncertainty methods appear not to be used as baselines. \n\n4. Line 101-103: Rather than intuitively defining conformal prediction, it would be better to write it down formally as a definition later. Note that the section is about conformal inference under nonexchangeability, but the description starts with traditional conformal prediction.\n\n5. Line 119: The term residual-aware seems odd. Did the authors mean residual-controlling or something?\n\n6. How dependent is the performance on the squashing function? It appears the work only explored tanh function,\n\n7. The target confidence is set as high as 0.9, which is okay. However, it is necessary to demonstrate the performance of the proposed method with varying significance levels. A calibration curve may be helpful in determining if the proposed method works effectively in all cases.\n\n8. For all the experiments, only single-time statistics are provided. It would be helpful to have the experiments repeated across multiple splits or seeds and the standard deviation reported to get a clearer picture of the method's performance. \n\n9. For many results, where DDCI performs better, there is no clear indication if the difference in width is sufficient in comparison to the deviations in reported coverage to know if DDCI is indeed a better method. Other metrics, such as Winkler Score, might also be helpful to understand the method better."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "886gRViEc9", "forum": "2qnpyNBCYH", "replyto": "2qnpyNBCYH", "signatures": ["ICLR.cc/2026/Conference/Submission18277/Reviewer_68ke"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18277/Reviewer_68ke"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18277/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762029454618, "cdate": 1762029454618, "tmdate": 1762927998116, "mdate": 1762927998116, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}