{"id": "3kTb7Iortf", "number": 21846, "cdate": 1758322594198, "mdate": 1759896900160, "content": {"title": "Learning to Undo: Transfer Reinforcement Learning under State Space Transformations", "abstract": "Transfer learning in reinforcement learning (RL) has shown strong empirical success. In this work, we take a more principled perspective by studying when and how transferring knowledge between MDPs can be provably beneficial. Specifically, we consider the case where there exists an undo map between two MDPs (a source and a target), such that applying this map to the target’s state space recovers the source exactly. We propose an algorithm that learns this map via regression on state feature statistics gathered from both MDPs, and then uses it to obtain the target policy in a zero-shot manner from the source policy. We theoretically justify the algorithm by analyzing the setting when the undo map is linear and the source is linearly-$Q^\\star$ realizable, where our approach has strictly better sample complexity than learning from scratch. Empirically, we demonstrate that these benefits extend beyond this regime: on challenging continuous control tasks, our method achieves significantly better sample efficiency. Overall, our results highlight how shared structure between tasks can be leveraged to make learning more efficient.", "tldr": "We show how learning an undo map between MDPs enables efficient policy transfer under state space transformations.", "keywords": ["reinforcement learning", "transfer learning"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/aa8d09a109659502f4d3ca98f95e68eb866368a9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes a transfer learning method, capable of recovering state-space transformations between target $\\mathcal{M}_t$ and source tasks $\\mathcal{M}_s$. Two settings for the algorithm LUMOS are proposed: one with theoretical guarantees, another with empirical evidence."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper is well written, and present a novel although narrow perspective for transfer learning in Reinforcement Learning."}, "weaknesses": {"value": "Theoretical results rely on a strong assumption given by Eq. 3. Practically, it does not seem feasible to tell beforehand if the state-space and dynamics of $\\mathcal{M}_t$ are a transformation (linear or not) of the state-space and dynamics of  $\\mathcal{M}_s$, which heavily limits the applicability of the method. Empirical results do not explore this weakness. As such, the paper’s contribution seems reduced to finding a map between two MDPs' dynamics, presuming an oracle (otherwise, fail). Thus, the last sentence before the concluding sentence appears misleading.\n\nIn the Related Works, authors have pointed out limitations of related works regarding theoretical guarantees, while the proposed method itself covers the narrow setting of linear state-space mappings. The arguments are not convincing due to the lack of baselines in the empirical evaluation, other than learning the task from scratch.\n\nThe manuscript is overall well written, but some parts are a bit confusing, such as the open loop definition in section 3.1, and short sentences like “We assume that $d \\le H$”."}, "questions": {"value": "**Q1.** In section 2 - transfer learning, and algorithm 2, during transfer, interacting with source tasks does not incur sample complexity. Would it be feasible to compare other metrics than sample complexity to assess the cost related to transferring (and interacting with $\\mathcal{M}_s$)?\n\n**Q2.** In Related Works, in the very last sentence, the author claims that the work  _“takes a step toward more principled and broadly applicable approach...”_. How does it hold with the strong assumption of linear transformation state-spaces?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "j4pv4i41ef", "forum": "3kTb7Iortf", "replyto": "3kTb7Iortf", "signatures": ["ICLR.cc/2026/Conference/Submission21846/Reviewer_enW4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21846/Reviewer_enW4"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission21846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761212976922, "cdate": 1761212976922, "tmdate": 1762941954345, "mdate": 1762941954345, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies transfer learning in reinforcement learning, focusing on when and how knowledge can be transferred between Markov Decision Processes (MDPs) to improve learning efficiency. The authors consider the setting where there exists an undo map between a source MDP and a target MDP, such that applying this map to the target’s state space exactly recovers the source.\n\nThe main contributions of the paper are:\n1. Algorithm for learning the undo map: The paper proposes a method that learns this map via regression on state feature statistics collected from both source and target MDPs. Once learned, the map enables zero-shot transfer of the source policy to the target.\n\n2. Theoretical analysis: When the undo map is linear and the source MDP is linearly realizable, the proposed approach achieves provably better sample complexity than learning the target MDP from scratch.\n\n3.  Empirical validation: Experiments on challenging continuous control tasks demonstrate that the approach achieves significantly higher sample efficiency than baseline methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Originality: Introduces the novel concept of an undo map to reverse state-space transformations, enabling zero-shot policy transfer. \n\n2. Quality: Methodologically rigorous with theoretical guarantees in the linear setting. Algorithms are clearly defined, and experiments on diverse continuous control tasks show substantial improvements in sample efficiency.\n\n3. Clarity: Well-structured and readable. Algorithms, definitions, and assumptions are clearly presented, with helpful figures illustrating key ideas.\n\nSignificance: learning high-quality policies from scratch typically requires millions\nof environment interactions."}, "weaknesses": {"value": "1. Limited Baselines: Experiments mainly compare against learning from scratch. To better demonstrate the practical advantage of proposed method, the paper should include comparisons with existing transfer learning RL methods, such as Chen et al. (2024) or other policy-transfer approaches. This would strengthen claims of empirical superiority.\n\n2. Theoretical Scope: The theoretical analysis is restricted to linear undo maps and linearly-Q⋆ realizable MDPs. While LUMOS extends to non-linear transformations empirically, the lack of theoretical guarantees in this general setting limits the rigor of the contribution. Extending bounds or providing analysis for non-linear settings would significantly enhance impact.\n\n3. Action Sequence Dependence: Both LUMOS-LIN and LUMOS require carefully chosen action sequences for effective learning of the undo map. The performance is sensitive to these sequences, but no principled method for discovering or optimizing these sequences is provided. This work could include a more systematic approach for generating action sequences.\n\n\n[1] Chen, E., Chen, X., & Jing, W. (2024). Data-Driven Knowledge Transfer in Batch $ Q^* $ Learning. arXiv preprint arXiv:2404.15209.."}, "questions": {"value": "Is the sample complexity upper bound of Algorithm 2 tight?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "wRBGEcA7nZ", "forum": "3kTb7Iortf", "replyto": "3kTb7Iortf", "signatures": ["ICLR.cc/2026/Conference/Submission21846/Reviewer_7ZNp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21846/Reviewer_7ZNp"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission21846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761415045475, "cdate": 1761415045475, "tmdate": 1762941953968, "mdate": 1762941953968, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes LUMOS, a method for transfer RL, when source and target tasks differ only by a transformation of the state. It learns an undo map that converts target observations into the source feature space so a source policy can be reused. The authors provide theory for the linear case and extend the method to nonlinear settings. Experiments on continuous-control tasks show it is more sample-efficient than training from scratch."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper is technically sound and provides a clear theoretical analysis under the linear-Q-realizable setting, with consistent assumptions and proofs. Experiments on multiple tasks validate the effectiveness of their method. The overall structure is logical and easy to follow, and the figures and algorithms are well presented."}, "weaknesses": {"value": "1. The paper builds on the \"undo map\" formulation. While this setting is well-defined and analytically tractable, and linearity assumption in theory is acceptable, it represents a relatively narrow class of transfer scenarios, where tasks dynamics are identical and only differ by an invertible transformation. This strong assumption limits its contribution to the current transfer RL research, where most problems are more complicated and no such deterministic \"undo map\" exists. The paper motivates the undo map using a few clean geometric and sensor transformation examples, but these settings may not capture the challenge in most transfer situations.\n2. The paper repeats several key ideas (such as their contributions) too many times across multiple sections, with only minor variations. Streamlining these explanations would make the presentation clearer and more concise. \n3. The paper does not include any ablation studies testing how key design choices affects the transfer results. For instance, examining how the choice of action sequence, target sample budget, or source policy quality affects the accuracy of the learned undo map.\n4. The paper does not provide open-source code and includes limited experimental details, which reduces reproducibility and transparency."}, "questions": {"value": "1. How might the proposed method be extended or adapted to handle more general cases, where an exact undo map does not exist?\n2. In the related work section, the paper claim that their method is practical and demonstrates strong empirical performance. Could you clarify how this comparison is fair, given that many related methods tackle more general transfer settings than the invertible-transformation case studied here?\n3. The proposed method relies on accurately matching feature statistics between the source and target tasks. How sensitive the approach is to potential noises in the target observations?\n4. In Equation 1, $\\psi_h (a_{0:h-1})$ is defined as the sum of state features, but in equation (5), $\\psi_h (a_{0:h-1})$ is defined as the average of state-action features. This inconsistence is confusing."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fW94ID1SzE", "forum": "3kTb7Iortf", "replyto": "3kTb7Iortf", "signatures": ["ICLR.cc/2026/Conference/Submission21846/Reviewer_J82C"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21846/Reviewer_J82C"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission21846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761881250878, "cdate": 1761881250878, "tmdate": 1762941953660, "mdate": 1762941953660, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a method for transfer learning in RL that learns an \"undo map\" to transform target state spaces back to source state spaces via regression on state feature statistics. The transfer learning is studied only in the context where the observation space has changed and not the dynamics or rewards. Experiments are conducted on continuous control problems."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "* Transfer learning is an important problem in RL. \n* The proposed method is interesting and has potential."}, "weaknesses": {"value": "* I found several overclaims by the authors and occasionally misleading comparisons:\n\n1. The setting studied here represents a very narrow and limited form of transfer learning. The authors only consider changes in the observation space (e.g., a change in viewpoint), whereas transfer learning in the broader literature often involves changes in rewards, dynamics, or both. Even within this limited setting, the assumed transformation must follow a specific linear structure, and the experiments are deliberately designed to satisfy this assumption (e.g., the sensor fusion experiments). The RGB-to-grayscale transformation mentioned in the introduction is missing from the experiments, and no experiments on naturally occurring transformations are provided. As a result, statements such as the following are clear overclaims:\n> (L463) Our method achieves significant gains in sample efficiency compared to\nlearning target policies from scratch, as demonstrated across multiple challenging continuous control environments.\n\n2. The authors repeatedly describe their method as a zero-shot transfer learning approach, yet it explicitly requires thousands of samples from the target task to learn the undo map. In the literature, zero-shot transfer refers to settings where no samples from the target task are available.\n\n3. The authors claim novelty in proposing a new method for transfer learning (L80), yet the idea of using undo maps for transfer was already introduced by Gupta et al. (2020). The only apparent difference here is that regression on feature statistics is used instead of trajectory matching.\n\n4. Empirical overclaims include statements such as the following. However, this comparison is made against learning from scratch, which is not a transfer learning algorithm and has no access to the source task or policy.\n> (L411) LUMOS-LIN is 143× more sample-efficient.\n\n5. The paper compares the sample complexity of the proposed method against the exponential lower bounds of Weisz et al. (2021), even though that work concerns worst-case MDPs specifically constructed to be difficult. For linear MDPs—the focus of this paper’s theoretical section—sample complexity bounds are already significantly better (see: Jin et al., “Provably efficient reinforcement learning with linear function approximation,” COLT 2020). Thus, the authors’ claim of “strictly better sample efficiency” is misleading; the improvement is marginal and applies only to a very narrow problem class, which should be clearly stated.\n\n6. The practical algorithm deviates considerably from the theoretical setting—for instance, it uses random action sequences instead of source rollouts. The paper provides no justification for why matching statistics should work in non-linear settings. Therefore, the following statement is also an overclaim:\n> (L67) Our algorithmic design is grounded in the setting where the undo map is linear and the source…\n\n\n\n* The paper has a limited experimental setup:\n1. As noted above, the environments are often artificially constructed to satisfy the assumptions of the method.\n\n2. The method is not compared against any prior algorithms from the transfer learning, meta-RL, or domain adaptation literature. The only baseline used is training from scratch, which raises major concerns about the validity of the claimed performance gains. At a minimum, the paper should include one baseline from each of these families to contextualize the proposed approach. Given that the transfer tasks involve only changes in the observation space, even simple methods such domain adaptation methods or simple data augmentation could serve as competitive baselines.\n\n3. The experiments use only three random seeds, which is insufficient for RL benchmarks. Moreover, it is unclear what the shaded regions in the plots represent. \n\n* Methodological issues: \n1. Figure 7 shows that the method can completely fail when using random action sequences for certain tasks. This critical dependency is understated and not properly discussed.\n\n2. The paper assumes an identifiable undo map from statistics, but the notion of identifiability is neither defined nor analyzed.\n\n* The paper is not well-placed within the extensive literature on transfer in RL, omitting several key references, including but not limited to:\n\n* Touati, Ahmed, Jérémy Rapin, and Yann Ollivier. \"Does Zero-Shot Reinforcement Learning Exist?.\" The Eleventh International Conference on Learning Representations.\n* Touati, Ahmed, and Yann Ollivier. \"Learning one representation to optimize all rewards.\" Advances in Neural Information Processing Systems 34 (2021): 13-23.\n* Rezaei-Shoshtari, Sahand, et al. \"Hypernetworks for zero-shot transfer in reinforcement learning.\" Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 37. No. 8. 2023.\n* Beck, Jacob, et al. \"Hypernetworks in meta-reinforcement learning.\" Conference on Robot Learning. PMLR, 2023.\n* Rakelly, Kate, et al. \"Efficient off-policy meta-reinforcement learning via probabilistic context variables.\" International conference on machine learning. PMLR, 2019.\n* Arndt, Karol, et al. \"Meta reinforcement learning for sim-to-real domain adaptation.\" 2020 IEEE international conference on robotics and automation (ICRA). IEEE, 2020.\n* Ju, Hao, et al. \"Transferring policy of deep reinforcement learning from simulation to reality for robotics.\" Nature Machine Intelligence 4.12 (2022): 1077-1087.\n* Ingebrand, Tyler, Amy Zhang, and Ufuk Topcu. \"Zero-shot reinforcement learning via function encoders.\" Proceedings of the 41st International Conference on Machine Learning. 2024."}, "questions": {"value": "1. What happens when the source policy is sub-optimal?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "rs70kaHTej", "forum": "3kTb7Iortf", "replyto": "3kTb7Iortf", "signatures": ["ICLR.cc/2026/Conference/Submission21846/Reviewer_zNyp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21846/Reviewer_zNyp"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission21846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761961127214, "cdate": 1761961127214, "tmdate": 1762941953261, "mdate": 1762941953261, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}