{"id": "3NEN2pH0W9", "number": 18496, "cdate": 1758288324744, "mdate": 1763730930409, "content": {"title": "TopoOT: Topology-Aware Optimal Transport for Test-Time Anomaly Segmentation", "abstract": "Deep topological data analysis (TDA) offers a principled framework for capturing structural invariants such as connectivity and cycles that persist across scales, making it a natural fit for anomaly segmentation (AS). Unlike threshold-based binarisation, which produces brittle masks under distribution shift, TDA allows anomalies to be characterised as disruptions to global structure rather than local fluctuations. We introduce TopoOT, a topology-aware optimal transport (OT) framework that integrates multi-filtration persistence diagrams with test-time adaptation (TTA). Our key innovation is Optimal Transport Chaining, which sequentially aligns persistence diagrams (PDs) across thresholds and filtrations, yielding geodesic stability scores that identify features consistently preserved across scales. These stability-aware pseudo-labels supervise a lightweight head trained online with OT-consistency and contrastive objectives, ensuring robust adaptation under domain shift. Across standard 2D and 3D anomaly detection benchmarks, TopoOT achieves state-of-the-art performance, outperforming the most competitive methods by up to +24.1\\% mean F1 on 2D datasets and +10.2\\% on 3D anomaly segmentation benchmarks.", "tldr": "", "keywords": ["Deep Topological Data Analysis", "Optimal Transport", "Test Time Traning", "Anomly segmentation"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/454f71e55256ff462b567ec488ddce2f221f3ee4.pdf", "supplementary_material": "/attachment/15da42bd64e3192d07635b612d35f1fca95d7bd8.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a new method, based on optimal transport and persistent diagrams, for anomaly detection. Their key idea is that, by encoding samples through persistent diagrams, the authors are able to define anomaly maps that are topology aware. Based on this view of the data, the authors use optimal transport theory to produce an anomaly score based on their cross-scale consistency."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "__Originality.__ To the best of my knowledge the authors' approach is a new combination of ideas in optimal transport and persistent diagrams for OT. I also point out that the combination of these ideas is well motivated in the main paper.\n\n__Clarity.__ The paper is mostly clear, though the discussion in Section 3 is too high level. I comment more on this point in the weaknesses.\n\n__Significance.__ Proposing a method that can perform anomaly detection without relying on the ad-hoc setting of a threshold, and that is robust under distributional shift is significant. With that said, the empirical validation falls a bit short of distributional shift claim (see weaknesses). I also think that the theoretical analysis would make the paper much stronger, but, as is, they are only shown in the appendix and are preliminary in nature."}, "weaknesses": {"value": "__Clarity issues.__ Overall, I think the discussion in section 3 is too high level. Here is a list of issues,\n\n- The formal definition of persistent diagrams is never really provided, and the overall background on these concepts is not provided in the main paper.\n- The notation used in eq. 2, $i(c)$ is never really defined.\n- The pseudo-label generation mechanism is mentioned, but never defined with an explicit equation or algorithm\n- There is no algorithm summarizing the test-time training strategy.\n\n__Empirical Validation.__ I like the overall structure of the experiments, especially the inclusion of a cross-domain setting that helps testing the claim that their method is robust to distributional shift. However, Table 2 only includes comparisons between cross-model experiments. I think it would be nice to have the same comparison for other TTT methods.\n\n__Theoretical Results.__ Even though the theoretical results are not included in the main paper, they are still part of the supplementary results, and the authors mention them in the main paper. I generally don't think it is a good idea to mention preliminary results in a submission -- either the authors provide solid, complete results, they don't provide them at all, or they wait and submit once the analysis is complete. With that in mind, here are some issues with the theoretical results section in the appendix,\n\n- The 4th equation in page 29 (the bound on the target risk by the source risk + the Wasserstein distance) was first established in (Redko et al., 2017), so the authors should cite the correct source here.\n- Still on that equation, the authors never define, mathematically, $\\epsilon_{S}(h)$. I think they should take the time to adapt the concepts in (Ben-David et al., 2010) and (Redko et al., 2017) to the anomaly detection scenario, which is far from obvious.\n- Similarly to the main paper, the proofs presented in this section are too high level to be considered. While some of the reasoning is intuitive, the authors would need to work out the proofs rather than providing sketches.\n\n# References\n\n(Redko et al., 2017) Redko, Ievgen, Amaury Habrard, and Marc Sebban. \"Theoretical analysis of domain adaptation with optimal transport.\" Joint European Conference on Machine Learning and Knowledge Discovery in Databases. Cham: Springer International Publishing, 2017."}, "questions": {"value": "Overall, I think the authors should rework the methodological and theoretical explanations of their paper. See for instantance __Clarity issues__ and __Theoretical Results.__ under weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8N2E0YdIN2", "forum": "3NEN2pH0W9", "replyto": "3NEN2pH0W9", "signatures": ["ICLR.cc/2026/Conference/Submission18496/Reviewer_sSap"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18496/Reviewer_sSap"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18496/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761573624967, "cdate": 1761573624967, "tmdate": 1762928195146, "mdate": 1762928195146, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles anomaly segmentation under distribution shift and proposes TopoOT, a test-time training framework integrating persistent homology and optimal transport. The method constructs multi-scale persistence diagrams and performs cross-diagram OT alignment to derive stable pseudo-labels, which supervise a lightweight head with OT-consistency and contrastive learning. Experiments on several 2D and 3D benchmarks show large improvements over existing thresholding and TTT baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Clear motivation & well-written\n\n2. Stong experimental results proves the effectiveness of TopoOT"}, "weaknesses": {"value": "1. This paper seems modified the template and make every page contain less rows, this increase the concern of whether this paper should be desk rejected.\n\n2.  Optimal Transport is a method with time-consuming calculation, I don't think this is a scalable method.\n\n3. The paper assumes stability in persistence diagrams correlates to accurate mask supervision, but empirical justification is limited: No analysis of true anomaly geometry vs. persistence features\n\n4. Pseudo-label quality and robustness require deeper evaluation"}, "questions": {"value": "see weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "D8qfnC0uc5", "forum": "3NEN2pH0W9", "replyto": "3NEN2pH0W9", "signatures": ["ICLR.cc/2026/Conference/Submission18496/Reviewer_HFSF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18496/Reviewer_HFSF"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18496/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761810237397, "cdate": 1761810237397, "tmdate": 1762928194506, "mdate": 1762928194506, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents **TopoOT**, a novel Test-Time Adaptation (TTA) framework for anomaly segmentation that replaces brittle fixed thresholds. Its core contribution is a topology-aware pseudo-labeling strategy combining Persistent Homology (TDA) and Optimal Transport (OT). The authors introduce **\"Optimal Transport Chaining\"** to align persistence diagrams across scales and filtrations, identifying structurally stable features. These features become robust pseudo-labels for supervising a lightweight head during TTA, using a combined $\\mathcal{L}_{OT}$ consistency and $\\mathcal{L}_{contrastive}$ loss. The method achieves new state-of-the-art results, showing significant F1-score gains on 2D and 3D anomaly benchmarks."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "* **Originality:** The paper introduces a novel combination of Persistent Homology (TDA) and Optimal Transport (OT) to generate pseudo-labels for Test-Time Adaptation. The \"Optimal Transport Chaining\" mechanism is a creative and principled solution to stabilize noisy TDA descriptors, moving beyond simple persistence-based filtering.\n* **Significance:** The work directly addresses the critical flaw of static thresholds in anomaly segmentation. It provides a robust, data-driven, and structure-aware adaptation mechanism, which is crucial for real-world deployment under distribution shifts. The significant performance gains (e.g., up to +24.1% F1) clearly demonstrate the value of this approach.\n* **Rigor & Generalizability:** The method's \"plug-and-play\" nature is convincingly validated across 7 different backbones and 5 diverse datasets, including 2D, 3D, and point-cloud modalities. This demonstrates broad applicability. Furthermore, the detailed ablation study provides clear, quantitative evidence for the paper's specific design choices, such as the importance of \"cross-level\" alignment."}, "weaknesses": {"value": "* **Contradictory Efficiency Claims:** The paper's claim of 121 FPS appears inconsistent with the TTA methodology. The 0.33s cost for TDA *plus* the 5-epoch TTA training required *for every sample* suggests the true end-to-end inference time is significantly slower, which is a critical detail for a TTA method.\n* **Potential Heuristic Replacement:** The method replaces a \"brittle threshold\" with a \"Top-K\" stable candidate selection. The paper fails to discuss how $K$ is determined or its performance sensitivity, potentially just trading one heuristic hyperparameter for another.\n* **Limited Scope for Textural Anomalies:** The method's success hinges on anomalies having clear topological signatures ($H_0$ components or $H_1$ holes). It is likely to perform poorly on purely textural anomalies (e.g., 'Carpet') where the anomaly map is diffuse and lacks distinct topological structures."}, "questions": {"value": "1.  **[Crucial] TTA Time Clarification:** Could the authors please provide a clear, end-to-end breakdown of the *total* wall-clock time required to process *a single test sample*? Specifically, what is the time for: (a) Backbone forward pass, (b) TDA feature generation (the 0.33s?), (c) OT Chaining, and (d) the TTA training (5 epochs)? The 121 FPS claim seems to omit the adaptation cost, which is the core of the method.\n2.  **Top-K Sensitivity:** How is the $K$ parameter (for Top-K candidates) chosen? Is it a fixed value, or is it adaptive? Could the authors provide an ablation study on the sensitivity of the F1-score to the choice of $K$?\n3.  **Performance on Textural Anomalies:** Could the authors comment on the method's performance or expected failure cases for anomalies that are purely textural and may not produce strong $H_0$ or $H_1$ features in the anomaly map?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "25ybkqC0C3", "forum": "3NEN2pH0W9", "replyto": "3NEN2pH0W9", "signatures": ["ICLR.cc/2026/Conference/Submission18496/Reviewer_fdep"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18496/Reviewer_fdep"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18496/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761965841331, "cdate": 1761965841331, "tmdate": 1762928192538, "mdate": 1762928192538, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes TopoOT, a topology-aware optimal transport framework for test-time anomaly segmentation. The key idea is to use topological persistence to capture stable structural features and align them through optimal transport to overcome brittle thresholding under domain shift. The main technical innovation is the Optimal Transport Chaining mechanism, which aligns persistence diagrams across thresholds and filtrations to produce stable pseudo-labels. A lightweight online head is then trained with OT-consistency and contrastive objectives to adapt at test time. The paper also provides theoretical stability and generalization guarantees. Experiments show that TopoOT achieves state-of-the-art performance on multiple 2D and 3D anomaly segmentation benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- Anomaly segmentation is an important problem with broad real-world applications.  \n- The paper introduces a novel approach that combines deep topological data analysis (TDA) and optimal transport (OT), supported by solid theoretical foundations.  \n- Experimental results are strong, and the code release improves reproducibility."}, "weaknesses": {"value": "- The paper focuses on methods that binarize anomaly scores but gives limited comparison and discussion with approaches that directly predict binary masks using segmentation networks [1,2].  \n- No failure case analysis is provided, which limits understanding of when the method may fail, such as in texture anomalies where topology priors may be less effective.  \n- The efficiency analysis is brief and lacks detailed comparison. Time and memory costs relative to other test-time adaptation methods should be summarized clearly, for example in a table including backbone runtime.  \n- The theoretical analysis is only briefly mentioned and lacks detailed proofs.\n- The paper does not clearly discuss parameter sensitivity or how hyperparameters are selected, which affects reproducibility and robustness.  \n\n[1] Zavrtanik, Vitjan, Matej Kristan, and Danijel Skočaj. \"Draem-a discriminatively trained reconstruction embedding for surface anomaly detection.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.\n[2] Zhang, Xinyi, et al. \"Unsupervised surface anomaly detection with diffusion probabilistic model.\" Proceedings of the IEEE/CVF International Conference on Computer Vision. 2023."}, "questions": {"value": "Major questions and suggestions:  \n- See weakness above.  \n\nMinor questions and suggestions:  \n- Citations should be placed in parentheses, e.g., “…without structured reasoning about data geometry (Sun et al., 2020; Volpi et al., 2022; Zhang et al., 2022).”  \n- In the last paragraph of page 4, the inclusion order may need to be reversed when $f \\in \\{sub, sup\\}$ takes different values.  \n- In Appendix Figure 5, the second subfigure should be labeled “1-Cube.”  \n- The Appendix only includes proof sketches; full proofs should be provided in the supplementary material."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "hGyBMjds4N", "forum": "3NEN2pH0W9", "replyto": "3NEN2pH0W9", "signatures": ["ICLR.cc/2026/Conference/Submission18496/Reviewer_Nvix"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18496/Reviewer_Nvix"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18496/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762071525252, "cdate": 1762071525252, "tmdate": 1762928192089, "mdate": 1762928192089, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}