{"id": "3WnXsp72v6", "number": 3624, "cdate": 1757488253783, "mdate": 1759898078005, "content": {"title": "Omni-Weather: Unified Multimodal Foundation Model for Weather Generation and Understanding", "abstract": "Weather modeling requires both accurate prediction and mechanistic interpretation, yet existing methods treat these goals in isolation, separating generation from understanding. To address this gap, we present Omni-Weather, the first multimodal foundation model that unifies weather generation and understanding within a single architecture. \nOmni-Weather integrates a radar encoder for weather generation tasks, followed by unified processing using a shared self-attention mechanism.\nMoreover, we construct a Chain-of-Thought dataset for causal reasoning in weather generation, enabling interpretable outputs and improved perceptual quality.\nExtensive experiments show Omni-Weather achieves state-of-the-art performance in both weather generation and understanding.\nOur findings further indicate that generative and understanding tasks in the weather domain can mutually enhance each other.\nOmni-Weather also demonstrates the feasibility and value of unifying weather generation and understanding.", "tldr": "", "keywords": ["AI for Science", "Unified foundation model", "Interpretable reasoning"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/cda60fe4d528b9af04daf4facbd3939da6f17e6b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents Omni-Weather, a multimodal foundation model that unifies weather generation and understanding within a single architecture. Unlike existing models that separately address forecasting or diagnostic reasoning, Omni-Weather integrates radar and text modalities through a shared self-attention backbone and a Chain-of-Thought (CoT) dataset to enable causal reasoning in weather modeling. The model achieves state-of-the-art results on both weather generation (e.g., nowcasting, radar inversion) and understanding (e.g., RadarQA tasks), demonstrating that generative and interpretive capabilities can reinforce each other.\n\nThe contributions are:\n1. Introduction of the first unified multimodal foundation model for weather that jointly handles generation (forecasting, inversion) and understanding (diagnostic reasoning, QA) tasks within a single framework.  \n2. Construction of a weather-specific Chain-of-Thought (CoT) dataset for causal reasoning in generation, improving interpretability and perceptual quality of outputs.  \n3. Empirical results showing Omni-Weather surpasses strong baselines (e.g., CasCast, DiffCast, WeatherGFM, RadarQA) in both pixel-level and perceptual metrics, with reasoning further enhancing visual fidelity and explainability."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper introduces the first unified multimodal foundation model for weather generation and understanding, representing a novel and impactful problem formulation.  \n2. The Chain-of-Thought dataset for causal reasoning in weather generation is promising, enabling interpretable forecasting and bridging the gap between prediction and explanation.  \n4. The experiments are comprehensive, covering both pixel-level and perceptual evaluations with clear comparisons to strong baselines.  \n5. The paper is well-written and clearly structured.\n6. The demonstrated mutual benefit between generation and understanding tasks highlights significant scientific insight with implications for broader multimodal foundation model research."}, "weaknesses": {"value": "1. The claim of a “foundation model for weather” seems overstated, as the model’s scope is limited to a single variable (radar VIL precipitation) rather than encompassing multiple atmospheric variables such as temperature, pressure and wind.  \n2. The proposed model only addresses short-range nowcasting (approximately one hour ahead) and is restricted to the SEVIR dataset covering the continental US, limiting its generalization and global applicability.  \n3. The Chain-of-Thought (CoT) dataset used for training is entirely LLM-generated, with no human expert validation or meteorological review to ensure physical correctness, as GPT-series models are not fine-tuned as meteorologist experts.\n4. The CoT generation pipeline relies on GPT-4o for attribute annotation and GPT-o3 for reasoning synthesis, producing synthetic causal narratives that may not reflect authentic meteorological reasoning. An ablation or qualitative comparison between LLM-generated CoT reasoning and human meteorologist-written reasoning would clear the confound of whether the improvements stem from genuine interpretability or stylistic mimicry of GPT."}, "questions": {"value": "Please refer to weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ewCOBVdcrF", "forum": "3WnXsp72v6", "replyto": "3WnXsp72v6", "signatures": ["ICLR.cc/2026/Conference/Submission3624/Reviewer_3h1v"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3624/Reviewer_3h1v"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3624/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761797725396, "cdate": 1761797725396, "tmdate": 1762916879140, "mdate": 1762916879140, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Omni-Weather, a multimodal foundation model designed to address a significant gap in radar modeling: the separation of generation (numerical prediction) and understanding (textual interpretation). The authors propose a single architecture that unifies these two capabilities, arguing that they are mutually beneficial. The model's core contributions are its unified architecture, the introduction of a novel Chain-of-Thought (CoT) dataset for causal reasoning in weather, and its demonstration of strong performance on both task categories."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- A multimodal model is a great direction towards briding the gap between numerical prediction tasks and high-level textual interepretations/analyses.\n- The framework is well motivated and is at the forefront of such multimodal models in this weather/radar domain.\n- Clearly writing\n- Evidence that joint training/multimodality provides complementary supervision signals and better scores in some areas that just a single modality."}, "weaknesses": {"value": "1. The considered data is exclusively radar. Weather in the title makes it sound overly general. As the authors point out, there would be signifcant challenges in even just extending this framework to more general weather-related tasks/dataset. Thus, I suggest writing OMNI-Radar and replacing most occurrences of weather with radar in the text. Similarly, the term \"foundation model\" in the title feels premature; this needs to urgently be renamed and the text revised to accurately reflect the true contributions of the work.\n2. Lack of clarity/details in some places. For example:\n- Unclear how encoders are trained and what their specific designs are (beyond high-level descriptions like \"VAE decoder\")\n- What's high-value retaining/matching?\n- eq 3.4 feels very abrupt... did some related sentences go missing?\n- $\\lambda_t$ is poorly explained/introduced. Multiplying both loss terms in Eq. 3.4 by $\\lambda_t$ doesn't make sense. Please correct. Also, please explain how it was tuned (same for $n_t$).\n- This claim should be toned down: *\"On the radar inversion task, Omni-Weather consistently surpasses both specialized... and generalist... models, achieving higher CSI scores across all thresholds, with gains up to 20% at high-value levels.\"* given that it's not true for the RMSE metric.\n- How's the CRPS computed? How many ensemble members are used?\n- Fig. 3: Full prompts should be included in appendix. Same for exact versioning of GPT models used\n- I'm confused by the \"CFG Setting\" (classifier free guidance) paragraph. There's no reference to CFG, not even diffusion, anywhere else... did the authors use it but forgot to mention it in the main text?\n3. No discussion of the complexity of the model, especially when compared to the \"generation-only\" baselines\n4. More comprehensive evaluations would be useful. E.g.:\n- Human expert evaluation of \"understanding\" outputs would be really useful and strong contribtuion. Are the explanations at the level of a meteorology expert? How useful are they actually? Are the textual outputs given by the model consistent with the numerical nowcasts (e.g., in fig. 4)? With the current results, it's hard to judge how scientifcally useful the \"understanding\" part of the model actually is.\n- How's the RMSE in Table 2 computed? A more comprehensive ablation (e.g. like the part of table 1 that's about radar nowcasting) would be more useful.\n5. While the paper is at the forefront of multimodal modeling for weather/radar, it's not there all by its own. The paper misses some important references and contextualization. In particular, 1) this paper is only *one* of the first multimodal models in this weather/radar domain [1], 2) There's been a benchmark proposed in this space, which includes SEVIR (the only weather dataset used on this paper) [2]. It would have been nice to use it here, but at least it should be discussed.\n\nMinor:\n- VIL should be explained before using its abbreviation form.\n- cascast is misspelled in Fig. 5\n\n[1] Aquilon: Towards Building Multimodal Weather LLMs; Varambally et al. 2025 (https://openreview.net/forum?id=KVxOwEYAF4)\n\n[2] CLLMate: A Multimodal Benchmark for Weather and Climate Events Forecasting; Li et al. EMNLP 2025 (https://arxiv.org/abs/2409.19058)"}, "questions": {"value": "- Why are so many different encoder/decoder's used? E.g., why are separate single-frame radar and multi-frame radar encoder needed?\n- *\"In the radar nowcasting task, forecasts exhibit fine-grained storm details with improved spatial coherence\"*... I'm not sure how the authors identify \"improved spatial coherence\" in Fig. 5?\n- Is there anything special about the extra Metaquery data that would make it particularly useful or do you think your model would benefit from any other extra, not radar specific, data? Table 5 seems to explore this a bit, but it's unclear what the two possible \"gen\" datasets are and why adding the 2nd \"gen\" dataset is so detrimental to performance.\n- Why not report CRPS for radar inversion task?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jubAO0Ls6C", "forum": "3WnXsp72v6", "replyto": "3WnXsp72v6", "signatures": ["ICLR.cc/2026/Conference/Submission3624/Reviewer_rnQS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3624/Reviewer_rnQS"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3624/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761808710667, "cdate": 1761808710667, "tmdate": 1762916878884, "mdate": 1762916878884, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes OmniWeather, a weather understanding and forecasting model that aims to perform three main tasks: (i) radar inversion (ii) radar understanding (iii) radar nowcasting. The authors finetune the multimodal Bagel on their CoT dataset, and benchmark their method against unimodal models for these three tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The authors train a single unified model that can reason across both images and text, and effectively produce interpretable forecasts. As far as I know, this is the first work that combines weather generation and understanding in the same model.\n2. The proposed model achieves strong results on all three considered tasks.\n3. The ablations are interesting, and shed light on the different steps of the model pipeline."}, "weaknesses": {"value": "1. My primary concern is that the paper overstates its scope and significance. The definition for a foundation model from [1] is \"A foundation model is any model that is trained on broad data (generally using self-supervision at scale) that can be adapted (e.g., fine-tuned) to a wide range of downstream tasks;\". While the paper certainly achieves impressive results in unifying different modalities, labeling the model a foundation model feels premature given that it is fine-tuned for only three task types on a limited data regime. I would recommend the authors to soften the claims in the introduction and abstract. I would also recommend a title change that better reflects the scope of the tackled problem. For example, a title with some combination of the words \"unified multi-task model for short-range weather understanding and generation\".\n\n2. The work is missing several important citations and discussions related to short-range/medium-range weather forecasting, e.g.  GenCast [2], Stormer [3], Pangu-Weather [4], Aurora [5], Prithvi WxC [6]. These are the canonical exemplars readers associate with large-scale weather pretraining/foundation model claims. Even if the focus is nowcasting, the paper should explicitly contrast goals, data scope, and evaluation scales with these systems. The authors should also compare their model against the important now-casting work [7] to better situate progress within the nowcasting literature.\n\n\n3. From my understanding, the authors use GPT-4o (Appendix A.4) to annotate radar data and identify important phenomenon from the images. I am concerned that this process might be error-prone and introduce mistakes that might propagate into the training process. Do the authors benchmark 4o annotations against a gold standard (for example, expert human)? How reliable is this data annotation process?\n\nThe manuscript also needs a precise description of the quality-control (QC) stages—currently “Structure Check, Causal Alignment, and Terminology” are named but not operationalized.\n\n\n### References\n[1] Bommasani, Rishi. \"On the opportunities and risks of foundation models.\" arXiv preprint arXiv:2108.07258 (2021).\n\n[2] Price, Ilan, et al. \"Gencast: Diffusion-based ensemble forecasting for medium-range weather.\" arXiv preprint arXiv:2312.15796 (2023).\n\n[3] Nguyen, Tung, et al. \"Scaling transformer neural networks for skillful and reliable medium-range weather forecasting.\" Advances in Neural Information Processing Systems 37 (2024): 68740-68771.\n\n[4] Bi, Kaifeng, et al. \"Pangu-weather: A 3d high-resolution model for fast and accurate global weather forecast.\" arXiv preprint arXiv:2211.02556 (2022).\n\n[5] Bodnar, Cristian, et al. \"A foundation model for the Earth system.\" Nature (2025): 1-8.\n\n[6] Schmude, Johannes, et al. \"Prithvi wxc: Foundation model for weather and climate.\" arXiv preprint arXiv:2409.13598 (2024).\n\n[7] Ravuri, Suman, et al. \"Skilful precipitation nowcasting using deep generative models of radar.\" Nature 597.7878 (2021): 672-677."}, "questions": {"value": "Apart from the main issues flagged in the Weaknesses section, I have other minor comments/questions/suggestions.\n\n1. The current description of CoT data annotation and Figure 4 are cluttered and hard to follow. The authors should consider simplifying it, or replacing it with a figure that reads top-to-bottom.\n2. Why do the authors use the word \"causal\"? For example, the prompt in Appendix A.4 asks the model to extract \"Temporal causal factor, perceptual causal factor\" without any sufficient explanation of what this means. How do we trust that the model knows the true \"causal\" factors for explaining these weather phenomenon?\n3. Lines 193-197 do not add any substantive value in explaining the problem setup and should either be replaced by a more complete mathematical description of the problem setup or omitted entirely.\n4. There are insufficient architectural details about the VAE used in the radar inversion task, and these details should be added to the manuscript.\n5. The clarity in Figure 3 could be improved. In particular, it is unclear how the tokens from the different modalities are combined in the model architecture.\n6. Line 214: modal -> model\n7. The authors need to add more details about how many data samples are used for training. While the authors mention that they generate 4000 CoT samples for radar nowcasting and 4,000 CoT annotations for radar inversion, the authors should also clarify the number of samples used from RadarQA, and the general metaquery data.\n\n\nOverall, I think this is a substantial and promising paper marred by some fixable issues. I would be willing to raise my score if the authors can satisfactorily address my concerns."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "NqmbNATW3T", "forum": "3WnXsp72v6", "replyto": "3WnXsp72v6", "signatures": ["ICLR.cc/2026/Conference/Submission3624/Reviewer_dM4g"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3624/Reviewer_dM4g"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3624/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761881257324, "cdate": 1761881257324, "tmdate": 1762916878697, "mdate": 1762916878697, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces Omni-Weather, a unified multimodal foundation model that brings weather generation and understanding into the same architecture. The authors also create a chain-of-thought dataset tailored for causal reasoning in generation and use it for finetuning and \"thinking\" inference. They show strong (often SOTA) results across nowcasting, radar inversion, and radar understanding, and provide evidence that training generation and understanding together lets the two enhance one another. Ablations further indicate that mixing scientific and general data boosts performance, especially on deterministic and perceptual metrics."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "(1) This paper introduces a multimodal foundation model that unifies weather generation and understanding within one architecture, using modality-specific encoders, and takes a step toward reasoning-capable unified foundation models for weather.\n\n(2) They present experiments and ablations with useful insights, showing how generation and understanding tasks can mutually enhance each other.\n\n(3) They demonstrate strong results across nowcasting, radar inversion, and radar understanding, often matching or exceeding state-of-the-art models."}, "weaknesses": {"value": "(1) As mentioned in the limitation section by the authors, the model cannot yet adapt to general-domain VAEs.\n\n(2) It would strengthen the paper to include a small human-validation study with weather experts. In particular, having domain experts rate the generated reports/explanations, and comparing those ratings to the LLM-based judge.\n\n(3) Results are centered on SEVIR-style radar nowcasting, satellite-to-radar inversion, and RadarQA understanding, and generalization to other weather tasks is not demonstrated."}, "questions": {"value": "(1) It is mentioned that there is a quality verification step to produce the final CoT dataset, including causal alignment, structure checks, etc. Is there human/expert validation at any point during the dataset generation or evaluation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "qcL87GJDsu", "forum": "3WnXsp72v6", "replyto": "3WnXsp72v6", "signatures": ["ICLR.cc/2026/Conference/Submission3624/Reviewer_naQj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3624/Reviewer_naQj"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3624/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762111638779, "cdate": 1762111638779, "tmdate": 1762916878346, "mdate": 1762916878346, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}