{"id": "3yOpgyOcyd", "number": 14035, "cdate": 1758227410854, "mdate": 1763732494523, "content": {"title": "PitStop: Physics-Informed Training with Gradient Stopping", "abstract": "Physics-informed learning offers a powerful approach for modeling physical systems by enforcing governing equations directly within the training process. However, optimizing such models remains inherently challenging, especially for large systems, due to the ill-conditioned nature of these residual-based loss functions. In this paper, we critically examine the limitations of classical optimization techniques by developing a comprehensive theoretical framework for physics-informed setups, including insights on convergence guarantees, convergence speed and fixed points. Next, we introduce PitStop, a novel optimization method for physics-informed training based on gradient stopping, which overcomes the limitations of classical methods by backpropagating feedback differently from the standard chain rule of calculus. The method is motivated and mathematically analyzed in our theoretical framework, incurs no additional computational cost compared to standard gradients, and achieves superior results in our experiments. Our work paves the way for more scalable and reliable physics-informed model training by fundamentally rethinking optimization paradigms.", "tldr": "", "keywords": ["Optimization", "Physics-Informed Training"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/6cbe4dc946e836592e8c8d339c89a9d54a085ffc.pdf", "supplementary_material": "/attachment/4dddd8ed4b74348f3a93c3480e25ca585a0a9745.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces PitStop to optimize physics-informed loss that modifies gradient backpropagation by stopping certain gradient flows, thereby deviating from the standard chain rule. The authors argue that classical optimization methods are ill-suited for physics-informed tasks because the residual-based loss functions are ill-conditioned and their approximate minima often fail to align with the supervised objective. PitStop is theoretically grounded using linear fixed-point theory and is shown to ensure convergence under mild conditions. The method requires no extra computational cost compared to standard gradients and exhibits improved convergence rates and stability. Extensive experiments on linear and nonlinear systems, including Burgers’ and Navier–Stokes equations, demonstrate faster convergence and better supervised accuracy compared to standard optimizers."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.The paper provides a comprehensive framework that connects optimization theory and physics-informed learning, especially through non-symmetric fixed-point operators and gradient stopping.\n\n2.Theorems on convergence, rate, and fixed points are well-structured and backed by detailed proofs.\n\n3.Reinterpreting backpropagation itself, rather than tuning weights or loss terms, is an innovative contribution to the field.\n\n4.The method maintains computational efficiency, making it suitable for large-scale physics-informed neural network (PINN) problems."}, "weaknesses": {"value": "1.The analysis is confined primarily to linearized systems and time/space-discretized settings, raising uncertainty about applicability to fully nonlinear PDEs or continuous-time PINNs.\n\n2.The method requires explicit temporal discretization, potentially limiting use in frameworks that rely on automatic differentiation.\n\n3. While the proofs seems rigorous, the implementation details and intuition behind gradient stopping, as well as some symbols in the proofs could be clarified further for non-theoretical audiences.\n\n4. The effect of hyperparameters (e.g., $\\alpha$ , learning rate $\\eta$) on convergence robustness could be elaborated."}, "questions": {"value": "1.Can the convergence guarantees extend to nonlinear PDE operators or models with data-driven mixed losses?  \n\n2.How sensitive is the method to the choice of α (initial condition weight) and step size η in practice?\n\n3.The physics-informed loss (6) is presented in a discretized form, i.e. in the settings the temporal and spatial domains are setting to equidistant points. This is too restrict. As we know, one of PINN’s advantage is its meshless property, but (6) is the form of finite difference scheme loss, reduced the advantage of the continuous physics-informed loss. In this setting we can solve (6) by solving linear algebraic equations like in the finite difference method, so why we need another optimization method to solve (6)? How to extend the method to nonregular domain? Can the method extend to continuous time/space physics-informed loss?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "exZqYquR2W", "forum": "3yOpgyOcyd", "replyto": "3yOpgyOcyd", "signatures": ["ICLR.cc/2026/Conference/Submission14035/Reviewer_GPk5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14035/Reviewer_GPk5"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761021441314, "cdate": 1761021441314, "tmdate": 1762924523435, "mdate": 1762924523435, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper provides an interesting study on the effect of gradient stopping in the optimization of time-dependent PINN loss. The authors propose to stop gradient propagation during autoregressive residual calculation. The experimental results show the benefit of this approach."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "This work performs systematic study of the effect of gradient stopping in training autoregressive PDE solvers, a popular trick that hasn't been properly investigated before. The authors analyze the effect of gradient stopping in linearized fix point setting, which is simple but illustrative perspective. The experimental results shows the effectiveness of this approach comparing to default optimizers."}, "weaknesses": {"value": "I have a few main concerns:\n\n1. The problem setting of PINN is non-standard. The authors say \"We restrict ourselves to a setup where the time derivative is discretized directly through a numerical time-stepping scheme, rather than being computed via automatic differentiation\". For most PINNs, there's no time-stepping and time derivatives are calculated very efficiently using AD. Even for PINOs, time derivatives can be evaluated using higher-order scheme.\n\n2. The comparison to standard PINNs is missing. It is likely that the mismatch of GD is due to the way time derivatives are calculated."}, "questions": {"value": "1. Is this PINN setting general enough?\n\n2. The experiments lack basic setting. What is the input/output of the network? If it's a standard MLP with time input, how is the time-stepping done? If not, how many roll out steps are done for both methods?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4VpgkeYlHS", "forum": "3yOpgyOcyd", "replyto": "3yOpgyOcyd", "signatures": ["ICLR.cc/2026/Conference/Submission14035/Reviewer_8BHV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14035/Reviewer_8BHV"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761545802460, "cdate": 1761545802460, "tmdate": 1762924523006, "mdate": 1762924523006, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes new optimization solutions for the key challenges of PINN optimization. The problem solved is very meaningful, and the method is also novel, but the insufficient evaluation of the results has affected the performance of the method. If the author solves my concerns and demonstrates that the proposed method has significant advantages, I will increase the rating."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. A new physics-informed loss optimization method has been derived through theoretical derivation, which has theoretical basis.\n2. Verified on 4 PDEs.\n3. The problem being solved is urgent and important."}, "weaknesses": {"value": "1. In Line 97, why can such an assumption be made? This approach yields different results from automatic differentiation, and different discretization methods can also lead to different outcomes.\n2. A typo is in Line 131.\n3. The experimental section only compares one curve. If experiments can be conducted under different boundary conditions and initial conditions, and statistical analysis can be added, it will improve the credibility of the paper.\n4. PINN will use second-order optimizers such as LBFGS after Adam, but this baseline is not mentioned in the paper.\n5. The paper lacks an introduction to the baseline. Is the calculation of PDE loss done using discrete methods or automatic differentiation in time derivatives?\n6. Can you draw an error graph for Figure 4, as it appears that gradient descent is more similar to solution.\n7. The paragraph starting from line 474 appears to have no relation to the previous part, and there is no relevant evidence before it. This paragraph makes the paper unscientific."}, "questions": {"value": "See the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ggvJNkBtmQ", "forum": "3yOpgyOcyd", "replyto": "3yOpgyOcyd", "signatures": ["ICLR.cc/2026/Conference/Submission14035/Reviewer_mAoF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14035/Reviewer_mAoF"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761553919222, "cdate": 1761553919222, "tmdate": 1762924522614, "mdate": 1762924522614, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents an optimization framework named PitStop for optimizing physics-informed objective functions. In the current paradigm, most work optimizes Physics-informes loss, which corresponds to the supervision loss of the temporal derivative of the governing physics model. By optimizing this derivative-based loss, the existing methods aim at attaining the optimal Supervision loss. However, this work points out that the optimal points of these two different loss functions are not always the same, and based on this observation, proposes PitStop as an alternative for the existing classical gradient-based optimization methods like Gradient Descent and Gauss-Newton methods. To analyze the properties of the PitStop, the authors use the lens of linear fixed-point iterations. With this interpretation, the authors claim that while PitStop could converge to the worse fixed point than the Gradient Descent in terms of the physics-informed loss, it eventually converges to the better Supervision loss faster than these methods. The authors provide experimental results on one toy example, harmonic oscillator, Burger's equation, and Navier-Stokes equation, and show that PitStop converges faster to the better solution than the conventional methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The motivation is good, and authors provided a thorough theoretical analysis of their approach. \n- With simple experiments, the authors effectively show that the current approach to minimize the Physics-informed loss does not always align with the final goal to minimize the Supervision loss. They also sho"}, "weaknesses": {"value": "- The overall description was hard to follow. More intuitive explanation about why PitStop works would be appreciated.\n- The overall description was hard to follow, making it challenge to reproduce the results\n- Even though the authors gave detailed definitions and analysis of their approach, it is unclear how we can implement it. Seeing the equation 7 and 8, I feel like we can reproduce the results by only cutting the gradient flow across different time steps, but I'm not sure if I understand it correctly. It would be helpful if the authors provide an explicit algorithm (or pseudo code).\n- The experimental results are not convincing that this approach is an overall better approach than existing methods.  For example,  in   Figure 4, I believe (d) GD gives better result than PitStop."}, "questions": {"value": "See above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "LdF7EjKcKQ", "forum": "3yOpgyOcyd", "replyto": "3yOpgyOcyd", "signatures": ["ICLR.cc/2026/Conference/Submission14035/Reviewer_WCm7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14035/Reviewer_WCm7"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761895246376, "cdate": 1761895246376, "tmdate": 1762924522237, "mdate": 1762924522237, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Paper Update"}, "comment": {"value": "Dear Reviewers,\n\nThank you all for reviewing our paper. We have uploaded an updated draft. In addition to minor corrections and further clarifications in the main text, we have added a new section to the appendix (Section C, page 20-23). This section provides additional experimental evaluation on the nonlinear systems (Burgers’ equation and the Navier–Stokes equations). These supplementary results further indicate that our method performs favorably in those cases as well."}}, "id": "7MFlRhelt2", "forum": "3yOpgyOcyd", "replyto": "3yOpgyOcyd", "signatures": ["ICLR.cc/2026/Conference/Submission14035/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14035/Authors"], "number": 6, "invitations": ["ICLR.cc/2026/Conference/Submission14035/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763733563694, "cdate": 1763733563694, "tmdate": 1763733563694, "mdate": 1763733563694, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}