{"id": "47ToW7T1iU", "number": 19967, "cdate": 1758301057030, "mdate": 1759897009840, "content": {"title": "FlowCast: Advancing Precipitation Nowcasting with Conditional Flow Matching", "abstract": "Radar-based precipitation nowcasting, the task of forecasting short-term precipitation fields from previous radar images, is a critical problem for flood risk management and decision-making. While deep learning has substantially advanced this field, two challenges remain fundamental: the uncertainty of atmospheric dynamics and the efficient modeling of high-dimensional data. Diffusion models have shown strong promise by producing sharp, reliable forecasts, but their iterative sampling process is computationally prohibitive for time-critical applications. We introduce FlowCast, the first model to apply Conditional Flow Matching (CFM) to precipitation nowcasting. Unlike diffusion, CFM learns a direct noise-to-data mapping, enabling rapid, high-fidelity sample generation with drastically fewer function evaluations. Our experiments demonstrate that FlowCast establishes a new state-of-the-art in predictive accuracy. A direct comparison further reveals the CFM objective is both more accurate and significantly more efficient than a diffusion objective on the same architecture, maintaining high performance with significantly fewer sampling steps. This work positions CFM as a powerful and practical alternative for high-dimensional spatiotemporal forecasting.", "tldr": "FlowCast is the first model to apply Conditional Flow Matching (CFM) to precipitation nowcasting. Our approach outperforms state-of-the-art diffusion models while also leveraging CFM's inherent efficiency to require a small number of sampling steps.", "keywords": ["conditional flow matching", "precipitation nowcasting", "generative models", "spatiotemporal forecasting", "machine learning in environmental science"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ea581237f98297c883e1c590f11d60a34022e441.pdf", "supplementary_material": "/attachment/6ac4eaf93467b772df0b7adc0d01cc2ee2e8a5c5.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces FlowCast, which applies Conditional Flow Matching (CFM) to radar-based precipitation nowcasting. The authors claim this is the first attempt to use CFM for spatiotemporal probabilistic forecasting. The model operates in a latent space via a VAE encoder-decoder and adopts an Earthformer-UNet backbone to learn a noise-to-data vector field. Experiments on the SEVIR and ARSO datasets show that FlowCast achieves state-of-the-art results in CRPS, CSI, and HSS, while requiring far fewer function evaluations than diffusion-based models. The paper highlights the superior efficiency–accuracy trade-off of CFM over diffusion objectives and positions FlowCast as a practical framework for real-time nowcasting."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "S1. This paper demonstrates significantly reduced inference steps compared with diffusion methods, making it relevant for operational nowcasting systems that demand fast turnaround.\n\nS2. FlowCast achieves superior or competitive scores on two diverse radar datasets, confirming generalization beyond a single domain.\n\nS3. The paper provides explicit architectural and training settings, enhancing reproducibility.\n\nS4. It addresses the real bottleneck in generative nowcasting (diffusion sampling inefficiency) with a concrete solution."}, "weaknesses": {"value": "W1. The claim in the abstract and introduction that this work is the first to apply Conditional Flow Matching to precipitation nowcasting is inaccurate, since prior studies such as the ICML 2025 rectified flow model have already demonstrated flow-based precipitation refinement.\n\nW2. The literature review in Section 2 on probabilistic nowcasting omits flow-based approaches when contrasting generative paradigms, resulting in an incomplete overview of probabilistic modeling beyond GANs and diffusion.\n\nW3. The introduction of flow models in Section 2 does not provide a comparative analysis against other flow-based frameworks such as Continuous Normalizing Flows or rectified flows, leaving the advantages of CFM for spatiotemporal uncertainty unexplained.\n\nW4. The architectural description in Section 3.2.2 shows that FlowCast merely adapts Earthformer-UNet to the CFM objective without introducing new architectural mechanisms or theoretical insights that would justify CFM’s suitability for atmospheric dynamics.\n\nW5. The experimental comparison in Section 4.2 excludes recent transformer-based baselines such as Earthfarseer, which limits the credibility of the claimed state-of-the-art performance.\n\nW6. The evaluation in Section 4.2 relies heavily on aggregated scores such as CSI-M and HSS-M, which mask variations across precipitation intensities and obscure the model’s behavior on extreme rainfall events.\n\nW7. The methodological and inference descriptions in Sections 3.2.2 and 4.1.4 omit discussion of training instability and ODE-based sampling overhead, leaving open questions regarding robustness and computational scalability."}, "questions": {"value": "1. The abstract mentions “predictive accuracy,” while the contributions section claims “probabilistic performance,” so which one defines the main contribution?\n2. The description in Section 4.1.1 on Page 5 states that the ARSO dataset uses “63,716 training samples,” while Table 1 lists only 38,229 training samples. How can this internal inconsistency in dataset splits be explained?\n3. Table 2 on Page 6 defines the ARSO latent dimensions as 13/12 × 38 × 52 × 4, which implies non-integer compression factors compared to the original 301 × 401 resolution. How is the rounding or padding handled to yield these dimensions?\n4. The results table for ARSO on Page 8 labels the highest-threshold metric as “CSI-219,” even though Section 4.1.2 defines ARSO thresholds as [15, 21, 30, 33, 36, 39] dBZ. Thus, why does the same SEVIR-specific label appear in the ARSO table, and what threshold does it actually represent?\n5. The conclusion on Page 9 asserts that FlowCast “maintains high forecast quality with as few as a single sampling step,” while all experiments use 10 steps for evaluation. How is this claim supported?\n6. Appendix Table 6 uses different VAE warmup epochs for SEVIR and ARSO despite both using the same VAE architecture. What rationale justifies this discrepancy in the training configuration?\n7.Appendix A.1.2 mentions an ODE solver ablation but gives no data. How is the claim of no difference supported?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "mww3W9ibh6", "forum": "47ToW7T1iU", "replyto": "47ToW7T1iU", "signatures": ["ICLR.cc/2026/Conference/Submission19967/Reviewer_zhbk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19967/Reviewer_zhbk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19967/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761682692595, "cdate": 1761682692595, "tmdate": 1762932580389, "mdate": 1762932580389, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The proposed FlowCast model is the first to apply Conditional Flow Matching to precipitation nowcasting, which utilizes VAE to compress radar data into latent space, combines Cuboid Attention and CFM to learn direct noise-data mapping for efficient sampling. On SEVIR and ARSO datasets, its various metrics outperform baselines like PreDiff and CasCast, with 10-step sampling more efficient than diffusion models."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. This work is the first to apply Conditional Flow Matching to precipitation nowcasting, learning a direct noise-to-data mapping. It achieves high-fidelity forecasting with only 10 sampling steps.\n2. This work adopts VAE latent space compression and Cuboid Attention architecture, balancing the efficiency of high-dimensional radar data processing and the ability of spatiotemporal dynamic modeling."}, "weaknesses": {"value": "1. Conditional Flow Matching achieves the mapping from noise to data by learning a vector field. However, the paper does not design a prior structure for the vector field in combination with the physical laws of precipitation, relying entirely on data-driven learning. This may lead the model to generate results lacking physical condition constraints.\n2. This work applies CFM to precipitation nowcasting for the first time, but the idea of CFM has already been validated in some tasks within the field of computer vision. The paper transfers it to the precipitation nowcasting scenario and fails to propose improvement strategies for CFM targeting certain characteristics of precipitation data (such as strong spatiotemporal correlation, dynamic evolution, etc.). This results in deficiencies in innovation and generative capability."}, "questions": {"value": "1. This work only validates performance on two radar datasets (SEVIR, ARSO). Are there experimental results tested on more datasets? Meanwhile, is the performance tested under shorter or longer lead times?\n2. The probabilistic baselines compared in this work only include diffusion models. Is there a comparison with GAN-based probabilistic models?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "wTYARPjirQ", "forum": "47ToW7T1iU", "replyto": "47ToW7T1iU", "signatures": ["ICLR.cc/2026/Conference/Submission19967/Reviewer_EpeH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19967/Reviewer_EpeH"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19967/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761808185176, "cdate": 1761808185176, "tmdate": 1762932519388, "mdate": 1762932519388, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper describes the new solution to the problem of radar-based precipitation nowcasting, which uses conditional flow matching (CFM). The authors highlight accuracy and efficiency based on the empirical evidence."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Significance: improving the performance and democratising access to precipitation forecasting is an important problem as addressed in this paper. \n\nClarity: the paper is in general clearly written\n\nQuality: the methodology is sound, the description seems correct and reproducible. The ablation studies show the justification for experimental decisions."}, "weaknesses": {"value": "Quality: The main argument is that swapping the training procedure from the diffusion model to conditional flow matching improves the performance, both in terms of accuracy and in terms of computational efficiency. The problem I see with this argument, however, is that there is previous evidence, in other domains, that the CFM may improve upon the efficiency and performance [1].  I would expect in this case for the authors to link it to the background and then say something that goes beyond the existing literature.  . In other words, the specific link to the justification of this method is missing. \n\nOriginality: as the narrative goes now, and stemming from the previous point, there is a concern that the work is an application of CFM for the precipitation forecasting. That should, in my mind, include a justification that is unique to the precipitation nowcasting (theoretical or otherwise).  Therefore, I would invite the authors to expand upon the contribution and say how this work goes beyond the existing literature in this aspect. \n\nIn summary, my main concern is that the claims now appear to be a combination of the two: CFM and precipitation forecasting.  I would invite the authors therefore to expand upon why this reasoning could be wrong. \n\n\n[1] Lipman et al (2023) Flow Matching  for Generative Modeling, ICLR 2023"}, "questions": {"value": "1. I would appreciate if the authors add confidence intervals to the key results (Tables 3-5 in particular). \n\n2. The algorithms for training and sampling at Page 4 are difficult to follow, therefore I would suggest that the authors present them as algorithm blocks.\n\n3. The authors say in the abstract: \"the uncertainty of atmospheric dynamics and the efficient modeling of high-dimensional data\" I am curious whether this paper addresses this question in any way beyond the accuracy metrics?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "GQdi1gHkEU", "forum": "47ToW7T1iU", "replyto": "47ToW7T1iU", "signatures": ["ICLR.cc/2026/Conference/Submission19967/Reviewer_itD7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19967/Reviewer_itD7"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19967/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761934849664, "cdate": 1761934849664, "tmdate": 1762932474794, "mdate": 1762932474794, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces FlowCast, which for the first time applies the efficient Conditional Flow Matching (CFM) framework to radar-based precipitation nowcasting. FlowCast integrates a variational autoencoder (VAE) for latent representation with a network backbone based on the Earthformer-UNet architecture. The authors aim to address the slow sampling issue inherent in existing diffusion models and use ablation studies to demonstrate the efficiency advantage of the CFM objective over the diffusion objective when applied to the same backbone."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. **Innovation and Practicality of the Methodology:**    \n    - The paper innovatively introduces the highly efficient CFM generative framework to the high-dimensional spatiotemporal prediction problem of precipitation nowcasting. This represents a valuable exploration of cutting-edge methods in the field.\n        \n    - A direct comparison and ablation study with diffusion models clearly demonstrates the significant advantage of CFM in terms of efficiency, showing that it can maintain or closely approach optimal performance with very few function evaluations (NFE). This is of high practical value for time-sensitive nowcasting applications.\n        \n2. **Clarity and Readability:** The paper is well-structured, the methodology is detailed, and the explanation of the CFM training and sampling process is particularly concise and clear, making the working principle of FlowCast easy to understand.\n    \n3. **Recognition of Effort and Contribution:** Given that the authors performed comparisons across two generative paradigms (CFM vs. Diffusion) and conducted experiments on two diverse geographical and climatic datasets, they clearly put effort into advancing model performance and exploring efficiency."}, "weaknesses": {"value": "1. **Incomplete Experimental Results and Lack of Convincing Evidence:**\n    \n    - **Inadequate Metric Presentation:** The experimental evaluation lacks quantitative verification of structured forecasts. For instance, the absence of analysis using spatial verification methods (e.g., FSS at different scales) prevents a thorough validation of the model's ability to predict the structure and location of precipitation systems. Furthermore, the authors did not provide complete performance curves for **all** baseline models across all future lead times on both datasets.\n        \n2. **Ambiguity in Innovation Positioning and Insufficient Exploration Breadth:**\n    \n    - **If positioned as Framework Innovation:** Simply applying the existing CFM training/sampling framework to a UNet backbone based on Earthformer Blocks results in a relatively low degree of methodological novelty for an ICLR-level conference.\n        \n    - **If positioned as Application Exploration:** The paper aims to explore the general applicability of CFM as an efficient generative paradigm for precipitation nowcasting, but the breadth of exploration is insufficient. The lack of comparative experiments applying CFM to at least one different type of advanced nowcasting model makes it difficult to strongly demonstrate CFM's effectiveness as a general objective function."}, "questions": {"value": "**Regarding False Alarm Ratio (FAR) and Forecast Quality:** Although FlowCast achieves the highest HSS-M score, your results indicate a **higher FAR-M** (compared to Earthformer and PreDiff). This suggests that FlowCast's high-scoring forecasts may be accompanied by a high rate of 'false alarms'. Could you provide and discuss more detailed categorical skill scores, such as the Threat Score (TS) or Equitable Threat Score (ETS) across different precipitation thresholds? This would help provide a fairer assessment of the model's actual skill in predicting high-intensity precipitation events."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "nt3NryuPnF", "forum": "47ToW7T1iU", "replyto": "47ToW7T1iU", "signatures": ["ICLR.cc/2026/Conference/Submission19967/Reviewer_25PR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19967/Reviewer_25PR"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission19967/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989670019, "cdate": 1761989670019, "tmdate": 1762932421618, "mdate": 1762932421618, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}