{"id": "4YGlj6kQgw", "number": 17670, "cdate": 1758279010844, "mdate": 1761241781259, "content": {"title": "The Dead Salmons of AI Interpretability: The Need for a Statistical Inference Perspective", "abstract": "A striking neuroscience study once placed a dead salmon in an fMRI scanner and showed it images of humans in social situations. Astonishingly, standard analyses reported brain regions predictive of social emotions. The explanation, of course, was not supernatural cognition but a cautionary tale about misapplied statistical inference.\nIn AI interpretability, reports of similar ``dead salmon'' artifacts abound: feature attribution, probing, sparse auto-encoding, and even causal analyses can produce plausible-looking explanations for randomly initialized neural networks. \nIn this work, we argue for a fundamental statistical-causal reframing: explanations of computational systems should be treated as parameters of a (statistical) model, inferred from computational traces. This perspective goes beyond simply measuring statistical variability of explanations due to finite sampling of input data; interpretability methods become statistical estimators and findings should be tested against explicit and meaningful alternative computational hypotheses. It also highlights important theoretical issues, such as the identifiability of explanations, which we argue is critical to understand the field’s susceptibility to false discoveries. We illustrate this reframing with a toy scenario recasting probing as hypothesis testing against null distributions derived from random computation. The statistical-causal perspective opens many avenues for future work aiming to turn AI interpretability into a rigorous science.", "tldr": "Argues that AI interpretability needs to be reframed as a statistical inference problem", "keywords": ["Interpretability", "Explanation", "Inference"], "primary_area": "interpretability and explainable AI", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/407292424cabb5ee1940a4440722aa0d4124122f.pdf", "supplementary_material": ""}, "replies": [{"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "KD8kFpQ5rD", "forum": "4YGlj6kQgw", "replyto": "4YGlj6kQgw", "signatures": ["ICLR.cc/2026/Conference/Submission17670/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17670/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761241780302, "cdate": 1761241780302, "tmdate": 1761241780302, "mdate": 1761241780302, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}