{"id": "540Bsw9Yu8", "number": 24653, "cdate": 1758359033591, "mdate": 1759896756928, "content": {"title": "Rectifying Diffusion Guidance with Exponential Moving Average", "abstract": "Continuous-time generative models, such as diffusion or flow models, employ Classifier-Free Guidance (CFG) to generate high-quality samples. However, CFG sacrifices sample diversity at the cost of sample quality, which leads to oversimplification. Furthermore, at high guidance scales, excessively accumulated guidance term causes oversaturation and leads to degraded sample quality. Previous attempts to solve this problem often require auxiliary components to construct \"weak\" version of the model, which hinders their adoption for publicly released models, where auxiliary components are accessible. In this paper, we revisit the property that the Exponential Moving Average (EMA) of a model's predictions during sampling phase acts as a low-pass filter. By suppressing high frequencies, the EMA of a model's predictions inherently degrades sample quality, allowing it to be leveraged as the \"weak\" version, while still retaining conditional components. To take advantage of this property, we introduce Rectified EMA Guidance (REG), a simple yet effective training-free approach. REG rectifies guidance term with the difference between the EMAs of the model's conditional and unconditional predictions. This rectified term offsets amplified conditional components, playing a crucial role in preserving sample diversity while improving quality. We validated REG on both class-conditional and text-conditional (industrial) models and demonstrate that it improves sample quality and preserves diversity by preventing oversaturation and oversimplification, even in high-guidance scenarios. To the best of our knowledge, REG is the first training-free guidance method that improves sample quality orthogonally and does not requires auxiliary components or specific model architecture, or modality. Therfore, it is applicable to a wide range of generative models, including large-scale public and industrial models.", "tldr": "We propose Rectified EMA Guidance (REG), a training-free method that uses a model's prediction EMA to rectify guidance, preventing oversaturation while improving quality and diversity without auxiliary components.", "keywords": ["diffusion models", "flow models", "guidance", "conditional generation"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/67478f2d5a20171c46d5b84d70cf9a7228ce2366.pdf", "supplementary_material": "/attachment/0dc04aaf32f4d8b1c916812fc07f8f4c06813e17.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a technically novel guidance approach, **Rectified EMA Guidance (REG)**, which replaces the unconditional prediction with a new EMA-rectified prediction. The authors state that REG achieves a better quality–diversity trade-off than widely used CFG. They conduct experiments on both text-to-image and class-conditional tasks to support their claims. REG does not rely on an extra model and shows good compatibility with publicly released models such as SDXL and SD3."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The paper proposes REG, which leverages EMA over model predictions during sampling, and provides an analysis of how EMA acts as a low-pass filter in sampling. This is novel and interesting."}, "weaknesses": {"value": "* The current draft is not ready for submission to a venue like ICLR. The manuscript appears hurried and suffers from numerous unprofessional issues, including a line-break problem (line 240), placeholders (line 323, “Figure X”), disordered figure/table numbering (e.g., Figure 4; Tables 1–2 include subfigures/tables that belong to different caption types), and low-resolution, pixelated figures, among others.\n* The methodology is not well motivated. I do not find sufficient intuition to justify the current design choices in REG. For example, the authors should explain why they use the EMA difference $\\hat{u}^m(x\\mid y)-\\hat{u}^m(x)$ to rectify the unconditional output rather than using it directly as a guidance signal.\n* In practice, the CFG weight $w$ is an effective knob to align predictions with user preferences and to control the quality–diversity trade-off. While REG expands the range over which $w$ can be adjusted, it also introduces several additional hyperparameters to tune $(\\beta_1, \\beta_2, \\gamma)$ and a wider tunable scope for $w$. I do not see clear benefits that justify the increased tuning complexity. The authors argue that REG is a “free lunch” that improves quality without sacrificing diversity, but the current experiments do not support this claim.\n* The expansion of REG is $\\tilde{u}_t(x\\mid y)=\\hat{u}_t(x)+w(\\hat{u}_t(x\\mid y)-\\hat{u}_t(x))+\\gamma(1-w)(s_1\\hat{u}^m_t(x\\mid y)-s_2\\hat{u}^m_t(x))$. Since $\\gamma(1-w)<0$, REG extends the tunable range of $w$. Note that setting $w=2.5,\\ \\beta_1=0,\\ \\beta_2=0,\\ \\gamma=0.5$ (i.e., no EMA in the rectified term) reduces the method to CFG with an effective $w = 1.6$. Referring to Table 2, CFG with $w=1.7$ performs no worse than REG with $w=2.5$ (CFG with $w=1.6$ is not reported, but it is reasonable to expect it would be at least comparable to $w=1.7$). This suggests the EMA component may even harm generation quality.\n* The motivation to replace AG based on the availability of “weak” models feels forced. Although early releases such as SDXL and SD3 may not include a weak model, such models can be saved during training. There is no obvious obstacle preventing future releases from supporting AG if maintainers choose to do so. Notably, in EDM-S, REG performs only comparably to vanilla CFG and still lags far behind AG."}, "questions": {"value": "* The authors should provide qualitative comparisons following [1], or quantitative comparisons such as precision–recall or an FID–IS diagram, following Figure 5 in [2], to support their claim.\n* EMA behavior is sensitive to the cumulative number of sampling steps; the authors should analyze how the number of steps influences the generation behavior of REG.\n* The authors should provide vector graphics or higher-resolution figures for Figure 2, Figure 3, Table 1, and Table 2.\n* The colorful notations appear unnecessary. Unless they convey essential information, please avoid them.\n\n[1] Guiding a Diffusion Model with a Bad Version of Itself\n\n[2] Classifier-Free Diffusion Guidance"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "rKj7RkIEOH", "forum": "540Bsw9Yu8", "replyto": "540Bsw9Yu8", "signatures": ["ICLR.cc/2026/Conference/Submission24653/Reviewer_uiNj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24653/Reviewer_uiNj"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24653/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761147564896, "cdate": 1761147564896, "tmdate": 1762943147869, "mdate": 1762943147869, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Rectified EMA Guidance (REG), a simple yet effective modification of classifier-free guidance (CFG) that mitigates the harmful effects of high guidance scales. Inspired by autoguidance and prior guidance techniques, REG employs an exponential moving average (EMA) of the conditional and unconditional model predictions to refine the guidance term in diffusion models. The authors show that REG defines a better negative signal for CFG by leveraging an average of past conditional and unconditional predictions, and—unlike autoguidance—REG requires no additional model training. Experiments demonstrate the advantages of REG over CFG when applied to recent conditional diffusion models."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The method addresses an important aspect of current generative models — the diversity-quality tradeoff. Since CFG is widely used across diffusion models, improving this aspect could have a significant impact on many applications.\n\n- The method is simple to implement and can be integrated into existing models with minimal overhead.\n\n- The approach is well-justified through a frequency analysis of the diffusion process and the filtering behavior of the EMA operator. Moreover, the use of EMA to improve the quality of diffusion model sampling is an interesting research direction.\n\n- The paper is well-written and easy to follow for the most part."}, "weaknesses": {"value": "* With a slight reformulation, this method could be viewed as a generalization of the momentum operation used in APG. I recommend that the authors include this discussion in Section 3.2 to better highlight the differences between APG and REG.\n\n* Some of the quantitative results are somewhat confusing. For instance, IG and CFG perform very similarly in the EDM2 experiment in Table 3, which is usually not the case. After inspecting the hyperparameters in Table 4, it appears that some settings are not fully aligned with best practices for diffusion models. For example, setting $t_{\\text{min}} = 2$ for EDM2 with IG might be too restrictive, as it disables guidance during the middle stages of sampling. The paper uses $t_{\\text{min}} = 0.28$. Similarly, $w_{\\text{high}}$ for FDG is set to 3 for SDXL, whereas the original paper typically uses larger values such as 7 or 10. For a more robust and fair comparison, it would be helpful to adopt a more standardized setup—comparing the proposed method and several baselines across a range of guidance scales and with more practical hyperparameters.\n\n* The images are heavily downsampled and degraded in quality, making it difficult to compare fine details across different outputs given the current image resolution in the paper."}, "questions": {"value": "1. Have you encountered any instability issues when computing the norm, particularly toward the end of the sampling process?\n\n2. Do you have an explanation for why the best CFG result outperforms REG in Table 6?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "2jB8Jmzxcv", "forum": "540Bsw9Yu8", "replyto": "540Bsw9Yu8", "signatures": ["ICLR.cc/2026/Conference/Submission24653/Reviewer_gP7p"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24653/Reviewer_gP7p"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission24653/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761835279020, "cdate": 1761835279020, "tmdate": 1762943147623, "mdate": 1762943147623, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes using an **Exponential Moving Average (EMA) of the model's predictions as a substitute for an explicit weak guidance model** in diffusion-based sampling. The premise is that the EMA acts as a low-pass filter, smoothing high-frequency details and thus approximating the output of a \"weaker\" or less-refined model. The authors claim that this approach, which they term REG, can **improve diversity preservation and sampling quality without the need to train or store additional models**."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. **Novelty of the Approach:** The perspective of **achieving weak guidance without training auxiliary models is compelling**. The original \"Weak Guidance\" paper highlighted the difficulty of this, and prior strategies for defining a suitable weak model were not entirely convincing.\n\n2. **Clarity:** The paper is **generally well-written and easy to understand**."}, "weaknesses": {"value": "1. **Image Quality:** The **figures in the paper are of poor quality**. They appear to be **heavily compressed and are too small** to properly assess the visual results. For a paper where image quality is a critical component of the evaluation, this is a significant drawback. For example, in Figure 1, it is impossible to discern any meaningful difference between the \"no CFG\" and \"REG\" samples. **Higher-resolution images are essential**.\n\n2. **Text-to-Image Metrics:** The authors evaluate T2I generation **using only FID on the COCO dataset**. It is widely known that **FID on COCO is not a reliable metric for T2I**, as improvements in user preference or text alignment do not necessarily correlate with FID improvements. The **evaluation would be much stronger with a more comprehensive set of metrics**, such as GenEval, DPG-Bench, and human-preference-based aesthetic scores (e.g., ImageReward, HPSv2, PickScore) evaluated on standard benchmarks like PartiPrompts or DrawBench.\n\n3. **Limited Model Evaluation:** For Text-to-Image, the method is **only evaluated on SD3**. To substantiate the claim that this method can be broadly used, it would **strengthen the paper to include results on a wider variety of models** (e.g., SD 1.5, SD 2.1, SDXL, PixArt-alpha, SANA, FLUX etc.). Similarly, for ImageNet, evaluating on other model families, like DiT, would be beneficial.\n\n4. **Comparison to Auto-Guidance:** The authors **claim their method can replace auto-guidance, but the results presented seem to contradict this**. The reported FID is **on par with *naive* guidance... and significantly worse than the auto-guidance method** it claims to replace. It is unclear what the advantage of this more complex pipeline is.\n\n5. **Data Presentation:** **Tables 1 and 2 would be much easier to interpret if presented as plots**. For the ImageNet results, an FID vs. IS curve would be a more informative way to show the trade-offs.\n\n6. **Parameter Sensitivity:** The paper would **benefit from an analysis of the sensitivity to the EMA parameters** ($\\tau_c$ and $\\tau_u$). How do different values affect the final prediction? Furthermore, it's worth exploring whether the same EMA parameter is optimal for all timesteps.\n\n7. **Increased Complexity:** This method **introduces additional complexity at test time by requiring the tuning of four parameters**: $\\tau_c$, $\\tau_u$, $\\omega$, and $\\gamma_c$.\n\n8. **Context in Prior Work (Missing Citation):** The paper **misses a key citation**: \"Don't drop your samples! Coherence-aware training benefits Conditional diffusion\" (Dufour et al., CVPR 2024). This work also presents a single-model weak guidance strategy. ... **A discussion of this prior work is needed**."}, "questions": {"value": "**Formulation of Guidance:** Substituting Equation 6 into Equation 7 yields:\n\n   $$\n   \\tilde{\\epsilon}(x) = \\epsilon(x) + \\gamma_c (1-\\omega) (\\epsilon^m(x|y) - \\epsilon^m(x)) + \\omega(\\epsilon(x| y) - \\epsilon(x))\n   $$\n\n   This **formulation seems counter-intuitive**, as increasing $\\omega$ (weight of the full model's guidance) simultaneously *decreases* the weight of the EMA model's guidance. The **dependency between these two guidance vectors may be problematic**. An **exploration of alternative, independent parameterizations could be valuable**. For example:\n\n   * **Option 1:** $\\tilde{\\epsilon}_t(x) = \\epsilon(x) + \\omega_1 (\\epsilon^m(x|y) - \\epsilon^m(x)) + \\omega_2(\\epsilon(x| y) - \\epsilon(x))$\n\n   * **Option 2:** $\\tilde{\\epsilon}_t(x) = \\epsilon_t(x) + \\omega_1 (\\epsilon^m(x|y) - \\epsilon(x)) + \\omega_2(\\epsilon(x| y) - \\epsilon^m(x))$\n\n   Exploring these parameterizations could lead to improvements."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "pfk3QmH9dD", "forum": "540Bsw9Yu8", "replyto": "540Bsw9Yu8", "signatures": ["ICLR.cc/2026/Conference/Submission24653/Reviewer_CWT2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24653/Reviewer_CWT2"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission24653/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761949408613, "cdate": 1761949408613, "tmdate": 1762943147172, "mdate": 1762943147172, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper observes that the guidance signal from CFG resulted in suppressed diversity, over saturation and layout variation when the guidance scale is too large. This is due to over-amplification of the semantic components leading to over-saturation. The work proposes to solve these problem by applying EMA. However, directly applying EMA on the velocity causing blurry information. The method applies EMA on the guidance term where the guidance components such as conditional term and unconditional term are averaged over the timesteps. This scheme helps to boost semantic shift and avoid amplication on perceptual quality. Hence, reducing over-saturation."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "1. The method is intuitive\n2. The experimental results show some significant improvements.\n3. The experiments and analysis seem comprehensive"}, "weaknesses": {"value": "1. The paper is written in rush with a lot of grammars and typos. Seriously, in line 240, the section has not completed.\n2. The visualization of the whole paper does not look very good."}, "questions": {"value": "Please see the weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "mLDwZy9GIX", "forum": "540Bsw9Yu8", "replyto": "540Bsw9Yu8", "signatures": ["ICLR.cc/2026/Conference/Submission24653/Reviewer_3GFE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24653/Reviewer_3GFE"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission24653/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762091282774, "cdate": 1762091282774, "tmdate": 1762943146911, "mdate": 1762943146911, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}