{"id": "5dwQrwtzmS", "number": 666, "cdate": 1756763912473, "mdate": 1763491551742, "content": {"title": "Fatigue-Aware Learning to Defer via Constrained Optimisation", "abstract": "Learning to defer (L2D) enables human-AI cooperation by determining when AI systems should make autonomous predictions versus deferring to human experts. However, existing L2D methods assume constant human performance across both short and long time horizons, contradicting established cognitive psychology research on fatigue-induced performance degradation. We present Fatigue-Aware Learning to Defer via Constrained Optimisation (FALCON), explicitly modelling {workload-varying} human performance through psychologically grounded fatigue curves. FALCON formulates L2D as a Constrained Markov Decision Process (CMDP), where system states incorporate both task-specific characteristics and cumulative human workload. In particular, we maximise classification accuracy under human-AI cooperation budget constraints, using PPO-Lagrangian optimisation. We also introduce the Fatigue-Aware L2D (FA-L2D) benchmark with controllable fatigue-induced performance degradation across varying time horizons, enabling scenarios that range from near-constant to highly variable human performance and replacing prior benchmarks that assumed stability over time. Extensive experiments on our benchmarks demonstrate that FALCON consistently outperforms state-of-the-art L2D approaches at all coverage levels, particularly when considering human performance variations. Notably, FALCON enables zero-shot generalisation to unseen experts with different fatigue patterns. Furthermore, L2D methods are shown to consistently surpass both AI-only and human-only baselines whenever coverage lies strictly between 0 and 1, underscoring the effectiveness of adaptive human–AI collaboration in a setting closer to real-world scenarios.", "tldr": "", "keywords": ["Learning to defer"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ec9f9c27c3186f5057595ea65633bb0f836a125a.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper presents an important contribution to human-AI collaboration by formally integrating cognitive fatigue into learning-to-defer systems. The proposed FALCON framework is well-motivated and addresses a critical gap in existing literature: the assumption of static human performance. Its use of S5 for long-term state tracking and PPO-Lagrangian for constrained optimization demonstrates technical contributions."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This work incorporates cognitive fatigue into the L2D paradigm. The deferral policy learns to avoid overloading humans during fatigue phases, improving system-level efficiency and human well-being.\n- The human performance model draws from cognitive psychology and psychometrics, grounding the work in established science.\n- The use of PPO-Lagrangian optimization with upper/lower cost constraints allows fine-grained control over human utilization, balancing automation and human engagement."}, "weaknesses": {"value": "- Regarding the two-phase model, real human performance may exhibit non-smooth dynamics, recovery periods, or individual variability not captured by the sigmoid decay.\n- The values of parameters (e.g., $w_0, w_{peak}, w_{base}$, etc.) need to be set carefully and estimated by each user."}, "questions": {"value": "See the above weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "HTnTdLJbvC", "forum": "5dwQrwtzmS", "replyto": "5dwQrwtzmS", "signatures": ["ICLR.cc/2026/Conference/Submission666/Reviewer_NXtg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission666/Reviewer_NXtg"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761705953647, "cdate": 1761705953647, "tmdate": 1762915577627, "mdate": 1762915577627, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes FALCON, a fatigue-aware learning-to-defer (L2D) framework for L2D that models human performance as workload-dependent using psychologically grounded fatigue curves and formulates L2D as a constrained MDP over sequences. It also introduces a  Fatigue-Aware L2D (FA-L2D) benchmark. Experiments on the benchmarks demonstrate the effectiveness of the propsoed FALCON."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The idea that incorporates workload-varying human performance and in a sequential decision-making task for L2D is well-motivated and interesting.\n\n2. The paper introduces a Fatigue-Aware L2D (FA-L2D) benchmark, which faciliate the future exploration in the field.\n\n3. Experiments demonstrates the effectiveness of the proposed method."}, "weaknesses": {"value": "1. The method model human performance based on Eq. 2. However, it is not clear how to guarantee that the model of human performance is reasonable. With a human-in-the-loop or at a fit-to-real-data example may make the method more convincing.\n\n2. In Eq. 2, modeling human performance relies on the introduced $\\rho$, which is difficult to be explicit in real applications for real humans. It is not clear how does it make sense in real applications and how to make sure it is introduced precisely.\n\n3. It is not clear whether the proposed method introduce extra training and inference costs compared to the baselines."}, "questions": {"value": "I'm also curious how does the method be capable to achieve zero-shot generalization, any discussion or analyses on that?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "1M0mIoDcnQ", "forum": "5dwQrwtzmS", "replyto": "5dwQrwtzmS", "signatures": ["ICLR.cc/2026/Conference/Submission666/Reviewer_44bJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission666/Reviewer_44bJ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761908103313, "cdate": 1761908103313, "tmdate": 1762915577503, "mdate": 1762915577503, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper considers the human fatigue level in a Learning to Defer problem. It not only provides a model for the effect of human fatigue level on human decision accuracy, but also proposes a new CMDP method to solve it. Numerical results are also provided to illustrate the performance. Additionally, many data benchmarks and simulation environments are provided."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper proposed a new methodology for the fatigue-aware human-AI interaction problem.\n \n2. The paper provides many data benchmarks for future research.\n\n3. The numerical results look good."}, "weaknesses": {"value": "1. From a methodology perspective, the paper might lack novelty. I might misunderstand the paper; however, it seems that the paper mainly transfers rho_t and x_t into some new features and then applies CMDP for a more stylized human reaction model. Could the authors elaborate more on the novelty of the methodology?\n\n2. The human-reaction function form might be too simplified, which may oversimplify the complexity of the problem. Specifically, the function form is almost monotonic, given its short warm-up phase. If the human fatigue level can be recovered when no job is assigned for a while,  can this algorithm still solve the problem efficiently?\n\n3. Even if the human-reaction form is correct, the numerical experiments might also be sufficient to prove the applicability of the proposed method, especially given that this paper does not have any theoretical guarantee. For example, what if the warm-up period is very long?"}, "questions": {"value": "1. What is the form of the backbone model? \n\n2. Is the AI classifier trained together with the L2D learner?\n\n3. What if the fatigue function is misspecified or different between training and test data? Can this algorithm recognize and correct it?\n\n4. Given this setup, a simple idea is to learn the function between accuracy and the workload directly, and pass the approximation to a CMDP. Will this simple idea be much worse than the method proposed in this paper?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "jBH6EJwo1I", "forum": "5dwQrwtzmS", "replyto": "5dwQrwtzmS", "signatures": ["ICLR.cc/2026/Conference/Submission666/Reviewer_7e2s"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission666/Reviewer_7e2s"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762053561377, "cdate": 1762053561377, "tmdate": 1762915577397, "mdate": 1762915577397, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Changes made in the revision"}, "comment": {"value": "We thank all reviewers for their insightful feedback. We have carefully considered the comments from each reviewer and have incorporated these suggestions into a revised version. All modifications are highlighted in blue in our paper. Specifically, we have:\n\n- add the training time of FALCON and competing methods on Cifar100 (Figure 5 in Appendix)\n\nWe have also prepared detailed responses to each reviewer's individual concerns, which can be found directly below their respective reviews."}}, "id": "EcH72ttn82", "forum": "5dwQrwtzmS", "replyto": "5dwQrwtzmS", "signatures": ["ICLR.cc/2026/Conference/Submission666/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission666/Authors"], "number": 13, "invitations": ["ICLR.cc/2026/Conference/Submission666/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763492900342, "cdate": 1763492900342, "tmdate": 1763492900342, "mdate": 1763492900342, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}