{"id": "5FOYGNXRNc", "number": 2314, "cdate": 1757057328280, "mdate": 1759898156216, "content": {"title": "DPGNet: Modeling Dynamic Graphs and Complex Temporal Patterns for Spatiotemporal Forecasting", "abstract": "Spatiotemporal prediction plays a crucial role in various domains, such as traffic management and weather forecasting. \nNevertheless, existing spatiotemporal prediction models remain limited in their ability to capture dynamic inter-node relationships and to comprehensively model complex temporal patterns.\nTo address these limitations, we propose the Dynamic Graph Prediction Network (DPGNet), which includes two key components: the Adaptive Graph Learner (AGL) and the Adaptive Season Learner (ASL). \nAGL is a plug-and-play module that can effectively capture dynamic inter-node relationships while suppressing weak connections. %reducing the impact of noise.\nASL can model the complex temporal patterns of nodes and construct graph structures across different temporal patterns and time scales. \nWe conduct extensive experiments on five real-world spatiotemporal forecasting datasets, and the results demonstrate that DPGNet outperforms many state-of-the-art methods in both effectiveness and efficiency. \nOur code is accessible at \\url{https://anonymous.4open.science/r/DPGNet}.", "tldr": "An efficient spatiotemporal forecasting model capable of capturing dynamic graphs and complex temporal patterns", "keywords": ["spatiotemporal forecasting", "dynamic graph learning", "complex temporal pattern", "plug-and-play module"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/62b8dbfa3389b361f807865b4cbc59947333f942.pdf", "supplementary_material": "/attachment/58f0d877fdce2edb7330f8be9844c2577329ca27.pdf"}, "replies": [{"content": {"summary": {"value": "This work proposes the Dynamic Graph Prediction Network (DPGNet), which includes two key components: the Adaptive Graph Learner\n(AGL) and the Adaptive Season Learner (ASL). AGL is a plug-and-play module that can effectively capture dynamic inter-node relationships while suppressing weak connections. ASL can model the complex temporal patterns of nodes and construct graph structures across different temporal patterns and time scales."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThe paper addresses an important problem in spatiotemporal prediction and highlights the issue of weak connections in learned graphs, which is relevant to the research community.\n2.\tThe experimental evaluation covers multiple widely used benchmark datasets (e.g., METR-LA, PEMS08, PEMS-Bay), which allows for a fair comparison with existing methods."}, "weaknesses": {"value": "1. There are inconsistencies in the experimental reporting. For example, in Section 4 the input/output lengths are described as O=3,6,12, but Table 1 uses O=3 while Table 3 reports “15min” and “60min.” Although these are equivalent, it is better to maintain consistent notation across the paper to avoid confusion. In addition, in Table 1 the reported STIDGCN result on PEMS08 for O=3 is 15.3111, whereas your proposed method achieves 15.2474. However, in Table 3, after adding AGL, STIDGCN achieves 15.2417, which is better than the best result reported in Table 1. This discrepancy is confusing and raises the question of whether the baseline results are fully optimized and whether the proposed improvement is robust. Please clarify the evaluation setting and ensure consistency in reporting.\n2. Both the Adaptive Graph Learner (AGL) and the Adaptive Season Learner (ASL) lack sufficient novelty. The proposed designs appear to primarily reorganize and reframe existing methods rather than introduce fundamentally new mechanisms.\n3. The experimental results show only limited improvements over existing baselines.\n4. The explanation of Figure 2 is unclear. It is difficult for the reader to immediately understand what weak/strong connections mean, why the zero entries are separated, and what the key takeaway is. I recommend that the authors improve the figure caption, highlight the main conclusion, and consider presenting a simpler comparison (weak vs strong ratios) for clarity. Figure 2 is difficult to interpret. For instance, the bar corresponding to 7.47% appears only slightly lower than the bar corresponding to over 90%, which is counter-intuitive. The current visualization does not clearly convey the magnitude of difference between weak and strong connections. I recommend the authors revise the figure or choose a clearer representation.\n5. The notation in the overview section is inconsistent with the symbols used in the corresponding figures. The use of boldface for mathematical symbols is not applied consistently (sometimes bold, sometimes not)."}, "questions": {"value": "1. There are inconsistencies in the experimental reporting. For example, in Section 4 the input/output lengths are described as O=3,6,12, but Table 1 uses O=3 while Table 3 reports “15min” and “60min.” Although these are equivalent, it is better to maintain consistent notation across the paper to avoid confusion. In addition, in Table 1 the reported STIDGCN result on PEMS08 for O=3 is 15.3111, whereas your proposed method achieves 15.2474. However, in Table 3, after adding AGL, STIDGCN achieves 15.2417, which is better than the best result reported in Table 1. This discrepancy is confusing and raises the question of whether the baseline results are fully optimized and whether the proposed improvement is robust. Please clarify the evaluation setting and ensure consistency in reporting.\n2. The explanation of Figure 2 is unclear. It is difficult for the reader to immediately understand what weak/strong connections mean, why the zero entries are separated, and what the key takeaway is. I recommend that the authors improve the figure caption, highlight the main conclusion, and consider presenting a simpler comparison (weak vs strong ratios) for clarity. Figure 2 is difficult to interpret. For instance, the bar corresponding to 7.47% appears only slightly lower than the bar corresponding to over 90%, which is counter-intuitive. The current visualization does not clearly convey the magnitude of difference between weak and strong connections. I recommend the authors revise the figure or choose a clearer representation."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "NCFsC82Itc", "forum": "5FOYGNXRNc", "replyto": "5FOYGNXRNc", "signatures": ["ICLR.cc/2026/Conference/Submission2314/Reviewer_muoK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2314/Reviewer_muoK"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2314/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761751453448, "cdate": 1761751453448, "tmdate": 1762916190278, "mdate": 1762916190278, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a novel spatio-temporal forecasting model to address limitations in capturing dynamic node relationships and complex temporal patterns."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- The framework is straightforward and easy to follow.\n- The experiment is comprehensive."}, "weaknesses": {"value": "- This work is with little novelty and fails to provide new perspectives. Constructing dynamic graphs or decomposing time series are both widely used strategies. And the proposed framework is merely a collection of existing commonly used models.\n- The reported performance of baselines is inconsistent with existing literture. For instance, with horizon as 12, the MAE of STIDGCN  on PEMS08 in its origin paper is reported as $13.45$, less than $19.5711$ in this paper."}, "questions": {"value": "See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "SjMJgZnZlV", "forum": "5FOYGNXRNc", "replyto": "5FOYGNXRNc", "signatures": ["ICLR.cc/2026/Conference/Submission2314/Reviewer_XUJY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2314/Reviewer_XUJY"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2314/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761880110797, "cdate": 1761880110797, "tmdate": 1762916189705, "mdate": 1762916189705, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new spatiotemporal forecasting model architecture by combining a dynamic graph learning module with a temporal module that learns at different time scales. The author then validates the model on several spatiotemporal prediction datasets. The AGL is also supplemented to baseline methods to show prediction improvements."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- Clarity: The paper provides clear and intuitive figures that show the model architecture and traffic data behaviour.\n- Quality: The proposed model is benchmarked on several datasets in different domains, e.g. traffic, weather, and electricity. The model's graph learning module is also substituted into baseline methods to show performance improvement."}, "weaknesses": {"value": "- Literature Review:\n  - Decomposing temporal dynamics into different scales is also proposed in works such as ASTGCN by Guo, S., Lin, Y., Feng, N., Song, C., & Wan, H. (2019).\n  - Section 2.2 is very sparse and deserves more discussion to place the paper in the context of existing work.\n  - Several citations are pointing to the wrong original paper. For instance, vanishing gradient was more formally analyzed by\nPascanu, R., Mikolov, T., & Bengio, Y..(2013), and dilated convolutions were proposed by Yu, F., & Koltun, V. (2015).\n- Experimental Setup:\n  - The entire appendix is missing to provide more information on the experimental setup.\n  - The baseline MAE and RMSE are reported to be lower in the original papers."}, "questions": {"value": "- Why is MAPE not included in the metrics?\n- What is the motivation behind using G-RNN? Since it operates on the adjacency matrix, how is it different from using GCNs interleaved with RNNs?\n- Please provide appendix for detailed experimental setup."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4p8EAIcTrm", "forum": "5FOYGNXRNc", "replyto": "5FOYGNXRNc", "signatures": ["ICLR.cc/2026/Conference/Submission2314/Reviewer_Dz25"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2314/Reviewer_Dz25"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2314/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762037233377, "cdate": 1762037233377, "tmdate": 1762916189444, "mdate": 1762916189444, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "A complicated, composite method for spatiotemporal forecasting."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. This work appears to be a combination of multiple previously proposed methods. Methodologically, I do not see anything new. \n2. The choice of datasets is reasonable. It is good that the experiments do not use the ETT dataset, because this paper focuses on spatiotemporal forecasting, where it is more appropriate to use datasets with a large number of spatial nodes."}, "weaknesses": {"value": "1. The motivation for introducing each component is not clearly explained. This is often the case in incremental work: the significance of each component is usually made explicit when it first appears in the original paper that proposed it. Here, since this method is formed by combining several prior methods, many steps are essentially skipped, which makes the overall architecture look complicated and not very elegant. \n2. The ablation study is too simple. If this paper aims to meet the ICLR bar, it needs to demonstrate that every component works, I mean even down to details like the introducing of FC layer in the G-RNN. Otherwise, this paper will not provide meaningful insights to the community and will only waste the limited time of the authors, readers, and reviewers."}, "questions": {"value": "same as weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "qR0By6EZLU", "forum": "5FOYGNXRNc", "replyto": "5FOYGNXRNc", "signatures": ["ICLR.cc/2026/Conference/Submission2314/Reviewer_r4TP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2314/Reviewer_r4TP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2314/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762063104816, "cdate": 1762063104816, "tmdate": 1762916189146, "mdate": 1762916189146, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}