{"id": "6KeQR225Hw", "number": 12407, "cdate": 1758207609627, "mdate": 1759897512012, "content": {"title": "Re2IC: Realism-Enhanced Region-Based Implicit Codec with Wavelet–Wasserstein Distortion", "abstract": "Recent advances in perceptual image compression improve quality through powerful probabilistic models but often incur prohibitive decoding costs. In this paper, we propose a low-complexity alternative called **Re**alism-enhanced **Re**gion-based **I**mplicit **C**odec, Re$^2$IC, that models visual perception region-by-region with saliency-guided partitioning.To further boost realism, we introduce wavelet–Wasserstein distortion (WA-WD), which balances fidelity and perception by explicitly controlling frequency characteristics. Together, these components enable fine-grained spatial–spectral optimization, allowing Re$^2$IC to achieve superior rate–perception trade-offs and outperform generative codecs like HiFiC while using less than $1\\%$ of their decoding cost. The design accelerates coding convergence, reduces decoding complexity, and produces high-quality reconstructions that preserve both fine textures and natural details. Experiments and user studies confirm that Re$^2$IC sets a new state of the art in rate–perception performance among overfitted codecs. Beyond compression, WA-WD also serves as a standalone, tunable metric, that alights more closely with human preference, achieving the highest Pearson (94.6%) and Spearman (92.3%) correlations.", "tldr": "", "keywords": ["Implicit codec", "perceputal compression", "image compression", "overfitted codec", "low-complexity compression"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e6dd25edc4296694be3c94d0c1e422c73be60d80.pdf", "supplementary_material": "/attachment/13ab3856e7fa789c0bae0700e3d6e173f499c1fc.zip"}, "replies": [{"content": {"summary": {"value": "## Summary\n* This paper propose Re2IC, a INR based perceptual image codec.\n* This paper also propose WA-WD, an improved WD (Wassertein distortion [Wasserstein distortion: Unifying fidelity and realism]) that aligns better with human preference.\n* Despite Re2IC achieves better visual quality than C3-WD and HiFiC, the decoding time is significantly increased to 400ms.\n* The result on WA-WD, on the other hand, looks more promising."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "## Strength\n* The proposed WA-WD seems to be an interesting addition in wassertein distortion. The authors successfully validate the effectiveness of WA-WD by empirical results (Table 2)."}, "weaknesses": {"value": "## Weakness\n* The codec, Re2IC is overcomplicated, making the empirical result much less convincing.\n  * The proposed Re2IC is composed of too many stages. The obvious consequence is, the decoding latency of Re2IC is too high. According to Table 4, the decoding latency of Re2IC is 400 ms. The reason why C3-WD makes sense is that it is much faster than many other perceptual image codec in terms of decoding time. However, for a perceptual codec with 400 ms decoding time, outperforming Re2IC and HiFiC is no longer good enough. In fact, Re2IC is already slower than many more recent GAN based codec, such as [MS-ILLM] and [TACO]. Besides, it is even slower or on par with recent diffusion based codec [StableCodec]. In that case, the empirical result in terms of human ELO score, is not convincing enough. \n* The codec, Re2IC lacks necessary ablation studies.\n  * The proposed WA-WD looks nice in performance. So the first thing the authors can do, is to train C3 by WA-WD and present the performance of C3-WA-WD. This ablation study is necessary as it validates the performance of WA-WD as a loss function instead of a IQA metric. Besides, if the result is good enough, it also solves the decoding latency issue of Re2IC as using WA-WD loss should not change the decoding complexity of C3-WD.\n  * The design component of Re2IC laso lacks necessary ablation studies. For example, what if we remove global local design? The Re2IC composes of many compoents but non of them are validated by empirical results."}, "questions": {"value": "## Questions\n* How is the result of C3-WA-WD like? It both validates the effectiveness of WA-WD as loss function, and also validates the performance of  Re2IC vs C3 using the same loss function.\n* How does each component of Re2IC contributes to the system individually?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "zqf3z4959W", "forum": "6KeQR225Hw", "replyto": "6KeQR225Hw", "signatures": ["ICLR.cc/2026/Conference/Submission12407/Reviewer_mXUQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12407/Reviewer_mXUQ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12407/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760935811860, "cdate": 1760935811860, "tmdate": 1762923302896, "mdate": 1762923302896, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the high perceptual quality-low decoding complexity trade-off in image compression by proposing Re²IC (saliency-guided region-based implicit codec with local-global modulation) and WA-WD (wavelet-Wasserstein distortion, a human-aligned perceptual metric with 94.6% Pearson/92.3% Spearman correlations). Experiments on Kodak/CLIC2020 show Re²IC outperforms HiFiC (rate-perception) with <1% decoding cost and surpasses overfitted codecs while accelerating convergence—its key contributions lie in Re²IC’s low-complexity high-performance design, spatiotemporal optimization via integrated modules, new SOTA for overfitted codecs, and WA-WD’s tunable perceptual utility."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "This paper demonstrates notable strengths across originality, quality, clarity, and importance: In originality, it exhibits meaningful innovation by addressing the \"perceptual quality-decoding complexity\" dilemma in image compression—proposing Re²IC  with saliency-guided region-based implicit modeling (a novel take on balancing local fitting and global context via LPN-GPM collaboration) and wavelet-Wasserstein distortion (WA-WD), which innovatively integrates wavelet frequency decomposition with Wasserstein distance to capture feature correlations ignored by traditional metrics, while also functioning as a standalone human-aligned perceptual indicator. In quality, its experimental design is rigorous and high-caliber: it covers diverse datasets (Kodak, CLIC2020), comprehensive baselines (traditional VTM, autoencoder-based MLIC++, generative HiFiC, overfitted C3/WDs), and multi-faceted evaluations (quantitative metrics like MACs/pixel, LPIPS, and PSNR; qualitative visual comparisons across scenes; subjective user studies with Elo scoring), ensuring reliable, robust validation of Re²IC ’s superiority (outperforming HiFiC with <1% decoding cost). In clarity, the paper is highly accessible: it structures technical content logically to unpack complex architectures/metrics, and provides detailed appendices (implementation details, ablation studies) to clarify design choices, making core innovations and results easy to follow."}, "weaknesses": {"value": "While this paper has achieved notable results in the field of low-complexity perceptual image compression, it still has four key shortcomings: First, at the level of core optimization technology, the idea of using wavelet transform to achieve frequency-aware optimization bears high similarity to existing related works—these works separate frequency-domain features through multi-scale transforms (e.g., wavelets, wavelet packets) to balance fidelity and perceptual quality, making the innovation less prominent in terms of technical pathways. A case in point is the paper WeConvene: Learned Image Compression with Wavelet-Domain Convolution and Entropy Mode. Second, there is an obvious imbalance in complexity optimization: although it focuses on achieving a significant reduction in decoding complexity (less than 1% of HiFiC’s), it fails to perform synchronous optimization and quantitative analysis of encoding complexity. Third, the coverage of dataset scenarios is insufficient, as experiments are only validated on two types of static image datasets, namely Kodak and CLIC2020."}, "questions": {"value": "Conduct a fine-grained comparative analysis with representative works such as WeConvene: for example, in a dedicated \"Technical Comparison\" section, compare the two types of works across dimensions including \"wavelet decomposition levels (single-level vs. multi-level)\", \"frequency-domain optimization objectives (fidelity-only vs. fidelity-perception balance)\", and \"integration methods with entropy coding (independent optimization vs. joint optimization)\", while highlighting innovative points such as how the WA-WD proposed in this paper captures feature correlations that are ignored by wavelet-domain convolution in WeConvene. Supplement systematic encoding complexity measurement: add indicators such as \"encoding latency (milliseconds)\" , \"encoding MACs/pixel\", and \"per-image training time\" to the experimental results, and integrate these indicators with decoding complexity into the same table to facilitate intuitive comparison. Expand the scope of datasets for static image testing: incorporate representative new datasets."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Dd4X6JBgnz", "forum": "6KeQR225Hw", "replyto": "6KeQR225Hw", "signatures": ["ICLR.cc/2026/Conference/Submission12407/Reviewer_NuCH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12407/Reviewer_NuCH"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12407/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761549129508, "cdate": 1761549129508, "tmdate": 1762923302608, "mdate": 1762923302608, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a realism-oriented codec based on wavelet–Wasserstein distortion (WA-WD), a new version of the recently proposes Wasserstein distortion. The authors aim to achieve high perceptual quality at low decoding complexity. The key contributions are (1) a region-wise perceptual modeling strategy using local perceptual networks (LPNs), which are modulated by a global perceptual modulator (GPM), and (2) a frequency-aware distortion metric, WA-WD, which decomposes Wasserstein distortion across wavelet subbands. Experiments show that Re2IC is competitive with baselines such as C3/WDs and HiFiC in terms of rate–perception-distortion performance, while maintaining lower decoding costs. The authors claim that the WA-WD can act as an effective perceptual metric."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper tackles an important problem: perceptual image compression at low computational cost. This is a longstanding research problem that remains unsolved.\n2. The authors provide several comparisons with previous compression schemes, yielding compelling rate-perception-distortion results at low computational costs. \n3. The introduction of frequency-aware control within the Wasserstein-distortion framework is an interesting and valuable direction.\n4. WA-WD may be an interesting new kind of perceptual metric."}, "weaknesses": {"value": "1. The paper's presentation and writing clarity are, in my opinion, insufficient. The mathematical exposition is dense and unstructured. Key definitions are not explained well enough, such as the Wasserstein distortion-where does it come from, why is it important, and why the authors chose to build on top of it.\n2. Weak theoretical grounding. The motivation for decomposing the Wasserstein distortion via wavelets lacks justification beyond intuition. No formal analysis shows why this approach improves perceptual correlation.\n3. Unclear interpretation of WA-WD. The paper does not explain what WA-WD measures in perceptual terms- how it connects to human visual sensitivity, and how the $\\sigma$-map should be understood intuitively?\n4. The paper reads more like a collection of formulas and results rather than a clear narrative explaining why each design choice is beneficial.\n5. Incomplete discussion on related work. For example, the authors omit recent diffusion-based compression papers [1,2,3], which are essential for contextualizing the contribution. The authors should discuss, and perhaps even compare performance against these, highlighting the trade-off between computation cost and performance.\n6. The authors propose a perceptual metric and claim high correlation with human judgments, but the evaluation is sparse and unsatisfying. I also don't see a reference to Table 2 from the paper, which shows the main results. Since the authors claim a highly performant perceptual metric in the abstract, I expected thorough evaluations showing that it's indeed highly performant. However, the evaluations are conducted only on one dataset, without any explanation regarding the nature of the experiment (sec. 4.3).\n\n\n[1] Yang and Mandt. Lossy Image Compression with Conditional Diffusion Models. In NeurIPS 2023.\n\n[2] Vonderfecht and Liu. Lossy Compression with Pretrained Diffusion Models. In ICLR 2025.\n\n[3] Ohayon et al. Compressed Image Generation with Denoising Diffusion Codebook Models. In ICML 2025."}, "questions": {"value": "What is the performance of the perceptual metric on common datasets such as LIVE, TID2013, KADID10k, BAPPS, etc.?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Vbir1QkchX", "forum": "6KeQR225Hw", "replyto": "6KeQR225Hw", "signatures": ["ICLR.cc/2026/Conference/Submission12407/Reviewer_SiBX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12407/Reviewer_SiBX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12407/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761567400924, "cdate": 1761567400924, "tmdate": 1762923302186, "mdate": 1762923302186, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Re2IC, a Realism-Enhanced Region-Based Implicit Codec that achieves perceptual image compression at low decoding complexity. The method integrates saliency-guided regional modeling with wavelet–Wasserstein distortion (WA-WD), enabling fine-grained spatial–spectral control for perception–fidelity balance. Experiments and human evaluations demonstrate that Re2IC achieves superior rate–perception trade-offs compared with both overfitted and generative codecs, while maintaining extremely low complexity."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The use of human preference evaluation alongside quantitative metrics is reasonable and supports the argument that WA-WD aligns more closely with perceptual quality.\n2. Compared with previous INR-based perceptual compression methods, the proposed approach demonstrates clear improvement in both realism and efficiency."}, "weaknesses": {"value": "1. The paper does not include comparisons with several recent perceptual optimization methods."}, "questions": {"value": "1. The authors should compare Re2IC with recent perceptually optimized methods such as TACO, Diffusion-based codecs, to strengthen the empirical validation.\n2. In Section 4.1, the baseline C3/WDs is mentioned. Does this refer to Balle et al. (2025) or to the original C3 (Kim et al., 2024)? Please clarify the specific implementation used and ensure proper citation consistency."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "NRwiKOnRRM", "forum": "6KeQR225Hw", "replyto": "6KeQR225Hw", "signatures": ["ICLR.cc/2026/Conference/Submission12407/Reviewer_3Qcj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12407/Reviewer_3Qcj"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12407/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761747698950, "cdate": 1761747698950, "tmdate": 1762923301723, "mdate": 1762923301723, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}