{"id": "6pmxBlGXyM", "number": 2629, "cdate": 1757170273317, "mdate": 1758806351589, "content": {"title": "​Aligning Stance Dynamics in Foundation Dialogue Models: Towards Context-Aware Safety Control​", "abstract": "Neural dialogue foundation models exhibit critical safety vulnerabilities by implicitly amplifying toxic discourse through contextual stance alignment. Current mitigation strategies fail to address the nuanced interplay between conversational dynamics and implicit harm. We propose a paradigm shift with three core contributions:\nFirst, we introduce ​context-aware stance classifiers​ leveraging graph-based reasoning and contrastive learning. These models decode complex stance expressions—including sarcastic agreement and indirect bias—that perpetuate harmful echo chambers.\nSecond, we design ​dynamic safety controllers​ combining attribute-guided decoding with retrieval-augmented counter-speech generation. This hybrid approach steers foundation models toward constructive responses while preserving conversational integrity.\nThird, we establish ​multidimensional harm metrics​ quantifying implicit biases across intersectional identities, moving beyond surface-level toxicity. Our framework pioneers joint optimization of stance neutrality, bias mitigation, and fluency preservation.\nValidated against adversarial conversational contexts, our method demonstrates significant improvements in ethical alignment for generative dialogue systems. We open-source toolkit facilitates safer deployment of foundation language models.", "tldr": "We pioneer a context-aware safety framework that breaks neural dialogue models' dangerous tendency to implicitly agree with toxic statements through dynamic stance control and bias-aware counter-speech generation.", "keywords": ["Stance Alignment", "Contextual Offensive Language", "Controllable Text Generation", "Neural Dialogue Safety", "Foundation Models", "Societal Impact"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "", "supplementary_material": ""}, "replies": [], "withdrawn": true}