{"id": "79uRpJkbxq", "number": 9712, "cdate": 1758136207020, "mdate": 1758830339133, "content": {"title": "LDC: Learning to Generate Research Idea with Dynamic Control", "abstract": "Recent advancements in large language models (LLMs) have demonstrated their potential in automating the scientific research ideation. Existing approaches primarily focus on prompting techniques, often producing ideas misaligned with expert standards -- novelty, feasibility, and effectiveness, which are widely recognized by the research community as the three key subdimensions of high-quality ideas. Also, balancing these dimensions remains challenging due to their inherent trade-offs. To address these limitations, we propose the first framework that employs a two-stage approach combining Supervised Fine-Tuning (SFT) and controllable Reinforcement Learning (RL) for the task. In the SFT stage, the model learns foundational patterns from pairs of research papers and their corresponding follow-up ideas. In the RL stage, multi-dimensional reward models guided by fine-grained feedback evaluate and optimize the model across key dimensions. During inference, dimensional controllers coordinated by a sentence-level decoder enable dynamic context-aware steering of the idea generation process. Our framework provides a balanced approach to research idea generation, achieving high-quality outcomes in the experiment by dynamically navigating the trade-offs among novelty, feasibility, and effectiveness.", "tldr": "A controllable reinforcement learning with dynamic controllers to optimize LLM-generated research ideas that automatically banlance novelty, feasibility, and effectiveness.", "keywords": ["LLMs", "controllable LLM generationScientific Discovery", "Fine-tuning", "Reinforcement Learning"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/81c5fcb02a389049b52f64ee92ce5e8c3903e735.pdf", "supplementary_material": ""}, "replies": [], "withdrawn": true}