{"id": "7ylBzf6bXv", "number": 12878, "cdate": 1758211144670, "mdate": 1763516243793, "content": {"title": "Effective Probabilistic Time Series Forecasting with Fourier Adaptive Noise-Separated Diffusion", "abstract": "Existing diffusion-based time series forecasting methods often target on mixed temporal patterns or undifferentiated residuals, limiting the potential of distinct temporal components. In this paper, we propose the Fourier Adaptive Lite Diffusion Architecture (FALDA), a novel probabilistic framework for time series forecasting. FALDA leverages Fourier-based decomposition to incorporate a component-specific architecture, enabling tailored modeling of individual temporal components. A conditional diffusion model is utilized to estimate the future noise term, while our proposed lightweight denoiser, DEMA (Decomposition MLP with AdaLN), conditions on the historical noise term to enhance denoising performance. Grounded in rigorous mathematical proof, we introduce the Diffusion Model for Residual Regression (DMRR), a framework which methodologically unifies diffusion-based probabilistic regression method and theoretically demonstrate that FALDA effectively reduces epistemic uncertainty, allowing probabilistic learning to primarily focus on aleatoric uncertainty through further probabilistic analysis. Experiments on six real-world benchmarks demonstrate that FALDA consistently outperforms existing probabilistic forecasting approaches across most datasets for long-term time series forecasting while achieving enhanced computational efficiency without compromising accuracy. Notably, FALDA also achieves superior overall performance compared to state-of-the-art (SOTA) point forecasting approaches, with improvements of up to 9\\%. The code will be made publicly available.", "tldr": "", "keywords": ["generative modeling", "diffusion model", "long-term time series forecasting", "deep learning"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1cfd3c89075fbf8c70165107197a6c8cb03f535e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes FALDA, a Fourier-based diffusion framework for probabilistic time series forecasting. By decomposing sequences into non-stationary, stationary, and noise components, FALDA improves accuracy and uncertainty modeling. Built on the DMRR framework, it unifies diffusion-based regression and achieves state-of-the-art results with better efficiency and uncertainty separation.\n\nThe authors’ signal decomposition method requires further explanation — why are the components with larger amplitudes in the frequency domain considered non-stationary signals, and how can it be justified that the smaller-amplitude frequency components are purely noise?\n\nThe authors’ definition and understanding of non-stationary signals seem to differ from the mainstream perspective in signal processing, which needs further clarification or analysis.\n\nThe proposed top-K frequency selection method for signal decomposition may distort the overall characteristics of the signal. In signal processing, even using a rectangular window causes sidelobe effects, let alone selecting only a few top-K frequency components.\n\nMany recent works have combined decomposition-based approaches with diffusion models for time series analysis, and the authors should provide a more detailed discussion and comparison with these studies."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "see summary"}, "weaknesses": {"value": "see summary"}, "questions": {"value": "see summary"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4USIYvLlrh", "forum": "7ylBzf6bXv", "replyto": "7ylBzf6bXv", "signatures": ["ICLR.cc/2026/Conference/Submission12878/Reviewer_q6pJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12878/Reviewer_q6pJ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12878/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760776100671, "cdate": 1760776100671, "tmdate": 1762923666128, "mdate": 1762923666128, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents FALDA, a probabilistic time series forecasting framework that leverages Fourier-based decomposition to facilitate the tailored modeling of individual temporal components. The authors also propose a theoretical framework, DMRR, which unifies several existing diffusion-based regression methods and establishes the mathematical foundation for FALDA. Experiments conducted on six real-world datasets demonstrate the competitive performance of FALDA in both point forecasting and probabilistic forecasting."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **S1** The paper is well-motivated, with clear writing and presentation that makes the technical contributions accessible. \n- **S2** The paper propose a theoretical framework DMRR, which mathematically classifies the existing diffusion-based time-series forecasting methods.\n- **S3** As a plug-and-play method, FALDA shows broad applicability and can enhance existing forecasting methods."}, "weaknesses": {"value": "- **W1** FALDA's Fourier decomposition process involves two key hyperparameters, K1 and K2. It appears that the selection of these hyperparameters varies across different datasets, which could potentially increase the practical deployment difficulty of the model. \n- **W2** Limited complexity experiments. The authors demonstrate the training and inference efficiency of FALDA in Appendix F.6, and Figure 6 shows its fast convergence property. However, this experiment is conducted only on the small-scale Exchange dataset. In addition, this section lacks comparisons with other DMRR-based approaches, such as D3U."}, "questions": {"value": "1. Could the authors provide additional evidence in the complexity and efficiency analysis section—for example, comparisons of training and inference efficiency on larger-scale datasets and against other DDRM-based methods?\n2. How do simpler forecasting approaches, such as Seasonal Naïve, perform on the datasets used in this paper?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "RRSRLotEu0", "forum": "7ylBzf6bXv", "replyto": "7ylBzf6bXv", "signatures": ["ICLR.cc/2026/Conference/Submission12878/Reviewer_SAp5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12878/Reviewer_SAp5"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12878/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761664156312, "cdate": 1761664156312, "tmdate": 1762923665822, "mdate": 1762923665822, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces the FALDA framework for multivariate time series (MTS) probabilistic forecasting. FALDA proposes a diffusion model approach based on residual regression, leveraging Fourier-transform-based time series decomposition to break down input sequences into stationary, non-stationary, and noise components, thereby enabling customized modeling of these components. This design helps FALDA reduce the model's epistemic uncertainty. Experimental results on six real-world datasets demonstrate that FALDA not only endows point forecasting models with probabilistic forecasting capabilities but also achieves competitive point forecasting performance overall."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **S1** The FALDA framework reduces epistemic uncertainty​ by explicitly modeling time series components through ​time-series-decomposition-based modeling.\n- **S2** The authors theoretically prove the equivalence​ between the ​DMRR (Diffusion Model with Residual Regression) scheme and CARD, strengthening the methodological foundation."}, "weaknesses": {"value": "- **W1** The Fourier-based decomposition introduces two hyperparameters ($K_1$ and $K_2$)​. It appears that the selection of these hyperparameters varies across different datasets, which could potentially increase the practical deployment difficulty of the model. ​In new scenarios, determining optimal values for these hyperparameters is non-trivial, potentially limiting the model’s deployability.\n- **W2** It is difficult to ensure that the Fourier-based sequence decomposition can effectively extract the ideal noise components in all cases. While the separation of stationary and non-stationary components generally works well and yields noticeable performance improvements, the approach does not consistently provide advantages across all datasets. In particular, on high-dimensional datasets such as Traffic and Electricity, FALDA shows limited gains in probabilistic forecasting, suggesting that the proposed decomposition method may not always be able to isolate the desired noise components effectively."}, "questions": {"value": "1. I suggest that the authors include in the main text a more detailed discussion of the selection strategies for the Fourier-based decomposition hyperparameters ($K_1$ and $K_2$) and their impact on model performance with different values.\n2. Compared with D3U, FALDA employs a more manual approach to extracting non-stationary components in time series, relying on Fourier-based decomposition. Quantitative results confirm that FALDA outperforms D3U in most experimental settings; however, in a few cases—particularly in probabilistic forecasting tasks—D3U still shows certain advantages. This might be because the proposed Fourier-based decomposition is less effective at capturing the uncertainty components of time series in those scenarios. How do the authors interpret and explain this phenomenon?\n3. What is the rationale for choosing iTransformer as the default backbone? Will the implementation code be released publicly?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "y0n21c6iqm", "forum": "7ylBzf6bXv", "replyto": "7ylBzf6bXv", "signatures": ["ICLR.cc/2026/Conference/Submission12878/Reviewer_vMHf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12878/Reviewer_vMHf"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12878/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761728664746, "cdate": 1761728664746, "tmdate": 1762923665358, "mdate": 1762923665358, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes FALDA (Fourier Adaptive Lite Diffusion Architecture), a diffusion-based probabilistic time series forecasting framework built on the unified DMRR formulation. By using Fourier decomposition to decouple non-stationary, stationary, and noise components, FALDA effectively separates epistemic and aleatoric uncertainties. The lightweight denoiser DEMA enhances efficiency and accuracy. Experiments show that FALDA outperforms existing diffusion-based and deterministic models in both point estimation and probabilistic forecasting."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1.\tThe paper is easy to follow and well written.\n2.\tThe visual examples are complete and clearly presented."}, "weaknesses": {"value": "1. I don’t understand how the paper separates epistemic uncertainty and aleatoric uncertainty. Epistemic uncertainty comes from the model’s limited predictive capability, which should reside in the residuals component in line 250, but the authors do not explicitly model different types of uncertainty within the residuals.\n2. To my knowledge, due to the inherent non-stationarity of time series data, the associated uncertainty often exhibits temporal shifts. However, the authors only use noise as the guidance information during the denoising process, which does not account for the non-stationary characteristics. Moreover, Table 4 does not include the critical probabilistic forecasting metric CRPS, which undermines the persuasiveness of the experimental results.\n2. Limited novelty — the method for non-stationary decomposition has already been proposed in FAN[1], and the residual decomposition has been applied in D3U[2].\n3. For the probabilistic forecasting metric CRPS, the proposed method shows no clear improvement over D3U on most datasets, except for the ILI and Exchange datasets.\n\n[1] Frequency Adaptive Normalization For Non-stationary Time Series Forecasting\n\n[2] Diffusion-Based Decoupled Deterministic and Uncertain Framework for Probabilistic Multivariate Time Series Forecasting"}, "questions": {"value": "see weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BSo66LjZ1N", "forum": "7ylBzf6bXv", "replyto": "7ylBzf6bXv", "signatures": ["ICLR.cc/2026/Conference/Submission12878/Reviewer_bFb8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12878/Reviewer_bFb8"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12878/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761964306704, "cdate": 1761964306704, "tmdate": 1762923664787, "mdate": 1762923664787, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}