{"id": "8fV7jcTngH", "number": 940, "cdate": 1756824605342, "mdate": 1763110797965, "content": {"title": "CrossLMM: Decoupling Long Video Sequences from LMMs via Dual Cross-Attention Mechanisms", "abstract": "The advent of Large Multimodal Models (LMMs) has significantly enhanced Large Language Models (LLMs) to process and interpret diverse data modalities (e.g., image and video). However, as input complexity increases, particularly with long video sequences, the number of required tokens has grown significantly, leading to quadratically computational costs. This has made the efficient compression of video tokens in LMMs, while maintaining performance integrity, a pressing research challenge. In this paper, we introduce CrossLMM, decoupling long video sequences from LMMs via a dual cross-attention mechanism, which substantially reduces visual token quantity with minimal performance degradation. Specifically, we first implement a significant token reduction from pretrained visual encoders through a pooling methodology. Then, within LLM layers, we employ a visual-to-visual cross-attention mechanism, wherein the pooled visual tokens function as queries against the original visual token set. This module enables more efficient token utilization while retaining fine-grained informational fidelity. In addition, we introduce a text-to-visual cross-attention mechanism, for which the text tokens are enhanced through interaction with the original visual tokens, enriching the visual comprehension of the text tokens. Comprehensive empirical evaluation demonstrates that our approach achieves comparable or superior performance across diverse video-based LMM benchmarks, despite utilizing substantially fewer computational resources.", "tldr": "", "keywords": ["Large Multimodal Models", "Long Visual Sequence", "Cross Attention"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/8bb2f0aaeacf75238b047ad863b2f20d7fdf829b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper explores methods to reduce the number of visual tokens used in large visual (video) language models, aiming to improve efficiency without compromising performance. To achieve this, the authors propose two new modules: a visual-to-visual cross-attention module (V2V) and a text-to-visual cross-attention module (T2V). The V2V module performs hierarchical visual aggregation, moving from coarse- to fine-grained representations while being guided by textual information, enabling more effective selection and refinement of visual features. Meanwhile, the T2V module strengthens interactions between textual input and the original visual tokens, enhancing the model’s multimodal comprehension. Experimental results show that the proposed method attains performance comparable to state-of-the-art approaches while greatly reducing the number of visual tokens, highlighting its potential to improve computational efficiency in large-scale video-language applications."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThe proposed approach is clearly explained.\n2.\tIt delivers performance on par with existing methods using much fewer visual tokens.\n3.\tThe method’s effectiveness is demonstrated across several benchmark datasets."}, "weaknesses": {"value": "1. The proposed CrossLLM framework offers limited novelty, as the idea of a cross-attention-based language model have been widely explored in previous works. The paper does not clearly explain how CrossLLM provides a significant extension or meaningful differentiation from previous works.\n\n2. The token compression is applied only within individual frames, which may overlook a key characteristic of the video modality— the redundancy of information across frames. It would be interesting to explore how this method could be extended to compress visual tokens across multiple frames.\n\n3.Although CrossLMM effectively compresses tokens, the performance degradation remains considerable, as shown in Table 1."}, "questions": {"value": "1.In the ablation study, the authors examine the effects of V2V insertion frequency and the training strategy for the T2V module. However, I wonder about the necessity of maintaining two distinct modules. Could a unified cross-attention mechanism be employed to jointly update both visual and textual tokens? Including a comparison or discussion of this design choice would provide valuable insights into the potential trade-offs and rationale behind the current approach.\n\n2. In the introduction of the visual-language projector, the authors mention using a single projector along with a differentiable inverse approximation. However, the paper lacks details on this inverse approximation—specifically, how it is implemented or computed."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ah8T3bVgUi", "forum": "8fV7jcTngH", "replyto": "8fV7jcTngH", "signatures": ["ICLR.cc/2026/Conference/Submission940/Reviewer_GCGM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission940/Reviewer_GCGM"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission940/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761449806654, "cdate": 1761449806654, "tmdate": 1762915645433, "mdate": 1762915645433, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "iVCgdUFcA1", "forum": "8fV7jcTngH", "replyto": "8fV7jcTngH", "signatures": ["ICLR.cc/2026/Conference/Submission940/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission940/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763110797153, "cdate": 1763110797153, "tmdate": 1763110797153, "mdate": 1763110797153, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces CrossLMM, a framework that uses a dual cross-attention mechanism (visual-to-visual and text-to-visual) to efficiently compress the number of visual tokens for processing long videos in Large Multimodal Models (LMMs), aiming to maintain high performance while significantly reducing computational cost."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The proposed dual cross-attention mechanism is a well-motivated design, as it aims to compress visual information by considering both the global visual context (V2V) and the guiding semantic information from the text (T2V), which could lead to more informed and effective token selection.\n\n- The paper is well-written and easy to follow."}, "weaknesses": {"value": "1. The core contribution of the paper is a dual cross-attention module that incorporates both global visual and textual information when compressing visual tokens. However, the idea of using cross-attention for visual token compression is not novel and has been explored in prior works, such as [1 2 3].\n\n[1] RSTNet: Captioning with Adaptive Attention on Visual and Non-Visual Words\n\n[2] Hybrid-Level Instruction Injection for Video Token Compression in Multi-modal Large Language Models\n\n[3] LLAVA-MINI: EFFICIENT IMAGE AND VIDEO LARGE MULTIMODAL MODELS WITH ONE VISION TOKEN\n\n2. The method section devotes considerable space to describing standard techniques in MLLMs, such as the bilinear pooling operator, which is widely used in models like LLaVA-OneVision, Qwen2.5-VL, and InternVL2.5. These components are not novel contributions of this work.\n\n3. Regarding the experiments:  \n   • In Table 1, results are shown for CrossLMM 7B under different token counts in the \"per frame\" setting. Does the model need to be retrained for each different token number?  \n\n   • In Table 2(a), the performance gain from using T2V alone is quite limited—only 0.1 on VideoMME and 0.2 on MVBench. However, when T2V is combined with V2V, the improvement on MVBench reaches 1.0. Could the authors provide a detailed explanation for this phenomenon?"}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "u2o7S8U1Kc", "forum": "8fV7jcTngH", "replyto": "8fV7jcTngH", "signatures": ["ICLR.cc/2026/Conference/Submission940/Reviewer_JsVk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission940/Reviewer_JsVk"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission940/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761732312097, "cdate": 1761732312097, "tmdate": 1762915645269, "mdate": 1762915645269, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes CrossLMM, a model designed for video understanding tasks that leverages both visual-to-visual and textual-to-visual cross-attention mechanisms to learn alignments between pooled visual tokens and textual tokens. CrossLMM is evaluated on benchmark datasets covering both short-form and long-form video understanding, demonstrating its effectiveness."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "* The paper is clearly written and easy to follow.\n* The idea is intuitive and well-presented.\n* Enhancing the alignment between visual and textual modalities after token reduction is a promising direction worthy of further exploration."}, "weaknesses": {"value": "* While the use of both visual-to-visual and textual-to-visual cross-attention is intuitive and known to improve performance, it is not novel. Also the primary efficiency gain of CrossLMM appears to stem from token pooling, which drastically reduces the number of visual tokens, not from the added attention modules.\n* Given that the core architectural idea is well established, a more rigorous experimental evaluation is expected. Yet, I believe the comparison between CrossLMM and the baselines is unfair: CrossLMM employs significantly stronger backbones (Qwen2.5 and SigLIP2), while many baselines rely on older or weaker models. As a result, it is difficult to attribute performance gains solely to the proposed architecture rather than the superior pre-trained components.\n* The efficiency comparison is conducted primarily against LLaVA-OV, which not only uses weaker backbones (Qwen2 and SigLIP) but also lacks any token reduction mechanism. This makes it an unsuitable baseline for evaluating efficiency claims. I think it's hard to draw clear conclusions from this set of experiments.\n* If efficiency is a central selling point, the paper should include comparisons with other methods that also employ token reduction strategies, under a controlled and fair experimental setup (e.g., using the same backbones and training protocols).\n* As both pre-training and SFT are applied, have the authors considered starting with the base version of Qwen rather than the instruct version?"}, "questions": {"value": "Please refer to the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "3IpG18IB7z", "forum": "8fV7jcTngH", "replyto": "8fV7jcTngH", "signatures": ["ICLR.cc/2026/Conference/Submission940/Reviewer_V5Em"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission940/Reviewer_V5Em"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission940/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761921999706, "cdate": 1761921999706, "tmdate": 1762915645134, "mdate": 1762915645134, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a novel scheme for visual token compression for VLM. Instead of compressing the tokens completely before using them as input to the LLM, the paper proposes a scheme where over the different layers of the LLM, cross attention back to the original visual tokens is used to update both the visual tokens and the textual tokens. This allows for a 'language-aware' compression, leading to superior results compared to earlier works."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The proposed dual attention mechanism makes sense, differs from earlier attempts that try to compress completely before the first LLM layer, and gives good results in practice. I've always wondered why the visual tokens were treated the exact same way as the textual tokens. Now that seems corrected.\n\nThe method has been tested on diverse video benchmarks, including videos of various length."}, "weaknesses": {"value": "1. The math doesn't add up in the section on 'initial token merge', where the use of bilinear pooling is said to reduce the dimensionality by a factor of 9, consistent with a 3x3 local patch aggregation, but then it's said this brings them from N=729 to N=9.  I thought this was a typo, but later in the experiments the authors keep mentioning sizes of 1 / 9 / 16, so now I'm confused and don't know what the authors are actually doing in this phase. \n\n2. One would expect that a more compact handling of the visual tokens would ultimately lead to significantly better results when working with long videos, allowing more frames to be considere, compared to the baseline scheme that can encode only a small fraction of the frames. However, this is not obvious from the obtained results."}, "questions": {"value": "1. Can you better explain the initial token merging (see Weakness 1 above) ? \n2. The text suggests that the same gamma is used for both V2V and T2V. Is that correct ? Seems a weird choice.\n3. Reducing the memory consumption and computational overhead is nice, but even nicer would be to show that, for a similar memory and compute budget, when dealing with long videos, your method could give significantly better results. Can you show this ? If not, do you know why ?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "9KJOmNOjOL", "forum": "8fV7jcTngH", "replyto": "8fV7jcTngH", "signatures": ["ICLR.cc/2026/Conference/Submission940/Reviewer_aQ8W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission940/Reviewer_aQ8W"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission940/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762114533957, "cdate": 1762114533957, "tmdate": 1762915644995, "mdate": 1762915644995, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}