{"id": "8wQ7Oc08vo", "number": 17140, "cdate": 1758272670597, "mdate": 1759897194293, "content": {"title": "A New Paradigm for Genome-wide DNA Methylation Prediction Without Methylation Input", "abstract": "DNA methylation (DNAm) is a key epigenetic modification that regulates gene expression and is pivotal in development and disease. However, profiling DNAm at genome scale is challenging: of $\\textasciitilde$28 million CpG sites in the human genome, only about 1–3\\% are typically assayed in common datasets due to technological limitations and cost. Recent deep learning approaches, including masking-based generative Transformer models, have shown promise in capturing DNAm–gene expression relationships, but they rely on partially observed DNAm values for unmeasured CpGs and cannot be applied to completely unmeasured samples. To overcome this barrier, we introduce MethylProphet, a gene-guided, context-aware Transformer model for whole-genome DNAm inference without any measured DNAm input. MethylProphet compresses comprehensive gene expression profiles ($\\textasciitilde$25K genes) through an efficient bottleneck multilayer perceptron, and encodes local CpG sequence context with a specialized DNA tokenizer. These representations are integrated by a Transformer encoder to predict site-specific methylation levels. Trained on large-scale pan-tissue whole-genome bisulfite sequencing data from ENCODE (1.6 billion CpG–sample pairs, $\\textasciitilde$322 billion tokens), MethylProphet demonstrates strong performance in hold-out evaluations, accurately inferring DNAm at unmeasured CpGs and generalizing to unseen samples. Furthermore, application to TCGA pan-cancer data (chromosome 1, 9,194 samples; $\\textasciitilde$450 million training pairs, 91 billion tokens) highlights its potential for pan-cancer whole-genome methylome imputation. MethylProphet offers a powerful and scalable foundation model for epigenetics, providing high-resolution methylation landscape reconstruction and advancing both biological research and precision medicine.", "tldr": "We develop a generalized gene-contextual transformer model for inferring whole-genome DNA methylation landscape without surrounding methylation as context information..", "keywords": ["DNA Methylation", "Deep Learning", "Genome"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c0d0719c4babb5f099941d178865ace55fe627cc.pdf", "supplementary_material": "/attachment/23a090e92082738754a3a0e607884535ee1859f8.pdf"}, "replies": [{"content": {"summary": {"value": "The paper presents a transformer-based architecture to predict DNA methylation. The key innovation is represented by the use of \"paired\" gene expression profiles as sources of additional context, which enables prediction at the single CpG site even in the absence of information on methylation (but with expression measurements). The proposed approach, called MethylProphet, is tested on data from major consortia (ENCODE and TGCA) demonstrating a good level of accuracy."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is well written, the task is well motivated and the approach is described in sufficient detail as to be clear whet the authors are doing and why.\n- The topic is of interest, although with caveats (see weaknesses).\n- The idea of using gene expression as context is novel and certainly of relevance to the task."}, "weaknesses": {"value": "I have many reservations about the paper, here are the main ones:\n- Gene expression and methylation are well known to be correlated, so in a sense adding expression as context is a natural idea. The question is whether adding expression makes the task still worthwhile. Much of the interest in methylation stems from its mechanistic role in regulating expression, as well as its biomarker function. If you already have expression measurements, the need to know much about methylation might be questionable.\n- Methylation is poorly understood in general but most CpGs are either unmethylated in islands associated with active genes, or methylated in the ocean or near repressed genes. This already suggests that knowledge of expression could provide a simple model with accuracy on a comparable scale (if in island and gene on, then 0, otherwise 1).\n- The comparisons are very limited, and the Fig 5 comparison against a method that does not use expression shows a fairly limited improvement despite the extra data."}, "questions": {"value": "- Methylation arrays often provide an aggregated reading for nearby CpGs, how do you deal with that?\n- How does the model perform on special CpGs, e.g. the ones used in clocks?\n- How do you integrate coverage information in your loss function?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "XMUGUlr2nL", "forum": "8wQ7Oc08vo", "replyto": "8wQ7Oc08vo", "signatures": ["ICLR.cc/2026/Conference/Submission17140/Reviewer_W98K"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17140/Reviewer_W98K"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17140/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761226642931, "cdate": 1761226642931, "tmdate": 1762927132346, "mdate": 1762927132346, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a Transformer-based model for predicting whole-genome DNA methylation profiles from gene expression and DNA sequence alone, without requiring measured methylation values. Trained on billion-scale ENCODE and TCGA datasets, it achieves strong performance in zero-shot methylation prediction across both unmeasured CpG sites and unseen samples."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper addresses a key limitation of imputation-based methods for DNAm prediction, allowing application to entirely new samples.\n\n2. The paper proposes a new formulation for the DNAm prediction task, which is intuitive and well-motivated.\n\n3. The authors conduct a comprehensive evaluation which includes multiple validation splits to test model’s generalization ability.\n\n4. The manuscript is well-written and well-structured, supported by informative results."}, "weaknesses": {"value": "1. The paper does not clearly explain why this task should be feasible, especially why gene expression is used as an input modality.\n\n2. It would be better to include an analysis of which patterns of CpGs are predictable and which are not.\n\n3. Given the two types of input data, it is hard to know the contribution from each modality. The paper should include an ablation study comparing the model to sequence-only and expression-only baselines."}, "questions": {"value": "1. How sensitive is the model's performance to the 1kb sequence window size?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4MeozWPrdv", "forum": "8wQ7Oc08vo", "replyto": "8wQ7Oc08vo", "signatures": ["ICLR.cc/2026/Conference/Submission17140/Reviewer_WQPP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17140/Reviewer_WQPP"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17140/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966905102, "cdate": 1761966905102, "tmdate": 1762927132053, "mdate": 1762927132053, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces MethylProphet, a proof-of-concept deep learning model that demonstrates the feasibility of predicting genome-wide DNA methylation using only gene expression and genomic context, without requiring any methylation data as input."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The methodological exposition is characterized by its clarity and high quality.\n2. The objective of integrating multi-modal information is both well-defined and effective."}, "weaknesses": {"value": "The primary issue with this paper is that while its core innovation is the mDNA-free prediction, it overlooks existing methods capable of predicting methylation sites from either gene expression alone or DNA sequence alone. Therefore, it is essential to establish a comparative baseline to demonstrate the synergistic advantage of fusing both modalities (gene expression and DNA sequence) over relying on a single modality."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FlJZ2DkVps", "forum": "8wQ7Oc08vo", "replyto": "8wQ7Oc08vo", "signatures": ["ICLR.cc/2026/Conference/Submission17140/Reviewer_Epkb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17140/Reviewer_Epkb"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17140/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762008614328, "cdate": 1762008614328, "tmdate": 1762927131794, "mdate": 1762927131794, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents MethylProphet, a Transformer model trained to prediction DNA methylation from gene expression, DNA sequence, and genomic annotations (such as CpG island annotation). Their approach is novel because it allows for whole genome DNA methylation inference for samples without any measure DNA methylation sites.\n\nTheir results show that their model can highly accurately predict methylation status across CpG sites in the genome for unseen samples. However, the performance for predicting methylation status at individual CpG sites across samples is only moderate, even for CpG site seen during training.\n\nOverall, the results presented are interesting and well executed, but the paper lacks sufficient baselines and ablations to prove that their model beats simple imputation techniques."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is generally well written, and the problem and approach are clearly presented.\n- The paper seeks to solve a problem that has not yet been tackled by other models in the field — whole genome methylation inference — and demonstrates that their approach is predictive.\n- The authors validate their results on two independent datasets and multiple different methylation sequencing assays. Their results are quite robust across datasets and assays\n- The validation splits and evaluation metrics are well designed."}, "weaknesses": {"value": "In my opinion, the main weakness of this paper is a lack of sufficient baselines and ablations.\n- There is only a comparison to one baseline “the CNN-based attention model in Levy-Jurgenson et al. (2019b)” and only on one of their two datasets. Moreover, from the details given in the appendix, it seems that MethylProphet and the baseline are not trained with the exact same information. In particular, it seems that MethylProphet is trained with additional genomic annotations that the CNN is not. For a fair comparison, MethylProphet should be trained with the exact same features/data as the baseline\n- The point is taken that a main innovation of the model is that it can perform whole genome methylation inference, which cannot be done by many of the prior models in this space. However, it would still be worthwhile to see more comprehensive baselines against popular models in the field — such as CpGPT and DeepCpG — on the in-distribution generalization task. The results presented in Figure 5 are only against one baseline model and on one chromosome.\n- For the MAC-PCC metric, it would be valuable to include another simple baseline of the mean methylation status across training samples\n- There are minimal ablations performed on the components of the methylProphet model. In particular, CpG island context is highly indicative of methylation status, and an ablation should be performed to understand how much of the models performance can be attributed to this annotation alone.\n\nMinor: \nSome figures and methods could be updated for clarity. \n\n    - For example, in table 4 MAS-PCC and MAC-CC are not defined (although they are defined later in the text)\n    - In Figure 4, axes should be labeled with “samples” and “CpGs”. In addition, moving figure 4 earlier in the paper would be helpful"}, "questions": {"value": "- I do not see any results showing generalization performance between datasets - was this tested?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "o6PMtitTi4", "forum": "8wQ7Oc08vo", "replyto": "8wQ7Oc08vo", "signatures": ["ICLR.cc/2026/Conference/Submission17140/Reviewer_SVbA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17140/Reviewer_SVbA"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission17140/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762015309643, "cdate": 1762015309643, "tmdate": 1762927131566, "mdate": 1762927131566, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}