{"id": "9aPd1yEGa0", "number": 25615, "cdate": 1758369497623, "mdate": 1759896713133, "content": {"title": "Robust Prediction-Powered Inference under Data Corruption", "abstract": "This paper proposes a robust prediction-powered semi-supervised statistical learning and inference framework. Existing prediction-powered inference (PPI) methods use pre-trained machine-learning models to impute unlabeled samples and calibrated the imputation bias, based on the assumption of covariate homogeneity between the labeled and unlabeled datasets. However, violation of the homogeneity assumption, such as distribution shifts and data corruption, can undermine the effectiveness of semi-supervised approaches and even break down the learning process. In response, we introduce robust estimation techniques to the imputation-and-then-calibration procedure of PPI. The approach can be easily integrated with general PPI methods and improves the robustness of them against the heterogeneity and the corruption in the unlabeled set. To make full use of the labeled and unlabeled data, a cross-validation procedure is also developed for selecting the shift/contamination level. Theoretical analysis shows that our method is consistent and robust under mild conditions. Numerical simulations and real-data applications also demonstrate the robustness and superiority of the proposed method.", "tldr": "This paper proposes a robust prediction-powered semi-supervised statistical learning and inference framework under data corruption.", "keywords": ["semi-supervised learning", "prediction-powered inference", "robustness"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/3bc53b241b35fb12e7647819fe93e65051eb7a69.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Roica (Robust prediction-powered inference with calibration), a method that enhances the Prediction-Powered Inference (PPI) framework. It substitutes the step of averaging the \"imputed gradients\" for unlabeled samples with robust mean estimation. Furthermore, it employs cross-validation on the labeled data to select the contamination level, aiming to enable reliable semi-supervised estimation and inference even when the unlabeled set is subject to contamination."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "This article mainly solves the problem of contaminated data. The author proposes a robust method that can also use unlabeled data when contaminated data is limited."}, "weaknesses": {"value": "I have several points:\n1. The paper claims that the proposed method improves robustness. My question is, does this refer only to an improvement in consistency, or does it also include gains in estimation efficiency? If it's only about consistency, why can't we just use the labeled data directly?\n2. Would you to clarify the meaning of the $\\epsilon=\\Theta(\\epsilon_*+\\log(1/\\tau)/N)$ symbol in line 257. My understanding was that $\\Theta$ denotes the parameter space, so its usage here with an equals sign seems unusual. Could you please explain its specific meaning in this context?\n3.To enhance clarity, I suggest providing further explanation of Assumptions 1 and 2. This would facilitate a deeper understanding of their role and justification for the reader.\n4.The significance of the result in Theorem 1 could be further highlighted by providing a clearer discussion. It would be very helpful to contextualize it against existing methods—clarifying how it aligns with or diverges from related work would make the specific advantages and novel contributions of your approach more apparent to the reader.\n5. The performance of the proposed method appears to rely on the accuracy of the pre-trained model $f(\\cdot)$. Could you comment on the robustness of your approach to potential inaccuracies in this model? Specifically, an analysis of its sensitivity to $f(\\cdot)$ would be highly informative.\n6. Both the lemma and the theorem demonstrate that the estimation is related to the dimension of the parameters. However, the simulation only considers p=3, while n and N are particularly large. Could we represent more cases with relatively small n, such as 100, and relatively large p, such as 10 or 20?"}, "questions": {"value": "please see the weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "no"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "cUNPfT44mm", "forum": "9aPd1yEGa0", "replyto": "9aPd1yEGa0", "signatures": ["ICLR.cc/2026/Conference/Submission25615/Reviewer_LWQZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25615/Reviewer_LWQZ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission25615/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761786164960, "cdate": 1761786164960, "tmdate": 1762943497644, "mdate": 1762943497644, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses robustness issues in Prediction-Powered Inference (PPI), which uses model-imputed labels for semi-supervised inference. Standard PPI assumes the unlabeled covariate distribution matches the labeled one and breaks under distribution shift or adversarial contamination. The proposed Roica framework adds a robust mean estimator to the imputation-and-calibration step and uses cross-validation on labeled data to choose a contamination level. The authors provide asymptotic theory and demonstrate advantages over prior PPI variants in synthetic and real-data settings (ACS income data and yeast promoter gene-expression)."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Theory appears sound: consistency and asymptotic normality under contamination.\n2. The robust mean-estimation method is principled and well-studied in high-dimensional statistics."}, "weaknesses": {"value": "1. The motivation for addressing corruption in PPI appears largely hypothetical. The paper does not demonstrate that the data-contamination scenarios it considers represent genuine bottlenecks in real semi-supervised inference workflows, raising concerns that the problem setting is constructed primarily to justify the proposed method. All the real data applications are made up by simulations to fit the problem that the author described. I would suggest to have more convincing motivations to motivate the paper.\n2. The core contribution is swapping in a known robust mean estimator. Most structural elements (bias-correction form, one-step Newton refinement) are directly inherited from prior PPI work.\n3. The contamination mechanism (simple additive shifts) may not reflect realistic mis-specifications like conditional shift, label-related corruption, or adversarial errors targeted at the model’s blind spots. How does Roica perform with those other situations?"}, "questions": {"value": "1. See weakness\n2. Can the contamination estimation step over-shrink toward supervised estimates and reduce PPI gains?\n3. Would Roica still help when model predictions are biased in-distribution, not only on corrupted points?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "lCyNvr8OXn", "forum": "9aPd1yEGa0", "replyto": "9aPd1yEGa0", "signatures": ["ICLR.cc/2026/Conference/Submission25615/Reviewer_XDuQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25615/Reviewer_XDuQ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission25615/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761942896715, "cdate": 1761942896715, "tmdate": 1762943496677, "mdate": 1762943496677, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a framework designed to enhance the robustness of Prediction-Powered Inference (PPI) in semi-supervised learning settings when the unlabeled data are contaminated or drawn from a shifted distribution. The authors propose incorporating a robust mean estimator into the imputation–calibration step of PPI to mitigate the adverse effects of data corruption. In addition, a cross-validation procedure is developed to select the contamination proportion parameter. The paper establishes asymptotic normality for the resulting estimator and presents empirical evaluations on synthetic data and two real-world datasets, demonstrating improved robustness compared with several existing PPI variants."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Conceptual simplicity and generality: The proposed approach integrates robust estimation principles into PPI in a way that is conceptually straightforward and potentially applicable to various models.\n\nTheoretical consistency: The asymptotic properties (consistency and asymptotic normality) of the proposed estimator are formally established under standard regularity conditions."}, "weaknesses": {"value": "Limited novelty: The methodological contribution is largely an application of known robust mean estimation techniques within the PPI framework. The main idea—replacing the sample mean in PPI by a robust alternative—is conceptually incremental and lacks substantive methodological innovation.\n\nMarginal theoretical contribution: The theoretical results mainly rely on standard asymptotic arguments for M-estimation and established results from the robust statistics literature. The paper does not develop new theoretical insights specific to the interaction between robustness and semi-supervised inference.\n\nIncomplete methodological clarity: The implementation details of the robust weighting scheme (Eq. 2) are insufficiently described. The optimization problem may be computationally demanding for large unlabeled datasets, yet no complexity analysis or practical guidance is provided.\n\nSimplistic experimental design: The contamination mechanisms used in simulations (additive shifts, replacement of a small fraction of samples) are stylized and do not convincingly capture the complexities of real-world distributional shifts. Moreover, the empirical analysis focuses narrowly on PPI-type baselines rather than more general robust SSL or domain adaptation methods.\n\nOverstated empirical claims: While Roica achieves favorable coverage and smaller confidence regions under artificial contamination, the results do not clearly demonstrate improved real-world predictive or inferential performance beyond these metrics.\n\nExpositional issues: The presentation is notation-heavy and sometimes opaque. Key algorithmic steps (e.g., the filtering procedure and cross-validation routine) would benefit from clearer pseudocode or schematic illustration."}, "questions": {"value": "How does the proposed robust mean estimation procedure differ in practice from existing filtering-based robust estimators? Is any modification specifically tailored to the PPI setting?\n\nHow stable is the cross-validation procedure for estimating the contamination level, particularly when the labeled sample size is small?\n\nWhat are the computational and scalability properties of solving Eq. (2)? How does performance degrade with increasing dimensionality or unlabeled sample size?\n\nThe theoretical results assume mild contamination. Can the method tolerate higher contamination levels, and how would it perform when this assumption fails?\n\nHow would Roica compare against robust domain adaptation or covariate-shift correction methods, which also address distributional heterogeneity?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "DVS1SOEU56", "forum": "9aPd1yEGa0", "replyto": "9aPd1yEGa0", "signatures": ["ICLR.cc/2026/Conference/Submission25615/Reviewer_m9vm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25615/Reviewer_m9vm"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission25615/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761960534234, "cdate": 1761960534234, "tmdate": 1762943496080, "mdate": 1762943496080, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The author focuses on the issue of estimating the overall data distribution parameter θ in semi-supervised scenarios, and how to improve the precision of θ estimation when there is distribution shift or data corruption in the unlabeled (or unreliable labeled) data. The author designed a robust parameter θ estimation technique Roica based on current PPI technology. By cross-validation to estimate the data contamination rate ϵ, with a weight restriction strategy on the unlabeled sample, the negative impact of bad data on the parameter θ estimation process was reduced. Detailed mathematical proofs and abundant simulations and real data experiments demonstrate the effectiveness of the proposed method."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Distribution shift/contamination in unlabeled data is widespread in real-world scenarios, but in previous studies of the PPI problems, this issue did not receive sufficient attention. The author pointed out this phenomenon for the first time and provided reasonable solutions.\n2. Compared with label correction or fine-tuning of pretraining models commonly used in semi-supervised learning, Roica can directly estimate parameter θ without the similar operations, which means lower computational overhead of this algorithm.\n3. Roica is a pluggable PPI method, which contains rigorous mathematical proofs. Rich experimental results have verified the effectiveness."}, "weaknesses": {"value": "1. The unlabeled data contamination rate ϵ in the experiment is relatively low (<15%), making it impossible to confirm the robustness of the proposed method in scenarios with high contamination rate ϵ.\n2. The simulation data and real dataset scenarios adopted are relatively simple. Whether it can ensure effectiveness in complex CV, NLP, and TS (time series) data machine learning tasks remains to be further confirmed.\n3. The detailed introduction of the Roica and Roica-cv method settings in the experiments were not found, which might cause readers to be confused about the experimental results."}, "questions": {"value": "1. Encourage the author to try to increase ϵ for experimental testing in the more complex dataset. In many machine learning tasks, there is often a distribution shift between all unlabeled samples and labeled samples (transfer learning), or the noise rate in noisy labeled tasks exceeds 40% (noisy label learning). The dataset used is also a more complex task rather than such logistic regression task.\n2. I didn't find the author's explanation regarding the differences between Roica and RoicA-CV in the main text. I guess RoICA-CV is the experimental result of estimating ϵ using cross-validation. Then, is the ϵ in Roica use the real ϵ directly in the dataset? Otherwise, it is difficult to explain why Roica performs better than RoicA-CV. It is hoped that the author will provide necessary explanations here in the experimental section of the main text.\n3. Although the paper provides a detailed description of the experimental setup, it is still recommended that the source code be published after this paper is accepted to promote further development in the field of PPI research.\n4.How exactly is the weight vector w computed in experiments? Is it via convex optimization, filtering, or heuristic truncation?\n5.It is recommended that all formulae be numbered."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "DaKlnOzf4P", "forum": "9aPd1yEGa0", "replyto": "9aPd1yEGa0", "signatures": ["ICLR.cc/2026/Conference/Submission25615/Reviewer_qvSq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25615/Reviewer_qvSq"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission25615/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966912177, "cdate": 1761966912177, "tmdate": 1762943495515, "mdate": 1762943495515, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}