{"id": "9IoBTP4EBO", "number": 5905, "cdate": 1757944852175, "mdate": 1763725473410, "content": {"title": "Latent Diffusion-based 3D Molecular Recovery from Vibrational Spectra", "abstract": "Infrared (IR) spectroscopy, a type of vibrational spectroscopy, is widely used for molecular structure determination and provides critical structural information for chemists. \nHowever, existing approaches for recovering molecular structures from IR spectra typically rely on one-dimensional SMILES strings or two-dimensional molecular graphs, which fail to capture the intricate relationship between spectral features and three-dimensional molecular geometry.\nRecent advances in diffusion models have greatly enhanced the ability to generate molecular structures in 3D space. \nYet, no existing model has explored the distribution of 3D molecular geometries corresponding to a single IR spectrum.\nIn this work, we introduce *IR-GeoDiff*, a latent diffusion model that integrates IR spectral information into both node and edge representations of molecular structures. We evaluate IR-GeoDiff from both spectral and structural perspectives, demonstrating its ability to recover the molecular distribution corresponding to a given IR spectrum. \nFurthermore, an attention-based analysis reveals that the model’s interpretation of IR spectra aligns with quantum mechanical principles of molecular vibrations.", "tldr": "", "keywords": ["Diffusion Models", "Molecular Generation", "Infrared Spectroscopy"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/77cbd7260132b9994e59cdd62fbb033b5dca461d.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The authors aim to reconstruct three-dimensional molecular geometries from infrared (IR) spectra. Unlike prior work that maps spectra to 1D SMILES or 2D graphs, IR-GeoDiff seeks to recover full 3D atomic coordinates. Their method conditions a geometric latent diffusion model on spectral information using a classifier. The model integrates IR features into both node (atomic) and edge (bond) representations through cross-attention with spectral patches and functional group features. The paper evaluates the approach using the Spectral Information Similarity and chemical graph similarity on the QM9S dataset. The authors also find that spectral peaks receiving the highest attention frequently correspond to functional groups."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "- To the best of my knowledge, this is the first paper that attempts to deduce 3D structure from IR\n- Significant performance gains over baseline 3D generative diffusion models (EDM, GEOLDM)"}, "weaknesses": {"value": "- Method is essentially a recombination of known techniques\n- Assumes that the atom types and the atom count are known beforehand\n- Metrics seem problematic"}, "questions": {"value": "- How reasonable is it to assume that only a single 3D structure generated an IR spectra? In an experiment there is surely a distribution over structures in a sample, is it not?\n- You mention that number of cases where molecules exhibit high graph similarity but low SIS, and vice versa. At the same time, only ~200 test samples were used for spectral metrics due to computational cost of SIS. What would be better metrics?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "7nqGjHDyhN", "forum": "9IoBTP4EBO", "replyto": "9IoBTP4EBO", "signatures": ["ICLR.cc/2026/Conference/Submission5905/Reviewer_sQdo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5905/Reviewer_sQdo"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission5905/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760980453606, "cdate": 1760980453606, "tmdate": 1762918339759, "mdate": 1762918339759, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work appears to be primarily a benchmark study. Building upon previous molecular generation approaches that failed to capture spectral features, the authors aim to address the problem of modeling the distribution of 3D molecular geometries corresponding to a single IR spectrum, under the assumption that atom types and counts are fixed. In the implementation, they construct a corresponding dataset based on QM9 and develop a framework that integrates techniques such as classifier guidance, latent diffusion models (LDM), and GeoLDM to achieve this goal."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The task is novel and introduces a fresh perspective to the field.\n2. The *Background* and *Related Works* sections are well-organized and provide a thorough summary, which is appropriate for a benchmark-focused study.\n3. The overall framework maintains good SE(3)-equivariance properties throughout the model design.\n4. The integration of spectral features is reasonable and well-supported by the ablation studies."}, "weaknesses": {"value": "1. The paper makes two main claims regarding the task: (1) it aims to model the distribution of 3D molecular geometries corresponding to a single IR spectrum, as stated in the *Abstract* and *Introduction*; and (2) it seeks to learn a probabilistic model $\\theta$ that captures the conditional distribution of molecular geometries given an IR spectrum, i.e., $p_{\\theta}(G|S)$, as described in the *Preliminaries* section. However, I question the accuracy of this task formulation, since in the actual implementation the authors assume that the atom types $h$ and the atom count $N$ of each molecule are known, and focus solely on modeling the conditional distribution over atomic coordinates $x$. Therefore, the model effectively learns $p_{\\theta}(x|S,h)$ rather than $p_{\\theta}(G|S)$, and the paper should have explicitly clarified at the outset what the true modeling objective of the task is.  \n2. The benchmark dataset is undersized: it relies solely on QM9, which includes molecules with at most nine heavy atoms. Contemporary 3D molecular tasks typically involve much larger molecules—e.g., those in GEOM-Drugs or PCQM4Mv2 average tens to hundreds of heavy atoms—so larger, multiscale benchmarks would be more representative and comprehensive.  \n3. The overall framework is primarily built upon several well-established methods, including classifier guidance, latent diffusion models (LDM), and GEOLDM. Although this design is adequate for a benchmark-oriented study, it offers limited novelty beyond existing approaches.  \n4. The baselines used in this work are relatively outdated and limited in number. In the field of molecular generation, many newer and more powerful methods beyond EDM and GeoLDM have been proposed, which could be adapted for comparison. At the very least, some of these recent approaches should have been considered to provide a more comprehensive evaluation.  \n5. The results and implementation of EDM and GeoLDM appear questionable and inconsistent. In your setting, both the atom types and atom counts are provided as part of the input, whereas for EDM and GeoLDM, only the number of atoms is fixed and the atom types are omitted—a significant loss of information. This discrepancy raises concerns about the fairness of the comparison. Please refer to **Question 2** for further discussion.  \n6. There are no formulations provided for any of the evaluation metrics in the manuscript."}, "questions": {"value": "1. The manuscript states that *“in the subsequent diffusion training stage, the spectral classifier is frozen to ensure a stable and consistent conditioning signal, while the autoencoder remains learnable.”* Why does the autoencoder remain learnable during the diffusion training stage? Is there any ablation study or experimental evidence supporting this design choice?\n2. The manuscript claims that *“denoising networks jointly model position- and feature-level noise, which precludes specifying atom types as inputs for EDM and GeoLDM.”* Why is this the case? The paper provides neither a theoretical formulation nor an architectural illustration to justify this restriction.\n3. In the definition of *molecular accuracy*, it is stated that *“if at least one sampled molecule exactly matches the reference structure.”* How is “matches” defined in this context? Does it refer to exact coordinate alignment, atom-type correspondence, or another structural similarity measure?\n4. During evaluation, is there any metric that measures spatial deviation—such as the root mean square deviation (RMSD)—between the generated positions $ x^{\\prime}$ and the reference positions $ x $?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "mrwweVKK1G", "forum": "9IoBTP4EBO", "replyto": "9IoBTP4EBO", "signatures": ["ICLR.cc/2026/Conference/Submission5905/Reviewer_YN2k"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5905/Reviewer_YN2k"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission5905/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761638326863, "cdate": 1761638326863, "tmdate": 1762918339233, "mdate": 1762918339233, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes IR-GeoDiff, a latent diffusion model designed to reconstruct three-dimensional molecular geometries directly from one-dimensional infrared spectra. Existing methods, which typically generate one-dimensional SMILES strings or two-dimensional molecular graphs, fail to capture the intrinsic relationship between infrared spectra and molecular geometry. IR-GeoDiff addresses this limitation through two key innovations: (1) It employs a multi-head cross-attention mechanism to integrate infrared spectral features into the node (atom) and edge (bond) features of the molecular geometry; (2) It utilizes a Transformer-based spectral classifier to simultaneously extract spectral and functional group features, which serve as conditional inputs for the generation process.\nThe model was evaluated based on both spectral and structural similarity metrics to assess the consistency between the generated geometries and their corresponding infrared spectra. Results demonstrate that IR-GeoDiff outperforms baseline models such as EDM and GEOLDM on the QM9S dataset. Furthermore, attention visualization analysis confirms that the model's interpretation of the spectra aligns with the principles of molecular vibration derived from quantum chemical calculations."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The work is innovative in its application of a latent diffusion model to the challenging task of recovering molecular geometry from infrared spectra. The model architecture is novel, particularly in its use of a multi-head cross-attention mechanism for feature fusion and a Transformer-based classifier for joint feature extraction.\n2. The model design is sound and the experimental evaluation is comprehensive, encompassing both spectral and structural dimensions. The inclusion of attention visualization provides valuable validation for the model's interpretability.\n3. The paper is well-structured, with detailed method descriptions. The inclusion of diagrams and formulas aids in comprehension.\n4. This research addresses a significant gap by enabling the direct recovery of 3D structures from infrared spectra. It holds considerable potential for applications in computational chemistry and drug design."}, "weaknesses": {"value": "1. The experimental setup has limitations. The chosen baseline models, EDM and GEOLDM, were proposed approximately three years ago. Given the rapid pace of development in this field, more recent and potentially superior models should be included for comparison.The speed of diffusion models is too slow, and in recent years, many new models have been developed. These new models should be compared.\n2. The study relies on a single dataset, QM9S, for validation. This dataset is limited to small molecules (with a maximum of nine heavy atoms), which restricts the complexity and diversity of the tested structures and may not adequately demonstrate the model's generalizability.\n3. The conclusion is underdeveloped. It primarily reiterates the main contributions and findings without a critical discussion of the study's limitations or a clear outlook on future research directions.\n4. The related work section lacks depth. It emphasizes the primary motivation for developing IR-GeoDiff but does not sufficiently elaborate on the core challenges or the specific innovations designed to overcome them, such as the multi-head cross-attention mechanism for fusing spectral and geometric features.\n5. There are inconsistencies between the manuscript text and the mathematical notation. For instance, the variable   in Equation 6 does not match the   in line 224 of the text."}, "questions": {"value": "1. The \"Experiments\" section should be strengthened by benchmarking IR-GeoDiff against more recent state-of-the-art models to compellingly demonstrate its superior performance.The speed of diffusion models is too slow, and in recent years, many new models have been developed. These new models should be compared.\n2. Additional experiments on datasets featuring more complex and diverse molecular structures are recommended to thoroughly validate the model's generalization capability.\n3. The \"Conclusion\" should be expanded to explicitly outline the study's limitations and to propose specific, actionable directions for future work.\n4. The \"Related Work\" section should be revised to provide a clearer exposition of the core challenges in this research area and to delineate how IR-GeoDiff's design, particularly its use of cross-attention, addresses these challenges.\n5. A thorough review of the entire manuscript is necessary to ensure consistency between all variables in the formulas and the main text."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "AoipZZoY1f", "forum": "9IoBTP4EBO", "replyto": "9IoBTP4EBO", "signatures": ["ICLR.cc/2026/Conference/Submission5905/Reviewer_x6jw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5905/Reviewer_x6jw"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission5905/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761876611539, "cdate": 1761876611539, "tmdate": 1762918338610, "mdate": 1762918338610, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes IR-GeoDiff, a latent diffusion model designed to recover 3D molecular geometries from infrared (IR) vibrational spectra. The model integrates spectral features into both node and edge representations within an equivariant latent diffusion framework. Experiments on the QM9S dataset demonstrate that IR-GeoDiff can reconstruct 3D structures with given IR spectra, achieving promising results on authors' designed evaluation metrics."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea of reconstructing 3D molecular geometries from vibrational spectra is scientifically interesting and potentially impactful for computational chemistry and molecular spectroscopy.\n2. The paper is overall well written and logically organized. It's easy to follow and recognize the paper's contributions."}, "weaknesses": {"value": "1. The motivation for adopting a latent diffusion model is not sufficiently convincing. Latent diffusion models rely heavily on strong VAE encoders/decoders to build meaningful latent representations, but such powerful autoencoders are not yet well established for molecular 3D geometry. In contrast, existing non-latent 3D molecular diffusion models already achieve strong and stable results directly in coordinate space. The paper should clearly justify why the latent-space formulation is preferable in this domain.\n2. The experiments only compare with EDM and GEOLDM. More recent and stronger baselines, including non-latent 3D molecular diffusion models, should be included for a fair evaluation.\n3. The claimed contribution focuses on 3D molecular generation, but the primary structural metric is the Tanimoto similarity between Morgan fingerprints. This metric does not capture 3D conformational or geometric correctness. Evaluations for quality of generated 3D structures should be reported.\n4. The method assumes that the atom types and atom count are known a priori. Although the authors justify this as reflecting certain experimental workflows, this assumption greatly limits practical usability. In real scenarios, these properties may be unknown or partially uncertain, making the proposed method inapplicable beyond constrained settings."}, "questions": {"value": "1. Is the autoencoder module trained by the authors, or reused from prior molecular latent diffusion work (e.g., GEOLDM)? Please clarify its training procedure, data, and reconstruction performance.\n2. When computing *molecular accuracy*, how is a correct molecule defined? Is it based on exact molecular graph structure, fingerprint, or SMILES? \n3. Since the paper reports top-$n$ accuracy, what value of $n$ is used, and how sensitive are results to this choice?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7pUgrDnsq4", "forum": "9IoBTP4EBO", "replyto": "9IoBTP4EBO", "signatures": ["ICLR.cc/2026/Conference/Submission5905/Reviewer_xKpc"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5905/Reviewer_xKpc"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission5905/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762071742349, "cdate": 1762071742349, "tmdate": 1762918338291, "mdate": 1762918338291, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}