{"id": "9JxOVBdwNf", "number": 3939, "cdate": 1757570444466, "mdate": 1759898062061, "content": {"title": "United Minds or Isolated Agents? Exploring Coordination of LLMs under Cognitive Load Theory", "abstract": "Large Language Models (LLMs) exhibit a notable performance ceiling on complex, multi-faceted tasks, as they often fail to integrate diverse information or adhere to multiple constraints. \n    We posit that this limitation arises when the demands of a task exceed the LLM's effective cognitive load capacity. This interpretation draws a strong analogy to Cognitive Load Theory (CLT) in cognitive science, which explains similar performance boundaries in the human mind, and is further supported by emerging evidence that reveals LLMs have bounded working memory characteristics.\n    Building upon this CLT-grounded understanding, we introduce ***CoThinker***, a novel LLM-based multi-agent architecture designed to mitigate cognitive overload and enhance collaborative problem-solving abilities. ***CoThinker*** operationalizes CLT principles by distributing intrinsic cognitive load through agent specialization and managing transactional load via structured communication and a collective working memory. We empirically validate *CoThinker* on complex problem-solving tasks and fabricated high cognitive load scenarios, demonstrating improvements over existing multi-agent baselines in solution quality and efficiency. Our analysis reveals characteristic interaction patterns, providing insights into the emergence of collective cognition and effective load management, thus offering a principled approach to overcoming LLM performance ceilings.", "tldr": "LLMs hit limits on complex tasks due to cognitive overload. CoThinker, a multi-agent LLM system inspired by Cognitive Load Theory, uses specialized agents and structured communication to overcome these limits and improve problem-solving.", "keywords": ["Large Language Models", "LLM Agents", "Multi Agent Systems", "Cognitive Load Theory", "Collective Intelligence", "Collaborative Reasoning", "Working Memory", "Complex Problem Solving", "Emergent Cognition"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ebb49083a17d7be5171d80ebb9b21b90a5f0068a.pdf", "supplementary_material": "/attachment/e956f6f3e64c3cdb8f0d2489258a752ebd587af3.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a new multi-agent prompting framework for enhancing LLM reasoning particularly in complex reasoning problems; The paper draws analogy between In-context learning failures in LLMs and cognitive load theory, claiming that the ICL's limitaiton can be viewed as a cognitive overload where the working memory of the LLM is not enough for the task's cognitive load. The paper then proposed CoThinker, which divides the cognitive loads to multiple parallel agents and maintains a shared working memory. The CoThinker framework shows moderate improvements on LiveBench and CommonGen-Hard compared with direct IO, CoT and previous multi-agent debating methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- The analogy from cognitive load theory is interesting, and has the potential to open up new perspectives in understanding and improving large language models\n- A comprehensive pilot study and citations from the cognitive science perspective is provided\n- The empirical results show that the framework generalize well on different llms\n- The paper is clearly written and easy to follow"}, "weaknesses": {"value": "- Although the paper spend a large portion trying to justify the CLT-LLM analogy, my main concern are as follows:\n  - It is still not clear what does the \"cognitive load\" mean in an LLM: what's the difference between a \"cognitive load\" and simply \"task difficulty\"/\"reasoning complexity\"; both the attention entropy and perplexity only reflects the \"uncertainty\" of the model, which is also directly correlates with the difficulty/complexity of the task. \n  - It is not clear why the analogy helps: I find it hard to justify any unique insights (compared with existing work on prompting methods) that the CLT-LLM analogy can bring. The final proposed method still boils down to: a central meta-agent + multiple sub-agents. I feel the analogy does not truly contribute to proposing a novel and effective method.\n  - And on LiveBench, the gains against the second best baseline is very marginal; again posing a challenge on why this analogy helps\n- Some very related work are missing in both related work and experiments:\n  - Wang, Zhenhailong, et al. \"Unleashing the emergent cognitive synergy in large language models: A task-solving agent through multi-persona self-collaboration.\" arXiv preprint arXiv:2307.05300 (2023).\n  - Suzgun, Mirac, and Adam Tauman Kalai. \"Meta-prompting: Enhancing language models with task-agnostic scaffolding.\" arXiv preprint arXiv:2401.12954 (2024)."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eiGDFYOJz4", "forum": "9JxOVBdwNf", "replyto": "9JxOVBdwNf", "signatures": ["ICLR.cc/2026/Conference/Submission3939/Reviewer_Vnt8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3939/Reviewer_Vnt8"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3939/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761102642458, "cdate": 1761102642458, "tmdate": 1762917103343, "mdate": 1762917103343, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper attempts to connect cognitive load theory with limitations of large language models, and builds a multi-agent framework to mitigate cognitive overload through agent specialization and structured communication."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The identified issue about the mismatch between task complexity and model processing capability is important and deserves further exploration.\n2. The experiments are comprehensive, with solid ablation studies and well-organized analyses."}, "weaknesses": {"value": "1. Cognitive science is mainly used as a rhetorical framing to justify a fairly standard multi-agent architecture (e.g., role assignment, communication bus, small-world topology). While it works, the CoThinker system lacks real novelty in design. I would expect cognitive theories to inspire genuinely new forms of multi-agent organization, rather than merely serving as interdisciplinary justification for existing designs.\n2. If CLT is to be meaningfully applied to LLMs, the key questions should be: how to measure a model’s working-memory capacity, how to quantify a task’s cognitive load, and most crucially, how to determine (in a quantifiable way) tasks be decomposed or allocated once both cognitive load and working-memory capacity are measurable. The paper does not directly address these points.\n3. The validation experiments in Section 3 do not provide real evidence; they merely restate an obvious fact: harder tasks make the model less confident, and clearer instructions help with difficult problems."}, "questions": {"value": "1. How do you envision quantitatively measuring “working memory capacity” in LLMs, beyond indirect proxies like attention entropy or perplexity?\n2. Could the proposed framework adaptively estimate cognitive load and decide when to invoke multi-agent collaboration?\n3. How sensitive is the performance of CoThinker to the chosen communication topology?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BiB3fqO14Z", "forum": "9JxOVBdwNf", "replyto": "9JxOVBdwNf", "signatures": ["ICLR.cc/2026/Conference/Submission3939/Reviewer_XuKf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3939/Reviewer_XuKf"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3939/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761172793777, "cdate": 1761172793777, "tmdate": 1762917103168, "mdate": 1762917103168, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the performance limitations of Large Language Models (LLMs) on complex, multi-faceted tasks through the lens of Cognitive Load Theory (CLT) from cognitive science. The proposed multi-agent framework CoThinker operationalizes CLT principles by distributing intrinsic cognitive load through agent specialization and managing transactional load via structured communication and a collective working memory. Experiments on LiveBench and CommonGen-Hard demonstrate improved performance over the baselines, especially on high cognitive load tasks."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The application of Cognitive Load Theory to explain LLM limitations is novel and insightful, bridging human intelligence and machine intelligence.\n2. Clear system design of the proposed method. Each component—agent specialization, the transactive memory system, and the communication moderator—directly maps to established principles for managing cognitive load in human collaborative systems."}, "weaknesses": {"value": "1. Comparisons in experiments omit some strong structured reasoning and multi-agent baselines (e.g., Tree-of-Agents, Agents with a leader, etc.). Statistical significance and variance across seeds are not consistently reported.\n2. Though each part of the system can be mapped to CLT, however, these three parts are typical settings for multi-agent systems. The inspiration from CLT to design the detail algorithms of each part is lacked.\n3. There is scalability analysis in the manuscript, but the experiment sets are too few to completely show the correlations between the number of agents and the performance."}, "questions": {"value": "1. Can you provide quantitative confirmation of small-world properties in the communication graph?\n2. How sensitive are results to the choice of N and β beyond the reported ranges? Could you include task-wise adaptive selection strategies?\n3. Can you provide more insights from CLT to explain the details of the system design?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "RUvOmNgIOr", "forum": "9JxOVBdwNf", "replyto": "9JxOVBdwNf", "signatures": ["ICLR.cc/2026/Conference/Submission3939/Reviewer_j9Gu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3939/Reviewer_j9Gu"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3939/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761488737015, "cdate": 1761488737015, "tmdate": 1762917102972, "mdate": 1762917102972, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "- This work explains the performance ceiling of in-context learning by comparing LLM attention mechanism with human working memory, where LLM has the similar cognitive load theory as in cognitive science and can be measured by attention entropy and perplexity.\n\n-  Based on the CLT of LLM and solutions to cognitive overload, the work introduce a multi-agent framework, CoThinker, consisting of agent parallel thinking, transacutive memory system and communication moderator. The experiments show the effectiveness of this framework in improving LLM's performance in complex tasks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Cognitive Load Theory provides an explanation for LLM performance limits and a clear design rationale for multi-agent collaboration.\n\n- CoThinker takes cognitive science principles—like working memory, collective cognition, and small-world communication—and turns them into practical, easy-to-understand tools. This connects human cognitive theory with machine collaboration.\n\n- The authors tested their theory using quantitative measures (entropy, perplexity) and multiple benchmarks across different model families, showing it’s robust and works broadly. Detailed ablation studies (on communication moderators, TMS, and thinking styles) help figure out which mechanisms do the most to cut down cognitive load."}, "weaknesses": {"value": "- CoThinker underperforms on low-load tasks (e.g., instruction following) due to communication overhead—suggesting inefficiency in simple contexts.\n\n- The chosen proxies for cognitive load (attention entropy, perplexity) are suggestive but indirect. Can you give more explanation on the relationship between attention entropy and cognitive load?"}, "questions": {"value": "Why were attention entropy and perplexity chosen as cognitive load proxies, and how might alternative measures, e.g., gradient variance?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "zTl7z7n2A5", "forum": "9JxOVBdwNf", "replyto": "9JxOVBdwNf", "signatures": ["ICLR.cc/2026/Conference/Submission3939/Reviewer_esfh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3939/Reviewer_esfh"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3939/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989700702, "cdate": 1761989700702, "tmdate": 1762917102791, "mdate": 1762917102791, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}