{"id": "9pGOTEQdsD", "number": 19509, "cdate": 1758296877253, "mdate": 1759897035298, "content": {"title": "PCA Feature Alignment is Sufficient for Building Graph Foundation Models", "abstract": "Graph foundation models (GFMs) aim to pretrain graph neural networks (GNNs) that can generalize to new graph datasets in a zero-shot manner, requiring little or no additional training. This goal is challenging because graph data collected from diverse domains often exhibit significantly different node features and topological structures, and standard GNNs are sensitive to such variations. Prior efforts either restrict learning to a single domain (e.g., molecular graphs) or rely on heavy auxiliary pipelines that transform raw features into surrogates using large language models (LLMs) or feature-graph constructions. However, these approaches are often computationally expensive or restricted to specific domains.\n\nIn this work, we find that principal component analysis (PCA) is a simple, efficient feature alignment for GFMs. We show that PCA-aligned features satisfy two properties central to zero-shot GFM generalization:  (i) equivalence on identical datasets (identical datasets with only feature dimensions permuted or node order permuted always generalize to invariant or equivalent graph representations) and (ii) representation bounded on latently same datasets (non-identical datasets with same latent space always generate graph representations within bounded distance and prediction error). Building on this alignment method, we develop a Mini-GFM framework that is trained once across multiple datasets; at generalizing time, it only requires PCA alignment of the new dataset and optimization of a shallow, task-specific linear head. Across diverse node- and graph-classification benchmarks, this approach delivers competitive zero-shot performance compared with other baselines while using substantially lower preprocessing cost. These theoretical and empirical results validate the sufficiency of PCA alignment.", "tldr": "", "keywords": ["Graph Neural Networks", "Foundation Models", "Zero-shot Generalization"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/bc16ebdf3954f8abf3add89fc029d632776e99e0.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper focuses on the challenge of zero-shot generalization of Graph Foundation Models (GFMs) across datasets. Addressing issues such as heterogeneous node features, distinct topological structures of graph data from different domains, and the limitations of traditional methods, it proposes to use Principal Component Analysis (PCA) as a feature alignment tool and constructs the Mini-GFM framework. Through experiments on node classification and graph classification tasks across multiple domains, the paper verifies the framework's competitiveness in zero-shot scenarios while reducing preprocessing costs, providing a new approach for efficient generalization of GFMs."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Graph Foundation Models represent an important cutting-edge direction in the field of graph learning.\n\n2. The experiments use 16 datasets for node classification and graph classification across different domains, including both small-scale standard datasets and the large-scale Amazon-2M dataset, showing a relatively rich selection of datasets."}, "weaknesses": {"value": "- The paper proposes that when the original feature dimension D is smaller than the target alignment dimension D’, the feature is repeatedly concatenated until its dimension exceeds D’ for processing. **However, it fails to consider the information redundancy that may be introduced by repeated concatenation of high-dimensional features.**\n\n- Although the paper demonstrates the advantage in training time on the Amazon-2M dataset, it does not analyze the computational complexity of PCA alignment in ultra-large-scale high-dimensional feature graphs (e.g., feature dimension D>10000, number of nodes exceeding 10 million). The core steps of PCA involve the calculation of the feature covariance matrix; when D is extremely large, the storage of the covariance matrix and eigenvalue decomposition will face memory and time bottlenecks. **Such high-dimensional graph data are common in practical industrial scenarios, and the paper does not explain how to solve this efficiency problem.**\n\n- The paper assumes that datasets from different domains share a low-rank latent matrix **H** (Eq. 8), but does not verify the rationality of this assumption through experiments.\n\n- Theorem 1 aims to prove the invariance of PCA to feature permutation. In the proof process, it mentions “**X’ =P_X·X**”, but according to the definition in the previous text, the feature permutation transformation should be “**X’ =X·P_X**” (Eq. 6), and there is **an error in the order of matrix multiplication here**. Additionally, there is a **citation error** in the proof (Line 618 of the paper).\n\n- The paper does not analyze the generalization performance degradation pattern of Mini-GFM when the latent spaces of datasets differ significantly (e.g., molecular graphs and social network graphs), which makes me concerned about its practicality.\n\n- The paper only sets two ablation baselines: \"Repeat\" and \"Message\", and does not conduct a sensitivity analysis on the key parameters of PCA alignment (e.g., the selection of target dimension).\n\n- The paper only verifies node classification and graph classification tasks, and **does not involve common tasks in the field of graph learning such as link prediction and graph generation**.\n\n- The experimental results are not marked with **standard deviations or confidence intervals**, making it impossible to judge the stability of the experimental results."}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "GlNbpVb3Dm", "forum": "9pGOTEQdsD", "replyto": "9pGOTEQdsD", "signatures": ["ICLR.cc/2026/Conference/Submission19509/Reviewer_dqxB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19509/Reviewer_dqxB"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19509/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761832906593, "cdate": 1761832906593, "tmdate": 1762931407608, "mdate": 1762931407608, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper argues for the use of PCA to align the feature space of different graphs, so that a single backbone model can be trained that will inductively generate embeddings for a new graph. These inductively generated embeddings then can be used directly for downstream tasks, such as node/graph classification/regression, and link prediction. This is overall, a novel idea.\nThe paper also presents a supporting theoretical argument for PCA being a good candidate for feature alignment. \nSome evaluation has been done on this idea in this paper, but I find the evaluation severely lacking."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The idea of using simple PCA for inductive feature alignment across datasets is novel.\n- The paper presents theoretical arguments to back the use of PCA."}, "weaknesses": {"value": "- The paper classifies its presented method as \"zero-shot\" when it clearly needs labels to learn a classification/regression head. The term \"inductive\" is more standard to be used in this scenario. \"Zero-shot\" indicates a lack of need for labels to generalize to a new task.\n- Handling scale invariance: The proposed method only handles the scale invariance of the type $SX$, but fails to mention the case $XS$. If this case is not realistic, a textual argument should be made as to why not. \n- Very few evaluations were done, and they do not include any standard deviation measure. For these problems, I would expect a paper to have a results table something like Table 5 in GraphAny.\n- The paper could additionally be improved with an evaluation on the task of link prediction (though my other concerns are far more important than this one).\n- The way of using bold text within table 3 is very different from what is standard. It does not recognize when a simple GNN beats the proposed method. Additionally, the fact that bold is not used for GNN is not mentioned anywhere. This will confuse readers into thinking the proposed methods are always better than a GNN.\n- Overall, the paper spends too much space explaining classic concepts of GCNs and PCA, and too little space on doing actual evaluation. \n\n**Typos**:\n- Line 053 - \"presentations\" -> \"representations\"\n- Line 135 - \"multi\" should be \"multiply\"\n- Linee 158 - \"Node permutation equivalence\" -> \"Node permutation equivariance\" (equivariance is the standard term to use here)"}, "questions": {"value": "- Normalization: Why form of normalization is used? It is not mentioned near line 201."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FtVdmmXshU", "forum": "9pGOTEQdsD", "replyto": "9pGOTEQdsD", "signatures": ["ICLR.cc/2026/Conference/Submission19509/Reviewer_kSxk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19509/Reviewer_kSxk"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19509/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761928152736, "cdate": 1761928152736, "tmdate": 1762931407229, "mdate": 1762931407229, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors focus on addressing the issue of inconsistent feature dimensions across different graph datasets in Graph Foundation Models (GFMs). They propose that Principal Component Analysis (PCA) is sufficient for aligning graph features. Based on this, they introduce a simple GFM method to achieve cross-dataset generality."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- Graph foundation models is a valuable research area.\n- Investigating how to align features across different graph datasets is worthwhile.\n- Restating the properties of the PCA holds some value."}, "weaknesses": {"value": "- The theoretical content appears somewhat dated or previously established. In my view, the two properties of PCA emphasized in the paper (\"Dimension Permutation Invariance\" and \"Node Permutation Equivalence\") are already well-recognized in the academic community. As noted in S3, the paper's contribution is primarily a restatement of PCA's properties rather than a new proof.\n- In my opinion, the theory presented does not adequately support the claim that \"PCA Feature Alignment is Sufficient for Building Graph Foundation Models.\" The proposed theory relies on Assumption 3, which posits that different graph datasets share latent features. However, this assumption may not hold for graph datasets. For instance, some graph datasets have no feature, which clearly does not satisfy Equation 8.\n- The experiments conducted in the paper seem insufficient and could benefit from greater rigor. For a graph foundation model, it would be appropriate to test the proposed method in few-shot scenarios. The current experimental setup is not typical for GFMs (e.g., the division of pre-training and testing graph data, as well as the data split ratios).\n- The authors claim that PCA can align graph features. To further validate this view, I suggest supplementing experiments that transfer from citation datasets to molecular datasets (such as BBBP, Tox21, QM9, ZINC) to further substantiate this view. This would be particularly valuable in strengthening the argument.\n- The proposed method lacks novelty. Existing works already employ PCA to unify features across different graph data, such as RiemannGFM [1], AnyGraph [2], All-In-One [3], and others.\n- Existing work, such as FUG [4], has already analyzed the relationship between PCA and graph feature unification. This paper could benefit from discussing them.\n\n[1] RiemannGFM: Learning a Graph Foundation Model from Riemannian Geometry, WWW-25.\n\n[2] AnyGraph: Graph Foundation Model in the Wild, Arxiv-24\n\n[3] All in One: Multi-task Prompting for Graph Neural Networks, KDD-23\n\n[4] FUG: Feature-Universal Graph Contrastive Pre-training for Graphs with Diverse Node Features, NeurIPS-24"}, "questions": {"value": "Please see the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "JPxgKwkLKe", "forum": "9pGOTEQdsD", "replyto": "9pGOTEQdsD", "signatures": ["ICLR.cc/2026/Conference/Submission19509/Reviewer_gzW1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19509/Reviewer_gzW1"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19509/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761934938061, "cdate": 1761934938061, "tmdate": 1762931406749, "mdate": 1762931406749, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper directly uses principal component analysis to align feature from different graphs and proposes the Mini-GFM framework. The method is validated across multiple datasets, demonstrating its effectiveness. Compared to existing methods, the proposed method is efficient and scalable for large graph data."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "S1. The solved problem is valuable.\n\n﻿\nS2. The proposed method is validated on diverse datasets, including both node and graph classification tasks.\n\n﻿\nS3. The authors provide a detailed time complexity analysis."}, "weaknesses": {"value": "W1. The proposed method is too simple and lacks novelty. Many existing works (e.g., MDGFM) have already used PCA to align features across different datasets. \n\nW2: The experimental evaluation lacks comparison with several state-of-the-art graph foundation models, such as MDGPT and MDGFM.\n\nW3. The paper lacks few-shot learning experiments. Few-shot generalization is an important capability for graph foundation models."}, "questions": {"value": "Q1. Why does the proposed method outperform the original fully trained GNN on some datasets (e.g., KarateClub)? \n\nQ2. How does the proposed method perform when pre-trained on only a single dataset? Can the proposed method truly acquire extensive graph knowledge through multi-domain pre-training?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "vKGLEXlzc9", "forum": "9pGOTEQdsD", "replyto": "9pGOTEQdsD", "signatures": ["ICLR.cc/2026/Conference/Submission19509/Reviewer_sfdt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19509/Reviewer_sfdt"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission19509/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761988345541, "cdate": 1761988345541, "tmdate": 1762931406372, "mdate": 1762931406372, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}