{"id": "9qXMe8XKvN", "number": 2199, "cdate": 1757023926052, "mdate": 1762792058355, "content": {"title": "SEGMENTED CONFIDENCE SEQUENCES AND MULTISCALE ADAPTIVE CONFIDENCE SEGMENTS FOR ANOMALY DETECTION IN NONSTATIONARY TIME SERIES", "abstract": "As time series data become increasingly prevalent in domains such as manufacturing, IT, and infrastructure monitoring, anomaly detection must adapt to nonstationary environments where statistical properties shift over time. Traditional static thresholds are easily rendered obsolete by regime shifts, concept drift, or multi-scale changes. To address these challenges, we introduce and empirically evaluate two novel adaptive thresholding frameworks: Segmented Confidence Sequences (SCS) and Multi-Scale Adaptive Confidence Segments (MACS). Both leverage statistical online learning and segmentation principles for local, contextually sensitive adaptation, maintaining guarantees on false alarm rates even under evolving distributions. Our experiments across Wafer Manufacturing benchmark datasets show significant F1-score improvement compared to traditional percentile and rolling quantile approaches. This work demonstrates that robust, statistically principled adaptive thresholds enable reliable, interpretable, and timely detection of diverse real-world anomalies.", "tldr": "we introduce and empirically evaluate two novel adaptive thresholding frameworks: Segmented Confidence Sequences (SCS) and Multi-Scale Adaptive Confidence Segments (MACS).", "keywords": ["adaptive", "threshold", "SCS", "MACS"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/dc03b5dd373b2bd8d85679f17381927cc9f4b61d.pdf", "supplementary_material": ""}, "replies": [{"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "TOvshn5Nfu", "forum": "9qXMe8XKvN", "replyto": "9qXMe8XKvN", "signatures": ["ICLR.cc/2026/Conference/Submission2199/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2199/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762792057474, "cdate": 1762792057474, "tmdate": 1762792057474, "mdate": 1762792057474, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}