{"id": "A8UKo53z3R", "number": 22827, "cdate": 1758335912960, "mdate": 1763566004630, "content": {"title": "WFDroneBench: A Benchmark for Sensor Placement and Drone Routing for Wildfire Detection", "abstract": "Increasingly frequent and severe wildfires threaten ecosystems, public health, and infrastructure. Early detection is vital but limited by existing monitoring systems. Drones offer mobile, real-time coverage, but optimizing sensor placement and drone routing in dynamic fire zones remains challenging. To address this, we in- troduce WFDroneBench, an open-source Python benchmarking library for early wildfire detection that integrates machine-learned risk maps with optimization- based deployment strategies for sensors, charging stations, and drones. It evaluates risk maps, optimization strategies, and monitoring equipment using standardized metrics and realistic wildfire simulations. The framework supports benchmarking across predictive and decision-making components: machine learning researchers can assess risk models and operations research experts can compare routing strate- gies. WFDroneBench includes 7746 scenarios across 49 locations, built from historical ignitions, real-world wildfire risk maps, and simulated fire spread, along with two ground detector and four drone routing strategies. Our experiments show that risk-aware strategies – Team Orienteering Problem (TOP) and Max-Coverage – significantly outperform other baselines when risk maps are sufficiently accurate, with TOP achieving the fastest detection on the most difficult fires. We further find that risk-aware static infrastructure helps even under an imperfect riskmap and drone-based detection outperforms ground sensors. Finally, our results reveal two key open challenges: (i) detecting small fires rapidly and reliably, and (ii) improv- ing risk-map prediction, where the gap between ground-truth ignition patterns and available risk maps highlights a significant opportunity for ML innovation.", "tldr": "Dataset and benchmarking environment for drone routing and sensor placement strategies in wildfire detection", "keywords": ["Wildfire", "Optimization", "benchmark", "dataset"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2b6613d97241b615ca78ff378044d90fd079ae23.pdf", "supplementary_material": "/attachment/69f9faee629890d13922b758fa87975281474c19.zip"}, "replies": [{"content": {"summary": {"value": "The authors have a good idea in trying to develop a risk-based approach to determining wildfire fighting strategies, but this paper is trying to do too much. It was very hard to follow."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The motivation is relevant and significant."}, "weaknesses": {"value": "*The paper was hard to follow, the authors need to focus either on 1) validating whether their WFDroneBench workflow supports four key stakeholder groups as they claim, or 2) their benchmarking (including validating their semi-synthetic wildfire benchmark dataset.) For either case, they must get feedback from actual firefighters that their approach is actually effective."}, "questions": {"value": "What research questions were the experiments answering?\n\nHow can firefighters know that your risk estimation is in alignment with actual operations?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "HjYx9Q4sBe", "forum": "A8UKo53z3R", "replyto": "A8UKo53z3R", "signatures": ["ICLR.cc/2026/Conference/Submission22827/Reviewer_7yan"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22827/Reviewer_7yan"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22827/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761777195164, "cdate": 1761777195164, "tmdate": 1762942402057, "mdate": 1762942402057, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes an open-source benchmark WFDroneBench for early fire detection, incorporating risk map, deployment strategies of ground equipment and drone routing strategies. WFDroneBench is modular and supports separate research on different system components. In addition, the paper curates a wildfire dataset containing 7746 scenarios. This paper evaluates and compares different wildfire detection strategies in its benchmark."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Good motivation. Proactive wildfire detection proves valuable in wildfire research.\n2. The modular workflow allows the system’s components to support diverse research objectives, enhancing the extensibility of this benchmark.\n3. The paper is well-written and provides a detailed introduction to the proposed benchmark."}, "weaknesses": {"value": "1. The experiment results are inconsistent with the discussion conclusions:\n* In Table 2, the UniCov drone routing strategy achieved the optimal detection rates and comparable detection times compared to TOP and Max-Cov, which contradicts the conclusion in line 413.\n* In Table 2, compared with Max-Cov, UniCov achieved better detection rate and detection time simultaneously under the Rondom Sensor Strategy. The same experimental result is shown in sub-scenarios such as Slow Big and Fast Big, which contradicts the conclusion in line 418. \n* In Table 2, compared with Uni-Cov, a significant decline in the detection rates of TOP and Max-Cov is observed, especially in Slow Small and Fast Big scenarios. The negative impact on detection rates may outweigh the benefits of the risk map.\n* When changing from the GT dynamic map to the BP risk map, the performance of TOP has declined, especially in the Fast Big scenario. This reult cannot prove robustness proposed in line 431.\n* In Table 3, Max-Cov outperforms Uniform Coverage in detection rate, which contradicts the conclusion in line 436.\n2. With respect to the proposed dataset, additional quantitative analyses of data distribution and data quality are recommended."}, "questions": {"value": "It would be valuable to vary the numbers of ground stations, charging stations, and drones to conduct comparative experiments for exploring optimal resource allocation."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "0lJuTb1vzT", "forum": "A8UKo53z3R", "replyto": "A8UKo53z3R", "signatures": ["ICLR.cc/2026/Conference/Submission22827/Reviewer_MC1z"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22827/Reviewer_MC1z"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22827/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761913103754, "cdate": 1761913103754, "tmdate": 1762942401804, "mdate": 1762942401804, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a new benchmarking framework, WFDroneBench, for early wildfire detction. It integrates a wide range of scenarios and locations based on historical ignition data and physics-based spread simulations. Hereby, the authors aim to provide a benchmark that supports the interests of multiple stakeholders and viewpoints, covering, e.g., the detection, drone allocation, and mechanical engineering decisions. In their experiments, they show the performance of different strategies in sensor placement and drone routing in wildfire detection."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is written in a very clear and concise way. It is easy to follow the proposed ideas and setup of the benchmark.\n- WFDroneBench allows evaluating multiple important factors of the wildfire detection tasks, such as charging station and ground sensor placements, on top of the drone operations themselves. Hence, a holistic evaluation of strategies can be obtained.\n- The benchmark is equipped with a selection of routing and sensor placement baselines to compare with."}, "weaknesses": {"value": "- While the evaluations consider different strategies, only a single hardware setup is demonstrated. Showing additional drone hardware configurations would support the claims about meeting the needs of, e.g., mechanical engineers, as claimed in Figure 1.\n- While the included strategies for drone routing and sensor placement act as a baseline (e.g., uniform coverage, brownian motion), the experiments section would be enhanced significantly by incorporating other, state-of-the-art drone routing approaches.\n- The evaluation of the benchmark focuses on the rate of fires detected in under 12 hours (Table 2, 3) with varying sensor placement and routing. It seems like the proposed utility of the benchmark for policy makers and mechanical engineers seems underexplored by the manuscript."}, "questions": {"value": "- In line 471, it is mentioned that environmental factors such as wind and temperature are not considered in the evaluation of the drones' performance. Since these factors impact the spread of wildfires, and may be useful for tasks such as routing, do the scenarios in the benchmark contain these informations, or is their inclusion entirely up to future work?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Q6It8ZhnDw", "forum": "A8UKo53z3R", "replyto": "A8UKo53z3R", "signatures": ["ICLR.cc/2026/Conference/Submission22827/Reviewer_8HFm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22827/Reviewer_8HFm"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22827/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761951528263, "cdate": 1761951528263, "tmdate": 1762942401517, "mdate": 1762942401517, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces WFDroneBench, an open-source benchmark and simulation framework that helps researchers and engineers test and compare wildfire detection strategies. The benchmark is extensively and useful, using real ignition data and realistic fire spread simulations. Experiments show that risk-aware routing strategies — especially TOP and Max-Coverage — detect fires faster and more effectively than random or uniform approaches. Drones outperform stationary sensors by a large margin. However, the success of these strategies depends heavily on having accurate and up-to-date risk maps."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The benchmark appears to be well executed and comprehensive.\n\n1. Wildfires are a critical global issue, and early detection is both societally impactful and technically challenging. Thus a benchmark for this task is likely going to be very useful with the rise in global warming.\n2. Glad to see that the benchmark would be completely open-source and has an associated library and toolkit, hopefully would be used to explore this clearly large problem space.\n3. The experiments evaluate multiple baselines under consistent conditions, including both static and dynamic risk maps. The authors appear to have put effort in constructing reasonable baselines."}, "weaknesses": {"value": "1. The work is primarily a benchmark, not a new algorithmic contribution. The routing formulations are not conceptually new. Reinforcement learning or imitation learning methods are only mentioned as future work. Including even one such baseline would make the benchmark more forward-looking.\n2. The text occasionally reads more like a system report — it’s dense, with many details about parameters and datasets but less emphasis on insights.\n3. Relevance to ICLR is low. It fits better in a systems, applied AI, or robotics venue than a core learning venue. Please comment on why this work is relevant for this venue."}, "questions": {"value": "Please clarify my questions in weakness. In general, the paper is well executed but doesn't offer many insights into the problem itself and could use some experiments which illuminate open problems in this domain which would improve the benchmark."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "XnfyFDRSw9", "forum": "A8UKo53z3R", "replyto": "A8UKo53z3R", "signatures": ["ICLR.cc/2026/Conference/Submission22827/Reviewer_6G5W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22827/Reviewer_6G5W"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22827/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761952954514, "cdate": 1761952954514, "tmdate": 1762942401286, "mdate": 1762942401286, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}