{"id": "AbEpaD30zV", "number": 23543, "cdate": 1758345201732, "mdate": 1763505168179, "content": {"title": "Farm-Scale Autonomous Welfare Monitoring in Precision Livestock: A Systematic Review of Robotics and Multimodal AI with an Emphasis on the Lab-to-Farm Deployment Gap", "abstract": "While breakthroughs in autonomous robotics and multimodal artificial intelligence (AI) promise continuous, real-time monitoring for precision livestock farming, their practical on-farm application faces significant limitations, revealing a critical lab-to-farm deployment gap. This deployment gap is rooted in fundamental challenges relevant to the embodied AI community: poor model generalization, sim-to-real fragility, and the absence of standardized validation benchmarks. The primary objective of this systematic review is to highlight state-of-the-art knowledge on these technologies to understand and bridge this gap, proposing a path forward that benefits both agricultural practice and on-farm research. From a pool of over 900 articles reviewed on autonomous navigation and AI-driven analytics, we systematically selected 33 studies to propose recommendations for adopting farm-scale autonomous monitoring in precision livestock. Our review reveals that while foundational technologies are well-established, research remains fragmented and often limited to laboratory simulations or small, single-farm field trials. Based on these findings, we propose a deployment-oriented roadmap with recommendations for developing integrated, robust, and scalable systems. Furthermore, we pinpoint a critical deficiency, that is, the lack of a standardized learning representation (ontology/schema) for collected welfare insights. This deficiency prevents the creation of reproducible datasets for the embodied AI community, hindering the development of truly robust and generalizable models for livestock welfare.", "tldr": "We systematically reviewed autonomous cattle monitoring and found that the key challenge is no longer developing foundational technology, but ensuring it can be reliably and scalably deployed on real farms.", "keywords": ["precision livestock farming", "dairy cattle", "animal welfare monitoring", "autonomous navigation", "computer vision", "multimodal AI", "edge computing", "technology adoption", "systematic review", "welfare representation learning"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/247972e5f183b45e01dd9ee38205684edd5539f5.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents a systematic review of 33 studies on autonomous robotics and multimodal AI for livestock welfare monitoring. It highlights the “lab-to-farm” deployment gap and proposes a roadmap for scaling autonomous systems to real-world agricultural environments. The paper claims novelty in synthesizing three domains i.e. robotic autonomy, welfare analytics, and multimodal decision systems, and emphasizes the need for standardized learning representations of welfare data."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "•\tComprehensive coverage: Excellent breadth across robotics, AI, and precision livestock.\n\n•\tClarity: Writing, structure, and visual presentation are top-tier for a review paper.\n\n•\tRelevance: The lab-to-farm gap framing is compelling and directly addresses a real deployment issue.\n\n•\tEthical awareness: The discussion of bias, privacy, and human-in-the-loop design is nuanced and appropriate."}, "weaknesses": {"value": "•\tShallow synthesis: Despite impressive citations, the paper mostly paraphrases existing surveys; it doesn’t push new theoretical or practical insights.\n\n•\tOverclaiming novelty: The “standardized learning representation” proposal lacks implementation detail or validation, it is more a vision statement than contribution.\n\n•\tNarrative bias: The authors admit to potential subjectivity; without preregistration or inter-rater validation, the “systematic” label is generous.\n\n•\tNo empirical backbone: No meta-analysis, quantitative trend, or benchmarking data—makes the conclusions feel anecdotal."}, "questions": {"value": "1.\tHow exactly do the authors define and operationalize a “standardized learning representation”?\n\n2.\tCould the authors provide even a minimal quantitative trend (e.g., publication frequency by modality)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4FtclBJhVr", "forum": "AbEpaD30zV", "replyto": "AbEpaD30zV", "signatures": ["ICLR.cc/2026/Conference/Submission23543/Reviewer_vfjV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23543/Reviewer_vfjV"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission23543/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761147311226, "cdate": 1761147311226, "tmdate": 1762942705677, "mdate": 1762942705677, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a systematic review of autonomous robotics and multimodal AI for dairy cattle welfare monitoring, arguing that a persistent “lab-to-farm” deployment gap, rather than a lack of core algorithms, limits the real-world impact. From ~900 records, the authors include 33 studies (2021–2025) spanning mobile autonomy, sensor fusion, and welfare analytics, and synthesize three themes: autonomy in farm environments, AI for welfare analytics, and multimodal fusion/decision support. The review highlights recurring barriers, sim-to-real fragility, poor cross-farm generalization, edge-compute/latency constraints, and the lack of standardized validation and benchmarks. It proposes a deployment roadmap emphasizing multi-farm datasets, edge-aware end-to-end systems, human-in-the-loop verification, and, its most distinctive claim, the need for a standardized, learnable representation of welfare insights. The methodology follows a PRISMA-style flow and provides search strings and high-level extraction tables, but it stops short of conducting a quantitative meta-analysis due to heterogeneity. Limitations include non-preregistration, potential selection bias, and uneven reporting across the included studies."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper thoughtfully integrates robotics autonomy, perception/sensor fusion, and animal-welfare analytics, providing an accessible systems-level view of what it would take to go from prototype to farm-scale deployment. \n- The focus on edge budgets, latency, and human-in-the-loop workflows is practical and valuable for moving beyond point solutions to integrated systems. \n- The call for multi-farm benchmarks and standardized validation, plus the emphasis on translating welfare signals into learnable, reusable representations, is a useful organizing agenda for the community."}, "weaknesses": {"value": "- As a primarily narrative survey without a new dataset/benchmark, concrete representation standard, or empirical evaluation, the contribution feels closer to an application-domain. The roadmap is persuasive but not instantiated (no released schema/ontology, no prototype benchmark), which weakens its novelty. \n- Although the PRISMA diagram and search string are provided, the inclusion set appears to include non-dairy or only tangentially relevant works (e.g., pipe inspection, general indoor robotics), which conflicts with the stated eligibility focusing on dairy welfare; this raises questions about the consistency of screening and the construct validity of the synthesis. \n- The paper’s most distinctive proposal, “a standardized learning representation for welfare insights”, remains aspirational: no concrete schema, ontology, labeling protocol, or exemplar encodings are given, and key targets (e.g., <100 ms, <5 W) are mentioned without justification or references to measured deployments. \n- There is no comparative analysis of metrics, failure modes, or cross-farm generalization deltas; many cited items are small-scale, theses, or narrow conference demos. Without harmonized metrics or a bias assessment, it is challenging to gauge the strength of evidence behind the three themes and the roadmap."}, "questions": {"value": "- Can the authors provide a first-cut learnable representation (schema + example annotations) for welfare events (e.g., lameness alerts) that links raw multimodal signals, contexts (farm/breed/season), and human adjudications, perhaps as a small, public exemplar to operationalize the proposal? \n- How were non-dairy or infrastructure-only robotics papers adjudicated against the inclusion criteria? Please clarify the rule that allowed such works and report sensitivity analyses when excluding them."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4MzaPc4G0N", "forum": "AbEpaD30zV", "replyto": "AbEpaD30zV", "signatures": ["ICLR.cc/2026/Conference/Submission23543/Reviewer_nRG5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23543/Reviewer_nRG5"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission23543/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761987335124, "cdate": 1761987335124, "tmdate": 1762942705408, "mdate": 1762942705408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper reviews 33 studies published between 2021 and 2025 related to AI-empowered livestock farming. The main message of this paper is to develop models capable of generalizing to versatile farms, which, in this reviewer's opinion, lacks a strong message for the community. No experimental or quantitative results are reported."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "- AI-empowered farming is an important topic.\n- The review covers recent studies including those published in 2025."}, "weaknesses": {"value": "1. Scope of review is narrow and not enough attractive for ICLR participants.\n\nThis review paper summarizes precision livestock farming, which is an AI application but not very fundamental. This reviewer believes a review paper at a top-tier conference should provide significant insights for the entire community. From this perspective, the topic is not relevant to most participants and lacks attractiveness.\n\n2. No critical insights are provided.\n\nThe content discusses related machine learning techniques and hardware superficially. The generalizability of learning-based methods beyond a specific farm is not a novel message. In this sense, this reviewer finds no novel insights in this paper.\n\n3. The target papers are unnecessarily limited to 2021-2025.\n\nThis reviewer found no justification for limiting the target to papers published after 2021."}, "questions": {"value": "1. Is there a reason to limit the target to papers after 2021? Are there any prior reviews covering earlier studies?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "N2nrBXzru4", "forum": "AbEpaD30zV", "replyto": "AbEpaD30zV", "signatures": ["ICLR.cc/2026/Conference/Submission23543/Reviewer_4TgM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23543/Reviewer_4TgM"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission23543/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761995704496, "cdate": 1761995704496, "tmdate": 1762942705098, "mdate": 1762942705098, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors provide a systematic review of the state-of-the-art in farm-scale autonomous cattle welfare monitoring. The studies emphasize on robotics and multimodal autonomous (or AI) solutions in precision livestock farming/agriculture robots. The review notes that a lack of systems and integration perspective in research  efforts hinders the effectiveness in practical scalable deployments. The authors perform a narrative review due to the fragmentation of the research space. The authors propose a deployment-oriented roadmap to close the gap from lab-to-farm disconnect."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1. The review provides a holistic understanding of constraints that affect the research in PLF - fragmentation of data,  economic and intellectual property barriers to help frame actionable solutions in livestock welfare monitoring.\n2. The authors identify critical new sensing methodologies such as facial recognition and behavior monitoring, thermal imagery, edge computing etc along with autonomous navigation."}, "weaknesses": {"value": "1. The review does not benchmark or summarize standard approaches in sim-to-real problems. A discussion of benchmarks, or specific integrations with multimodal sensors for real-time policy adaptation would be beneficial.\n2. Similarly, a discussion involving sensors, autonomous strategies, data collection, and system integration in detail would be beneficial to explore."}, "questions": {"value": "As the review highlights that having standardized data for farms would help with the research community, and there is a significant gap in sim-to-real transfer, what are your thoughts about procedural/generative AI for data standardization and are have there been any prior-works in any relevant field that show success in sim-to-real? Perhaps, manipulation from the robotics community would be an inspiration?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "jBwrqqWy9u", "forum": "AbEpaD30zV", "replyto": "AbEpaD30zV", "signatures": ["ICLR.cc/2026/Conference/Submission23543/Reviewer_VwuL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23543/Reviewer_VwuL"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission23543/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762158615261, "cdate": 1762158615261, "tmdate": 1762942704224, "mdate": 1762942704224, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}