{"id": "ABjaSsrYPD", "number": 3705, "cdate": 1757499809312, "mdate": 1759898074192, "content": {"title": "Concept Insertion Success over Time in Diffusion Models through Prompt-Conditioned Interventions", "abstract": "Diffusion models are usually evaluated by their final outputs, gradually denoising random noise into meaningful images. \nYet, generation unfolds along a trajectory, and understanding this dynamic process is crucial for explaining how controllable, reliable, and predictable these models are in terms of their success/failure modes. In this work, we ask the question: *when* does noise turn into a specific concept (e.g., age) and lock in the denoising trajectory? We propose PCI Prompt-Conditioned Intervention) to study this question. PCI is a training-free and model-agnostic framework for analyzing concept dynamics through diffusion time. The central idea is the analysis of *Concept Insertion Success* (CIS), defined as the probability that a concept inserted at a given timestep is preserved and reflected in the final image, offering a way to characterize the temporal dynamics of concept formation. Applied to several state-of-the-art text-to-image diffusion models and a broad taxonomy of concepts, PCI reveals diverse temporal behaviors across diffusion models, in which certain phases of the trajectory are more favorable to specific concepts even within the same concept type. These findings also provide actionable insights for text-driven image editing, highlighting *when* interventions are most effective without requiring access to model internals or training. Altogether, we establish temporal concept analysis as a new perspective for understanding and steering diffusion models.", "tldr": "We propose Prompt-Conditioned Intervention (PCI), a framework that reveals how and when concepts can be inserted into diffusion trajectories, showing that timing critically shapes concept success across contexts and models.", "keywords": ["temporal analysis", "concept emergence", "diffusion models", "explainability"], "primary_area": "interpretability and explainable AI", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/668fd04a185a2016ad3c9d53ca9987e628ef8c1a.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Prompt-Conditioned Intervention (PCI) to study when a semantic concept becomes established during the denoising process of diffusion and flow models. By switching prompts at different timesteps and using a vision-language model to check concept presence, the authors derive a Concept Insertion Success (CIS) curve that quantifies concept insertability over time. Experiments on Stable Diffusion 2.1, SDXL, and SD 3.5 show that global scene factors appear earlier, human attributes emerge mid-trajectory, and accessories lock in later. The study also demonstrates a simple text-driven image editing application, suggesting that edits are most effective when CIS is between 0.5 and 0.7."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Exploring when concepts emerge along the diffusion timeline offers an interesting and novel temporal perspective on concept formation in generative models.\n\n2. The paper is clearly written and easy to follow, with well-structured figures and explanations that make the methodology and findings accessible even to non-experts."}, "weaknesses": {"value": "1. Narrow task scope and unclear practical significance (main concern).\nThe paper leverages PCI and CIS to reveal that timing, model choice, and context influence concept insertion, but the exploration remains confined to a single downstream application—text-driven image editing—and primarily relies on qualitative demonstrations. Section 5 and Figure 5 (as well as Appendix Figure 11) merely show edits guided by CIS thresholds and report the empirical finding that the 0.5–0.7 probability range offers a “balanced trade-off.” However, the study does not substantiate why knowing that certain concepts lock in earlier or later yields quantifiable benefits in practice or theory—such as reducing trial-and-error, improving editing stability, strengthening concept binding, or informing training/scheduler design. Moreover, focusing exclusively on the [0.5, 0.7] CIS window without connecting it to broader temporal or theoretical frameworks limits the work’s contribution to understanding “when timing matters” beyond this heuristic range.\n\n2. Strong reliance on a single LVLM-based VQA judge with potential coupling bias.\nThe CIS measure depends entirely on a single VQA-style Large Vision–Language Model (Qwen-VL-3B) for concept detection. Although Appendix A.4.1 includes a brief comparison with a 7B variant, there is no human annotation calibration or multi-judge agreement analysis. The evaluation also remains binary (concept present/absent), which cannot capture concept strength, spatial accuracy, or attribute binding, potentially conflating weak or erroneous detections with genuine insertions. These factors introduce uncertainty into the CIS curve and may distort the estimated locking points.\n\n3. Editing experiments lack strong baselines and quantitative comparison."}, "questions": {"value": "See weakness1."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "mmJ1BSjqlH", "forum": "ABjaSsrYPD", "replyto": "ABjaSsrYPD", "signatures": ["ICLR.cc/2026/Conference/Submission3705/Reviewer_uBmP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3705/Reviewer_uBmP"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3705/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761396508416, "cdate": 1761396508416, "tmdate": 1762916935915, "mdate": 1762916935915, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces PCI, a training-free framework for analyzing when concepts become locked into the generation trajectory of text-to-image diffusion models. The core method involves switching prompts at different timesteps during denoising: starting with a neutral base prompt and then introducing a concept-augmented prompt at various intervention points. The authors define CIS as the probability that a concept inserted at a given timestep appears in the final image, evaluated using a VLM."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- PCI is training-free, model-agnostic, and requires no access to model internals, making it broadly applicable and easy to implement across different diffusion architectures.\n- The seed resampling strategy with optional negative guidance ensures that base prompts remain neutral with respect to target concepts, addressing a potential confound that could undermine the analysis.\n- While the core idea of prompt switching is conceptually straightforward, the paper addresses a dimension that prior interpretability work has largely overlooked: the temporal evolution of concepts during generation. Through thorough experimentation across diverse concept taxonomies, the study reveals actionable patterns (e.g., global factors lock early, human properties mid-trajectory, accessories late) that provide valuable insights, filling an important gap in understanding diffusion model dynamics."}, "weaknesses": {"value": "- The paper primarily focuses on CIS as the main metric for evaluating when concepts can be inserted. However, successful concept insertion does not necessarily mean the generated image maintains fidelity to the original intent or preserves other important content from the base prompt. The trade-off between concept insertion success and overall content preservation is not systematically quantified beyond qualitative observations in the editing examples. A more comprehensive analysis could include metrics that measure how much the image deviates from the base generation when concepts are inserted at different timesteps, helping users better understand the full cost-benefit landscape of intervention timing.\n- The prompts studied in this work are relatively simple and focused (e.g., \"a realistic photo of a person,\" \"a landscape\"). How well do the insights and CIS patterns generalize to more complex, compositional prompts with multiple objects, relationships, and attributes? For instance, if editing a complex scene like \"a young woman wearing sunglasses sitting on a red chair in a sunlit café,\" would the optimal insertion times for individual concepts (age, accessories, color, setting) still follow the patterns observed with simpler prompts, or would the interactions between multiple concepts shift the temporal dynamics?"}, "questions": {"value": "- if the inserted concept is very abstract and cannot be easily fit in the categories studied in this work, how can a user find the best inserting point without trying every possible timestep?\n- what if the VLM cannot evaluate the abstract concept, how do you solve this? Could you discuss failure modes where VQA might struggle (e.g., highly subjective concepts like \"elegance\" or \"tranquility\") and potential mitigation strategies?\n- The current analysis focuses on inserting one concept at a time. How would CIS behave when multiple concepts need to be inserted? Would their optimal insertion times interfere with each other?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WBaNC6kb4g", "forum": "ABjaSsrYPD", "replyto": "ABjaSsrYPD", "signatures": ["ICLR.cc/2026/Conference/Submission3705/Reviewer_Qc2X"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3705/Reviewer_Qc2X"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3705/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761801412744, "cdate": 1761801412744, "tmdate": 1762916935656, "mdate": 1762916935656, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies how individual concepts in a text prompt influence the diffusion generation process over time. The proposed method, Prompt-Conditioned Intervention (PCI), provides an intuitive mechanism to probe when a specific concept meaningfully affects generation. In addition, the paper introduces the Concept Insertion Success (CIS) metric to quantitatively capture the temporal dynamics of concept influence during diffusion. Together, PCI and CIS offer a useful framework for analyzing how textual concepts guide the image generation trajectory."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- The idea behind PCI and CIS are intuitive and well-motivated, offering a practical way to examine concept influence in diffusion models.\n- The manuscript is clearly written and the main claims are clearly communicated."}, "weaknesses": {"value": "- The analysis is primarily focuses on isolated concept influence (while the interactions between concepts and contexts are mentioned). Further exploration of interactions between concepts and broader prompt context would enrich the contributions.\n- While PCI and CIS measure the latest timestep at which a concept can be successfully inserted, this does not directly indicate when the model begins to encode the concept. Studying the earliest insertion or concept disappearance behavior would strengthen the temporal interpretation of the findings.\n- Sensitivity analysis to variations in prompt phrasing and initial noise seeds is limited (as it is averaged over subcategory of concepts). Investigating robustness across seeds and prompt variations would help clarify the generality of PCI/CIS."}, "questions": {"value": "In addition to insertion, could PCI and CIS be extended to analyze the concept removal or replacement dynamics? For example, identifying the latest timestep at which removing a concept no longer changes the generated output."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "f5xXvsLgcf", "forum": "ABjaSsrYPD", "replyto": "ABjaSsrYPD", "signatures": ["ICLR.cc/2026/Conference/Submission3705/Reviewer_V3XN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3705/Reviewer_V3XN"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3705/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761894182294, "cdate": 1761894182294, "tmdate": 1762916935308, "mdate": 1762916935308, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the denosing dynamics of concept formation in diffusion models, focusing on when specific concepts (e.g., age) emerge and stabilize during the denoising trajectory. It proposes PCI (Prompt-Conditioned Intervention), a training-free and model-agnostic framework that analyzes Concept Insertion Success (CIS) to study how concepts evolve over diffusion time.  Experiments on state-of-the-art text-to-image diffusion models reveal some insights about diverse temporal behaviors for concept formation."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The presentation of figures is great and easy to understand.\n- The math notations in this paper are self-contained and well-defined.\n- The paper writing is easy to follow.\n- The idea of Prompt-Conditioned Intervention is cool.\n- The proposed method is straightforward."}, "weaknesses": {"value": "- I am quite disappointed that, although this paper uncovers some interesting phenomena regarding denoising trajectories, the final method does not stand out significantly. This is my main concern.\n- PCI is also heavily based on the performance of the adopted MLLM (like Qwen-3B).\n- The evaluation is only based on SD-series models. How about FLUX and other SoTA models?\n- Some wrong citation formats are used in the paper.\n- I have to say that the performance of image editing is not so well in Fig. 5. It seems that the resultant methods didn't work well."}, "questions": {"value": "Please see the section of weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "p50PieC5dX", "forum": "ABjaSsrYPD", "replyto": "ABjaSsrYPD", "signatures": ["ICLR.cc/2026/Conference/Submission3705/Reviewer_RMvL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3705/Reviewer_RMvL"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3705/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761911655571, "cdate": 1761911655571, "tmdate": 1762916934216, "mdate": 1762916934216, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}