{"id": "AdfEHMueyc", "number": 17324, "cdate": 1758274717335, "mdate": 1759897182174, "content": {"title": "Evolving Embodied Intelligence: Graph Neural Network–Driven Co-Design of Morphology and Control in Soft Robotics", "abstract": "The intelligent behavior of robots does not emerge solely from control systems, but from the tight coupling between body and brain—a principle known as embodied intelligence. Designing soft robots that leverage this interaction remains a significant challenge, particularly when morphology and control require simultaneous optimization. A significant obstacle in this co-design process is that morphological evolution can disrupt learned control strategies, making it difficult to reuse or adapt existing knowledge. We address this by develop a Graph Neural Network-based approach for the co-design of morphology and controller. Each robot is represented as a graph, with a graph attention network (GAT) encoding node features and a pooled representation passed through a multilayer perceptron (MLP) head to produce actuator commands or value estimates. During evolution, inheritance follows a topology-consistent mapping: shared GAT layers are reused, MLP hidden layers are transferred intact, matched actuator outputs are copied, and unmatched ones are randomly initialized and fine-tuned. This morphology-aware policy class lets the controller adapt when the body mutates. On the benchmark, our GAT-based approach achieves higher final fitness and stronger adaptability to morphological variations compared to traditional MLP-only co-design methods. These results indicate that graph-structured policies provide a more effective interface between evolving morphologies and control for embodied intelligence.", "tldr": "GNN-Based Co-Design of Morphology and Control of Soft Robotics", "keywords": ["GNN", "Co-design", "Embodied Intelligence", "Soft Robotics", "Transfer learning"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e268d59ef85cbdd321356dbdce0c7685c7a43d03.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The authors propose a graph attention controller — and a means of controller inheritance — in the context of robot morphology evolution. The authors claim that this method remedies disruptions in the reuse and adaptation of controllers as morphologies change during evolution. They evaluate their method and claims in the EvoGym environment."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The problem of simultaneously optimizing morphology and control is a longstanding unsolved problem. This is an important scientific and engineering problem and highly relevant to ICLR."}, "weaknesses": {"value": "No form of hypothesis testing was reported (only mean fitness + stdev curves), but as far as I can tell, in all but one experiment, there was no difference with and without weight inheritance. In the one case where weight inheritance might affect fitness, there was no difference with and without the proposed method.\n\nMore importantly, there is no evidence that design optimization occurred. And there is no evidence that weights were inherited across different designs.\n\nFinally, the scholarship is poor. I expected to see (at the very least some subset of) the following literature referenced/discussed:\n\n1. Huang et al. One policy to control them all: Shared modular policies for agent-agnostic control. ICML (2020).\n2. Yuan et al. Transform2Act: Learning a transform-and-control policy for efficient agent design. ICLR (2022).\n3. Gupta et al. Metamorph: Learning universal controllers with transformers. ICLR (2022).\n4. Hong et al. Structure-aware transformer policy for inhomogeneous multi-task reinforcement learning. ICLR (2022).\n5. Xiong et al. Universal morphology control via contextual modulation. ICML (2023).\n6. Xiong et al. Distilling morphology-conditioned hypernetworks for efficient universal morphology control. ICML (2024).\n7. Strgar et al. Evolution and learning in differentiable robots. RSS (2024).\n8. Mertan & Cheney. Towards multi-morphology controllers with diversity and knowledge distillation. GECCO (2024).\n9. Li et al. Generating freeform endoskeletal robots. ICLR (2025).\n10. Lu et al. Bodygen: Advancing towards efficient embodiment co-design. ICLR (2025)."}, "questions": {"value": "1. Based on evidence provided it is not clear the proposed method does what the authors claim. Why do the authors conclude their method improves fitness?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "D9hoZSLnAX", "forum": "AdfEHMueyc", "replyto": "AdfEHMueyc", "signatures": ["ICLR.cc/2026/Conference/Submission17324/Reviewer_du33"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17324/Reviewer_du33"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760717212212, "cdate": 1760717212212, "tmdate": 1762927251898, "mdate": 1762927251898, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces GNN for soft-robotics co-design and also introduce a scheme for morphology matching. Also to my best knowledge, GNN and Transformer are already heavily used for robot co-design."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "This paper introduces a topology-consistent, graph-based policy representation that enables seamless controller inheritance across evolving morphologies, significantly improving adaptability and efficiency in soft robot co-design."}, "weaknesses": {"value": "I have a relatively big concern about the contribution of this paper. GNN and Transformer are already heavily used in co-design, for example [1,2,3,4], what is the main difference between this work with them?\n\nFor example, paper [4] discusses the morphology representation for Transformer in co-design, and introduces a light-weight embedding for efficient morphology representation and morphology aligning using one network. GNN demonstrates little advantage over Transformer with a reasonable morphology embedding. \n\n[1] Preco: Enhancing generalization in co-design of modular soft robots via brain-body pre-training\n\n[2] Curriculum-based Co-design of Morphology and Control of Voxel-based Soft Robots\n\n[3] Transform2act: Learning a transform-and-control policy for efficient agent design\n\n[4] Bodygen: Advancing towards efficient embodiment co-design\n\n**But I find the authors do not compare this work with them even though the topic is closely related. If possible, could the author provide any comparison with this line of works?**"}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "NPIBxSogWk", "forum": "AdfEHMueyc", "replyto": "AdfEHMueyc", "signatures": ["ICLR.cc/2026/Conference/Submission17324/Reviewer_71DV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17324/Reviewer_71DV"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761379201369, "cdate": 1761379201369, "tmdate": 1762927251542, "mdate": 1762927251542, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper models soft/voxel robots as graphs (nodes represent voxels/actuators, edges represent adjacency/structural constraints) and constructs an actor-critic controller using graph attention networks (GATs). The outer layer employs genetic algorithms (GA) to explore morphologies, while the inner layer optimizes control via PPO. To address the long-standing issue of \"morphological changes → control mismatch,\" the authors propose topology-consistent parameter inheritance/mapping: shared encoding layer weights are directly reused across morphologies, output channels are aligned by parent-child actuator pairs, and newly added/deleted components undergo minimal reset and fine-tuning. This forms an integrated \"evolution-learning\" loop: offspring morphologies are generated through mutation → parent control is inherited → a small number of PPO updates are applied → fitness is evaluated → selection and further mutation occur. Experiments on EvoGym multitasks demonstrate advantages over baselines like MLP-PPO and no inheritance in peak rewards, convergence speed, and robustness to morphological perturbations."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Using graphs to represent forms (nodes/edges) is a priori abstraction that makes the controller more robust to \"node count/topology changes\" and avoids the vulnerability of fixed input dimensions in MLP.\n\n2. In response to the pain point of \"training from zero as soon as the form changes\", a mapweights inheritance (shared layer reuse, output layer channel alignment, new random/deletion dropout) is proposed, significantly reducing the cost of offspring warm-up."}, "weaknesses": {"value": "1. Morphology generation relies on mutation and selection, lacking systematic integration of generative priors (VAE/diffusion/diffusion, microphysical guidance), and search efficiency may be limited in large morphological spaces. No control design with single-stage evolution has been achieved.\n\n2. Comparison spectra are relatively concentrated: a systematic comparison between the main and other strong baselines of the graph structure (such as ModularEvoGym) and meta learning/fast adaptation methods."}, "questions": {"value": "1. Can GAT representation and inheritance still generalize stably under irregular/hierarchical topology (joint chain, tree, graph mixture) and task migration settings? Are there any failed cases and diagnoses of 'negative transfer immediately after inheritance'?\n\n2. Has the system been tested for stability under real-world factors such as large-scale morphological disturbances (large proportion of added or deleted nodes/switched neighborhoods), perceptual noise/delay, and execution saturation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "XJ8zayDEZ5", "forum": "AdfEHMueyc", "replyto": "AdfEHMueyc", "signatures": ["ICLR.cc/2026/Conference/Submission17324/Reviewer_WRgZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17324/Reviewer_WRgZ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761642993923, "cdate": 1761642993923, "tmdate": 1762927251273, "mdate": 1762927251273, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper aims to implement a graph neural network–based co-design framework for soft robot morphology and control. Robots are represented as graphs, and a graph attention network combined with an MLP enables policies to update as the morphology changes."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "+ This work aims to address a critical and well-recognized problem of morphology–control co-design in soft robots.\n+  Scalability is an important challenge in soft robot co-design."}, "weaknesses": {"value": "-  The novelty of this paper is rather limited. The primary contribution seems to be adding a graph network on top of an MLP to address scalability.\n-  The problem formulation for morphology–control co-design is unclear. What exactly is the control space (e.g., motion or torque variables) that the method optimizes for control?\n-  It is not clear why the proposed method uses a “decentralized structure” (Line 190), nor why it is inherently scalable to adding or removing actuators. For instance, if actuators are added, the control policy still needs to change to control the added motors (and the added DoF). Thus, the claim that “morphological changes such as adding or removing actuators can be incorporated without redesigning the policy” is not convincing.\n-  How are morphologies generated or sampled? The paper provides no detail on the process of morphology design.\n-  It is questionable to present this method as a co-design approach. The pipeline appears sequential: first generating a morphology, then optimizing a controller for that morphology. Soft robot co-design should tightly integrate morphology design with motion control and physical constraints; the current framework does not clearly demonstrate such coupling.\n- The literature review is very limited. For example, key recent work in morphology-control co-design is largely omitted.\n-  Experiments are limited to a simple 2-D discrete simulation. There is no evaluation on more realistic soft robot simulations or physical platforms, making generalizability to real soft robots questionable.\n-  Experiments do not include comparisons with state-of-the-art methods, making it difficult to assess performance improvements or contributions relative to existing work."}, "questions": {"value": "Please see the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "3CEJXABMEI", "forum": "AdfEHMueyc", "replyto": "AdfEHMueyc", "signatures": ["ICLR.cc/2026/Conference/Submission17324/Reviewer_rGkR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17324/Reviewer_rGkR"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission17324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762120737190, "cdate": 1762120737190, "tmdate": 1762927250995, "mdate": 1762927250995, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}