{"id": "aDJcWNmfce", "number": 12352, "cdate": 1758207217727, "mdate": 1759897515289, "content": {"title": "Strictly Constrained Generative Modeling via Split Augmented Langevin Sampling", "abstract": "Deep generative models hold great promise for representing complex physical systems, but their deployment is currently limited by the lack of guarantees on the physical plausibility of the generated outputs. Ensuring that known physical constraints are enforced is therefore critical when applying generative models to scientific and engineering problems. We address this limitation by developing a principled framework for sampling from a target distribution while rigorously satisfying physical constraints. Leveraging the variational formulation of Langevin dynamics, we propose Split Augmented Langevin (SAL), a novel primal-dual sampling algorithm that enforces constraints progressively through variable splitting, with convergence guarantees. While the method is developed theoretically for Langevin dynamics, we demonstrate its effective applicability to diffusion models. In particular, we use constrained diffusion models to generate physical fields satisfying energy and mass conservation laws. We apply our method to diffusion-based data assimilation on a complex physical system, where enforcing physical constraints substantially improves both forecast accuracy and the preservation of critical conserved quantities. We also demonstrate the potential of SAL for challenging feasibility problems in optimal control.", "tldr": "We propose a novel constrained sampling algorithm for physically-constrained deep generative modeling", "keywords": ["Langevin sampling", "generative models", "constrained sampling", "duality", "Lagrangian", "data assimilation", "optimal control", "diffusion models", "inverse problems", "optimal control"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/92669fcf19b830312b496a3dd8d380bd0784f172.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper tackles the problem of sampling from generative models while strictly satisfying physical constraints like conservation laws. Existing approaches either fail to enforce constraints exactly (penalty methods) or become trapped in limited regions under non-convex constraints (projection methods). The authors propose Split Augmented Langevin (SAL), which uses variable splitting and augmented Lagrangian dynamics to progressively enforce constraints while preserving exploration capability. The method operates in a training-free manner on pre-trained diffusion models and provides convergence guarantees through duality analysis. Experiments on energy-preserving field generation, data assimilation for the Burgers equation, and optimal control problems demonstrate that SAL achieves both strict constraint satisfaction and accurate conditional sampling, outperforming existing baselines in maintaining physical plausibility and forecast accuracy."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "**Principled framework with theoretical guarantees:** The variational formulation and duality analysis provide strong theoretical foundations, proving that the relaxed problem recovers the target distribution as coupling strength increases.\n\n**Training-free and modular:** The method works as a drop-in replacement for standard Langevin steps in pre-trained diffusion models, requiring no retraining or additional data.\n\n**Strong empirical validation:** Experiments on diverse physical systems demonstrate practical effectiveness, showing improved constraint satisfaction and forecast accuracy compared to existing baselines."}, "weaknesses": {"value": "**Limited Complexity of Constraints.** While the experiments effectively demonstrate the method's core capabilities, the constraint types considered are relatively simple. The energy conservation constraint in Section 5.1 is a quadratic sphere, and the mass conservation in Section 5.2 is linear. Real-world physical systems often involve more complex constraints, such as coupled higher-order nonlinear conservation laws (e.g., multi-component energy functionals with nonlinear operators), or systems governed by multiple interacting PDEs with intricate coupling structures. It remains unclear how the projection step and the coupling parameter would perform when the constraint manifold has significantly more complex geometry or when the projection itself becomes computationally expensive. Evaluating SAL on such challenging constraints would strengthen confidence in its applicability to complex physical modeling tasks.\n\n**Gap between Theoretical Analysis and Actual Implementation.** While the paper presents a practical and effective algorithm, there is a notable gap between the theoretical analysis and the actual implementation. The convergence analysis in Section 4.3 focuses on the optimization problem (Eq 4.4) in the space of probability measures, establishing strong duality (Proposition 5) and asymptotic recovery (Proposition 6). However, the actual algorithm (Eq 4.5-4.6) is a stochastic sampling procedure operating in sample space with Langevin noise. The missing piece is a rigorous convergence analysis of the proposed iterative scheme (4.6) itself, which would require establishing: (1) Non-asymptotic convergence rates in Wasserstein distance, (2) Finite-sample guarantees for fixed $\\rho$ values, (3) Guidance on hyperparameter selection ($\\rho, \\tau, \\eta$) based on convergence theory. The current theoretical results only guarantee that as $\\rho \\to \\infty$, the solution to (4.4) approaches $p_C$, but do not characterize how the finite-step stochastic algorithm (4.6) approximates this solution. This is acknowledged by the authors as a limitation, but addressing it would significantly strengthen the contribution. Despite this gap, the empirical results convincingly demonstrate the method's effectiveness."}, "questions": {"value": "While the theoretical contributions (Propositions 3-6) are rigorous, the connection between the mathematical advantages and the observed performance improvements in Section 5 is not clearly articulated. Specifically, it remains unclear how the duality gap in Proposition 3 directly explains the constraint violations in Figure 3, or how Proposition 5's attained duality resolves both the exploration bias (Figure 2) and projection artifacts (Figure 4) simultaneously. I recommend adding explicit statements or a summary that maps each theoretical result to the corresponding experimental observations, making the paper more accessible to readers outside convex optimization. A comparative table contrasting penalty methods, projected Langevin, and SAL across key mathematical properties (duality, constraint satisfaction, exploration) would significantly improve clarity."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "LCEop7uT2L", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Reviewer_1KBT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Reviewer_1KBT"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761803586582, "cdate": 1761803586582, "tmdate": 1762923267557, "mdate": 1762923267557, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces SAL, a principled framework for strictly constrained sampling. By combining a variable-splitting formulation with stochastic primal–dual updates, SAL attains strict feasibility under nonconvex constraints while preserving the exploratory behavior. Theoretical analysis provides strong guarantees, and experiments on physical systems and control tasks demonstrate the method’s potential. However, the experiment results are somewhat limited, leaving some unconvincibility about the practical robustness of the proposed method. I would consider raising my rating if additional experimental results were provided."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The SAL algorithm achieves strict feasibility without sacrificing exploration in constrained generation, addressing the weakness of previous projected or penalty-based approaches through a well-motivated formulation.\n2. The paper provides a clear variational interpretation of constrained sampling and offers theoretical guarantees supporting the soundness and effectiveness of the proposed method.\n3. The experiments cover a broad range of tasks and settings, demonstrating that SAL maintains physical constraints while preserving sampling diversity and quality."}, "weaknesses": {"value": "1. None of the three experiments report quantitative metrics or summary tables comparing different methods.\n2. Lines 329–333 mention several baselines intended for comparison, yet the most relevant one, the Primal–Dual Langevin method, does not appear in the reported experimental results.\n3. Lines 420–421 note that ADMM is a classical solver for obstacle-avoidance problems and highlight its limitations, but the experiments result does not provide a direct comparison between ADMM and the SAL, which is unreasonable.\n4. Lines 320–322 discuss computational cost, claiming that SAL adds only the cost of a projected diffusion step compared to the unconstrained baseline. However, the additional variable-splitting updates also may introduce extra overhead. Additionaly, a quantitative runtime comparison with baselines would be necessary to substantiate the efficiency claim."}, "questions": {"value": "1. I understand that the SAL combines the strengths of several existing baselines. Since prior work such as Primal–Dual Sampling already performs well, to what extent is SAL an incremental improvement that integrates ideas from Projected LMC, variable splitting, and augmented Lagrangian methods? It would be helpful to include a summary table comparing different baselines across key aspects (feasibility, stricticity, etc.) to make the distinctions clearer.\n2. The paper mentions that a projection operator is required for SAL as well as for other methods. However, do such projection operators always exist for arbitrary physical constraints or control objectives? If not, could the authors discuss possible strategies or approximations?\n3. Given that the authors are trying to model constrained sampling over physical field functions rather than simple random variables, and physical conservation laws also apply to fields, is it formally appropriate to represent the problem directly using random variables $x$ and $z$? Some clarification on this abstraction would make the formulation more convincing."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "KJcAPiIdnN", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Reviewer_gUbm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Reviewer_gUbm"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891916921, "cdate": 1761891916921, "tmdate": 1762923267225, "mdate": 1762923267225, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Split Augmented Langevin (SAL), a training-free sampler that enforces hard constraints by splitting variables and projecting a companion variable onto the constraint set each step, with the final output $z_T \\in C$. It provides a variational/duality view, consistency to the strictly constrained law as coupling increases, and a drop-in use within diffusion models.\n\nContributions:\n1) A split augmented Langevin sampler with projection that enforces samplewise constraints while preserving exploration.\n2) A relaxed duality analysis with attained strong duality and recovery of the strictly constrained law.\n3) A practical integration recipe for diffusion/latent diffusion requiring only a projection operator $P_C$, demonstrated on three tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1) A split augmented Langevin formulation that enforces per-sample constraints while retaining exploration; a practical combination of variable splitting and projection for sampling.\\\\\n2) Coherent variational/duality setup with clear algorithms; sensible baselines demonstrating feasibility and distributional fidelity.\n3) Motivation is explicit; notation and procedures are readable; appendices provide proofs, variants, and implementation notes.\n4) Training-free and model-agnostic; integrates with diffusion pipelines, making strict constraints more accessible in scientific applications."}, "weaknesses": {"value": "(clarification added; no new concerns):\n\n1) Projection robustness: many constraints need iterative or approximate $P_C$. Quantify how projection error affects feasibility and sampling bias; include experiments sweeping inner-iteration counts or projection tolerances. Explanation: SAL relies on $P_C$ at every step, but the paper does not report projection tolerances/inner-iterations or a sensitivity study; under inexact $P_C$ strict feasibility and unbiasedness remain unverified.\n\n2) Hyperparameter tuning: performance depends on $\\rho$ and dual step $\\eta$. Propose adaptive schedules driven by observed coupling gaps $\\|x_t - z_t\\|$ or constraint residuals, and compare against fixed/annealed baselines. Explanation: only manual tuning/limited ablations are shown; since $\\rho$ trades enforcement vs.\\ exploration and $\\eta$ controls dual stability, lack of an adaptive policy risks brittle behavior across tasks.\n\n3) Experimental breadth: add compact, classical PDE tests where projections are standard and informative (Poisson $Au=b$, Darcy with mass/flux balance, incompressible NS via Hodge projection), reporting PDE residuals, divergence norms, spectra. Explanation: current tasks are useful but less controlled; canonical PDEs provide standard projections and interpretable diagnostics that isolate sampler behavior and strengthen generality.\n\n4) Latent diffusion details: when enforcing constraints in decoded space, discuss scaling $\\rho$ through the decoder Jacobian and show sensitivity analyses to ensure stability and consistent enforcement. Explanation: the latent update introduces $J_\\phi^\\top(\\phi(x)-z)$, but the paper offers no guidance on choosing $\\rho$ relative to $\\|J_\\phi\\|$ or on sensitivity to decoder conditioning; mis-scaling may weaken enforcement or destabilize updates."}, "questions": {"value": "1) Problem setting and constraints. For physics, equality-in-expectation $\\mathbb{E}_q[h(x)]=0$ seems insufficient. In many cases, the idealized requirement $\\mathbb{E}_q[|h(x)|]=0$ would force $h(x)=0$ almost surely (i.e., strict feasibility), but this is typically impractical to enforce via smooth penalties. Please clarify your recommended formalization: average constraints (Section 3) versus support constraints $x\\in C$ almost surely (Section 4). Do you envisage $h(x)\\ge 0$ and $\\lambda\\ge 0$ anywhere, or do you recommend set membership with projection as the primary approach?\n\n\n2) Finite-time behavior and stopping. Can you relate finite $\\rho$ and step sizes to discrepancy from the target conditional $p_C$? A practical stopping rule based on $\\|x_t - z_t\\|$ or constraint residual thresholds would help practitioners decide when sampling is accurate enough.\n\n3) Adaptive schedules for $\\rho$ and $\\eta$. Do you recommend an adaptive policy driven by observed coupling gaps or residuals (e.g., increase $\\rho$ when violations plateau, decrease when exploration slows)? A short ablation comparing fixed, annealed, and adaptive schedules would be valuable.\n\n4) Inexact projections and robustness. When $P_C$ is computed approximately (few inner iterations), what error conditions preserve convergence and strict feasibility in practice? Please include an experiment sweeping projection tolerance/iterations and reporting feasibility rates and sampling bias.\n\n5) Intersections of multiple constraints. For $C=\\cap_i C_i$, do you prefer a single projection onto the intersection, alternating projections onto $C_i$, or multiple split variables $z^{(i)}$ with separate dual updates? A small comparison on stability, wall-clock, and feasibility would inform users.\n\n6) Classical PDE benchmarks. Consider adding concise tests where projections are standard and informative: Poisson with linear constraints $Au=b$, Darcy flow with mass/flux balance, and incompressible Navier–Stokes via Hodge projection. Reporting $\\|Au-b\\|_2$, divergence norms, spectra, and feasibility histograms would strengthen generality claims."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hDF8co6OXu", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Reviewer_7Rvb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Reviewer_7Rvb"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761972424756, "cdate": 1761972424756, "tmdate": 1762932300616, "mdate": 1762932300616, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Split Augmented Langevin (SAL), a training-free sampler that enforces hard constraints by splitting variables and projecting a companion variable onto the constraint set each step, with the final output $z_T \\in C$. It provides a variational/duality view, consistency to the strictly constrained law as coupling increases, and a drop-in use within diffusion models.\n\nContributions:\n1) A split augmented Langevin sampler with projection that enforces samplewise constraints while preserving exploration.\n2) A relaxed duality analysis with attained strong duality and recovery of the strictly constrained law.\n3) A practical integration recipe for diffusion/latent diffusion requiring only a projection operator $P_C$, demonstrated on three tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1) A split augmented Langevin formulation that enforces per-sample constraints while retaining exploration; a practical combination of variable splitting and projection for sampling.\\\\\n2) Coherent variational/duality setup with clear algorithms; sensible baselines demonstrating feasibility and distributional fidelity.\n3) Motivation is explicit; notation and procedures are readable; appendices provide proofs, variants, and implementation notes.\n4) Training-free and model-agnostic; integrates with diffusion pipelines, making strict constraints more accessible in scientific applications."}, "weaknesses": {"value": "(clarification added; no new concerns):\n\n1) Projection robustness: many constraints need iterative or approximate $P_C$. Quantify how projection error affects feasibility and sampling bias; include experiments sweeping inner-iteration counts or projection tolerances. Explanation: SAL relies on $P_C$ at every step, but the paper does not report projection tolerances/inner-iterations or a sensitivity study; under inexact $P_C$ strict feasibility and unbiasedness remain unverified.\n\n2) Hyperparameter tuning: performance depends on $\\rho$ and dual step $\\eta$. Propose adaptive schedules driven by observed coupling gaps $\\|x_t - z_t\\|$ or constraint residuals, and compare against fixed/annealed baselines. Explanation: only manual tuning/limited ablations are shown; since $\\rho$ trades enforcement vs.\\ exploration and $\\eta$ controls dual stability, lack of an adaptive policy risks brittle behavior across tasks.\n\n3) Experimental breadth: add compact, classical PDE tests where projections are standard and informative (Poisson $Au=b$, Darcy with mass/flux balance, incompressible NS via Hodge projection), reporting PDE residuals, divergence norms, spectra. Explanation: current tasks are useful but less controlled; canonical PDEs provide standard projections and interpretable diagnostics that isolate sampler behavior and strengthen generality.\n\n4) Latent diffusion details: when enforcing constraints in decoded space, discuss scaling $\\rho$ through the decoder Jacobian and show sensitivity analyses to ensure stability and consistent enforcement. Explanation: the latent update introduces $J_\\phi^\\top(\\phi(x)-z)$, but the paper offers no guidance on choosing $\\rho$ relative to $\\|J_\\phi\\|$ or on sensitivity to decoder conditioning; mis-scaling may weaken enforcement or destabilize updates."}, "questions": {"value": "1) Problem setting and constraints. For physics, equality-in-expectation $\\mathbb{E}_q[h(x)]=0$ seems insufficient. In many cases, the idealized requirement $\\mathbb{E}_q[|h(x)|]=0$ would force $h(x)=0$ almost surely (i.e., strict feasibility), but this is typically impractical to enforce via smooth penalties. Please clarify your recommended formalization: average constraints (Section 3) versus support constraints $x\\in C$ almost surely (Section 4). Do you envisage $h(x)\\ge 0$ and $\\lambda\\ge 0$ anywhere, or do you recommend set membership with projection as the primary approach?\n\n\n2) Finite-time behavior and stopping. Can you relate finite $\\rho$ and step sizes to discrepancy from the target conditional $p_C$? A practical stopping rule based on $\\|x_t - z_t\\|$ or constraint residual thresholds would help practitioners decide when sampling is accurate enough.\n\n3) Adaptive schedules for $\\rho$ and $\\eta$. Do you recommend an adaptive policy driven by observed coupling gaps or residuals (e.g., increase $\\rho$ when violations plateau, decrease when exploration slows)? A short ablation comparing fixed, annealed, and adaptive schedules would be valuable.\n\n4) Inexact projections and robustness. When $P_C$ is computed approximately (few inner iterations), what error conditions preserve convergence and strict feasibility in practice? Please include an experiment sweeping projection tolerance/iterations and reporting feasibility rates and sampling bias.\n\n5) Intersections of multiple constraints. For $C=\\cap_i C_i$, do you prefer a single projection onto the intersection, alternating projections onto $C_i$, or multiple split variables $z^{(i)}$ with separate dual updates? A small comparison on stability, wall-clock, and feasibility would inform users.\n\n6) Classical PDE benchmarks. Consider adding concise tests where projections are standard and informative: Poisson with linear constraints $Au=b$, Darcy flow with mass/flux balance, and incompressible Navier–Stokes via Hodge projection. Reporting $\\|Au-b\\|_2$, divergence norms, spectra, and feasibility histograms would strengthen generality claims."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hDF8co6OXu", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Reviewer_7Rvb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Reviewer_7Rvb"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761972424756, "cdate": 1761972424756, "tmdate": 1763361292200, "mdate": 1763361292200, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Split Augmented Langevin (SAL), a method for strictly enforcing equality constraints during sampling in generative methods such as score-based diffusion models. It introduces a primal–dual Langevin framework that couples unconstrained and projected variables to guarantee feasibility at every step."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "**S1.** The paper effectively highlights the central difficulty in constrained generation, balancing feasibility with sample diversity, and offers a thoughtful critique of simple projection-based solutions.\n\n**S2.** It presents a theoretically grounded primal–dual Langevin formulation that unifies ideas from constrained optimization and generative sampling in a principled way.\n\n**S3.** The exposition is clear and precise, with mathematical reasoning and well-structured derivations that make the approach easy to follow."}, "weaknesses": {"value": "**W1.** The paper does not include enough baselines or adequately discuss prior work on constrained generation. Comparable methods such as PCFM [2], D-Flow [3], DiffusionPDE [4], and ECI [1] are only briefly mentioned or omitted. ECI, for instance, also enforces hard constraints, while PCFM demonstrates constrained sampling under nonconvex conditions: both directly relevant for benchmarking.\n\n**W2.** The empirical analysis is limited, lacking standard quantitative metrics such as MMSE, SMSE, or FID reported routinely in this literature. Reported results rely largely on qualitative visualizations and histograms, and even show non-zero constraint violations (e.g., Fig. 3) without quantifying their scale or assessing the degree of enforcement softens your claim of hard constraint.\n\n**W3.** The evaluated constraints are relatively simple, and the computational claims appear optimistic. The method assumes analytic projectors, but more complex nonlinear or PDE-based constraints would require solving constrained least-squares problems at every step, which could become computationally expensive and limit scalability.\n\n**W4.** The algorithm assumes that projecting Gaussian noise to obtain ($z_0$) yields feasible initial states. This assumption may hold for simple quadratic or linear constraints but lacks guarantees for challenging manifolds, such as PDE solutions with shocks and discontinuities. Testing on more complex physical systems, as in PCFM [2] or guided functional diffusion methods [5], would better support claims of generality.\n\n**References**\n\n[1] Cheng et al., *Gradient-Free Generation for Hard-Constrained Systems (ECI)*, arXiv:2412.01786 (2024).\n\n[2] Utkarsh et al., *Physics-Constrained Flow Matching: Sampling Generative Models with Hard Constraints*, arXiv:2506.04171 (2025).\n\n[3] Ben-Hamu et al., *D-Flow: Differentiating through Flows for Controlled Generation*, arXiv:2402.14017 (2024).\n\n[4] Huang et al., *DiffusionPDE: Generative PDE-Solving under Partial Observation*, NeurIPS 37 (2024).\n\n[5] Yao et al., *Guided Diffusion Sampling on Function Spaces with Applications to PDEs*, arXiv:2505.17004 (2025).\n\n[6] Chamon et al., *Constrained Sampling with Primal-Dual Langevin Monte Carlo*, NeurIPS 37 (2024)."}, "questions": {"value": "**Q1.** How does the proposed SAL method compare quantitatively to prior constrained generation frameworks such as PCFM [2], D-Flow [3], DiffusionPDE [4], or ECI [1] that also enforce hard or functional constraints?\n\n**Q2.** What is the average magnitude of the constraint violation observed in Figure 3, and does the method guarantee strict satisfaction (i.e., ($||h(x)|| = 0$)) or only approximate feasibility?\n\n**Q3.** How would the projection operator behave for complex or nonlinear constraints where analytical projectors are unavailable? Would this require solving an inner constrained least-squares problem at every step, and how does that impact computational cost?\n\n**Q4.** Given that the initialization step projects Gaussian noise to obtain ($z_0$), what guarantees exist that this projection produces feasible or representative samples, especially for high-dimensional or nonconvex manifolds?\n\n**Q5.** How does your method perform in high-dimensional or multi-modal constrained settings? Does it exhibit the slow mixing behavior often observed in Langevin-based samplers, and what evidence supports stable convergence in such regimes?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "LaRGunK0zg", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Reviewer_zhci"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Reviewer_zhci"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761976565283, "cdate": 1761976565283, "tmdate": 1762923266745, "mdate": 1762923266745, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General Clarifications on Our Contributions"}, "comment": {"value": "Before addressing specific comments, we would like to highlight two overarching clarifications regarding the contributions of our work: **a conceptual comparison with other approaches**, and the **demonstration of SAL's ability to handle complex non-analytical projection operators**.\n\n### Conceptual comparison with other approaches\n\nTo the best of our knowledge, SAL is the first method that enables diffusion models to be conditioned on non-convex hard constraints without introducing bias. This capability is important for many applications where strict physical constraints are essential.\n\nProjection appears to be the necessary cost of obtaining exact constraint satisfaction Our analysis shows that soft penalties cannot enforce hard constraints, and that approaches relying on constraint satisfaction in expectation (e.g., Primal–Dual Langevin) also fail to ensure feasibility on individual samples.\n\nBy contrast, SAL maintains exploration while enforcing the constraint through a separate projected variable, coupled to the sample via a dual variable that converges (Proposition 5). This variable-splitting design gives SAL the ability to preserve the correct conditional distribution while enforcing constraint.\n\nBelow we provide a clearer mapping between the theoretical results (Propositions 3–6) and the empirical observations in Section 5, and we include a concise comparative summary table as recommended by reviewers gUbm and 1KBT.\n\n\n#### (1) Strict constraint satisfaction\n\n**Empirical observation**  \nPenalty and Primal–Dual Langevin methods exhibit constraint violations, as shown in Figure 2.\n\n**Theoretical insight**  \nProposition 3 shows that penalty methods optimize a Lagrangian with a fixed dual variable, leading to a suboptimal saddle point gap and hence infeasible samples [2].\n\n**Our approahch**  \nSAL guarantees feasibility by explicitly projecting $z$ onto $\\mathcal{C}$, achieving strict constraint satisfaction by design.\n\n---\n\n#### (2) Unbiased exploration\n\n**Empirical observation**  \nPenalty methods and projected Langevin distort exploration due to repeated projections, as shown in Figures 2, 3 and 4.\n\n\n**Our approach** \nWe decouple these two antagonistic objectives through variable splitting and coupling constraint. \n\n**Theoretical insight**  \nThe consistency between the two variables is ensured by imposing a coupling constraint. This constraint is provably achieved because the dual variable converges, as stated in Proposition 5.\n\n---\n\n#### (3) Comparative summary\n\n| Algorithm | Constraint form | Strict constraint satisfaction | Unbiased exploration | Targets $p_\\mathcal{C}$ | Duality convergence guarantee | Latent-space diffusion compatible |\n|------------|----------------|-------------------------------|----------------------|-----------------------------|-----------------------------|-----------------------------------|\n| Primal–Dual Langevin | Equality/inequality, on average | ✗ | ✓ | ✗ | ✓ | ✗ |\n| Projected Langevin | Arbitrary sets | ✓ | ✗ | ✗ | ✗ | ✓ |\n| Penalty / Guidance | Differentiable penalty | ✗ | ✗ | ✗ | ✗ | ✓ |\n| **SAL** | Arbitrary sets | **✓** | **✓** | **✓** | **✓** | **✓** |\n\n\n---\n\n## General clarification on the complexity of projection operators\n\nWe thank the reviewers for pointing out that the constraint sets in our experiments might appear simple because some projection operators admit analytical forms. We acknowledge that this aspect was not sufficiently emphasized in the main text. In fact, Experiment 5.2 (data burgers equation) involves a non-analytical, high-dimensional, non-convex projection, implemented via an iterative numerical optimization procedure. Specifically, the feasible set is the intersection of mass and energy conservation constraints:\n\n$$\n\\mathcal{C} = \\{z \\in \\mathbb{R}^d \\mid 1^{\\top} z = M, \\ \\|z\\|^2 = E^2 \\},\n$$\n\nwhich defines a non-convex manifold. The projection step solves\n\n$$\n\\underset{z \\in \\mathbb{R}^d}{\\min} \\ \\frac{1}{2}\\|z - x\\|^2\n\\quad \\text{subject to} \\quad 1^{\\top} z = M, \\ \\|z\\|^2 = E^2,\n$$\n\nand is computed via an iterative alternating-projection algorithm, as described in Appendix E.2. This projection is significantly more complex than analytic projections, and is computed in dimension $d=200$ for a number of 50 iterations.\n\nWe also report in Appendix A.8 a quantitative study of runtime and computational cost, showing that the iterative projection introduces only a modest overhead relative to the diffusion score evaluation, which remains the dominant cost. Additionally, because strict feasibility is required only at the final iteration of SAL, intermediate projections can be computed approximately, providing a trade-off between computational cost and accuracy.\n\nIn the revised manuscript, we will move part of this discussion from the appendix to the main text (Section 5.2) to make this point clearer and to highlight that SAL naturally accommodates both analytical and numerical projection routines."}}, "id": "pMw8MVVT6o", "forum": "aDJcWNmfce", "replyto": "aDJcWNmfce", "signatures": ["ICLR.cc/2026/Conference/Submission12352/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12352/Authors"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12352/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763237393066, "cdate": 1763237393066, "tmdate": 1763237393066, "mdate": 1763237393066, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}