{"id": "ADLiUSC7Qm", "number": 2768, "cdate": 1757244046998, "mdate": 1763727454359, "content": {"title": "Hot Fuzz: Temperature-Tunable Composition of Diffusion models with Fuzzy Logic", "abstract": "Composing pretrained diffusion models provides a cost-effective mechanism to encode constraints and unlock new generative capabilities. Prior work relies on crafting compositional operators that seek to extend set-theoretic notions such as union and intersection to diffusion models, e.g., using a product or mixture of the underlying energy functions. We expose the inadequacy and inconsistency of combining these operators in terms of limited mode coverage, biased sampling, instability under negation queries, and failure to satisfy basic compositional laws such as idempotency and distributivity.\nWe introduce a principled calculus grounded in fuzzy logic that resolves these issues. Specifically,  we define a general class of conjunction, disjunction and negation operators that generalize the classical mixtures, illustrating how they circumvent various pathologies and enable precise combinatorial reasoning with score models.   Beyond existing methods, the proposed *Dombi* operators afford complex generative outcomes such as Exclusive-Union (XOR) of individual scores. We establish rigorous theoretical guarantees on the stability and temperature scaling of Dombi compositions, and derive Feynman-Kac correctors to mitigate the sampling bias in score composition. Empirical results on image generation with stable diffusion and multi-objective molecular generation substantiate the conceptual, theoretical, and methodological benefits. Overall, this work lays foundation for systematic design, analysis, and deployment of diffusion ensembles.", "tldr": "We propose a set of novel score composition operatorsbased on fuzzy logic for diffusion models and showcase that they improve combinatorial reasoning capabilities of ensembles.", "keywords": ["Diffusion", "Score Composition", "Logical Inference", "Temperature Scaling", "Fuzzy Logic"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/335b02cdc6d481a2797743661a257a5759c8f996.pdf", "supplementary_material": "/attachment/9f7c9e46f66405845a130ac05751e3a6261c30f6.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes Dombi operators as a principled way of implementing conjunction, disjunction, and negation operations for composing diffusion models. The Dombi operators seek to correct flaws in the standard implementations of the composition operations including bias, instability, and failure to obey compositional laws. The proposal is tested on image and molecular generation problems."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "I appreciate the rigorous derivation of \"correct\" operators for conjunction, disjunction, and negation. The perspective is helpful for clarifying and unifying a somewhat-messy landscape in which different works use different implementations of compositional operators loosely tied to logical operators -- but which may not represent those logical operators very well, and also may not combine together (e.g. conjunction with negation) in logically consistent ways."}, "weaknesses": {"value": "The analysis of the flaws in PoE/MoE methods, as well as the comparison of the Dombi operators to \"standard implementations\", make particular choices of implementation that are in some sense the \"naive\" ones rather than what I would consider the \"standard\" ones: for example, implementing conjunction as $p^1(x) p^2(x)$ and negation as $p^1(x) / p^2(x)^\\gamma$. Works (referenced in this paper but not discussed in great detail) such as Du23 and Liu22 implement conjunction not as a simple product but actually $p(x) \\prod_i p(x|c_i) / p(x)$ (for two distributions, $p(x|c_1)p(x|c_2) / p(x)$), and negation not as $p(x|c_1)/p(x|c_2)$ but $p(x) p(x|c_1) / p(x|c_2)$, where $p(x)$ is the unconditional. Also, CFG is essentially a negation $p(x|c)^\\gamma p(x)^{1 - \\gamma} = p(x) (p(x|c)/p(x))^\\gamma$. Choices like these work better in practice, and seem to be closer to the Dombi operators derived in Def 4.1. (For example the denominator in (8) is somewhat related to the unconditional). I also suspect that these implementations might not suffer from some of the failure cases (instability, failure to compose, etc.) I feel that these Du/Liu variant would be a valuable (fairer) baseline for comparison. (I still think there is theoretical value in the derivations of the Dombi forms even if they turn out to be similar to the Du/Liu variants, because to my knowledge the forms described in these earlier works were essentially discovered to work well empirically without much theoretical justification.)"}, "questions": {"value": "Can you comment on connections to the Du/Liu variants of compositional operators as discussed in Weaknesses? Did you try any of these variants for comparison, or test whether they suffer from the identified failure cases?\n\nDiscussion around Definition 4.1: I wonder if there is any connection with parametrization-independence here. Bradley&Nakkiran25 (Appendix I) (https://arxiv.org/pdf/2502.04549) (and possibly other references) suggest that parametrization-independence may be a beneficial property for compositional operators (a property possessed by the CFG operator and the Du/Liu styles of product composition); they also show that all 1-homogeneous operators are independent of parametrization. The Dombi operators you obtain appear to be 1-homogeneous as well. Can you comment on potential connections with parametrization-independence and/or other reasons that 1-homogeneity may be desirable for these operators?\n\nMinor comments:\nL123 “important to note”?\nL142: CFG is usually defined as $p^1(x)^\\gamma p^2(x)^(1 - gamma) = p^2(x) (p^1(x)/p^2(x))^\\gamma$ — not sure what is meant here?\nL215 I think this is the first time $\\phi_c$ is mentioned; if so, not very well motivated/introduced \nL244 Without reading Appendix A, it’s not clear what $g$ is"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "51XlsbdbDs", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Reviewer_nPjQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Reviewer_nPjQ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761013356766, "cdate": 1761013356766, "tmdate": 1762916370463, "mdate": 1762916370463, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General Response to the Reviewers and Overview of changes"}, "comment": {"value": "The combined feedback from the reviewers was incredibly insightful and helped us improve both the presentation and the theoretical contribution of our manuscript.\nWe are very excited about this work and wish to convey it to readers as clearly and effectively as possible.\n\nBelow is a brief list of the changes that have been implemented. These changes are preliminary, given the time constraints, and we will strive to further improve the manuscript with more time.\n\n**For the ease of the reviewers, the sections with the most changes are temporarily presented in blue textcolor.**\n## Implemented Changes\n**Clarity: Relevant sections revised**. Reviewers noted typos and instances of unclear language. We revised the relevant sections, especially Definition 4.1, taking care to introduce and motivate each mathematical construct. We will further improve the writing.\n\n**Negation in the manuscript and in related work: Clearer introduction and motivation in revision.**  We rephrased the introduction of $\\phi_c$ as a mapping function, to more clearly argue for the motivation and correctness of our referenced negation. We revised the discussion of related work in concept negation. We plan to elaborate on this in the appendix. More details are provided in our response to 9bJN and nPjQ.\n\n**Connections to Power-Means:** We now included a reference to work on ($\\alpha$) power mixtures.\nSuprisingly, these operators result in equivalent score calculus, but in terms of log-likelihoods and densities **only Dombi Composition forms a logic** as power means are non-associative.\n\n**Additional Experiment with SAT: Investigates stability in complex compositions.** We include an experiment with complex composition formulas and provide preliminary results in this answer and the appendix. We will extend this to a thorough ablation study of our method in a controlled setting for the camera-ready.\n\n**Additional figure in Introduction added.** We included a figure in the introduction, inspired by a comment from 9bJN, that illustrates our method and visually connects it to PoE, MoE, and the harmonic mean.\n\n## Additional Experiment: SAT Diffusion\n\nWe propose a toy experiment where $k$ individual diffusion models act as propositional variables.\nWe analytically define each diffusion model to move particles towards Gaussians at the corners of a hypercube; each model targets **only one half of the hypercube**.\nFor example, one model targets only the corners on the right side, another targets the corners at the top, and so on.\nA base model targets all corners.\n\nWe then define propositional formulas: XOR over $k$ variables, a majority formula, and an *exactly one* formula (OneHot).\nWe measure how many particles arrive at the correct modes and **how uniformly the modes are targeted**.\nThe compositions are highly complex, with *XOR* (encoded in 3SAT format) having over a hundred operators, and *exactly one* having many clauses that only contain negated distributions.\nOur method still manages to reach mostly the correct modes in a uniform manner.\nIn contrast, PoE quickly grows unstable and exhibits shifts in the mode locations, especially when multiple negations are used.\n\nThe results below are preliminary; we will provide further details and more thorough results as soon as possible.\n\ncorr: fraction of particles at correct modes.\nall: fraction of particles at any mode.\nPPL: uniformity over particles in correct modes from 0-1. Higher is better.\n| Formula        | Method | corr (k=2) | all (k=2) | PPL ↑ (k=2) | corr (k=5) | all (k=5) | PPL ↑ (k=5) | corr (k=10) | all (k=10) | PPL ↑ (k=10) |\n|----------------|--------|--------------|-------------|-------------|--------------|--------------|--------------|----------------|---------------|---------------|\n| **Maj_k**      | Dombi  | **1.00**     | **1.00**    | **1.00**    | **1.00**     | **1.00**     | **1.00**     | **1.00**        | **1.00**       | **0.98**       |\n|                | Prod   | **1.00**     | **1.00**    | 0.82        | **1.00**     | **1.00**     | 0.09         | 0.00           | 0.00          | 0.00          |\n| **XOR_k**      | Dombi  | 0.97         | **1.00**    | **1.00**    | **0.95**     | **1.00**     | **1.00**     | **0.91**        | **1.00**       | **0.98**       |\n|                | Prod   | **1.00**     | 0.00        | **1.00**    | 0.00         | 0.00         | 0.00         | 0.00           | 0.00          | 0.00          |\n| **OneHot_k**   | Dombi  | 0.97         | **1.00**    | **1.00**    | **0.59**     | **1.00**     | **1.00**     | **0.09**        | **1.00**       | **0.99**       |\n|                | Prod   | **1.00**     | 0.00        | **1.00**    | 0.00         | 0.00         | 0.00         | 0.00           | 0.00          | 0.00          |\n\nThese results are included in the appendix, and an extended setup of this experiment will be provided for the camera-ready.\n# We again thank all reviewers for their constructive feedback and look forward to further discussion!"}}, "id": "rHsQD2t7Fk", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Authors"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763727530397, "cdate": 1763727530397, "tmdate": 1763727530397, "mdate": 1763727530397, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper examines techniques to compose diffusion models with set theoretic operations such as unions and negations. They find inconsistencies in existing techniques, in particular for negation and complex combinations of operations. They then address these problems with Dombi operators which they derive rigorously from fuzzy logic. They show that their operators are more well behaved and allows for consistent composition and algebraic operations and show more stable sampling of their method on three datasets resulting in higher sample quality."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "- Composing diffusion models is extremely useful, in particular negation has many practical use cases.\n- The paper clearly demonstrates the shortcomings of existing approaches to motivate the need for their method. \n- The operators are rigorously derived from fuzzy logic, putting their method on firm mathematical grounds\n- The experimental results convincingly demonstrate the effectiveness of their method"}, "weaknesses": {"value": "- The presentation of the paper could be slightly improved. For example, the different colors in figure 2 are too similar, making it hard to read. - - It is also not clear which of the dark curves represents which probability distribution\n- Some variables seem to be undefined or fall out of nowhere, like the form of g(x) and s_c in definition 4.1 \n- The used lambda hyperparameter seems to very significantly between different experiments, raising the question how carefully this has to be tuned"}, "questions": {"value": "- How sensitive is the lambda hyperparameter?\n- Did you try larger logical formulas? How robust is this?\n- How expensive is the sampling; does the integration become more expensive in particular with the mentioned oscillations, and does the construction of the composition incur any computational overhead?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Csl9tjGepK", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Reviewer_ndFP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Reviewer_ndFP"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761348844779, "cdate": 1761348844779, "tmdate": 1762916369135, "mdate": 1762916369135, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates compositional generation in diffusion models through the lens of fuzzy logic. By building on theoretical foundations in score-based generative models, existing compositional operators, and fuzzy set theory, the authors proposes Dombi operator that addresses limitations of prior approaches and demonstrates improved stability. Experimental results on small diffusion models, Stable Diffusion 1.4, and protein synthesis further support the effectiveness of the method."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The paper is grounded in solid theoretical analysis, clearly identifying weaknesses in existing compositional operators for diffusion models.\n- The proposed Dombi operator demonstrates strong compositional performance (e.g., Figure 3) and provides a flexible framework for combining multiple operators."}, "weaknesses": {"value": "- The presentation of Sections 2-5 would benefit from improved clarity: several terms are introduced without sufficient explanation, and there are noticeable typos that hinder reading.\n- Although the theoretical justification is strong, the empirical evaluation is relatively limited. Additional qualitative visualizations and ablation studies would help further substantiate the claims, particularly in the context of real-world diffusion models.\n- Some empirical results for SD1.4 are referenced as being in the supplementary material (in Appendix C.2), but no supplementary was provided."}, "questions": {"value": "- How does the Dombi operator affect inference-time efficiency when applied to large-scale diffusion models (e.g., Stable Diffusion)? Is the overhead negligible or significant?\n    - How does the method extend to models with stronger inherent compositional abilities (e.g., SDXL, SD3)? Do the benefits persist or diminish?\n- Were the images in Figure 3 generated with FKC correction? If so, how large is the performance gap between Dompi with and without FKC correction?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "tdNzunhZ8p", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Reviewer_ZuTu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Reviewer_ZuTu"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761881942601, "cdate": 1761881942601, "tmdate": 1762916366593, "mdate": 1762916366593, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Combining or negating (conditional) diffusion models is an important problem for controllable generation, whether in text-to-image generation or designing molecules which (do not) have certain properties.   The paper highlights pitfalls with several existing heuristics for combining models via the product or negating models with quotients, and seeks to correct these by turning to fuzzy logic operations.    The proposed Dombi Operators satisfy DeMorgan's Laws and encompass several existing heuristics for combination or negation.     Finally, the authors derive a practical scheme for sampling from the combination of diffusion, combining techniques from several recent works.\n\nThe authors demonstrate gains from the proposed compositions on text-to-image generation and dual target drug design, along with several insightful examples to elucidate properties in Figure 2."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "The paper is logically structured and well-executed in (i) demonstrating the pitfalls of existing heuristic for model combination, (ii) deriving Dombi Operators which satisfy DeMorgan's Laws as we would expect from logical operations (iii) deriving an SMC resampling scheme combining two recent methods (Ito Density Estimators and Feynman Kac Correctors), and (iv) demonstrating its efficacy.\n\n\nSec. 3.2 makes a nice point about implicit temperature scaling of score addition\n\n**I am very positive on the paper apart from a technical concern about the negation derivations** (described below).   If valid, this should be mathematically salvageable but also may change experiment results.    Thus, I am giving a low initial score, but I am looking forward to discussion with the authors."}, "weaknesses": {"value": "**Concerns re: Negation** \nI have a concern regarding negation in Definition 4.1, especially moving from constant $c \\perp x$ to $c(x)$.  \n- First, even for $c\\perp x$, I get $\\phi_c(x) = \\frac{x}{x+c^2} \\implies \\phi_c^{-1}(y) = c^2 \\frac{y}{1-y}$. \n     - Now, $\\phi_c^{-1}(1-\\phi_c(p(z))) = \\phi_c^{-1}( \\frac{c^2}{p(z)+c^2}) = c^2\\left( \\frac{c^2}{p(z)+c^2} \\right)\\left( \\frac{p(z)+c^2}{p(z)} \\right) =\\frac{ c^4 }{ p(z)}$\n     - This does not match the stated $\\neg_c p(z) = \\frac{c^2}{p(z)}$ in Eq. 7\n\n- What would it mean to take $\\phi_{c(x)}(p(x))$?   This is using a different function $\\phi_{\\mathfrak{c}}(t)$ depending on the input $t \\in [0, \\infty]$ (since for given $x$, we are interested in $\\mathfrak{c}=c(x)$ and $t = p(x)$ )\n     - It is also unclear how to invert $\\phi$ now\n     - Not sure where the `order isomorphism' condition is used in Def A1, but again, now $\\phi$ isn't a fixed function.\n\n*Nevertheless, the conjunction and disjunction distribution operations in Eq 8-9 are correct for constant $c$.   Thus, only the negation operation is problematic*.   If the main goal for this definition of negation was to derive the contrast operator of Garipov et. al 2023, there should be other ways (see Observations below).\n\n**Clarity**  \nThe clarity of the paper is further lacking in several places.\n\n*Definitions* (mostly fixed by including Def. A1 in main text)\n- L215:  The role of $\\phi_c$ has not been introduced.\n    - $N(x) = 1-x$ corresponds to $\\phi(x) = x$, and it probably does make sense to start with this $N(x)$.  You can then mention more general $N_\\phi(x) = \\phi^{-1}[ 1- \\phi(x)]$ and reference App. Def A1  (*not referenced anywhere in main text!*)\n    - This would also emphasize the role of $\\phi$ *alone* to define negation, which then feeds through to conjunction and disjunction via DeMorgan's laws for a given $f$\n- App Def. A1:  should have citation or proof that these satisfy DeMorgan's Laws (I confirmed that both hold for the given definition)\n- L242:  $g(x)$ is not defined.  \n\n\n*Sec 5:  Bounds on Precision and Stability*\n- Lines 274-275 and L276-277 should be reworded.   Only after reading the title of Corollary 5.1 \"Idempotency and Distributivity Bias\" did I understand what we we talking about.\n\n\n*Algorithm*\n- In Sec 6 (and possible Alg 1), it would be useful to re-emphasize the use of the Ito density estimator (Eq. 3) to track weights in the composite scores.   \n\n*Experiments*\n- What $\\lambda$ are used for operations in Figure 3?\n- Please check the logic in Lines 396-398 and consider writing the result of each logical clause for legibility.  I get that $p_{\\text{xor}} = \\{ \\textcolor{blue}{2,3}, \\textcolor{orange}{0,1} \\}$ so that $p_{\\text{xor}} \\wedge \\neg p_3 = \\{ \\textcolor{blue}{3}, \\textcolor{orange}{1} \\}$ since $\\{ \\textcolor{blue}{2}, \\textcolor{orange}{0} \\} \\in p_3$"}, "questions": {"value": "I am confused by the equation in Line 204, where the first and third logical statements are equivalent but the second is not.   I presume the authors wanted to obtain different \"probability-distribution logic\" for equivalent logical statements.\n\n\n\n*Minor comments:*\n- Prop. 6.1 should reference the Feynman-Kac / weighted PDE in Eq. 6.  Otherwise it is not clear where $g_t^{1,2}$ are coming from.\n- why introduce the notion of energy?  I thought it might be cleaner to just use densities.   \n- In Alg. 1 line 4, the authors point out the transformation $\\lambda \\leftrightarrow -\\lambda$ between conjunction and disjunction for fixed $\\lambda$.   This is a useful observation worth emphasizing!  \n    - I suppose it's obvious from the score expressions in Lines 8-9, but less obvious from the distributions\n\n**Observations:** (optional)\n\nA distinct justification for the Dombi conjunction and disjunction in Eq 8-9 can be given using $\\lambda$ (a.k.a. '$\\alpha$' or power-) mixtures or quasi-arithmetic means of densities ([1], used e.g. for annealing paths in [2]).      For a similar generator $h(p(x)) = \\frac{1}{\\lambda}p(x)^{\\lambda} - \\frac{1}{\\lambda}$, define\n$$\n\\mu^{(\\lambda)}_w(x; p,q) = h^{-1}[(1-w) h(p(x)) + w h(q(x))] / Z \\\\\n= [ (1-w) p(x)^{\\lambda} + w ~q(x)^{\\lambda}]^{\\frac{1}{\\lambda}} / Z\n$$\nNow, for $w=1/2$, this term factors out and scales the mean by $(\\frac{1}{2})^{\\frac{1}{\\lambda}}$ (similar to the factors in Corollary 5.1).   This $\\lambda$ representation is closely related to the $\\alpha$-divergence [1, Sec 4-5] (c.f. $\\chi^2$-divergence in Eq. 10, see below)\nThis may be frivolous, or may be useful for the following reasons:\n\n- $\\lim_{\\lambda \\rightarrow 0} h(p(x)) = \\log p(x)$, so $\\mu^{(\\lambda=0)}_w = p(x)^{1-w} q(x)^w / Z$, matching geometric averages or classifer-free guidance\n    - for $w=1/2$, we get an `idempotent version' of the product ($\\wedge$), i.e. $\\mu^{(\\lambda=0)}_{\\frac{1}{2}} = p(x)^{\\frac{1}{2}} q(x)^{\\frac{1}{2}}/Z$\n- Continuing with $w=\\frac{1}{2}$ and emphasizing the $\\lambda \\rightarrow -\\lambda$ relationship as in authors' Alg 1 Line 4, the product now fits nicely into the rest of the special cases described by the authors:\n    - max:  $\\lambda \\rightarrow \\infty$\n    - mixture (MoE disjunction)  $\\lambda = 1$\n    - Dombi disjunction:  $\\lambda > 0$\n    - product (PoE conjunction) $\\lambda \\rightarrow 0$\n    - Dombi conjunction:  $\\lambda < 0$\n    - harmonic mean:  $\\lambda = -1$\n    - min:  $\\lambda \\rightarrow -\\infty$\n- Perhaps it is not obvious to introduce $w \\neq \\frac{1}{2}$ from the fuzzy logic perspective (?), but quasi-arithmetic mixtures could expand the search space for effective model combinations.    \n- Logic is probably suitable for distributivity and chaining operations though.\n\n\n*Garipov et. al 2023 Contrast?*\n\nGiven my concerns about negation as presented (and for fun), consider a different way to derive Garipov et. al 2023's contrast operator.   We want $p(x)$ 'and' $p(x)^2/q(x)$ (high p, low q, needs to be integrable)\n\n$$\np(x) \\wedge_{\\lambda} \\frac{p(x)^2}{q(x)}  = \\frac{p(x)^3 / q(x)}{[ p(x)^{\\lambda} + p(x)^{\\lambda} \\frac{p(x)^{\\lambda}}{q(x)^{\\lambda}}]^{\\frac{1}{\\lambda}}} = \\frac{p(x)^3 / q(x)}{[  \\frac{p(x)^{\\lambda}}{q(x)^{\\lambda}}\\left( q(x)^{\\lambda} + p(x)^{\\lambda} \\right)]^{\\frac{1}{\\lambda}}} =  \\frac{p(x)^2}{\\left( q(x)^{\\lambda} + p(x)^{\\lambda} \\right)^{\\frac{1}{\\lambda}}}\n$$\nwhich matches for $\\lambda = 1$.\n\n\n\n\n\n[1] Amari 2007, Integration of Stochastic Models by Minimizing α-Divergence\n\n[2] Masrani et. al 2021, q-paths: Generalizing Geometric Average Paths using Power Means"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "tZgmxAAfop", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Reviewer_9bJN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Reviewer_9bJN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762417141447, "cdate": 1762417141447, "tmdate": 1762989060358, "mdate": 1762989060358, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Combining or negating (conditional) diffusion models is an important problem for controllable generation, whether in text-to-image generation or designing molecules which (do not) have certain properties.   The paper highlights pitfalls with several existing heuristics for combining models via the product or negating models with quotients, and seeks to correct these by turning to fuzzy logic operations.    The proposed Dombi Operators satisfy DeMorgan's Laws and encompass several existing heuristics for combination or negation.     Finally, the authors derive a practical scheme for sampling from the combination of diffusion, combining techniques from several recent works.\n\nThe authors demonstrate gains from the proposed compositions on text-to-image generation and dual target drug design, along with several insightful examples to elucidate properties in Figure 2."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "The paper is logically structured and well-executed in (i) demonstrating the pitfalls of existing heuristic for model combination, (ii) deriving Dombi Operators which satisfy DeMorgan's Laws as we would expect from logical operations (iii) deriving an SMC resampling scheme combining two recent methods (Ito Density Estimators and Feynman Kac Correctors), and (iv) demonstrating its efficacy.\n\n\nSec. 3.2 makes a nice point about implicit temperature scaling of score addition\n\n**I am very positive on the paper apart from a technical concern about the negation derivations** (described below).   If valid, this should be mathematically salvageable but also may change experiment results.    Thus, I am giving a low initial score, but I am looking forward to discussion with the authors."}, "weaknesses": {"value": "**Concerns re: Negation** \nI have a concern regarding negation in Definition 4.1, especially moving from constant $c \\perp x$ to $c(x)$.  \n- First, even for $c\\perp x$, I get $\\phi_c(x) = \\frac{x}{x+c^2} \\implies \\phi_c^{-1}(y) = c^2 \\frac{y}{1-y}$. \n     - Now, $\\phi_c^{-1}(1-\\phi_c(p(z))) = \\phi_c^{-1}( \\frac{c^2}{p(z)+c^2}) = c^2\\left( \\frac{c^2}{p(z)+c^2} \\right)\\left( \\frac{p(z)+c^2}{p(z)} \\right) =\\frac{ c^4 }{ p(z)}$\n     - This does not match the stated $\\neg_c p(z) = \\frac{c^2}{p(z)}$ in Eq. 7\n\n- What would it mean to take $\\phi_{c(x)}(p(x))$?   This is using a different function $\\phi_{\\mathfrak{c}}(t)$ depending on the input $t \\in [0, \\infty]$ (since for given $x$, we are interested in $\\mathfrak{c}=c(x)$ and $t = p(x)$ )\n     - It is also unclear how to invert $\\phi$ now\n     - Not sure where the `order isomorphism' condition is used in Def A1, but again, now $\\phi$ isn't a fixed function.\n\n*Nevertheless, the conjunction and disjunction distribution operations in Eq 8-9 are correct for constant $c$.   Thus, only the negation operation is problematic*.   If the main goal for this definition of negation was to derive the contrast operator of Garipov et. al 2023, there should be other ways (see Observations below).\n\n**Clarity**  \nThe clarity of the paper is further lacking in several places.\n\n*Definitions* (mostly fixed by including Def. A1 in main text)\n- L215:  The role of $\\phi_c$ has not been introduced.\n    - $N(x) = 1-x$ corresponds to $\\phi(x) = x$, and it probably does make sense to start with this $N(x)$.  You can then mention more general $N_\\phi(x) = \\phi^{-1}[ 1- \\phi(x)]$ and reference App. Def A1  (*not referenced anywhere in main text!*)\n    - This would also emphasize the role of $\\phi$ *alone* to define negation, which then feeds through to conjunction and disjunction via DeMorgan's laws for a given $f$\n- App Def. A1:  should have citation or proof that these satisfy DeMorgan's Laws (I confirmed that both hold for the given definition)\n- L242:  $g(x)$ is not defined.  \n\n\n*Sec 5:  Bounds on Precision and Stability*\n- Lines 274-275 and L276-277 should be reworded.   Only after reading the title of Corollary 5.1 \"Idempotency and Distributivity Bias\" did I understand what we we talking about.\n\n\n*Algorithm*\n- In Sec 6 (and possible Alg 1), it would be useful to re-emphasize the use of the Ito density estimator (Eq. 3) to track weights in the composite scores.   \n\n*Experiments*\n- What $\\lambda$ are used for operations in Figure 3?\n- Please check the logic in Lines 396-398 and consider writing the result of each logical clause for legibility.  I get that $p_{\\text{xor}} = \\{ \\textcolor{blue}{2,3}, \\textcolor{orange}{0,1} \\}$ so that $p_{\\text{xor}} \\wedge \\neg p_3 = \\{ \\textcolor{blue}{3}, \\textcolor{orange}{1} \\}$ since $\\{ \\textcolor{blue}{2}, \\textcolor{orange}{0} \\} \\in p_3$"}, "questions": {"value": "I am confused by the equation in Line 204, where the first and third logical statements are equivalent but the second is not.   I presume the authors wanted to obtain different \"probability-distribution logic\" for equivalent logical statements.\n\n\n\n*Minor comments:*\n- Prop. 6.1 should reference the Feynman-Kac / weighted PDE in Eq. 6.  Otherwise it is not clear where $g_t^{1,2}$ are coming from.\n- why introduce the notion of energy?  I thought it might be cleaner to just use densities.   \n- In Alg. 1 line 4, the authors point out the transformation $\\lambda \\leftrightarrow -\\lambda$ between conjunction and disjunction for fixed $\\lambda$.   This is a useful observation worth emphasizing!  \n    - I suppose it's obvious from the score expressions in Lines 8-9, but less obvious from the distributions\n\n**Observations:** (optional)\n\nA distinct justification for the Dombi conjunction and disjunction in Eq 8-9 can be given using $\\lambda$ (a.k.a. '$\\alpha$' or power-) mixtures or quasi-arithmetic means of densities ([1], used e.g. for annealing paths in [2]).      For a similar generator $h(p(x)) = \\frac{1}{\\lambda}p(x)^{\\lambda} - \\frac{1}{\\lambda}$, define\n$$\n\\mu^{(\\lambda)}_w(x; p,q) = h^{-1}[(1-w) h(p(x)) + w h(q(x))] / Z \\\\\n= [ (1-w) p(x)^{\\lambda} + w ~q(x)^{\\lambda}]^{\\frac{1}{\\lambda}} / Z\n$$\nNow, for $w=1/2$, this term factors out and scales the mean by $(\\frac{1}{2})^{\\frac{1}{\\lambda}}$ (similar to the factors in Corollary 5.1).   This $\\lambda$ representation is closely related to the $\\alpha$-divergence [1, Sec 4-5] (c.f. $\\chi^2$-divergence in Eq. 10, see below)\nThis may be frivolous, or may be useful for the following reasons:\n\n- $\\lim_{\\lambda \\rightarrow 0} h(p(x)) = \\log p(x)$, so $\\mu^{(\\lambda=0)}_w = p(x)^{1-w} q(x)^w / Z$, matching geometric averages or classifer-free guidance\n    - for $w=1/2$, we get an `idempotent version' of the product ($\\wedge$), i.e. $\\mu^{(\\lambda=0)}_{\\frac{1}{2}} = p(x)^{\\frac{1}{2}} q(x)^{\\frac{1}{2}}/Z$\n- Continuing with $w=\\frac{1}{2}$ and emphasizing the $\\lambda \\rightarrow -\\lambda$ relationship as in authors' Alg 1 Line 4, the product now fits nicely into the rest of the special cases described by the authors:\n    - max:  $\\lambda \\rightarrow \\infty$\n    - mixture (MoE disjunction)  $\\lambda = 1$\n    - Dombi disjunction:  $\\lambda > 0$\n    - product (PoE conjunction) $\\lambda \\rightarrow 0$\n    - Dombi conjunction:  $\\lambda < 0$\n    - harmonic mean:  $\\lambda = -1$\n    - min:  $\\lambda \\rightarrow -\\infty$\n- Perhaps it is not obvious to introduce $w \\neq \\frac{1}{2}$ from the fuzzy logic perspective (?), but quasi-arithmetic mixtures could expand the search space for effective model combinations.    \n- Logic is probably suitable for distributivity and chaining operations though.\n\n\n*Garipov et. al 2023 Contrast?*\n\nGiven my concerns about negation as presented (and for fun), consider a different way to derive Garipov et. al 2023's contrast operator.   We want $p(x)$ 'and' $p(x)^2/q(x)$ (high p, low q, needs to be integrable)\n\n$$\np(x) \\wedge_{\\lambda} \\frac{p(x)^2}{q(x)}  = \\frac{p(x)^3 / q(x)}{[ p(x)^{\\lambda} + p(x)^{\\lambda} \\frac{p(x)^{\\lambda}}{q(x)^{\\lambda}}]^{\\frac{1}{\\lambda}}} = \\frac{p(x)^3 / q(x)}{[  \\frac{p(x)^{\\lambda}}{q(x)^{\\lambda}}\\left( q(x)^{\\lambda} + p(x)^{\\lambda} \\right)]^{\\frac{1}{\\lambda}}} =  \\frac{p(x)^2}{\\left( q(x)^{\\lambda} + p(x)^{\\lambda} \\right)^{\\frac{1}{\\lambda}}}\n$$\nwhich matches for $\\lambda = 1$.\n\n\n\n\n\n[1] Amari 2007, Integration of Stochastic Models by Minimizing α-Divergence\n\n[2] Masrani et. al 2021, q-paths: Generalizing Geometric Average Paths using Power Means"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "tZgmxAAfop", "forum": "ADLiUSC7Qm", "replyto": "ADLiUSC7Qm", "signatures": ["ICLR.cc/2026/Conference/Submission2768/Reviewer_9bJN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2768/Reviewer_9bJN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2768/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762417141447, "cdate": 1762417141447, "tmdate": 1763770053136, "mdate": 1763770053136, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}