{"id": "aVGg6lRCVi", "number": 5837, "cdate": 1757939193764, "mdate": 1763142976799, "content": {"title": "Geometric Variational Inference: Elliptic Multi-Marginal Schrödinger Bridge, Anchor Compatibility, and Rates Entropic to Wasserstein", "abstract": "We study variational smoothing as path-space inference in which time-marginals must remain compatible with a single evolution between observations. Our main result shows that path-space variational inference coincides with a multi-marginal Schrödinger bridge whose anchors are the posterior time-marginals, via the Gibbs Donsker Varadhan identity. This induces an Onsager-Fokker geometry: diffusion determines the metric tensor while drift enters through Fokker-Planck and Hamilton-Jacobi-Bellman (HJB)constraints that select the curve; in the linear-Gaussian case this recovers the Rauch-Tung-Striebel smoother. We further characterise limiting regimes as diffusion varies (convergence to $W_2$ displacement geodesics with segment-wise rates; large: convergence to mixture geodesics). Finally, we present a log-domain multi-marginal solver that computes posterior paths and provides theory-driven diagnostics on a controlled benchmark.", "tldr": "Prove that path-space VI is a multi-marginal Schrödinger bridge, inducing an Onsager–Fokker geometry, establish limiting regimes with rates and extend to unbalanced observations via VI–HK, and provide a stable IPFP", "keywords": ["Variational Inference", "Schrödinger Bridge", "Bayesian Smoothing", "Smoothers", "HJB–Fokker–Planck", "Optimal Transport", "Information Geometry", "Multi-Marginal", "IPFP/Sinkhorn", "Ornstein–Uhlenbeck", "Kalman–Bucy", "Rauch–Tung–Striebel", "Hellinger–Kantorovich (Reaction–Transport) Geometry"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/56e3d1ca206b093702a3bcb1e86a10354a95eb11.pdf", "supplementary_material": "/attachment/40e705750f36ce2a272ee15aea9009c5c9f235dc.zip"}, "replies": [{"content": {"summary": {"value": "This is a pure maths paper on path-space inference"}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "Likely the content is of high quality. Unfortunately I did not understand any of it."}, "weaknesses": {"value": "As written above, I was unable to understand the manuscript. This is because I lack the mathematical background. \n\nThat being said, this work does not make any efforts in terms of accessibility. Key concepts and abbreviations are not explained, and a high level of the reader's expertise is expected. The introduction, related work and mathematical preliminaries are all squeezed into one page (60 lines). Therefore, I was not only unable to follow the mathematical arguments; I even did not understand why the results are relevant.\n\nIt seems to me that a 9 pages conference paper is not the best format to present the results because it resulted in an extremely dense manuscript and prohibited any adequate discussion of the numerous results (4 Theorems, 4 Corollaries, 1 Lemma, 1 Theorem, all within 9 pages) and their assumptions. \nI also have some doubts whether this work fits a machine learning venue, given that the \"broader ML impact and applications\" section is a telegraphic list with 5 items squeezed into 4 lines of text."}, "questions": {"value": "Please expand on the \"Broader ML and applications\" paragraph."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "bxf6eE5961", "forum": "aVGg6lRCVi", "replyto": "aVGg6lRCVi", "signatures": ["ICLR.cc/2026/Conference/Submission5837/Reviewer_MPen"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5837/Reviewer_MPen"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission5837/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761660476471, "cdate": 1761660476471, "tmdate": 1762918294432, "mdate": 1762918294432, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this paper, the authors studied geometric intepretations of a Baysian inference problem over a space of paths. Given a space of paths in $\\mathbb{R}^d$ (a path is a continuous function from [0,T] to $\\mathbb{R}^d$), a prior given as some simple distribution over paths, e.g., distribution induced by the OU process, a likelihood function at K snapshots (at K time steps) of the process, one can define the posterior (over paths). The authors derive multiple insights:\n\n- Proposition 1: given a \"variational inference distribution\" Q (over paths), if one minimizes the \"path KL\" between Q and the prior under constraints that Q has to match the posterior at all $K$ snapshots (anchors), the optimal solution is the posterior. Note that this minimization problem is an extension of Schrodinger bridge (in SB, we only have two snapshots -- starting and ending marginal distributions of the process). So this result, although via quite straightforward reformulations, gives an alternative view for the posterior: it is just an extended SB.\n\nThe authors went on to show that (Theorem 2) the probability path formed by marginals of the posterior (slice at all continuous time steps) is a geodedic in the space of probability measure where the Riemannian metric is defined by the prior. Assumingly the prior is induced by some linear SDEs with drift $b$ and diffusion $\\Sigma$, this Riemannian metric is indepdent of $b$, only depends on $\\Sigma$ via $D = \\Sigma \\Sigma^{\\top}$. In summary, this insight re-explains the posterior as a geodesic curve in the space of probability distributions whose Riemannian metric is defined by the prior.\n\nWhen the diffusion term of the prior SDE is isometric, i.e., $\\Sigma = \\sigma I$, the authors further show that:\n\n- When $\\sigma \\approx +\\infty$, the posterior geodesic is the \"piecewise\" geodesics induced by the \"mixture\" geometry, where  \"piecewise\" means \"between snapshots of the posterior\", and \"mixture\" is w.r.t. each two consecutive snapshots.\n\n- When $\\sigma \\approx 0$, in the above statement, replace \"mixture\" by \"Wasserstein\"."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "- This is a highly insightful paper (both deep and broad) with multiple theoretical contributions. The derived results are expected to be very useful for the theoretical OT/geometric ML community."}, "weaknesses": {"value": "- Given its mathematically intensive nature, the paper is generally difficult to access. It appears more suitable for publication in a specialized mathematics journal--though this is not necessarily a weakness. However, the writing is quite succinct with advanced terminology and concepts, many of which are introduced without sufficient explanation. Numerous abbreviations are also used without being spelled out in full, some sentences are not complete (please do complete). Overall, the authors seem to assume that the reader is a mathematician already well-versed in this specific area.\n\n- It is remarked that common factorisations can violate temporal compatibility on path space. However, the proposed method does not seem to fully overcome this limitation. The compatibility is only achieved when the posterior snapshots are exactly per-time tilts, which generally doesn't hold if $K>1$. Although the authors discuss the case where the cross-time factor depends on $x$, the treatment remains quite limited. More detailed explanations are needed--particularly regarding which specific processes concretely satisfy this condition. Please elaborate on this point without relying on the Doob-h transform, as it remains too general and abstract."}, "questions": {"value": "- How to access to the posterior snapshots in practice? \n\n- What are classes of practical ML problems that fall into this extension Schrodinger bridge problem?\n\n- How does \"machine precision\" appear in Figure 1(a)? -- I could not spot it.\n\n- In Theorem 3, please define (or recall) $\\rho_t^{\\sigma}$ and $\\rho_t^{(W)}$ (currently those are only defined later in the text).\n\n- In Corollary 4: is the Wasserstein curve also piecewise? If so, please do mention.\n\n- Line 82: where does the control drift $u_t$ come into play in the SDE? Also, please do elaborate the kinetic + potential action (8) where $u_t$ pops up.\n\n- The authors used the terminology \"variantional inference\" (VI) in their results. However, it seems to me that these results are about \"variational form\" because the optimal $Q$ is just the posterior distribution. When using VI, we would expect (1) Q is explicitly parametrized within a family and (2) the optimal Q is generally different from the posterior. If this is the case, please revise accordingly."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "pEhL0syO43", "forum": "aVGg6lRCVi", "replyto": "aVGg6lRCVi", "signatures": ["ICLR.cc/2026/Conference/Submission5837/Reviewer_Prfj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5837/Reviewer_Prfj"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission5837/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761710130269, "cdate": 1761710130269, "tmdate": 1762918293760, "mdate": 1762918293760, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper develops a geometric formulation of path-space variational inference (VI) and shows that VI for latent diffusion/state-space models with multiple observation times is exactly equivalent to a multi-marginal Schrödinger bridge (MMSB) whose anchors are the posterior time-marginals, not the per-time Bayesian tilts. Starting from the path-space free-energy\n$$\nF[Q] = \\mathrm{KL}(Q \\parallel P_{\\text{ref}}) - \\mathbb{E}_Q[\\log L_y(X)],\n$$\nthe authors prove that the unique minimiser is the posterior path measure and that this minimiser is simultaneously the entropy projection of the reference diffusion onto the set of path measures matching the posterior anchors. This induces an Onsager–Fokker/Otto–Wasserstein geometry in which diffusion fixes the metric tensor and drift appears only as a constraint through Fokker–Planck/HJB equations. They characterize when posterior anchors coincide with simple per-time tilts (an anchor-compatibility criterion), derive small-diffusion and large-diffusion limits with segment-wise rates (convergence respectively to $W_2$ displacement geodesics and to mixture/m-connection geodesics), and extend the construction to unbalanced observations via a VI–Hellinger–Kantorovich equivalence. Finally, they implement a log-domain multi-marginal IPFP solver and validate the theory on controlled OU–GMM benchmarks, showing recovery of Rauch–Tung–Striebel in the linear–Gaussian case."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* Precise identification of path-space VI with a multi-marginal Schrödinger bridge whose anchors are the posterior time-marginals, derived from the Donsker–Varadhan identity and entropy projection.\n* Clear geometric interpretation: diffusion defines the Onsager–Fokker/Otto metric, drift enters only through FP/HJB constraints; this cleanly separates geometry from dynamics.\n* Limiting-regime analysis in both directions: $\\sigma \\to 0$ gives $W_2$ displacement geodesics (with rates), $\\sigma \\to \\infty$ gives segment-wise mixture geodesics, matching information-geometric intuition.\n* Anchor-compatibility criterion (equations (6)–(7) in the paper) that states exactly when naive per-time tilts are already correct and when cross-time Doob corrections are necessary.\n* Practical, numerically stable log-domain multi-marginal IPFP implementation with diagnostics (RTS recovery, diffusion-scaling experiments) that confirm the theoretical claims on OU–GMM benchmarks.\n* Extension to unbalanced observations via a VI–HK action with transport plus reaction and first-order conditions matching HK geometry."}, "weaknesses": {"value": "* Strong reliance on a strictly positive, elliptic reference (OU or similar) with known transition kernels; this is reasonable for diagnostics but leaves open how to apply the same guarantees when the reference is a learned neural SDE or when kernels are low-rank/approximate.\n* Computational scaling of the multi-marginal log-domain IPFP is $O(KN^2)$–$O(KN^3)$ on grids, which restricts experiments to low dimension and small $K$; the paper mentions amortised or neural variants but does not report results for them.\n* The equivalence is exact for posterior anchors $\\mu_k = (P_{\\text{post}})_{t_k}$, which themselves are unknown in the usual VI setting; in practice, one must approximate these anchors, and the paper does not provide a quantitative stability analysis for anchor errors.\n* Comparisons to recent multi-marginal SB works for generative modeling are mostly conceptual; more direct numerical comparisons (same kernels, same grids) would help situate the contribution.\n* The unbalanced VI–HK extension is theoretically neat but only validated on synthetic controlled cases; no large or noisy real-data example is shown."}, "questions": {"value": "1. How sensitive is the log-domain IPFP to diffusion anisotropy and to nearly singular kernels (e.g., very small $\\sigma$ in high dimensions)? Are there step-size/ε-scaling heuristics that guarantee convergence in those regimes?\n2. The metric–drift separation is proved for uniformly elliptic diffusions. Can the authors comment on whether hypoelliptic references (e.g., kinetic Langevin) still yield a meaningful geometric statement, or whether the MMSB solver breaks because of loss of strict positivity?\n3. For the VI–HK extension, is there an example where the reaction term materially improves smoothing over a naive per-time reweighting, and can this be diagnosed by the same compatibility residuals used in the balanced case?\n4. Recent multi-marginal SB methods for multimodal generation (e.g., Chen et al. 2023; De Bortoli et al. 2024) also use iterative projections. Can the authors clarify whether their log-domain solver is directly interchangeable with those, or whether the Doob–$h$ potentials require a different normalisation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "fR763m2Ciy", "forum": "aVGg6lRCVi", "replyto": "aVGg6lRCVi", "signatures": ["ICLR.cc/2026/Conference/Submission5837/Reviewer_tMy3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5837/Reviewer_tMy3"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission5837/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762345263277, "cdate": 1762345263277, "tmdate": 1762918293300, "mdate": 1762918293300, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}