{"id": "AZl4sTVDCC", "number": 8774, "cdate": 1758097785888, "mdate": 1759897764685, "content": {"title": "Query-aware Hub Prototype Learning for Few-Shot 3D Point Cloud Semantic Segmentation", "abstract": "Few-shot 3D point cloud semantic segmentation (FS-3DSeg) aims to segment novel classes with only a few labeled samples. However, existing metric-based prototype learning methods generate prototypes solely from the support set, without considering their relevance to query data. This often results in prototype bias, where prototypes overfit support-specific characteristics and fail to generalize to the query distribution, especially in the presence of distribution shifts, which leads to degraded segmentation performance. To address this issue, we propose a novel Query-aware Hub Prototype (QHP) learning method that explicitly models semantic correlations between support and query sets. Specifically, we propose a Hub Prototype Generation (HPG) module that constructs a bipartite graph connecting query and support points, identifies frequently linked support hubs, and generates query-relevant prototypes that better capture cross-set semantics. To further mitigate the influence of bad hubs and ambiguous prototypes near class boundaries, we introduce a Prototype Distribution Optimization (PDO) module, which employs a purity-reweighted contrastive loss to refine prototype representations by pulling bad hubs and outlier prototypes closer to their corresponding class centers.  Extensive experiments on S3DIS and ScanNet demonstrate that QHP achieves substantial performance gains over state-of-the-art methods, effectively narrowing the semantic gap between prototypes and query sets in FS-3DSeg.", "tldr": "", "keywords": ["few-shot 3D point cloud semantic segmentation，hubness learning，prototype learning"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a33d1dcb1655ecbb6789f83ef819ca50703dc465.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Query-aware Hub Prototype learning for few-shot 3D point cloud semantic segmentation (FS-3DSeg) to address prototype bias. The framework includes two main components: (1) a Hub Prototype Generation (HPG) module that constructs a bipartite graph between support and query points, identifies frequently linked hub points, and clusters them into query-relevant prototypes; and (2) a Prototype Distribution Optimization module that refines bad hubs with a purity-reweighted contrastive loss. Experiments on S3DIS and ScanNet show consistent improvements over other baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper is clearly written and easy to follow, with strong motivation and clear figures to explain the technical details.\n2. Introducing query-aware hub prototypes is a novel perspective that leverages the hubness phenomenon to address the prototype bias for FS-3DSeg.\n3. The method achieves superior performance over other baseline methods, with ablation studies validating each module’s contribution."}, "weaknesses": {"value": "1. In Hub Point Mining (line 233-235), query points are used as centers, but in Bad Hub Selection (line 254-256), query and support points are merged. The rationale for this inconsistency is unclear.\n2. For the Purity-reweighted contrastive loss (Eq. 7), the weighting scheme suggests the weight for bad hubs is smaller than the fixed weight 1 for foreground prototypes while line 274-277 writes the bad hubs need stronger guidance for the alignment. The smaller weights do not align with the motivations for “stronger guidance” for bad hubs.\n3. Missing related work. Recent works on 3D few-shot learning (e.g., Generalized Few-shot 3D Point Cloud Segmentation with Vision-Language Model, CVPR 2025) are highly relevant and should be cited.\n4. Some grammar errors (e.g., “After that, we identify all potential bad hubs within H, which with stronger connections to center points belonging to different classes,” at line 257)."}, "questions": {"value": "Please refer to the weakness part and address the concerns there."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "fedlvPMK9l", "forum": "AZl4sTVDCC", "replyto": "AZl4sTVDCC", "signatures": ["ICLR.cc/2026/Conference/Submission8774/Reviewer_B2Tj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8774/Reviewer_B2Tj"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760839492031, "cdate": 1760839492031, "tmdate": 1762920552003, "mdate": 1762920552003, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a Query-aware Hub Prototype (QHP) approach for few-shot 3D point-cloud segmentation. It introduces (i) Hub Prototype Generation (HPG), selecting “hub” support points via neighborhood popularity, then performing local clustering to form multiple prototypes per class while interacting with query features; and (ii) Prototype Distribution Optimization (PDO), identifying “bad hubs” by purity and applying a purity-weighted contrastive loss to pull them toward class centers."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The motivation for addressing prototype bias from using only support features is interesting. \n\nThe experimental comparison is sufficient. \n\nStepwise ablations (Baseline → +HPG → +PDO) indicate incremental improvements"}, "weaknesses": {"value": "1. The abstract and introduction state that “existing metric-based prototype learning methods generate prototypes solely from the support set, without considering their relevance to query data.” This is not generally accurate. A substantial body of transductive / query-guided work explicitly leverages unlabeled query features to refine or align prototypes with the query distribution, e.g., support–query alignment and query-aware refinement [1, 2, 3]. Because this statement underpins the paper’s motivation and novelty positioning, it weakens the contribution as written.\n\n2. The claimed benefits of hub selection and purity-weighted correction are motivated empirically. There is no analysis of hub statistics, misalignment probability, or even simple bounds showing when purity-weighted attraction is preferable to standard contrastive objectives.\n\n3. Why do you prioritize pulling low-purity (“bad-hub”) / outlier prototypes toward the class center instead of the complementary strategy of reinforcing high-purity (“good-hub”) prototypes toward positives? What theoretical or empirical evidence shows that focusing on repairing bad hubs yields better decision boundaries than amplifying good hubs?\n\n4. The improvements of most settings in Tables 1 and 2 are quite marginal. In Table 6, the authors perform a comparison between PC loss and contrastive loss. Do you use the optimal hyperparameter (e.g., $\\lambda$) for the standard contrastive loss? The performance difference between PC loss and contrastive loss is marginal, and your Fig. 5 (c) shows that different $\\lambda$ have a critical influence on the performance. Will using a better hyperparameter for contrastive loss lead to better performance? \n\n5. Figure 5 shows that the performance of the proposed method is highly sensitive to the hyperparameters, $k$, $\\eta$, $\\lambda$, and $\\gamma$. It’s unclear how robust the method is for a new dataset without re-tuning.\n\n6. What is the performance when using more prototypes than 100? \n\n\n\n[1]. Wang K, Liew J H, Zou Y, et al. Panet: Few-shot image semantic segmentation with prototype alignment[C]//proceedings of the IEEE/CVF international conference on computer vision. 2019: 9197-9206.\n\n[2]. D. Hu, S. Chen, H. Yang and G. Wang, \"Query-Guided Support Prototypes for Few-Shot 3D Indoor Segmentation,\" in IEEE Transactions on Circuits and Systems for Video Technology, vol. 34, no. 6, pp. 4202-4213, June 2024. \n\n[3]. Ning Z, Tian Z, Lu G, et al. Boosting few-shot 3d point cloud segmentation via query-guided enhancement[C]//Proceedings of the 31st ACM international conference on multimedia. 2023: 1895-1904."}, "questions": {"value": "see my weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "t3dYc7iell", "forum": "AZl4sTVDCC", "replyto": "AZl4sTVDCC", "signatures": ["ICLR.cc/2026/Conference/Submission8774/Reviewer_63hN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8774/Reviewer_63hN"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761898551460, "cdate": 1761898551460, "tmdate": 1762920551650, "mdate": 1762920551650, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a novel method for few-shot 3D point cloud semantic segmentation (FS-3DSeg) by proposing a Query-aware Hub Prototype (QHP) learning framework. The core idea is to mitigate prototype bias in metric-based few-shot methods by selecting query-relevant hub points from the support set. Two main modules are proposed: (1) Hub Prototype Generation (HPG), which constructs a bipartite graph between support and query sets to identify frequently-linked support “hub” points and generate prototypes via local clustering; and (2) Prototype Distribution Optimization (PDO), which uses a purity-reweighted contrastive loss to refine bad prototypes and enhance class compactness. Extensive experiments on S3DIS and ScanNet show improved performance over several baselines, supported by ablation studies and qualitative comparisons."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The introduction of “hubness” for prototype generation in FS-3DSeg is novel and provides a new perspective on addressing support-query misalignment.\n- Extensive experiments: Evaluations on S3DIS and ScanNet across 1-shot and 5-shot settings are comprehensive. Ablation studies and parameter sensitivity analyses support the effectiveness of the proposed modules.\n- Clear writing and figures: The paper is well written, and figures (e.g., Figure 1, Figure 2, Figure 3) effectively illustrate the key concepts."}, "weaknesses": {"value": "- Limited comparisons to recent or stronger baselines: The paper lacks comparisons with more recent state-of-the-art methods beyond COSeg and QGE/QGPA. Recent approaches that incorporate transformer-based meta learners, distillation, or prompt-based adaptation are not discussed or evaluated.\n- Unclear generalization and robustness of hub mining: The “hubness” concept is somewhat heuristic and heavily relies on k-NN and purity thresholds. There is limited discussion or analysis on whether hub mining is robust under significant domain shift, class imbalance, or in real-world open-set scenarios.\n- Efficiency claims are underexplored: While FLOPs and inference time are briefly compared, the computational cost of bipartite graph construction and clustering in large-scale 5-way settings is not analyzed. It is unclear whether the method truly scales well.\n- No failure cases shown: All qualitative visualizations emphasize improvement. It would be helpful to include cases where the method fails or introduces errors to better understand its limitations.\n- Motivation example could be more intuitive: Although prototype bias is well described in text, there is no concrete visual example showing how traditional support-only prototypes fail on specific query samples."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "0E7l3hy8kZ", "forum": "AZl4sTVDCC", "replyto": "AZl4sTVDCC", "signatures": ["ICLR.cc/2026/Conference/Submission8774/Reviewer_F9pR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8774/Reviewer_F9pR"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761901970492, "cdate": 1761901970492, "tmdate": 1762920551302, "mdate": 1762920551302, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses prototype bias in few-shot 3D point cloud semantic segmentation by introducing a Query-aware Hub Prototype (QHP) learning framework. QHP constructs class prototypes using high-frequency hub points that exhibit the highest similarity to the query point clouds. To further enhance prototype quality, the proposed Prototype Distribution Optimization (PDO) module identifies potential bad hubs, and then adopt a Purity-reweighted Contrastive (PC) loss to suppress these bad hubs and optimize the prototype distribution."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. It is interesting to introduce the concept of hubs into few-shot 3D point cloud semantic segmentation. By selecting the parts of the support point cloud closest to the query to generate prototypes, the resulting prototypes better align with the distribution of the query point cloud.\n\n2. The experimental evaluation is sufficiently comprehensive and convincingly supports the effectiveness of the proposed QHP."}, "weaknesses": {"value": "1. The experiment in Table 5 suggests that QHP is relatively sensitive to hyperparameter choices, raising concerns about its generalization across different datasets. This sensitivity may also explain why the performance gains on ScanNet are less pronounced than those on S3DIS. To address this issue, please verify whether substantially different hyperparameters are required for ScanNet.\n\n2. The temperature parameter in Equation 8 has not been subjected to ablation analysis, despite being a critical factor influencing the effectiveness of contrastive learning."}, "questions": {"value": "I have concerns regarding the weakness, particularly the generalization of QHP. If these concerns are adequately addressed, I would be happy to raise my score."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "o3XWBbqxQX", "forum": "AZl4sTVDCC", "replyto": "AZl4sTVDCC", "signatures": ["ICLR.cc/2026/Conference/Submission8774/Reviewer_SJ47"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8774/Reviewer_SJ47"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966285692, "cdate": 1761966285692, "tmdate": 1762920550515, "mdate": 1762920550515, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}