{"id": "aZs6DkGM2I", "number": 8566, "cdate": 1758091151537, "mdate": 1759897776118, "content": {"title": "STAN: A Spatio-Temporal Attention Network for Space Debris Multistage Collision Avoidance", "abstract": "The rapid expansion of space missions has led to an exponential increase in space debris, posing severe threats to spacecraft. Existing approaches struggle to handle multistage collision risks in cluttered orbital environments, and the use of continuous low-thrust propulsion further complicates avoidance planning. To address these challenges, we propose the Spatio-Temporal Attention Network (**STAN**), which employs novel Spatio-Temporal Attention (**ST-Attention**) layers in place of conventional attention mechanisms. STAN encodes satellite-debris pairs and integrates time and distance into attention weight computation, enabling the model to generate context-aware low-thrust maneuvers. The model is trained using deep reinforcement learning across four representative multistage collision scenarios, jointly optimizing collision probability, fuel consumption, and orbital deviation. Experimental results show that STAN outperforms baseline methods in safety performance, fuel efficiency, and orbit preservation.", "tldr": "We propose STAN, a spatio-temporal attention network for real-time low-thrust avoidance of multistage space debris collisions using deep reinforcement learning.", "keywords": ["Space Debris Collision Avoidance", "Deep Reinforcement Learning", "Spatio-Temporal Attention", "Continuous Low-Thrust Control", "Policy Network Design"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2317951c8389958a5c0b1ee3c0cc2766fe49febb.pdf", "supplementary_material": "/attachment/1a3a7b0f9fbd5927ca9f72aeab75a707522e3ea9.zip"}, "replies": [{"content": {"summary": {"value": "The paper introduces **STAN**, a reinforcement‑learning policy for satellite–debris collision avoidance under continuous low‑thrust. The key architectural idea is a Spatio‑Temporal Attention (ST‑Attention) layer that injects a physics‑motivated bias—computed from each object’s distance of closest approach (DCA) and time to closest approach (TCA)—into scaled dot‑product attention over a variable‑sized set of debris. STAN outputs both a thrust vector and a termination signal; training uses PPO across four scenario families (single, strict multistage, probability‑based multistage, complex). The manuscript claims large improvements in reward, fuel, and collision probability versus FC/CNN/LSTM baselines, with ablations for attention and termination."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "I think the problem choice is timely and practically important: multistage conjunction handling with **continuous** low-thrust and variable-length inputs is closer to real electric-propulsion operations than impulsive-burn abstractions. The physics-aware inductive bias—folding DCA/TCA into attention—offers an intuitive way to prioritize likely threats without heavy modeling; the mechanism is clearly written with $b_i=-\\sum_j\\gamma_j\\Phi_{ij}$ and $W=\\mathrm{softmax}(QK^\\top/\\sqrt{D}+\\lambda B)$. Conceptually, the **termination head** is a good interface for fuel economy in continuous-thrust settings. I also appreciated the scenario taxonomy and visuals, and that some PPO hyperparameters and environment details are spelled out. In terms of significance, a robust policy for variable-$N$ debris could matter for on-board autonomy. And in terms of clarity, the high-level pipeline and figures communicate the intent well, even if some equations/indices need tightening."}, "weaknesses": {"value": "**1) Termination gating appears inverted and non-differentiable.**  \nEquation (7) computes the final action as\n$ \\Delta v_t^{\\text{final}} = H(p_{\\text{done}}-0.5)\\,[\\alpha S(t)+(1-\\alpha)a] $,\nwhich *enables* thrust when the model believes the task is “done,” contradicting the prose (“stop thrusting when appropriate”) and discarding the continuous probability via a hard Heaviside. I strongly recommend flipping the logic (e.g., multiply by $1-p_{\\text{done}}$ or use a smooth sigmoid gate) and **re-running all experiments**.\n\n**2) ST-Attention bias broadcasting is ambiguous and may be ineffective.**  \nYou define a per-debris bias $b_i$ from $\\Phi_i=(d_i,t_i)$ and then state “each row is identical ($B_{ij}=b_j$)” before adding $\\lambda B$ to the logits. If $B_{i*}$ is row-constant, adding the same constant to a row cancels in the row-wise softmax; if it’s column-constant (per-key), the bias is global and not pairwise. Please pin down the tensor shapes and show an ablation that the bias actually changes attention maps and outcomes.\n\n**3) Internal inconsistencies weaken trust.**  \nThe manuscript alternates between a collision-probability threshold of $0.02$ vs $0.002$; the ablation-section narrative claims rewards “around $750$” in the 10-debris probabilistic setting while the table lists $\\approx 276$; scenario size is “up to $116$” debris in one place and $1178$ elsewhere. Some tables also show FC outperforming STAN on reward (and reporting implausibly tiny probabilities) despite the text claiming consistent dominance. Please take a look at these items.\n\n**4) Collision-probability ($P_c$) modeling is under-specified and numerically suspect.**  \nThe analytic form lacks the covariance definitions $\\sigma_R,\\sigma_S,\\sigma_W,\\sigma_{SW}$ and how they are estimated/propagated. Reported values span $10^{-34}$–$10^{-1}$, which looks implausible without a careful uncertainty model and numerically stable evaluation. Safety claims based on $P_c$ are hard to interpret or reproduce.\n\n**5) Baselines do not represent current best set/attention policies (and may be unfair).**  \nGiven STAN’s set-attention core, comparisons against FC/CNN/LSTM are not enough. Please include capacity-matched **vanilla Transformer/Set Transformer** and consider a simple **model-based** low-thrust planner, with clearly documented padding/masking for permutation robustness.\n\n**6) Physics realism gap.**  \nEverything uses a two-body model, yet “complex” scenarios reference real-world (e.g., CelesTrak) data. Over a 1.2-hour window some regimes may be fine, but ignoring J2/drag (especially in LEO) and omitting the TLE→state pipeline (e.g., SGP4) risks mischaracterizing DCA/TCA and $P_c$.\n\n**7) Methodology and statistics need tightening.**  \nResults appear single-seed; no mean ± std or clear train/test splits. The “strict multistage” scenario is policy-dependent (training continues until success, then the next collision is injected on the updated trajectory), which risks leakage between training and evaluation. Runtime scaling claims should be backed by matched FLOPs/wall-clock under identical widths/batching.\n\n**8) Reproducibility and clarity gaps.**  \nKey actor sizes, number of heads/embedding $D$, normalization/dropout, and values/schedules for $\\lambda,\\gamma,\\alpha$ are missing. Orbit deviation is defined on normalized elements but table captions/values sometimes read like kilometers."}, "questions": {"value": "Every item raised in the Weaknesses section can be viewed as a question for the authors.\nI may well be mistaken on several of these points, and I would sincerely appreciate clarification or correction wherever appropriate.\nIf the authors can address or resolve even part of these concerns—whether by showing that I misunderstood something or by providing additional detail—it would be very helpful."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "LlXAOBioo2", "forum": "aZs6DkGM2I", "replyto": "aZs6DkGM2I", "signatures": ["ICLR.cc/2026/Conference/Submission8566/Reviewer_gUnw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8566/Reviewer_gUnw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8566/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761156192419, "cdate": 1761156192419, "tmdate": 1762920421883, "mdate": 1762920421883, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes STAN (Spatio-Temporal Attention Network), a reinforcement learning-based policy network combined with attention mechanisms for continuous low-thrust spacecraft collision avoidance in complex, multi-debris orbital environments. The work addresses key limitations in prior methods, including the inability to handle variable numbers of debris, and insufficient integration of physics-informed risk metrics into learning-based control."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "ST-Attention design combines self-attention with physically-informed bias to prioritize debris threats effectively. It addresses the gap in standard attention mechanisms that lack domain knowledge.\n\nArchitecture - Strengths:\n1. Combines learned and domain knowledge through fusing of self-attention for complex interactions with explicit physics-informed bias features, capturing both debris correlations and collision risks.\n\n2. Scalable to arbitrary debris counts through encoding features and using attention allows the model to handle variable numbers of debris objects and multi-threat scenarios.\n\n3. Learnable weighting setup let the network adjust the importance of physical features relative to learned embeddings, improving adaptability to different orbital contexts or debris densities."}, "weaknesses": {"value": "Architecture - Limitations:\n\n1. Physics-aware attention bias incorporates the distance of closest approach (DCA) and time to closest approach (TCA) as a learnable bias, the model ensures attention is grounded in domain-relevant risk indicators, not just learned embeddings. Model may be more biased towards immediate critical threats than long-range operational settings such as mission fuel consumption.\n\n2. Uniform broadcast of bias across all columns to form 𝑁×𝑁. This assumes the physical importance of debris i affects all pairwise interactions equally, which may ignore interaction-specific relationships between debris pairs (e.g., cross-collision influence).\n\n3. Mean pooling across debris dimension reduces to a single vector 𝑓 and  both heads rely on it. May lose fine-grained per-debris information, limiting the decoder’s ability to make nuanced, individual maneuvers for specific threats.\n\n4. Reward penalizes collision probability but does not explicitly enforce safety constraints. Policy may occasionally select risky maneuvers if they increase cumulative reward. Does not explicitly account for sensor noise or uncertainty in debris position, which could make the reward function misleading in real operational settings.\n\n5. Some terms may overlap in effect, e.g., minimum distance softness (p_s) and collision probability (p_c) are related; summing both may overweight certain safety aspects.\n\nExperiments - Limitations:\n\n1. Current approach considers Two-body orbital dynamics only and it neglects higher-order perturbations such as J2 (Earth oblateness), atmospheric drag, solar radiation pressure, and third-body effects (Moon, Sun).\n\n2. Multistage collisions are simulated progressively, but each scenario cover only a short timeframe (e.g., 1.2 hours in experiments). The simulation is for 1.2-hour mission window and does not test long-term maneuver planning, cumulative collision risk, or fuel optimization over multiple orbital periods. Policy generalization to extended missions or sequential conjunctions is unclear.\n\n3. Spacecraft near-circular orbit, debris initialized along same orbit. Unrealistic debris distribution case, the real debris is in multiple orbital planes, inclinations, and eccentricities.\n\n4. Exact positions and velocities of debris are used. Ignores sensor noise, tracking errors, and uncertainty in debris catalog."}, "questions": {"value": "The authors can address the experimental limitaions concerns on choosing shorter time frame for experiments, why didn't consider the smaller pertubations in the orbital dynamics, circular initialization of debris orbits and sensor noise in the modelling scenrios."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "XQmmHYe75b", "forum": "aZs6DkGM2I", "replyto": "aZs6DkGM2I", "signatures": ["ICLR.cc/2026/Conference/Submission8566/Reviewer_eUN8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8566/Reviewer_eUN8"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8566/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761838171746, "cdate": 1761838171746, "tmdate": 1762920420154, "mdate": 1762920420154, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose STAN, a Spatio-Temporal Attention Network for avoiding space debris with a deep reinforcement learning approach. STAN's architecture adds a novel spatio-temporal attention mechanism that includes the distance to the closest approach and time to the closest approach as an added bias to the computation of the attention weights. Space debris avoidance is formulated as a Markov Decision Process (MDP) and solved with Proximal Policy Optimization (PPO). The model is evaluated on a simulated environment with multiple debris objects and compared to  baselines with different architectures (CNN, MLP and Transformer). The results show that STAN outperforms the baselines in terms of collision avoidance rate and fuel consumption and that the added spatio-temporal attention mechanism outperforms a standard Transformer architecture."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper is well written and easy to follow.\n- Nice illustrations help to understand the proposed method and results.\n- The proposed spatio-temporal attention mechanism is novel and well motivated.\n- The spatio-temporal attention mechanism is shown to improve performance over a standard Transformer architecture."}, "weaknesses": {"value": "- The architectural innovation is not compared / discussed to other algorithms in the field of space debris collision avoidance. \n- The claims in the introduction from l. 41 to 46 could be supported with references.\n- Stick with constant capitalization of figure and section references.\n- Define acronyms at first use (Spatio-Temporal Attention (ST-Attention) in l.49) and then continue with the acronym.\n- The reward function definition could be made reader-friendly by including the variable names directly in the equation.\n- The authors space key seems to be broken, white spaces are missing in l. 177, 180, 182, 242, 329, 340, 351, 356, 342, 390, 392, 393, 447, 448, 449 and 478."}, "questions": {"value": "- How are hyperparameters selected? How many seeds were used for the experiments? What are the standard deviations?\n- Can you share the codebase and the test environment?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6EiUbvrnnZ", "forum": "aZs6DkGM2I", "replyto": "aZs6DkGM2I", "signatures": ["ICLR.cc/2026/Conference/Submission8566/Reviewer_MJKd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8566/Reviewer_MJKd"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8566/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761849289389, "cdate": 1761849289389, "tmdate": 1762920419640, "mdate": 1762920419640, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a solution for multistage collision avoidance. \nThe solution utilizes an attention layer with temporal encoding, which incorporates the time to closest approach and the miss distance between the pair of objects.\nThe model is used as an RL policy for satellite maneuvering. The model was compared with CNN, LSTM, and FC architectures in an undisclosed environment."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "# originality\n\nThe paper proposes a space-time (miss distance x time to closest approach) encoding added to the representation after dot product attention, applied to RL for collision avoidance maneuvers in lower Earth orbits. The model has two heads, one with the 3D thrust vector and another one with and indicator of maneuver. \n\n# quality \n\nThe paper illiustrates the architecture of the solution with a clear Fig. 1.\n\n# clarity\n\nThe paper is written in clear English\n\n# significance\n\nThe problem of complex collision avoidance is important for space sciences and for RL for real-world critical systems"}, "weaknesses": {"value": "# originality\nThe proposed policy architecture performance in the PPO framework depends on the critic network. This is not covered in the paper or annexes. \n\n## Physics fusion\nIn Section 4.2, the paper attributes the b term as a \"physical prior\". As these numbers (TCA and miss distance) are estimated using statistical assumptions rather than physical laws, it is challenging to consider them more than features or time-space encodings.\n\n# quality \n\n\n## Related work\n\nRelevant papers are not considered, nor compared against. For example:\n- Kolosa (2019) https://www.proquest.com/openview/320685ea5feac29eb871b0c9f169d002/1?pq-origsite=gscholar&cbl=18750&diss=y\n- Miller (2019) https://www.researchgate.net/profile/Richard-Linares/publication/331135625_LOW-THRUST_OPTIMAL_CONTROL_VIA_REINFORCEMENT_LEARNING/links/5c67324b299bf1e3a5abe460/LOW-THRUST-OPTIMAL-CONTROL-VIA-REINFORCEMENT-LEARNING.pdf\n- Herrera (2020) https://www.proquest.com/openview/efe02b87a62929000fc02e548eaeee6a/1?pq-origsite=gscholar&cbl=18750&diss=y\n- Federici (2021) https://www.researchgate.net/profile/Lorenzo-Federici/publication/353828924_Autonomous_Guidance_for_Cislunar_Orbit_Transfers_via_Reinforcement_Learning/links/612a31bf0360302a00618551/Autonomous-Guidance-for-Cislunar-Orbit-Transfers-via-Reinforcement-Learning.pdf\n- Sullivan (2021) https://ieeexplore.ieee.org/abstract/document/9438267\n- Bonasera (2022) https://arc.aiaa.org/doi/abs/10.2514/1.G006783\n- Dolan (2023) https://proceedings.mlr.press/v211/dolan23a.html\n- Lafarge (2023) https://www.sciencedirect.com/science/article/pii/S0094576523002928\n- Zhang (2023) https://ieeexplore.ieee.org/abstract/document/10332252\n- Qu (2023) https://ieeexplore.ieee.org/abstract/document/10451330\n- Holder (2025) https://ojs.aaai.org/index.php/AAAI/article/view/34852\n- Kazemi (2024) https://ieeexplore.ieee.org/abstract/document/10611892\n\nand others.\n\n## Paper attributed to ICLR 2025 but in fact withdrawn\nIn line 132, the manuscript states:\n\n\nwhile high-profile works such as the Equivariant Spatio-Temporal Attentive Graph Network (ESTAG) (Wu et al., 2023) and the\nSpacetime E(n)-Transformer (SET) (Charles, 2025) advanced equivariant attention mechanisms for physical and geometric systems.\n\n\nIn the References section, (Charles, 2025) indicates an openreview link for ICLR 2025. When following the link, we see the author has withdrawn the paper, with the comment: \"I am withdrawing the paper as I do not believe it currently meets the standards of the conference.\"\n\nThe cited paper (Charles, 2025) is high-profile in what sense?\n\n## Results validation\n\n1. Experiments are not run in a publicly available benchmark for orbital dynamics, like Kolosa (2019), Herrera (2020), or others, so the results are not comparable.\n1. Other experiments with competing models using RL or optimization for Collision Avoidance are not shown as benchmarks. See above the list of references for relevant papers in the CAM literature. This would provide evidence of the architecture's superiority wrt other published architectures.\n1. Comparing against CNN and LSTM is not enough, because the standard for the prediction of quantities related to collision avoidance is the transformer.\n1. It is not clear if ablations only remove architectural elements or also features, for example, are the TCA and miss distance included as features when B is ablated?\n1. The code is not runable, as it does not use standard or published environments for orbital dynamics, as said before, and the code for the environment is not disclosed.\n1. Large scale experiments. Debris comes in general in large clouds of small objects. In Fig 3 iii), we see an increasing number of debris up to 1000, versus training and inference times, but not reward or specific performance metrics.\n\n## Missing ablations\n\n1. Evidence needed for mean pooling (eq. (6))\n1. Behavior with a varying number of debris across time, $N_t$\n1. Evidence needed for sentence \"The self-attention component can\nidentify complex, non-obvious relationships between threats, while the physics-based bias ensures\nthat the model remains sensitive to critical, domain-specific risk indicators, improving learning efficiency and final policy performance.\"\n1. Evidence needed for sentence \"In practice, we found that the traditional attention mechanism was not effective\"\n\n\n\n# clarity\n\n\n\n## Notation\n\nIn figure 1, Satellite state and debris state appears before being defined.\nEq 2. $\\Delta v$ is a vector. In the manuscript all vectors are bold except this one. This raises confusion whether this notates speed or velocity. Apparently it is the second. Also in line 190 $u_t$ is a vector and is not in bold.\n\n# significance\n\n## Single agent formulation\nThe current and future spacefaring is based in constellations. So it is arguable that the single agent setting is not compliant with real deployments. Also, avoidance maneuveres can be motivated by other satellites and not just debris.\n\n## Speed constraint\nThe speed constraint --- on the norm of the velocity --- entails that the spacecraft can exert omnidirectional thrust. This is not realistic in practice."}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "OiEketAqUT", "forum": "aZs6DkGM2I", "replyto": "aZs6DkGM2I", "signatures": ["ICLR.cc/2026/Conference/Submission8566/Reviewer_45Dp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8566/Reviewer_45Dp"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8566/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761946497035, "cdate": 1761946497035, "tmdate": 1762920419313, "mdate": 1762920419313, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Seeking Expert Opinion on Alternatives to Mean Pooling for Aggregation Strategy"}, "comment": {"value": "We sincerely thank the reviewer for pointing out the limitation of mean pooling in our original design. This observation has led us to carefully re-examine the global summarization mechanism in STAN. After extensive architectural exploration, we have identified three principled alternatives that all address the concern:\n\n- **[CLS]-based Self-Attention (N+1 tokens)**: We prepend a learnable [CLS] token (class token) to the sequence of N debris interaction embeddings, forming an (N+1)-length input. A standard Transformer encoder layer (with self-attention) processes the full sequence, and the output at the [CLS] position serves as the global context vector. The physics-aware bias (based on DCA/TCA) is incorporated into the attention logits, applied only when the query is [CLS] (i.e., row 0 of the attention matrix).\n\n- **Attention Pooling (Set-based Aggregation)**: We retain the original N-token sequence and first apply a self-attention layer (without physical bias) to enable inter-debris interaction. Then, instead of mean pooling, we use a learned query vector to compute attention weights over the contextualized embeddings, producing a weighted sum as the final representation. Additionally, we incorporate the physics-aware bias (based on DCA/TCA) into the attention logits, ensuring that the final weighted aggregation prioritizes physically high-risk debris.\n\n- **Cross-Attention with Physics-Guided Query (1-token Cross-Attention)**: We introduce a single learnable “maneuver query” and perform cross-attention directly over the debris embeddings. The attention logits are explicitly augmented with the DCA/TCA-derived bias term, ensuring that the final fused representation prioritizes physically high-risk debris in a transparent and differentiable manner.\n\nAll three variants offer promising improvements over the original mean-pooling baseline. These approaches differ subtly in terms of inductive bias, computational overhead, and interpretability. Given the reviewer’s deep expertise in this area, we would be truly grateful for any guidance on which formulation aligns best with the community’s expectations for physically grounded, scalable decision-making in multi-threat environments. We are currently conducting further experiments to quantify their performance, and we will carefully consider the reviewer’s input in the revised manuscript."}}, "id": "Nb6K36pZVw", "forum": "aZs6DkGM2I", "replyto": "aZs6DkGM2I", "signatures": ["ICLR.cc/2026/Conference/Submission8566/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8566/Authors"], "number": 6, "invitations": ["ICLR.cc/2026/Conference/Submission8566/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763470922573, "cdate": 1763470922573, "tmdate": 1763470978352, "mdate": 1763470978352, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}