{"id": "BamabJR7Ed", "number": 14446, "cdate": 1758235576250, "mdate": 1759897369604, "content": {"title": "Five-Mode Tucker-LoRA for Video Diffusion on Conv3D Backbones", "abstract": "Parameter-efficient fine-tuning for text-to-video diffusion remains challenging. Most LoRA-style adapters either flatten 3D kernels into 2D matrices or add temporal-only modules, which breaks the native structure of Conv3D backbones. We present a five-mode Tucker-LoRA that learns a Tucker residual directly on the 5-D convolutional weight update across output/input channels, time, height, and width. This preserves spatio-temporal geometry and enables mode-wise rank budgets; setting some ranks to one (or the temporal rank to zero) recovers common 2D or temporal-only adapters. We instantiate the adapter in VideoCrafter (Conv3D U-Net) and AnimateDiff (2D+motion) under a unified 16×224 evaluation protocol on MSR-VTT. The method achieves a favorable memory–quality trade-off compared with strong 2D/pseudo-3D baselines and reaches target FVD earlier in time-to-target analysis. Results and ablations suggest that respecting the full dimensionality of video kernels is key for budgeted, tensorized adaptation.", "tldr": "", "keywords": ["Video Diffusion", "Parameter-Efficient Finetuning", "LoRA", "Tensor Decomposition", "Tucker", "3D Convolution"], "primary_area": "optimization", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0e0e7e12e867fbdc5c12d2a5c38c827bc439b5f2.pdf", "supplementary_material": "/attachment/6ce9ec571205ac1f1b5d5064d953d343b46ed8ee.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a 5D Tucker-LoRA adapter for parameter-efficient fine-tuning (PEFT) of Conv3D-based text-to-video diffusion models. \n5D Tucker-LoRA contains 5-D weight updates for Conv3D (across output channels, input channels, temporal, height, width). The authors claim that this preserves the spatio–temporal geometry of video generation. However, the work suffers from critical gaps in innovative contribution to fully substantiate its claims."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. This paper presents sufficient implementation details and is easy to follow.\n2. This paper presents some theoretical properties of their method."}, "weaknesses": {"value": "1. The biggest issue with this paper is that the problem it discusses and addresses is entirely not a concern for current video generation models. The 5D-LoRA proposed in this paper is applicable to Conv3D, yet modern video generation architectures are almost all based on Transformer-based DiT (Denoising Diffusion Transformer). These architectures do not have convolutional layers at all, and there is even less need to use convolution-based LoRA. The architectures discussed in this paper (AnimateDiff and VideoCrafter) are now considered outdated. The authors should consider more about the DiT architecture (CogVideoX, Wan, HunyuanVideo).\n\n2. The writing quality is obviously below the bar of ICLR. The introduction of this paper fails to explain why Conv3D-specific LoRA would be more effective than attention-based LoRA for temporal learning. When introducing the initialization strategy using Higher-Order SVD (HOSVD) and Higher-Order Orthogonal Iteration (HOOI) (Line136), the paper only mentions these techniques without properly citing their original works. The Preliminaries section covers core concepts of video latent diffusion, 3D convolutions, and parameter-efficient adaptation, but most of these topics lack relevant citations."}, "questions": {"value": "This work lacks impactful innovation, while the proposed 5D-LoRA is not capable of the modern DiT models. Moreover, the writing quality of this paper also does not meet the standards for acceptance at ICLR."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "mWEeNZbFM1", "forum": "BamabJR7Ed", "replyto": "BamabJR7Ed", "signatures": ["ICLR.cc/2026/Conference/Submission14446/Reviewer_4TUw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14446/Reviewer_4TUw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14446/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761457069626, "cdate": 1761457069626, "tmdate": 1762924851738, "mdate": 1762924851738, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a Five-Mode Tucker-LoRA for parameter-efficient fine-tuning of text-to-video diffusion models built on Conv3D backbones. While conventional LoRA methods flatten convolutional kernels or use pseudo-3D (temporal-only) adapters, the proposed approach directly applies a Tucker decomposition to the 5-D convolution kernel."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper targets an under-explored but important design space: PEFT for video diffusion that respects Conv3D’s intrinsic five-mode tensor structure.\n\n2. The authors maintain a unified evaluation protocol across backbones (VideoCrafter, AnimateDiff) and provide detailed metrics (FVD, CLIP-T, VRAM, throughput)."}, "weaknesses": {"value": "1. Poor Writing and Presentation Quality. The overall writing is rough and occasionally inconsistent, making it difficult to follow technical details in later sections. Figures (e.g., Fig. 2–4) are non-vector raster images with visible compression artifacts and low readability.\n\n2. Weak and Outdated Baselines. The experiments compare only against early, relatively weak models (VideoCrafter and AnimateDiff). These backbones lag far behind current state-of-the-art systems such as WAN 2.1, or  SVD, huanyuanvideo, which feature stronger visual quality and temporal consistency. As a result, the reported gains are difficult to interpret as meaningful progress on modern video diffusion. \n\n3. Limited Novelty. The paper’s main contribution, applying Tucker decomposition to Conv3D kernels, is conceptually straightforward and built almost entirely on existing tensor algebra and LoRA principles. There is little true methodological innovation beyond adapting Tucker to 5D convolution. The theoretical propositions (parameter counts, monotonicity) are standard results from classical tensor decomposition literature.\n\n4. The paper evaluates only on FVD and CLIP–T, which are weakly correlated with human aesthetic or temporal preference.\nThere is no user study, subjective rating, or perceptual evaluation to support the claim of “better visual coherence“."}, "questions": {"value": "1. Substantially revise the writing and ensure figures are vector-based (PDF/SVG).\n\n2. Replace outdated baselines with strong, recent models (e.g., WAN 2.1, SVD)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "KUAOJxFYfc", "forum": "BamabJR7Ed", "replyto": "BamabJR7Ed", "signatures": ["ICLR.cc/2026/Conference/Submission14446/Reviewer_fDh5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14446/Reviewer_fDh5"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14446/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761643628295, "cdate": 1761643628295, "tmdate": 1762924851304, "mdate": 1762924851304, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel five-dimension LoRA for convolutions. It decomposes all 5 dimensions of a convolution, as input, output, time, height and width, in convolution-based video diffusion models, and apply LoRAs following individual ranks. This preserves spatiotemporal structures and further enables flexible independent adjustments. The proposed method is tested with various UNet-based video diffusion models for domain adaptation on MSR-VTT dataset. It achieves surpassing performance compared to traditional 2D LoRAs for convolutions."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The proposed new LoRA for convolution is novel and well motivated. It disentangles all 5 dimensions, not only preserving original spatiotemporal structure without flattening, but also enabling flexible control on each dimension (for potential spatial/temporal decomposition)."}, "weaknesses": {"value": "- The proposed method is only compared to its own baseline, 2D LoRA, in evaluation. More non-LoRA domain adaptation methods should be compared comprehensively. The raw base model's result is also necessary, as the provided visualization might indicate that 2D lora even harms the quality.\n\n- The proposed method is limited to convolution only, while most diffusion foundation models are adopting transformer architectures. For example AnimateDiff combines spatial convolution with temporal attentions, and only 2D lora can be applied here."}, "questions": {"value": "- How would each rank be heuristically adjusted given different cases, e.g. different new datasets with different spatial/temporal complexity or gap, or base model's video length/frame resolution?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "BMGpR8x5Et", "forum": "BamabJR7Ed", "replyto": "BamabJR7Ed", "signatures": ["ICLR.cc/2026/Conference/Submission14446/Reviewer_uddD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14446/Reviewer_uddD"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14446/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761984949052, "cdate": 1761984949052, "tmdate": 1762924850298, "mdate": 1762924850298, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes 5D Tucker-LoRA, a structured low-rank adaptation method for text-to-video diffusion models. By learning a Tucker residual directly on the 5D Conv3D kernel, the method preserves the spatio–temporal structure of video kernels and allows flexible mode-wise rank control. It is evaluated on VideoCrafter and AnimateDiff, showing memory–quality trade-offs and faster attainment of practical FVD thresholds compared to pseudo-3D adapters."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "* This paper aims to addresses an important problem of parameter-efficient fine-tuning for video diffusion, which has high computational and memory costs.\n* The proposed 5D Tucker-LoRA method is conceptually appealing, as it allows flexible mode-wise rank control."}, "weaknesses": {"value": "* The evaluation only compares against the pseudo-3D adapter (AD-2D). There are no experiments with other PEFT strategies such as naive LoRA, making it difficult to assess the true performance gains.\n* No video examples or visual analysis are provided, making it difficult to judge perceptual improvements or temporal coherence.\n* The paper does not explicitly show how 5D Tucker-LoRA improves the temporal dimension, which is a key aspect for evaluating video diffusion models.\n* Other recent PEFT strategies for video diffusion are not considered, limiting understanding of where this method stands relative to state-of-the-art.\n* The impact of temporal rank selection is not thoroughly explored, leaving questions about robustness and hyperparameter sensitivity."}, "questions": {"value": "* How does 5D Tucker-LoRA improve temporal modeling compared to 2D or pseudo-3D adapters? Can you provide quantitative or qualitative evidence?\n* How does the method perform against other PEFT strategies, such as naive LoRA or full fine-tuning?\n* Could you provide video examples to support qualitative evaluation, demonstrating temporal coherence and overall generation quality?\n* The paper only compares temporal Tucker ranks ∈ {0, 1, 4} and claims r=4 is optimal. How sensitive are the results to temporal rank selection?\n* Is 5D Tucker-LoRA compatible with higher-resolution videos or longer temporal sequences, and what is the associated computational overhead?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eL9Aiia49x", "forum": "BamabJR7Ed", "replyto": "BamabJR7Ed", "signatures": ["ICLR.cc/2026/Conference/Submission14446/Reviewer_RCrE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14446/Reviewer_RCrE"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14446/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762137856524, "cdate": 1762137856524, "tmdate": 1762924849478, "mdate": 1762924849478, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}