{"id": "bEL7xaBdJf", "number": 2619, "cdate": 1757166154031, "mdate": 1763621905778, "content": {"title": "Centrality Graph Shift Operators for Graph Neural Networks", "abstract": "Graph Shift Operators (GSOs), such as the adjacency and graph Laplacian matrices, play a fundamental role in graph theory and graph representation learning. Traditional GSOs are typically constructed by normalizing the adjacency matrix by the degree matrix, a local centrality metric. In this work, we instead propose and study Centrality GSOs (CGSOs), which normalize adjacency matrices by global centrality metrics such as the PageRank, $k$-core or count of fixed length paths. We study spectral properties of the CGSOs, allowing us to get an understanding of their action on graph signals. We confirm this understanding by defining and running the spectral clustering algorithm based on different CGSOs on several synthetic and real-world datasets. We furthermore outline how our CGSO can act as the message passing operator in any Graph Neural Network and in particular demonstrate strong performance of a variant of the Graph Convolutional Network and Graph Attention Network using our CGSOs on several real-world benchmark datasets.", "tldr": "We propose and study Centrality Graph Shift Operators (CGSOs), which normalize adjacency matrices by global centrality metrics. We furthermore outline how CGSOs can act as message passing operators in any Graph Neural Network.", "keywords": ["Graph Neural Networks", "Graph Shift Operators", "Centrality"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/913ef4ca680c6d04105006f1da9ba22a5f62fa94.pdf", "supplementary_material": "/attachment/f6fbcb9faec034de7b2a7140aad7db884fac25bd.zip"}, "replies": [{"content": {"summary": {"value": "The paper directly extends the parameterized graph shift operator (PGSO) from using degree based normalization into a general graph centrality (pagerank, L-walk, and k-core) based and develops centrality based graph shift operator (CGSO). The authors provide related mathematical properties associated with the related formulation. The work explores the impact of CGSO on spectral clustering and node classification tasks and observed improvements against GCN/GAT baselines, especially on heterophilic graphs. However, the novelty is limited since it is an incremental extension of PGSO. Moreover, the performance of CGSO does not show systematic advantages over the degree based PGSO in most graph datasets. Despite the extra computational cost brought by obtaining the centralities for each node, which may be non-trivial for large graphs, the work lack systematic analysis (theoretical or experimental) on why and how the centrality based GSO can provide the mentioned benefit comparing to the simpled degree based GSO. The heavy mathematics provided in the main context and appendix does not directly help understanding the behavior difference between GSO/PGSO and CGSO on the clustering and classification tasks. How does CGSO affect the graph spectrum properties from a signal processing perspective for homophilic/heterophilic graphs? This is a critical question discussed by literatures, but it is missing in this paper."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. Uses several graph centralities to substitute degree in GSO/PGSO and induces global information into the message passing process. \n2. Obtains performance improvements on node clustering and classification tasks against classic baselines. \n3. Provides the performance landscape over the key trainable parameters (e2 and e3) for spectral clustering."}, "weaknesses": {"value": "1. It is an incremental extension of PGSO. \n2. The PageRank, k-core, and L-walk based CGSO do not show general advantage over degree based, which is basically PGSO, on node classification tasks (table2 and 3). I can accept that the paper does not compare the performance of CGSO with SOTA models like FAGCN, ChebNet, TEDGCN, GPRGNN, LINKX, ACM-GCN, and GloGNN, but CGSO should significant improvement over PGSO (CGSO-D in this paper), otherwise, what's point of spending extra computation on the other centralities?\n3. The paper lacks systematic theoretical and empirial insights on how the centralities changes the behavior of GSO, how that is related with the observed performance changes, and what the interplay between the graph structure and the favored centralities is. Simply saying globol information is used is far from enough. \n4. Propositions 1 to 4 do not help understand the behavior of CGSO on the clustering and classfication tasks. \n5. Graph spectral analysis from the signal filtering perspective is not provided. This is an important topic, or say a focus, discussed in key literatures, such as [1], [2], and [3]. \n6. In line 431, the authors state \"an observation that we have not previously seen in the literature\". Actually this phenomenon is analyzed in [3]. \n7. For k-core and L-walk based CGSO, how to choose the hyper parameters of k and L? No guidance, theoretical or empirical, is provided.\n8. Lemma 4.1 on the average degree of BA scale-free network is a classic well-known conclusion, not the contribution of this paper. Also, I don't see how this can help undertand the behavior of CGSO. \n9. No sufficient explanations are provided on why CGSO tends to do better on heterophilic graphs. \n\n[1] Analyzing the expressive power of graph neural networks in a spectral perspective. \n[2] Beyond low-frequency information in graph convolutional networks. \n[3] From Trainable Negative Depth to Edge Heterophily in Graphs."}, "questions": {"value": "1. In lines 354-355, by \"homophilic\" and \"heterophilic\", do the authors actually mean \"homogeneous\" and \"heterogeneous\"?\n2. For clustering on Cora, how to obtain the ground truth node membership?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "0h1lirnzYh", "forum": "bEL7xaBdJf", "replyto": "bEL7xaBdJf", "signatures": ["ICLR.cc/2026/Conference/Submission2619/Reviewer_rpKn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2619/Reviewer_rpKn"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2619/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761892069612, "cdate": 1761892069612, "tmdate": 1762916308831, "mdate": 1762916308831, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We would very much like to thank the reviewers for their insightful reviews and the AC for taking the time to handle our paper. Given the mixed and, on average, low scores, we think it is more productive for us to continue to improve our manuscript and to not take any more of your time with further discussion. We therefore, choose to withdraw our submission at this stage. Thank you all for your valuable feedback.\n \nKind regards, \n \nThe Authors of Submission2619"}}, "id": "BRJsMefDG8", "forum": "bEL7xaBdJf", "replyto": "bEL7xaBdJf", "signatures": ["ICLR.cc/2026/Conference/Submission2619/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2619/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763621905181, "cdate": 1763621905181, "tmdate": 1763621905181, "mdate": 1763621905181, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Centrality Graph Shift Operators (CGSO), by normalizing the adjacency matrix with different centrality metrics (e.g., degrees, PageRank score, k-core numbers). The authors provide spectral analysis on the properties of these CGSOs, with empirical validation in synthetic and real-world graphs. The authors further incorporate CGSOs in graph neural networks to demonstrate their utility on several real-world datasets."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. It is interesting to study the class of generalized graph shift operators, and combine them with graph neural networks.\n\n2. The paper is mostly well-written."}, "weaknesses": {"value": "1. The motivation of this work remains unclear. Are the class of CGSOs intended to inject more global information to graph representations? If so, why not encoding these centrality metrics as node features? Or perhaps the proposed CGSOs enjoy provable guarantees on some problems (e.g. spectral clustering)? However, the established theoretical properties do not explicitly answer why or in what settings these CGSOs are preferred.\n\n2. Limited novelty and effectiveness when incorporating CGSO in GNNs. The authors largely reuse the parameterized CGSO framework from Dasoulas et al. (eqn 3), merely changing the degree matrix normalization to other centrality metrics. More importantly, for the real-world benchmark evaluations (Table 2), out of 7 benchmark graphs except arxiv-year, none of the proposed new CGSOs outperform the original degree matrix normalization for GCN-based baselines (3rd block); similar trend can be observed for GATv2 baseline. In additiona, combining local CGSO (degree normalization) and global CGSO do not always improve performance over using local CGSO only (see Table 3). This raises concerns on how effective these newly proposed CGSOs are for real-world graph tasks."}, "questions": {"value": "1. Based on the spectrum properties of CGSO (e.g. Prop 3.3, 3.4), can the authors compare the three proposed CGSO (using k-core, PageRank score, and Walk Count) from their spectrum properties and discuss when or why they outperform one another?\n\n2. Can the authors compare their proposed CGSO with the baseline of using standard degree matrix normalization (CGCG w/ D) plus encoding the centrality metrics as node features? Intuitively this provides a easy way to incorporate (global) centrality features in the graph representations, and avoid possible numerical instability for inverting the centrality matrix.\n\n3. For many figures (e.g. Fig 1., 4, 5), the color bars across subplots are not standardized to the common range. This renders comparison across different subplots difficult and confusing. Can the authors fix this and discuss the figures on a comparable basis?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "pu1bFAGGYq", "forum": "bEL7xaBdJf", "replyto": "bEL7xaBdJf", "signatures": ["ICLR.cc/2026/Conference/Submission2619/Reviewer_XSXG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2619/Reviewer_XSXG"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2619/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761947668428, "cdate": 1761947668428, "tmdate": 1762916308625, "mdate": 1762916308625, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a novel class of graph shift operators (GSOs), termed Centrality-based Graph Shift Operators (CGSO). To address this, the authors propose integrating various node centrality metrics (e.g., betweenness, closeness, eigenvector centrality) into the design of GSOs. Specifically, they define CGSOs as a centrality-weighted version of the adjacency matrix, where each edge is scaled based on the centrality of its incident nodes. The paper presents theoretical analysis of CGSO properties (spectral behavior, stability, interpretability), and empirically evaluates CGSO on tasks like node classification and graph signal forecasting."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The idea of incorporating global node importance into the shift operator is simple, well-motivated\n\nThe paper provides strong theoretical support for the CGSO design, including propositions on spectral characteristics and signal propagation.\n\nExperiments on node classification show that CGSO offers consistent performance gains."}, "weaknesses": {"value": "Although improvements are consistent, the gains are sometimes marginal (especially on Pubmed)\n\nWhile the authors propose to use node centrality as a way to encode global importance, there is no principled theoretical justification for why these particular centrality metrics (e.g., betweenness, closeness, eigenvector) are most suitable for constructing GSOs.\n\nWhile CGSO is integrated into models like GCN, this integration is surface-level"}, "questions": {"value": "Could the centrality scores be learned or updated during training, instead of being precomputed?\n\nIs there a way to automatically choose or combine centrality functions based on data or task type?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Yx25Itry1a", "forum": "bEL7xaBdJf", "replyto": "bEL7xaBdJf", "signatures": ["ICLR.cc/2026/Conference/Submission2619/Reviewer_LWiU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2619/Reviewer_LWiU"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2619/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761950140232, "cdate": 1761950140232, "tmdate": 1762916307681, "mdate": 1762916307681, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Centrality Graph Shift Operators (CGSOs) based on the normalization of the adjacency matrix with different centrality metrics. The authors analyze spectral properties of the CGSOs and validate them via spectral clustering on both synthetic and real-world datasets. They further use CGSOs as message passing operators in Graph Convolutional Network and Graph Attention Network v2, demonstrating strong performance across benchmarks. Overall, the paper is well-motivated and clearly-structured with both theoretical and empirical support."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The idea and construction of CGSOs are simple but broadly applicable.\n2. The paper provides theoretical properties of Markov Averaging Operators to explain when/why CGSOs should separate clusters.\n3. The empirical results (many shown in Appendix) are comprehensive and presented with clarity."}, "weaknesses": {"value": "1. The proof of Proposition 3.2 seems to assume no self-loops in the graph. In Section 3.2, the new parametrized CGSO adds self-loops to the adjacency matrix, so a brief discussion on how the theories/propositions can be extended would improve completeness. Also, it would\nbe helpful to clearly state the assumptions and constants in propositions.\n2. The hyperparameters in Appendix A.5 are from a grid search on the classical GCN, which might under-tune others. Although this is designed for comparison, it would be helpful to see the model performances with hyperparameters tuned for CGCN too."}, "questions": {"value": "1. Could you add all assumptions and constants in the statements of propositions for clarity?\n2. For the walk count node centrality matrix, you use l=2 in all experiments. Would different l affects the result? How sensitive are results to l?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "G9k1z2Wbx9", "forum": "bEL7xaBdJf", "replyto": "bEL7xaBdJf", "signatures": ["ICLR.cc/2026/Conference/Submission2619/Reviewer_LfRT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2619/Reviewer_LfRT"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2619/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761958234559, "cdate": 1761958234559, "tmdate": 1762916307382, "mdate": 1762916307382, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}