{"id": "bhuFwR5rOS", "number": 4685, "cdate": 1757746241359, "mdate": 1762924611257, "content": {"title": "Video Diffusion Model for Point Tracking", "abstract": "Point tracking aims to estimate pixel trajectories across video frames but remains challenging under large displacements, occlusion, and real-world artifacts. Conventional trackers, built on image-centric backbones and synthetic training, often fail in these settings. We revisit this problem through the lens of video diffusion models based on Diffusion Transformers (DiTs), whose 3D global attention structure and large-scale training naturally provide global temporal context and real-world priors. We first analyze the intrinsic robustness of video DiT features, showing stronger correlation maps than supervised ResNet backbones even under occlusion and motion blur. To fully exploit these properties, we introduce an upsampler that restores spatial detail while fusing multi-layer features, followed by an iterative refiner for high-precision trajectories. Extensive experiments on TAP-Vid benchmarks demonstrate that our framework achieves superior robustness and accuracy compared to existing backbones, establishing video DiTs as powerful foundations for point tracking.", "tldr": "", "keywords": ["Video Diffusion Models", "Point Tracking", "Visual Correspondence"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/0466899ffea0da630f5f75bed5b771bebc69ee9b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper explores video diffusion transformers (DiTs) as a feature backbone for point tracking. It first analyzes DiT features, showing more stable correlation maps under large motion, occlusion, and blur. Building on this, the authors introduce a lightweight upsampler to recover spatial detail from DiT tokens and plug it into an iterative refinement tracking pipeline. Experiments are conducted on TAP-Vid (Kinetics and DAVIS)."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "* **Strong backbone choice**. Leveraging a video DiT backbone—pretrained at scale on real videos—provides a compelling feature for point tracking.\n\n* **Clear feature analysis**. The paper provides a detailed comparison against ResNet/DINO backbones, showing that DiT features yield more stable, higher-quality correlation maps under large motion, occlusion, and blur, mitigating the limits of local cost-volume matching."}, "weaknesses": {"value": "* **Limited technical novelty**. The paper’s main contribution is to replace a ResNet backbone with a DiT backbone plus an upsampler, rather than leveraging diffusion as a generative pipeline to for point tracking. This reads more like an engineering effort than a substantive research contribution.\n\n* The paper states: “First, when the target point moves outside the receptive field due to large motion or occlusion, the local correlation becomes ambiguous.” I do not believe this can be fixed simply by using a stronger backbone (DiT). If the target truly moves beyond the correlation’s receptive field, the tracker lacks the necessary evidence to infer motion—regardless of feature quality. Addressing this requires expanding the receptive field (e.g., multi-scale/global correlation) or changing the architecture to incorporate global attention / long-range matching, not merely swapping in DiT features. Therefore, I don't agree with the claim that “video DiTs can address this fundamental challenge of point tracking”.\n\n* **Limited evaluation**. Despite claiming strong generalization from video diffusion, the experiments are confined to two TAP-Vid subsets, and the method performs better on one, and worse on other, undermining the generalization claim.\n\n* Reported results are far below prior work (e.g., CoTracker3: $< \\delta^{x}_{\\mathrm{avg}}$ on Kinetics/DAVIS of 67.8/76.9), yet Table 3 shows much lower values here; is there any different evaluation protocol for this.\n\n* **Unclear takeaways**. On Kinetics, fine-tuning + upsampler hurts performance, while on DAVIS it helps. These contradictory outcomes make it hard to draw conclusions—should practitioners use a DiT backbone for tracking, and should it be fine-tuned?\n\n* **Runtime trade-offs not justified**. Compared with lightweight ResNet-based trackers (e.g., CoTracker3, LocoTrack), the DiT backbone is slower. Given the mixed accuracy results, it’s unclear that the added compute is a good trade-off—especially for real-world deployments where tracking remains a latency-sensitive, low-level vision component."}, "questions": {"value": "* Can the authors further evaluate both the zero-shot model and the fine-tuned + upsampler variant on additional test sets such as DynamicReplica, RoboTAP, and RGB-Stacking [1][2]?\n\n* Can the authors report the runtime and peak GPU memory of the proposed method? How many points can your model support in a single forward pass?\n\n* My take is that the pretrained DiT backbone shows impressive correspondence ability (key for tracking), though it still lags well-trained tracking methods. A more suitable adaptation seems necessary. It appears the current bottleneck is the fine-tuning setup and the upsampler design. Could the authors try different upsamplers and fine-tuning strategies to close the gap?\n\n**Conclusion**\n\nWhile the paper is well-motivated and the DiT backbone is a reasonable choice for robust features, the work reads largely as a backbone swap, and the evidence does not support the stated generalization benefits. Evaluation is limited and findings are inconclusive about fine-tuning and the upsampler, and the runtime trade-off is not reported. Based on this, I recommend reject.\n\n[1] Karaev, Nikita et al. “CoTracker3: Simpler and Better Point Tracking by Pseudo-Labelling Real Videos.” ArXiv abs/2410.11831 (2024)\n\n[2] Harley, Adam W. et al. “AllTracker: Efficient Dense Point Tracking at High Resolution.” ArXiv abs/2506.07310 (2025)"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "23nrabfyPE", "forum": "bhuFwR5rOS", "replyto": "bhuFwR5rOS", "signatures": ["ICLR.cc/2026/Conference/Submission4685/Reviewer_Mruo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4685/Reviewer_Mruo"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission4685/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761451727047, "cdate": 1761451727047, "tmdate": 1762917512292, "mdate": 1762917512292, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "l3iKGt6ZR1", "forum": "bhuFwR5rOS", "replyto": "bhuFwR5rOS", "signatures": ["ICLR.cc/2026/Conference/Submission4685/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission4685/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762924609596, "cdate": 1762924609596, "tmdate": 1762924609596, "mdate": 1762924609596, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper conducts a further exploration of DiffTrack, offering a more in-depth comparison between video diffusion transformer (DiT) models and traditional vision backbones. However, overall, the work appears to be an incremental extension of DiffTrack rather than a substantially new contribution. Neither the insight nor the technical innovation is sufficiently novel to meet the ICLR standards for contribution and originality."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The paper is well-written and easy to follow. The contributions are clearly claimed, and the corresponding supporting experiments are provided."}, "weaknesses": {"value": "The overall insight of the paper is not novel. \n\n1. The idea of analyzing temporal correspondences across frames using diffusion transformers (DiTs) from a point tracking perspective has already been explored in DiffTrack.\n\n2. In terms of methodology, the contribution appears quite limited. The proposed approach essentially builds on DiffTrack by adding an upsampler and concatenating it with the Refiner module from CoTracker. \n\n3. The main technical contribution is the upsampler, which is simply designed to rescale the multi-scale features proposed in DiffTrack to a uniform resolution, followed by feature pooling. However, it seems that there is no clear or formal definition of the upsampler module in the paper.\n\n4. While Table 3 shows improvement on DAVIS, that dataset contains only 30 videos. On the more challenging and large-scale Kinetics dataset, the proposed method even leads to significant performance degradation. These results fail to convincingly demonstrate the effectiveness of the upsampler."}, "questions": {"value": "Please refer to the weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "lhn2d5vwQf", "forum": "bhuFwR5rOS", "replyto": "bhuFwR5rOS", "signatures": ["ICLR.cc/2026/Conference/Submission4685/Reviewer_2L3f"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4685/Reviewer_2L3f"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission4685/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761474287778, "cdate": 1761474287778, "tmdate": 1762917511987, "mdate": 1762917511987, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper explores the use of video diffusion transformers (Video DiTs) as feature backbones for point tracking, aiming to leverage their global 3D attention and large-scale real-world pretraining to improve robustness under large motion, occlusion, and motion blur. The authors propose a simple two-stage adaptation: (i) an upsampler module to recover spatial detail and fuse multi-layer DiT features; (ii) an iterative refiner adopted from common point trackers for high-precision trajectory estimation. Experiments on TAP-Vid DAVIS and Kinetics datasets are reported."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "* Diffusion models are indeed a natural candidate for geometric perception tasks, and this work provides an initial empirical exploration of how their temporal reasoning could benefit pixel-level correspondence.\n* Conceptually simple and clear idea. The paper integrates video DiTs into a point tracking framework with minimal modifications and clear motivation.\n* Well-written and easy to follow, with coherent structure and extensive visualizations (cost volumes, qualitative examples)."}, "weaknesses": {"value": "* While the paper claims that Video DiTs inherently capture temporal consistency, results (Table 3) show that they underperform most image-based backbones, even when equipped with the upsampler and refiner. Given that image-based backbones model temporal relations after feature extraction, Video DiTs should have an advantage in these zero-shot settings. Yet, their performance remains lower, contradicting the claimed benefit of 3D attention in Section 3.2.\n* The proposed upsampler leads to inconsistent gains across datasets: improvements on DAVIS but a drop on Kinetics. This suggests that the design may not generalize well and the gains are dataset-specific. The paper should analyze why the upsampler struggles in long or diverse sequences.\n* Evaluation is limited to two datasets (DAVIS, Kinetics). To establish the generality of diffusion-based backbones, additional domains, such as RoboTAP (robotics), should be tested. These would better reflect the claim of robustness to real-world artifacts.\n* The scale gap between Video DiTs (billions of parameters) and ResNet-based CoTracker3 backbones (tens of millions) raises fairness concerns. The current results may conflate improvements from model capacity rather than architectural superiority. The authors should either (a) compare against equally large vision backbones (eg DINOv3 7B, SwinV2 3B), or (b) use smaller DiTs to isolate the temporal modeling effect.\n* Video DiTs are known for high memory and computational cost. Section A mentions 4 A6000 GPUs for 15 K iterations for training, but memory usage and runtime are not quantified for inference.\n\n### Overall\nThe paper explores a promising direction, integrating video diffusion transformers into point tracking, but lacks strong empirical evidence and insight on why and how this integration improves performance. Most observed gains are modest or dataset-specific, and core claims about temporal reasoning and real-world robustness are not convincingly demonstrated. If extended with deeper analysis of DiT adaptation, this line of work could meaningfully contribute to understanding how generative video priors support geometric perception."}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "pPGqHmdFfV", "forum": "bhuFwR5rOS", "replyto": "bhuFwR5rOS", "signatures": ["ICLR.cc/2026/Conference/Submission4685/Reviewer_3P9a"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4685/Reviewer_3P9a"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission4685/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761649456603, "cdate": 1761649456603, "tmdate": 1762917511562, "mdate": 1762917511562, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes using features from video diffusion transformers as a backbone for point tracking. On TAP-Vid dataset, the method shows strong robustness and competitive accuracy. Zero-shot DiT features already outperform a supervised ResNet backbone under occlusion and motion blur condition, and the upsampler + refiner improve fine localization."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1. This paper presents a study on video DiTs for point tracking and demonstrates that it outperforms ResNet under conditions involving large motion, occlusion, and motion blur.\n2. The authors conducted extensive evaluations showing that their backbone surpasses CoTracker3 and other competing backbones.\n3. The paper is well-written and easy to follow."}, "weaknesses": {"value": "1. This paper does not introduce a new method. It only replaces the standard backbone with a Video DiT.\n2. Table 4 claims that Video DiTs mitigate performance degradation. However, CoTracker3 still achieves much better performance, even under greater degradation.\n3. The Video DiT model is computationally heavy and requires much more GPU memory."}, "questions": {"value": "1. The refiner is expected to significantly improve performance in other models; however, according to Table 2, it only provides a slight improvement here. Could you explain why?\n2. Could you provide results for the other complete model, not just the backbone?\n3. Could you clarify what you mean by zero-shot point tracking?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ocFZf3h9nw", "forum": "bhuFwR5rOS", "replyto": "bhuFwR5rOS", "signatures": ["ICLR.cc/2026/Conference/Submission4685/Reviewer_fAdW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4685/Reviewer_fAdW"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission4685/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761980969202, "cdate": 1761980969202, "tmdate": 1762917510618, "mdate": 1762917510618, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}