{"id": "bIluMStaUC", "number": 12328, "cdate": 1758207085954, "mdate": 1763769478507, "content": {"title": "AI Realtor: Towards Grounded Persuasive Language Generation for Automated Copywriting", "abstract": "This paper develops an agentic framework that employs large language models (LLMs) for grounded persuasive language generation in automated copywriting, with real estate marketing as a focal application. \nOur method is designed to align the generated content with user preferences while highlighting useful factual attributes.\nThis agent consists of three key modules: (1) Grounding Module, mimicking expert human behavior to predict marketable features; (2) Personalization Module, aligning content with user preferences; (3) Marketing Module, ensuring factual accuracy and the inclusion of localized features.  \nWe conduct systematic human-subject experiments in the domain of real estate marketing, with a focus group of potential house buyers. The results demonstrate that marketing descriptions generated by our approach are preferred over those written by human experts by a clear margin while maintaining the same level of factual accuracy. \nOur findings suggest a promising agentic approach to automate large-scale targeted copywriting while ensuring factuality of content generation.", "tldr": "To what extent LLMs can generate grounded, persuasive language for automated copywriting", "keywords": ["Persuasive Language Generation", "Large Language Model", "Automated Copywriting"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0fa841c3e6ab9afa32c8bf056f6a1afcff016f4c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes an agentic framework for grounded, personalized persuasive copy in real estate marketing. The agent has three modules—Grounding (attribute to feature mapping), Personalization (eliciting user preferences), and Marketing (factuality + localized “surprisal” via RAG)—and reports human-subject evaluations where AI Realtor wins ~70% vs. human experts at similar factuality (Elo analysis)"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* This paper is well-motivated and uses real estate as a concrete, measurable domain for grounded persuasion.\n* Personalization design (explicit preference elicitation + selection) and localized “surprisal” via retrieval grounded are novel and plausible mechanisms for persuasion\n* The method shows strong gains over human baselines on Real Estate Marketing data"}, "weaknesses": {"value": "* The experiment results appear confined to one city/region and a particular property distribution. Persuasion effects are culturally and economically sensitive; cross-market experiment is needed to validate the method's effectiveness. Currently the evidence might be insufficient to show the design generalizes beyond real estate. \n* Module ablations show aggregate deltas but not where each module matters. No ablation studies of personalization weight / rarity threshold.\n* For a production-adjacent contribution, the paper needs latency, cost, and throughput analysis (for example, per-listing generation time, retrieval budget), and robustness under noisy/missing attributes."}, "questions": {"value": "* How stable are outcomes across cities/price bands and demographics? \n* How sensitive are results to $\\alpha$ (feature existence), $c$ and $r_{0}$ (personalization strength)? \n* Is the SFT method evaluated as a standalone model or a SFT model with the full modular system? Have we tried experiment with smaller model with full modular system?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7kMckCBj0J", "forum": "bIluMStaUC", "replyto": "bIluMStaUC", "signatures": ["ICLR.cc/2026/Conference/Submission12328/Reviewer_amxD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12328/Reviewer_amxD"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12328/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761636856045, "cdate": 1761636856045, "tmdate": 1762923251834, "mdate": 1762923251834, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this work, the authors focus on the task of language generation for grounded persuasion, especially targeting the domain of real estate marketing. For this task, they propose a new benchmark by constructing a corresponding new dataset. Furthermore, to solve the task, they also propose a LLM-based agent on a pipeline that comprises a Grounding Module, mimicking human expertise in identifying and signaling critical, credible selling points, a Personalization Module, tailoring content to user preferences, and a Marketing Module, ensuring factual consistency and incorporating localized features. This pipeline-based workflow is supported by economic theory. Experimental results on the proposed benchmark show the superiority of the proposed pipeline-based agent in win rate and Elo rating against other LLM-based approaches."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- This work provides a new benchmark with a new dataset.\n- The evaluation is conducted on large-scale human judgment and is thus reliable.\n- The authors provide a specific new approach for this task, which is supported by economic theory.\n- The proposed approach actually outperforms the baseline in their reliable experiments.\n- The ablation study shows the importance of the proposed modules."}, "weaknesses": {"value": "- The target model in the experiment is restricted to GPT-4o and GPT-4o-mini.\n- The used baselines are weak. Reasoning models, inference time scaling approaches, and other agent-based approaches are not used."}, "questions": {"value": "- What kind of decoding approach did you use? Greedy (temperature = 0) or sampling (temperature > 0)?\n- Do the baseline methods also use RAG in their inference?\n- In the SFT baseline, what kind of fine-tuning did you use? (e.g., with or without LoRA)\n- In the use of RAG, how many documents are retrieved for each prompt?\n\nMinor comment:\n- The equation on p.8 sticks out to the right margin of the paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "yHVjA0Clyl", "forum": "bIluMStaUC", "replyto": "bIluMStaUC", "signatures": ["ICLR.cc/2026/Conference/Submission12328/Reviewer_LGBp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12328/Reviewer_LGBp"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12328/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761991018177, "cdate": 1761991018177, "tmdate": 1762923251539, "mdate": 1762923251539, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents AI Realtor, a LLM-based agentic framework that generates persuasive and fact-grounded real-estate contents. The system is decomposed into three modules: grounding module, personalization module and marketing module."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1) The topic of this paper is meaningful and practical. The experimental results on the benchmark demonstrate considerable improvements. \n2) Overall, the paper demonstrates a high standard in methodology design, experimental scale, and human evaluation, the work is relatively solid."}, "weaknesses": {"value": "1) All three modules are straightforward combinations of existing techniques and the novety is limited.\n2) The Hallucination evaluation setting is simple, especially considering the hallucination characteristics of LLM-intrinsic, I do wonder more details of this part."}, "questions": {"value": "See the weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jFRd2vuWnc", "forum": "bIluMStaUC", "replyto": "bIluMStaUC", "signatures": ["ICLR.cc/2026/Conference/Submission12328/Reviewer_5Q3B"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12328/Reviewer_5Q3B"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12328/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761994830776, "cdate": 1761994830776, "tmdate": 1762923251172, "mdate": 1762923251172, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper instantiates a benchmark for persuasive writing inspired by real-estate marketing (REM). REM is chosen because it has (1) rational decision makers, (2) monetary implications for both the buyer and the seller, and (3) structured data sources for grounding. In particular, the authors use real house descriptions from Zillow for the Chicago area and gather annotators who are interested in and rational about buying houses. The task is framed as writing persuasive marketing descriptions for a property that appeal to the annotator's personal preferences.\n\nTwo descriptions for the same property written by different sources are presented and pairwise win-rates are collected. Baselines include static human-written descriptions already present on the website, and vanilla LLM and fine-tuned LLM written copy that uses all the attributes of the listing.\n\nAI Realtor on the other hand elicits user preferences with a survey, and identifies listing features that are would appeal to a user. Finally, an LLM (GPT-4o / GPT-4o-mini) is used to write a short description of the property that attempts to persuade the target user by highlighting personalized/stand-out features. AI Realtor includes:\n1. Grounding Module to identify abstract property features from the property listing. The paper presents a framework to build this feature space from existing marketing descriptions.\n2. Personalization Module to elicit features that are preferred by a particular user and then identifying if such features are present in a given listing.\n3. Marketing Module to identify stand-out features about a listing relative to other listings in the region\n\nResults show that user consistently prefer the AI Realtor copy over both the human-written and vanilla LLM-written copy. LLM-as-a-Judge (with human-validation) shows that the Grounding module reduces hallucinations in the AI Realtor written descriptions.\n\nA study is conducted to measure whether LLMs can simulate the users as a means to automate the benchmark. However, initial results suggest that modeling personal preferences is difficult and noisy i.e. in the near term, such benchmarks will need to use real human annotators and cannot be automated."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. The argument for using real-estate marketing (REM) as a testbed for persuasion is very persuasive (caveat in the next section)\n    - REM requires grounded persuasion and has measurable economic impact. The source listings are information dense such that persuasion requires selecting the right subset of information to highlight based on the target user\n2. The components of AI Realtor are motivated by the real demands of REM\n    - The evaluations of factuality show that the AI Realtor can generate persuasive copy grounded in the listed property attributes\n    - Marketing and Personalization modules are motivated by criteria known to persuade the audience\n3. The potential for simulating the benchmark (and the lack thereof) is valuable information"}, "weaknesses": {"value": "1. (Re strength 1) The importance of the description in the real-estate marketing is unclear. Zillow provides exact address, house attributes, and pictures. How important is the descriptive passage in selecting to visit/buy a property compared to the attributes (the pictures for example)?\n2. I have certain questions about the definition and evaluation of factuality\n    - The extent of information available in the house \"attributes\" is unclear. So it's hard to understand what inferences are valid and which inferences aren't. Consider the cases below.\n    - A statement made by a human realtor about a property (within walking distance to a swimming pool) may be true and demonstrable but may not be explicitly listed in the Zillow house attributes. How is the factuality of such a statement judged? Would the human-written copy be penalized for hallucination?\n    - The description in Figure 8 mentions \"Minutes from the Lake down Irving\". Does this mean that the distance of local landmarks is part of the attributes?\n3. ELO is sensitive to the order of comparisons. Please provide confidence intervals on the ELO estimates with bootstrapping (e.g. [LMArena](https://colab.research.google.com/drive/1RAWb22-PFNI-X1gPVzc927SGUdfr6nsR?usp=sharing) provides confidence intervals)"}, "questions": {"value": "Clarifications\n---\n1. Line 429: This line seems to contradict Fig 5 factuality judgements on soft attributes match more than judgements on hard attributes\n2. App E2: Human evaluation of factuality measures whether each attribute is faithfully depicted in the description. However, it does not measure whether all features in the description are grounded in the attributes. Thus, there seems to be a mismatch in how factuality is defined for the human raters vs the LLM-as-a-judge\n\nSuggestions\n---\nLine 83: A single Reddit anecdote cannot be called a \"recent report\""}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PNBlqAxopq", "forum": "bIluMStaUC", "replyto": "bIluMStaUC", "signatures": ["ICLR.cc/2026/Conference/Submission12328/Reviewer_h9UB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12328/Reviewer_h9UB"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12328/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762118252250, "cdate": 1762118252250, "tmdate": 1762923250765, "mdate": 1762923250765, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}