{"id": "BLJ5DsJ0i6", "number": 12060, "cdate": 1758205457017, "mdate": 1763758275136, "content": {"title": "GraphPFN: A Prior-Data Fitted Graph Foundation Model", "abstract": "Foundation models pretrained on large-scale datasets have transformed such fields as natural language processing and computer vision, but their application to graph data remains limited. Recently emerged graph foundation models, such as G2T-FM, utilize tabular foundation models for graph tasks and were shown to significantly outperform prior attempts to create GFMs. However, these models primarily rely on hand-crafted graph features, limiting their ability to learn complex graph-specific patterns. In this work, we propose GraphPFN: a prior-data fitted network for node-level prediction. First, we design a prior distribution of synthetic attributed graphs. For graph structure generation, we use a novel combination of multiple stochastic block models and a preferential attachment process. We then apply graph-aware structured causal models to generate node attributes and targets. This procedure allows us to efficiently generate a wide range of realistic graph datasets. Then, we augment the tabular foundation model LimiX with attention-based graph neighborhood aggregation layers and train it on synthetic graphs sampled from our prior, allowing the model to capture graph structural dependencies not present in tabular data. On diverse real-world graph datasets with up to $50{,}000$ nodes, GraphPFN shows strong in-context learning performance and achieves state-of-the-art results after finetuning, outperforming both G2T-FM and task-specific GNNs trained from scratch on most datasets. More broadly, our work demonstrates that pretraining on synthetic graphs from a well-designed prior distribution is an effective strategy for building graph foundation models.", "tldr": "", "keywords": ["graph foundation models", "tabular foundation models", "LimiX", "graph neural network", "graph machine learning"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a41c4410e4a1c66cae7f96cfb965d994cd7638eb.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes GraphPFN, which augments the tabular FM LimiX with attention-based message-passing adapters and pretrains them (PFN style) on synthetic graphs drawn from a novel prior that mixes degree-corrected SBMs, preferential attachment (to induce core-periphery), and graph-aware SCMs (MLP/GNN-mixed, optional LapPE). It shows promising ICL on some datasets and SOTA after finetuning on graphs up to ~50k nodes, though several settings hit OOM and TFMs’ class-count limits remain."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper proposes a clear architectural idea: lightweight graph adapters (masked attention over adjacency) added to each LimiX block; retains PFN ICL while enabling learned structural reasoning.\n2. The paper combines multi-SBM with preferential attachment to mimic community + core-periphery; attributes from graph-aware SCM (MLP/GNN mix, optional LapPE).\n3. The pretraining scale is large with 4M synthetic samples and 500k steps."}, "weaknesses": {"value": "1. The efficiency is still the bottleneck. The model processes the whole graph jointly; OOM prevents FT on multiple datasets and the paper itself flags poor scaling. Provide rigorous memory/throughput curves and practical remedies.\n2. Task breadth is narrow. Despite an MGM head, the method remains node-only; no on-main link/graph-level results, so the “foundation” scope is limited.\n3. The baselines are limited. Not enough recent graph transformers or foundation models are compared. This could make the sota claim less effective.\n4. ICL trails G2T-LimiX on heavy, structurally different graphs (e.g., hm-prices, city-roads-M), and authors attribute this to prior mismatch—but evidence and how to solve the mismatch is lack of discussion."}, "questions": {"value": "1. Can the pretrained model be extended to other graph-related tasks? And what kind of changes are needed for the pretraining datasets and methods.\n2. Can you integrate sampling (random walk) or chunked/sparse attention to avoid whole-graph processing?\n3. What is performance vs. number/selection of labeled context nodes and class imbalance?\n4. Could you please ablate MGM weight, LapPE during pretraining vs. downstream, and adapter placement per block; quantify where LapPE helps/hurts?\n5. Could the author compare the method with more up-to-date baselines?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dRRGMt08WM", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Reviewer_4qnR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Reviewer_4qnR"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761759986890, "cdate": 1761759986890, "tmdate": 1762923035640, "mdate": 1762923035640, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes GraphPFN, a graph foundation model for node-level prediction that extends the tabular foundation model LimiX by adding attention-based message-passing adapters to each transformer block. The model is pretrained on 4 million synthetic graphs sampled from a prior that combines multiple stochastic block models with preferential attachment for structure generation, and augments tabular structured causal models with message-passing mechanisms for attribute generation."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Motivation:  The proposed method combines multiple degree-corrected SBMs to address the \"too clean\" cluster problem in single-SBM generations, and the preferential attachment augmentation naturally to create the core-periphery structure in social and information networks, which sounds interesting. \n\nMethod: Rather than training a graph model from scratch, the authors initialize from LimiX and add sparse message-passing adapters that respect the per-feature tokenization. The motivation seems reasonable since it lets the model learn what to aggregate rather than relying entirely on hand-crafted features like G2T-FM does.\n\nEmpirical results: The overall performance is not bad if fully fine tuned."}, "weaknesses": {"value": "Scalability: The scalability issues are frankly concerning for something claiming to be a foundation model. GraphPFN hits out-of-memory errors on 3 of 11 datasets during finetuning, that's failing on 27% of your own benchmark. What's worse is that these failures happen at 148K-168K nodes, I don't think these graph datasets are big enough comparing with OGB datasets. While the authors acknowledge this in Appendix A, but this isn't just a limitation to note. It fundamentally undermines the claim of \"foundation model\"  which should be scalable. The paper needs a more concrete solution (even if preliminary).\n\nPrior analysis: The prior coverage problem reveals a deeper issue with the core contribution. When GraphPFN performs dramatically worse than G2T-LimiX on datasets like hm-prices or city-roads-M, and the explanation is \"The proposed graph prior does not cover graphs from specific domains\". That's a problem with the prior design, not just an implementation detail. The manuscript provides no quantitative validation that synthetic graphs match real-world statistics like degree distribution, clustering coefficient, or assortativity. The prior appears tailored to social/information networks without demonstrated generalization to physical/spatial networks. The core claim that pretraining on synthetic graphs from a well-designed prior is effective lacks sufficient support when systematic failures occur on specific graph types.\n\nInsufficient ablation of critical design choices: The manuscript lacks ablations for several key decisions. The rationale for adding adapters to every LimiX block rather than fewer layers is unexplored. The choice to freeze LimiX layers during pretraining instead of joint training lacks justification through empirical comparison. The individual contribution of the masked graph modeling objective versus supervised PFN loss remains unclear, and the 0.1 coefficient for MGM appears arbitrary without sensitivity analysis. Performance sensitivity to the number of pretraining graphs (4M) and steps (500K) is unexplored despite Figure 2 showing continued improvement at 500K steps. The effect of prior hyperparameters like mixing probability p or LapPE inclusion frequency lacks systematic investigation. Furthermore, the compared GNN models are just so limited and many current state-of-the-art models are not included especially graph transformers and heterophilic GNNs.\n\nModel comparison: G2T-FM uses Laplacian positional encodings (LapPE) in all experiments while GraphPFN do not use them at all, creating uneven comparison where G2T-FM accesses global positional information unavailable to GraphPFN base variant. G2T-FM employs neighborhood-aggregated features computed via explicit aggregation while GraphPFN relies on learned message passing. These differences prevent isolating whether improvements stem from trainable message passing specifically versus superior feature engineering. Further ablation study on this aspect should be conducted.\n\nWeak in-context learning performance without systematic analysis: GraphPFN's ICL performance is substantially worse than G2T-LimiX on multiple datasets, sometimes by large margins (e.g., hm-prices: 68.02 vs. 74.96). This indicates the model has not fully learned to perform ICL on graphs, this really undermines a key promise of the PFN framework. If ICL performance is unreliable, GraphPFN's value as a zero-shot foundation model is limited, reducing it primarily to a pretrained initialization for finetuning. The manuscript provides no systematic analysis correlating ICL success with graph properties like size, density, or community structure to understand when the approach is applicable.\n\nValidation of graph prior quality: The manuscript lacks quantitative validation that synthetic graphs match real-world distributions. Figures 3-4 provide only qualitative visualizations without comparing metrics like degree distribution, clustering coefficient, or graph diameter against real datasets. An analysis demonstrating that real datasets fall within the statistical distribution of synthetic graphs would substantiate claims about prior quality and coverage. The absence of such validation makes it difficult to assess whether poor performance on certain datasets stems from fundamental approach limitations or simply inadequate prior design.\n\nPresentation: The overall presentation has many problems. 1) Captions are sloppy and not informative. 2) Some terms are not defined such as \"OOM\" even though I understand what is stands for but it should be clearly defined. \n\nOverall, I feel that this paper is only half-finished, as many important aspects, especially those related to scalability, are not thoroughly addressed. More importantly, while the manuscript claims to focus on graph foundation models, it only evaluates node-level tasks, which makes its scope far too narrow."}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "UkUPyG14eL", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Reviewer_X1vi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Reviewer_X1vi"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761850242809, "cdate": 1761850242809, "tmdate": 1762923035126, "mdate": 1762923035126, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose GraphPFN, a method for adapting pre-trained tabular foundation models (TFM) to graph data by augmenting a TFM with a message-passing layer, and pre-train it on a large variety of synthetic graphs with causal, structurally-correlated node features. They demonstrate that GraphPFNs perform largely on par with or better than G2T-FMs across tasks in both in-context learning and fine-tuning setting, while avoiding expensive pre-processing required by G2T-FMs."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The core idea is interesting and potentially impactful. Leveraging pre-trained tabular foundation models (TFM) for GFMs is a sensible idea.\n2. The integration of the graph adapters is a smart way of injecting structural inductive biases into TFMs effectively, without resorting to costly hand-crafted features (the avenue taken by G2T-FMs).\n3. The results are overall convincing to the extent that the resulting models can compete with G2T-FMs and GNNs.\n4. The paper is well-written, despite requiring substantial background on several areas the bare minimum for the background is mostly provided, and the overall presentation is clear and coherent."}, "weaknesses": {"value": "1. The graph structure generation process seems mostly guided by an “eye test” on what “realistic” graphs _should_ look like. While I appreciate the authors’ efforts to go beyond simple synthetic graphs (SBM/ER/BA graphs etc.) and provide a generation algorithm that outputs a rather rich distribution of graphs, I’m not fully convinced that pre-training only on graphs from a single family of distributions is sufficient to capture real-world graph complexity. The authors clearly acknowledge this in section 5.2 and Appendix A (which I appreciate), where this phenomenon is reflected in the limited performance of GraphPFN (ICL) on certain datasets.\n2. GraphPFN results are largely _on par with_, rather than consistently beating G2T-FMs across the benchmarks tested. I acknowledge that G2T-FMs typically perform better on downstream tasks where the datasets fit the graph prior better, however. Given comparable performance with G2T-FMs, I think the advantage of GraphPFN is the lack of reliance on hand-crafted features, and as a (likely result) faster evaluation, though the authors have not conducted any experiments (see Suggestion 1).\n3. There are several issues with the evaluation procedures:\n   - The GNN benchmarks are not provided with LapPE features, unlike GraphPFN,  resulting in an unfair comparison (see Suggestion 2).\n   - Another factor that prevents fair comparison is that no information is provided on model sizes and training/pre-processing/inference efficiency. This is especially crucual in evaluating GraphPFN since it’s clear that the model is quite large, taking 6 days with eight A100s to pre-train _only_ the graph adapter layers, and leading to OOM errors in fine-tuning on certain datasets. When discussing foundation models parameter efficiency is an important metric to pay attention to, and it seems in this paper this dimension is wholly omitted (see Suggestion 1)."}, "questions": {"value": "**Questions:**\n1. During pre-training, all layers except the graph adapters are frozen. Was a non-frozen model considered, and would there be there any potential benefits in pre-training the whole model?\n2. Given the reliance of GraphPFN on synthetic graphs in pre-training despite the need for a realistic graph prior, can we not consider leveraging existing graph datasets either instead of or alongside synthetic graphs?\n3. How does GraphPFN (with/without LapPE) compare with G2T-FMs in terms of any pre-processing and inference speed? I would expect GraphPFN (without LapPE) to perform inference faster since they don’t need to precompute encodings or structural statistics.\n\n**Suggestions:**\n1. More information regarding parameter counts and training/pre-processing/inference efficiency is required to better compare the GraphPFN and the baseline models (particularly the G2T-FMs) in a fair manner. I would imagine this would also help the authors make the point that not relying on hand-crafted features makes GraphPFN faster than G2T-FMs (assuming this holds; if not, please explain why).\n2. Considering that some GNN benchmarks already outperform GraphPFN (ICL, without LapPE) on some datasets (`hm-prices`, `city-roads-M`, `questions`), GNN results with LapPE would provide a fairer comparison against stronger benchmarks; I suggest the authors provide them as well. Note that I am aware that the GraphPFN (ICL) results are with no additional training on the downstream dataset, so comparable results against GNNs are already impressive in their own right.\n3. Referring to the UniMP model (Shi et al., 2021) as GT is confusing, given that acronym’s use for _graph transformers_ which typically leverage global attention over the graph. A minor suggestion is to use the UniMP convention.\n\n**Conclusion:** I am very on the fence with this paper; the proposed idea is nice and seems to be implemented well. However, it seems to me the authors have failed to capitalize on the proposed method’s key advantage over G2T-FMs in not relying on costly hand-crafted features, and with performance against the baseline models being rather on par rather than a clear win, it’s hard to evaluate the true potential impact of the paper. I therefore recommend a tentative acceptance, and encourage the authors address the aforementioned concerns to arrive at a stronger paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "LZL0EnQaGf", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Reviewer_PBKF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Reviewer_PBKF"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761856424739, "cdate": 1761856424739, "tmdate": 1762923034372, "mdate": 1762923034372, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces GraphPFN, a prior-data fitted network for node-level prediction that builds graph foundation models (GFMs) through synthetic pretraining. It generates diverse, realistic graphs using a hybrid of stochastic block models and preferential attachment, combined with graph-aware causal models for attributes and targets. By augmenting the tabular foundation model with attention-based neighborhood aggregation and training on these synthetic graphs, GraphPFN achieves strong performance."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. This paper studies an interesting and practical research question of applying synthetic data in large-scale pretraining.\n2. The proposed data generation pipeline seems reasonable."}, "weaknesses": {"value": "1. The writing of this paper is confusing and the core contribution of the work is not well presented. In the introduction (line 066), the authors mentioned \"but such models still depend heavily on hand-crafted features and, as a result, are limited in their ability to capture complex graph patterns.\" This challenge is addressed by the proposed message-passing layer which replaces the structural features. However, the motivation of utilizing synthetic data pretraining is not discussed, which has no clear connection to the challenges mentioned. \n2. Efficiency concern: the proposed method builds on existing TFMs and requires post-training involving massive compute resources(8*A100*6days). At inference time, it involves dataset-specific fine-tuning to achieve the claimed SOTA performance. Given the lack of efficiency comparison, I doubt the real gains of the proposed method over baselines. \n3. Misleading experimental results: Table 2 compares GraphPFN with baselines. However, the gains of GraphPFN are inconsistent, with OOM issues which were not observed in baselines. Since a core edge of GraphPFN is that it does not rely on hand-crafted features, it is not reasonble to include the results for the LapPE enhanced version. As a result, the original version of the proposed method is less competitive, especially when compared with G2T. \n4. The data generation process involves many hyperparameters. Though the authors claim that they can be sampled from some distribution, the details are missing and the method still heavily relies on trial-and-error, limiting its real-world applicability."}, "questions": {"value": "1. What is the initial motivation of applying synthetic data pretraining? Can it be replaced by real-world data, or a mix of both? \n2. How does the properties and amounts of pretraining data affect performance?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "NeRpi4IM3t", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Reviewer_P18Y"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Reviewer_P18Y"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761973895720, "cdate": 1761973895720, "tmdate": 1762923033986, "mdate": 1762923033986, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "New Experimental Results"}, "comment": {"value": "Dear Reviewers,\n\nIn this general comment, we present some new experimental results that are relevant to the comments of several reviewers. \n\nIn the table below we show the results of new checkpoints that have better downstream performance. Here, GraphPFN is the checkpoint from the submission version and GraphPFN-1.1 is the updated version. Most important changes include adding EMA weight averaging during pretraining for improving stability and updating hyperparameters of the prior to cover larger and more dense graphs. As one can see, the overall results are better now, with particularly noticeable improvements on `hm-prices`, `avazu-ctr`, `twitch-views` and `artnet-views`. \n\nWe also experimented with finetuning GraphPFN-1.1 on larger graphs with even higher density, and the corresponding checkpoint is called GraphPFN-1.1-dense. It even further improves the results on `hm-prices` and `twitch-views`, supporting our hypothesis that poor performance on these datasets was caused by lack of dense enough graphs in the prior.\n\n|                                   | pubmed       | facebook     | amazon-ratings | questions    | wiki-cs      | tolokers-2   | city-reviews | artnet-exp   | hm-prices    | avazu-ctr    | city-roads-M | twitch-views | artnet-views |\n| :-------------------------------- | :----------- | :----------- | :------------- | :----------- | :----------- | :----------- | :----------- | :----------- | :----------- | :----------- | :----------- | :----------- | :----------- |\n| G2T-LimiX (ICL)                   | 88.96 ± 0.18 | 91.29 ± 0.14 | 44.10 ± 0.16   | 15.31 ± 0.77 | 79.99 ± 0.28 | 61.48 ± 0.30 | 77.72 ± 0.54 | 48.43 ± 0.18 | 74.96 ± 0.06 | 32.39 ± 0.14 | 64.53 ± 0.07 | 71.08 ± 0.07 | 60.95 ± 0.10 |\n| GraphPFN (ICL)                    | 89.76 ± 0.02 | 90.23 ± 0.03 | 43.71 ± 0.03   | 12.30 ± 0.05 | 77.29 ± 0.03 | 58.95 ± 0.02 | 79.52 ± 0.01 | 49.97 ± 0.01 | 68.02 ± 0.02 | 21.67 ± 0.05 | 58.93 ± 0.02 | 59.95 ± 0.08 | 58.87 ± 0.01 |\n| GraphPFN  + LapPE (ICL)           | 89.41 ± 0.09 | 91.45 ± 0.16 | 42.64 ± 0.22   | 9.62 ± 0.16  | 79.13 ± 0.37 | 61.18 ± 0.11 | 79.73 ± 0.08 | 49.68 ± 0.04 | 68.56 ± 0.10 | 23.33 ± 0.47 | 58.61 ± 0.41 | 63.66 ± 0.77 | 60.31 ± 0.09 |\n| GraphPFN-1.1 (ICL)                | 89.53 ± 0.03 | 91.21 ± 0.01 | 43.88 ± 0.03   | 18.67 ± 0.04 | 79.48 ± 0.05 | 60.01 ± 0.03 | 79.31 ± 0.01 | 50.30 ± 0.01 | 71.45 ± 0.02 | 30.07 ± 0.01 | 61.86 ± 0.03 | 62.37 ± 0.04 | 61.70 ± 0.01 |\n| GraphPFN-1.1 + LapPE (ICL)        | 89.40 ± 0.15 | 91.00 ± 0.23 | 43.32 ± 0.15   | 12.48 ± 0.37 | 79.82 ± 0.25 | 61.47 ± 0.17 | 79.56 ± 0.06 | 50.26 ± 0.05 | 71.57 ± 0.06 | 30.83 ± 0.22 | 61.80 ± 0.15 | 69.08 ± 0.34 | 62.93 ± 0.04 |\n| GraphPFN-1.1-dense (ICL)          | 89.06 ± 0.03 | 90.83 ± 0.03 | 42.24 ± 0.04   | 15.93 ± 0.04 | 79.14 ± 0.02 | 60.43 ± 0.03 | 78.00 ± 0.01 | 51.46 ± 0.01 | 74.09 ± 0.02 | 29.63 ± 0.01 | 60.27 ± 0.04 | 68.07 ± 0.06 | 61.64 ± 0.01 |\n| GraphPFN-1.1-dense  + LapPE (ICL) | 88.51 ± 0.09 | 90.02 ± 0.30 | 42.18 ± 0.15   | 10.60 ± 0.63 | 80.13 ± 0.19 | 61.35 ± 0.21 | 77.97 ± 0.15 | 51.87 ± 0.07 | 74.18 ± 0.05 | 30.90 ± 0.32 | 60.55 ± 0.22 | 71.60 ± 0.28 | 62.26 ± 0.09 |\n\nBest regards,\n\nAuthors"}}, "id": "Zsj8bbQdDT", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Authors"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763758441846, "cdate": 1763758441846, "tmdate": 1763758441846, "mdate": 1763758441846, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General Response"}, "comment": {"value": "Dear Reviewers,\n\nWe thank you for your insightful feedback. We addressed the specific comments and questions in individual responses below. In this general response, we want to elaborate on why we believe GraphPFN is an important step for GFMs.\n\nThe development of GFMs, even those restricted to node-level tasks only, faces several fundamental challenges. First, **graphs do not constitute a single domain**, but rather serve as a way to represent data from different domains from social and web networks to road graphs. This makes it challenging to achieve knowledge transfer between different datasets. Second, there is a **lack of high-quality, large-scale, diverse graph datasets for pretraining GFMs**. In contrast to CV or NLP, the amount of available data in graph ML is orders of magnitude smaller.\n\nIn our opinion, **none of prior GFMs, except recently proposed G2T-FM, managed to convincingly address these challenges** for graphs with arbitrary node features, meaningful prediction tasks and realistic data splits. Most progress so far has been limited to either text-attributed graphs, where tasks can be unified via text encoders, or to few-shot scenarios, which are less practical for many real-world applications.\n\nAt the same time, **tabular ML faces similar challenges, and this domain has recently seen the emergence of successful foundation models**, such as TabPFNv2 and LimiX. These models demonstrate strong empirical performance and, in certain settings, outperform task-specific models trained from scratch. Most TFMs follow the PFN framework [1], and we believe that, as for now, **PFNs offer the most promising path toward foundation models for both tabular and graph domains**.\n\n**Our position is supported by experimental results of PFNs in the tabular domain**, and we also have several hypotheses about why PFNs function well as foundation models. First, their in-context capabilities enable them to potentially capture patterns not only at the level of individual samples, but also at the level of the whole dataset, treating other samples as useful context. We suppose that this can be crucial for heterogeneous domains like graphs or tables. Second, given the insufficient amount of real-world pretraining data in comparison to CV and NLP, the use of synthetic datasets becomes a feasible and effective alternative. The flexibility of synthetic data also enables us to control the knowledge acquired by the foundation model.\n\nHowever, **despite their success in the tabular domain, PFNs are not yet fully adopted to graphs**, and GraphPFN is the next step in this direction. While G2T-FM has shown that PFN-based TFMs can outperform both GNNs and prior GFMs, it relies on hand-crafted features to capture graph interactions and was not pretrained on graph data. In GraphPFN, we address these limitations by using learnable message passing layers and pretraining the model on synthetic datasets drawn from a carefully designed prior. To the best of our knowledge, GraphPFN is the first successful model pretrained in the PFN framework specifically for graph data.\n\nTherefore, **the key contribution of our work is that it shows that the PFN framework can be adapted for graph learning tasks and show decent performance**. Although much work remains, including the design of a better graph prior distribution, the investigation of a more effective graph-specific PFN architecture, scaling to larger graphs and addressing link- and graph-level tasks, our results show a clear and promising direction forward. We hope that our work will support further development of GFMs and will inspire further research in this area.\n\nBest regards,\n\nAuthors"}}, "id": "l2nhuiwXEv", "forum": "BLJ5DsJ0i6", "replyto": "BLJ5DsJ0i6", "signatures": ["ICLR.cc/2026/Conference/Submission12060/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12060/Authors"], "number": 6, "invitations": ["ICLR.cc/2026/Conference/Submission12060/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763758500033, "cdate": 1763758500033, "tmdate": 1763758500033, "mdate": 1763758500033, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}