{"id": "Bp3I456do5", "number": 8655, "cdate": 1758093843122, "mdate": 1763613782201, "content": {"title": "Debiased and Denoised Projection Learning for Incomplete Multi-view Clustering", "abstract": "Multi-view clustering achieves outstanding performance but relies on the assumption of complete multi-view samples. However, certain views may be partially unavailable due to failures during acquisition or storage, resulting in distribution shifts across views. Although some incomplete multi-view clustering (IMVC) methods have been proposed, they still confront the following limitations: 1)  Missing-view data imputation methods increase the unnecessary computational complexity; 2) Consensus representation imputation methods always ignore the inter-view distribution bias due to missing views. To tackle these issues, we propose a novel IMVC based on projection debiasing and denoising (PDD). Specifically, it utilizes the unbiased projection learned from complete views to refine the biased projection learned from data with missing views. Additionally, we introduce a robust contrastive learning for consensus projection to mitigate cluster collapse risk induced by misalignment noise. Comprehensive experiments demonstrate that PDD achieves superior performance compared with state-of-the-art methods.", "tldr": "We propose a consensus projection refinement strategy for deep incomplete multi-view clustering, aiming to mitigate cluster collapse risk induced by misalignment noise.", "keywords": ["Incomplete multi-view clustering", "projection debiasing and denoising", "robust contrastive learning."], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/4631c7f4c756b5d765248980c38e210f18f76b5d.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces PDD (Projection Debiasing and Denoising), a framework for Incomplete Multi-View Clustering (IMVC). The framework addresses challenges such as distribution shifts caused by missing views and cluster collapse due to misalignment noise. By employing unbiased projection refinement and denoised contrastive learning, PDD achieves SOTA performance on multiple datasets under varying missing rates."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.The use of unbiased projection refinement corrects distribution shifts in biased projections, enhancing consensus embeddings.\n2. The framework is robust under varying missing-view rates (10%–70%), outperforming nine strong baselines."}, "weaknesses": {"value": "(1) It is not straightforward to learn the denoising effect of denoising contrastive loss, which should be explained.  \n(2) It is not clear why the model imputes the missing views in both the representation space and sample space."}, "questions": {"value": "(1) Is the proposed model suitable for large-scale datasets?\n(2) Does the proposed model perform stably across all missing rates?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "upr96Z4SEF", "forum": "Bp3I456do5", "replyto": "Bp3I456do5", "signatures": ["ICLR.cc/2026/Conference/Submission8655/Reviewer_knnk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8655/Reviewer_knnk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761897363742, "cdate": 1761897363742, "tmdate": 1762920474806, "mdate": 1762920474806, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a novel incomplete multi-view clustering framework. An adaptive projection matrix is constructed to integrate complementary information across views. Then, through an attention-based strategy, the framework utilizes unbiased projection to correct the distribution shift of biased projections, thereby obtaining a bias-corrected consensus projection. By maximizing the mutual information, it enhances cross-view semantic correlations. Finally, an innovative denoising contrastive learning strategy is introduced to alleviate the risk of clustering collapse caused by multi-view heterogeneity and misaligned noise."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.This paper proposes a novel framework named PDD based on debiasing and denoising projection learning. By combining attention mechanisms with contrastive learning, it effectively addresses distribution shifts and clustering collapse caused by missing views in incomplete multi-view clustering.\n\n2.It introduces a denoising contrastive loss based on truncated power series approximation, which transforms the unbounded amplification of hard samples in the InfoNCE loss into a bounded constraint, balancing positive sample discriminability and noise suppression."}, "weaknesses": {"value": "1. There lacks a convergence analysis.\n2. In addition to \\lambda_{1} and \\lambda_{2}, there are also hyperparameters $\\alpha$ and $C$, for which the authors do not provide detailed explanations regarding the principles behind their selection.\n3. This paper proposes a projection matrix based on prior separability, using variance to measure the projection weights of each view. More expanations should be provided on whether this could lead to imbalanced projections across views."}, "questions": {"value": "1.Can the model converge stably? It is recommended that the authors add convergence analysis experiments to demonstrate the stability and convergence of the proposed algorithm.\n\n2.What are the selection principles for the hyperparameters $\\alpha$ and $C$ in this paper? Please provide a detailed explanation.\n\n3.Please provide an explanation for the issue mentioned in weakness 3."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "RBsOtj0oUm", "forum": "Bp3I456do5", "replyto": "Bp3I456do5", "signatures": ["ICLR.cc/2026/Conference/Submission8655/Reviewer_qR7X"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8655/Reviewer_qR7X"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761929960351, "cdate": 1761929960351, "tmdate": 1762920474105, "mdate": 1762920474105, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses distribution shift in incomplete multi-view clustering caused by missing data. To mitigate cross-view semantic gaps, it optimizes projections into a shared embedding space from an information-theoretic perspective. The method leverages an unbiased projection together with an attention-based refinement strategy to build a robust consensus embedding, thereby alleviating heterogeneity and inconsistency issues commonly encountered in incomplete multi-view clustering."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "(1) Dealing with data distribution drift is interesting and valuable in incomplete multi-view clustering caused by missing data.\n(2) The paper proposes the novel idea of utilizing representations from complete views to refine those from missing views, guided by correlations between complete-view samples and missing-view samples.\n(3) The manuscript is clearly written and well organized, providing strong motivation, detailed methodology, and thorough analysis.\n(4) Experimental results across multiple datasets demonstrate strong performance."}, "weaknesses": {"value": "1.\tSection 2.2 lacks sufficient coverage of recent incomplete multi-view clustering works, particularly those based on missing-view imputation.\n2.\tThe framework illustration (Figure 1) is relatively simple and does not fully reflect key methodological details.\n3.\tOne core contribution is using unbiased projections to correct biased ones; however, a more detailed explanation of its motivation and effectiveness is still expected."}, "questions": {"value": "1. Dealing with data distribution drift is interesting in incomplete multi-view clustering, but how to prove the proposed method to handle the distribution drift better than the previous competitors?\n2. Abstract claim that \"Consensus representation imputation methods ignore the interview distribution bias due to missing views\", what is the interview distribution bias? This concept may require more detailed visualizations to help understanding."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "vBlDyD6i7O", "forum": "Bp3I456do5", "replyto": "Bp3I456do5", "signatures": ["ICLR.cc/2026/Conference/Submission8655/Reviewer_HWFR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8655/Reviewer_HWFR"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761979419462, "cdate": 1761979419462, "tmdate": 1762920473687, "mdate": 1762920473687, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}