{"id": "BT9rsod6Hc", "number": 14559, "cdate": 1758238915650, "mdate": 1759897362412, "content": {"title": "Quartet of Diffusions: Structure-Aware Point Cloud Generation through Part and Symmetry Guidance", "abstract": "We introduce the *Quartet of Diffusions*, a structure-aware point cloud generation framework that explicitly models part composition and symmetry. Unlike prior methods that treat shape generation as a holistic process or only support part composition, our approach leverages four coordinated diffusion models to learn distributions of global shape latents, symmetries, semantic parts, and their spatial assembly. This structured pipeline ensures guaranteed symmetry, coherent part placement, and diverse, high-quality outputs. By disentangling the generative process into interpretable components, our method supports fine-grained control over shape attributes, enabling targeted manipulation of individual parts while preserving global consistency. A central global latent further reinforces structural coherence across assembled parts. Our experiments show that the Quartet achieves state-of-the-art performance. To our best knowledge, this is the first 3D point cloud generation framework that fully integrates and enforces both symmetry and part priors throughout the generative process.", "tldr": "We propose a structure-aware point cloud generation pipeline through part and symmetry guidance, guaranteeing symmetry and achieving SOTA results", "keywords": ["computer vision", "point cloud generation", "structure-aware", "part-based", "symmetry-aware"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e2cf4dff828ba4fb2213f0edaba4315f7b3d9dd1.pdf", "supplementary_material": "/attachment/afbd47f79ee08c45170dbd6d4c7dbca119dbdfef.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes a part-level point cloud generation framework called the \"Quartet of Diffusions,\" which integrates part and symmetry awareness into the generative process. The method uses four diffusion models to generate structure-aware 3D shapes by modeling shape latents, symmetries, parts, and assemblers. The Quartet framework is shown to outperform state-of-the-art methods in terms of diversity, quality, and symmetry."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Part-level 3D generation is a critical research topic recently.\n- Using separate diffusion models to represent parts and transformations between them is novel and interesting, ensuring global shape symmetry.\n- The disentangled representation of parts, symmetries, and global structure offers fine-grained control over the generation process, allowing for targeted manipulation of individual parts.\n- The method pipeline is complex but clearly written."}, "weaknesses": {"value": "- Currently, part generation methods based on implicit representations (e.g., PartCrafter, PartPacker, OmniPart) have achieved very impressive results, almost reaching production-ready levels. However, this paper still insists on using point clouds as the 3D representation, and the experiments are only validated on the ShapeNet dataset. As this approach can only generate a limited number of points and coarse geometric details, this somewhat diminishes the contribution and novelty of the paper. Therefore, I recommend that the authors discuss in detail why they chose this approach and clarify the advantages of using point clouds as a 3D representation for structured 3D generation.\n- The Quartet framework involves four separate diffusion models, which could introduce significant computational overhead during both training and inference, making it potentially less practical for real-time applications.\n- Integration of four diffusion models will lead to accumulated errors, which are not analyzed."}, "questions": {"value": "See the weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "U01HZjpQTL", "forum": "BT9rsod6Hc", "replyto": "BT9rsod6Hc", "signatures": ["ICLR.cc/2026/Conference/Submission14559/Reviewer_E7K3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14559/Reviewer_E7K3"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14559/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761709352568, "cdate": 1761709352568, "tmdate": 1762924948565, "mdate": 1762924948565, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes “Quartet of Diffusions,” a structure-aware point-cloud generative framework that factorizes generation into four diffusion models: a global shape latent, a symmetry group, distinct parts, and an assembly model. Each model is learned separately and connected via conditioning, which enforces part symmetry and yields realistic assemblies. The method is reported to be computationally efficient in training (despite four models) and outperforms prior work on standard metrics (e.g., Chamfer / 1-NNA) and on a newly introduced symmetry-awareness metric (SDI)."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 4}, "strengths": {"value": "-\tClear conceptual decomposition: Factorizing generation into interpretable aspects (shape latent, symmetry, parts, assembly) is an elegant way to inject structure and inductive bias that matches human intuition about object design.\n-\tSolid empirical gains: The method shows strong improvements on classical generation metrics (1-NNA / Chamfer) and on the proposed symmetry metric (SDI), indicating both fidelity and structural plausibility.\n-\tSymmetry guarantees: Enforcing symmetry in the part generation produces more realistic, consistent results for symmetric objects.\n-\tReasonable compute: The paper claims modest GPU/training cost despite four separate diffusion models, which makes the approach more practical than it may first appear.\n-\tRigorous presentation: The paper is mathematically well-presented where needed."}, "weaknesses": {"value": "-\tWhile the authors introduced an evaluation metric for symmetry-awareness, the work does not explicitly evaluate the part-awareness such as in SeaLion (Zhu et al., 2025).\n-\tThe method is only evaluated on three object classes of ShapeNet. \n-\tRelated work could be improved and be made more readable. The section seems only like an assembly of many citations without having a flow content-wise.\n-\tThe figures can be improved as often the point clouds overlap with text boxes, making the figures less readable and enjoyable (Fig. 1, 2, 3)"}, "questions": {"value": "-\tBy explicitly defining diffusion models for the four aspects (shape latent, symmetry, parts, assembly), the authors induce a bias into the model. Is it possible to investigate the impact of each of the four aspects individually?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Dy6Kh663gS", "forum": "BT9rsod6Hc", "replyto": "BT9rsod6Hc", "signatures": ["ICLR.cc/2026/Conference/Submission14559/Reviewer_6Uas"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14559/Reviewer_6Uas"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14559/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761748804040, "cdate": 1761748804040, "tmdate": 1762924948098, "mdate": 1762924948098, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a 3D point cloud generative model that considers part generation with symmetry. The model uses a four-stage diffusion process: it first generates a global shape latent, then symmetry groups (represented by reflection planes), followed by part geometry, and finally an assembler that composes the shapes. Experimental results show the framework achieves better performance than various point cloud generation baselines while using a lower training budget. The ablation study validates the effectiveness of the proposed method."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The explicit consideration of symmetry in the 3D point cloud generation process is a novel exploration, and the evaluation, especially the SDI metric in Tables 1 and 3, clearly demonstrates the effectiveness of the proposed framework.\n- Additionally, the proposed framework achieves state-of-the-art performance compared to existing point cloud generation methods on standard metrics (1-NNA in Table 1), showcasing the quality and diversity of generated shapes.\n- A thorough ablation study in Table 3 validates the necessity of each introduced module."}, "weaknesses": {"value": "Despite the strong performance shown, I still have some concerns regarding the evaluation setting.\n\n1. Data Split Concerns. In Table 1, the evaluation protocol follows PointFlow (Yang et al., 2019), which uses the full category dataset for train/test splitting. Since this work uses ShapeNetPart, a subset of that data, it is unclear whether the train/test split remains consistent. If not, the test set may have leaked into the training set. Clarification is needed to ensure fair evaluation.\n2. Comparison Baselines. The proposed framework is compared against many point cloud generation methods. However, none of them (including SALAD and SPAGHETTI) use part annotations for training their generative models. The proposed comparisons do not seem comprehensive. Instead, I would suggest comparing with methods that use part labels when training generative models. Some examples are provided below:\n- StructureNet: Hierarchical Graph Networks for 3D Shape Generation. SIGGRAPH Asia 2019.\n- SDM-NET: Deep Generative Network for Structured Deformable Mesh. SIGGRAPH Asia 2019.\n- PQ-NET: A Generative Part Seq2Seq Network for 3D Shapes. CVPR 2020.\n- DSG-Net: Learning Disentangled Structure and Geometry for 3D Shape Generation. TOG 2021.\n- DiffFacto: Controllable Part-Based 3D Point Cloud Generation with Cross Diffusion. ICCV 2023.\n- PASTA: Controllable Part-Aware Shape Generation with Autoregressive Transformers. Arxiv 2024.\n\nI suggest making minor adjustments to the framework's claims: \n\n- The paper claims the framework supports fine-grained manipulation, but provides no visual examples or quantitative evaluations. This claim should be softened to avoid confusion.\n- Various existing works consider symmetry in 3D shape generation (particularly for feature extraction), especially StructureNet and related approaches. More discussion on this point is recommended."}, "questions": {"value": "Overall, I am convinced by the novelty and strong performance of the proposed framework. However, I have concerns about the fairness of the evaluation protocol and the absence of important baselines. Therefore, I am currently leaning toward rejection but am open to raising my rating if the following questions are addressed:\n\n1. Data Split Clarification: Could you please clarify the train/test split used in your experiments? Since you use ShapeNetPart (a subset of the full ShapeNet dataset) while the baseline evaluation protocol follows PointFlow (Yang et al., 2019) which uses the full category dataset, it is unclear whether your split maintains consistency with the original protocol. Specifically, could you confirm that there is no data leakage between your training and test sets, and provide details on how many samples were used for training vs. testing?\n2. Comparison with Part-Aware Baselines: The current baselines (including SALAD and SPAGHETTI) do not use part annotations during training, which makes the comparison potentially unfair given that your method explicitly leverages part labels. Could you include comparisons with some part-aware generative methods such as StructureNet (SIGGRAPH Asia 2019), SDM-NET (SIGGRAPH Asia 2019), PQ-NET (CVPR 2020), DSG-Net (TOG 2021), DiffFacto (ICCV 2023), and PASTA (Arxiv 2024)? This would provide a more comprehensive evaluation of your method's advantages when part supervision is available."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "vgzPHw2SEK", "forum": "BT9rsod6Hc", "replyto": "BT9rsod6Hc", "signatures": ["ICLR.cc/2026/Conference/Submission14559/Reviewer_wWCJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14559/Reviewer_wWCJ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14559/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761779986738, "cdate": 1761779986738, "tmdate": 1762924947602, "mdate": 1762924947602, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposed Quartet of Diffusion, a part-level, symmetry conditioned point cloud diffusion model that is trained on Shapenet dataset with segmentation labels. After sampling a global shape latent code, the paper then samples both the part level code and a symmetry group that the shape obeys. Afterward, a set of scales, translations, and rotations are sampled that are used to assemble the shapes together. The method shows superior generation metrics compared to other point cloud generation methods. It also supports part level generation which keeping the rest of the parts fixed"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper proposed a novel symmetry conditioned point-cloud generation method. The symmetry diffusion formulation proposed in the paper seems novel and could potentially be a contribution to the shape generation field \n2. The generation quality surpasses many strong baseline including LION and ShapeGF. This suggests the overall generation quality."}, "weaknesses": {"value": "1. I found the application provided by the authors to be insufficient to justify the modeling of parts and symmetry. Part-level generation is not a novel task and could be done without modeling the symmetry (See DiffFacto). It would be great to see further application enabled by the structure-aware modeling. \n2. The training requires part-segmentation labels as well as closed vocabulary part classes. This limits the generalization ability of the network to larger dataset such as Objaverse. \n3. The generated outcome is a point-cloud, which to me is not clear what it would be useful for. Can subsequent surface reconstruction algorithm be used to recover a higher fidelity shape?"}, "questions": {"value": "1. Are the assembled shapes always valid? Are there intersections or detachment between parts? Some metrics that quantifies this would be helpful (See SeaLION or DiffFacto for example metrics)\n2. Some shapes don’t have all the parts. How does the part diffusion model shapes with missing parts?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "IrODDCzgHt", "forum": "BT9rsod6Hc", "replyto": "BT9rsod6Hc", "signatures": ["ICLR.cc/2026/Conference/Submission14559/Reviewer_rXcP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14559/Reviewer_rXcP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14559/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761967166965, "cdate": 1761967166965, "tmdate": 1762924947222, "mdate": 1762924947222, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}