{"id": "CF3kJrAwmV", "number": 9047, "cdate": 1758108648877, "mdate": 1763728172271, "content": {"title": "BioBO: Biology-informed Bayesian Optimization for Perturbation Design", "abstract": "Efficient design of genomic perturbation experiments is crucial for accelerating drug discovery and therapeutic target identification, yet exhaustive perturbation of the human genome remains infeasible due to the vast search space of potential genetic interactions and experimental constraints. Bayesian optimization (BO) has emerged as a powerful framework for selecting informative interventions, but existing approaches often fail to exploit domain-specific biological prior knowledge. We propose Biology-Informed Bayesian Optimization (BioBO), a method that integrates Bayesian optimization with multimodal gene embeddings and enrichment analysis, a widely used tool for gene prioritization in biology, to enhance surrogate modeling and acquisition strategies. \nBioBO combines biologically grounded priors with acquisition functions in a principled framework, which biases the search toward promising genes while maintaining the ability to explore uncertain regions. \nThrough experiments on established public benchmarks and datasets, we demonstrate that BioBO improves labeling efficiency by 25-40\\%, and consistently outperforms conventional BO by identifying top-performing perturbations more effectively. Moreover, by incorporating enrichment analysis, BioBO yields pathway-level explanations for selected perturbations, offering mechanistic interpretability that links designs to biologically coherent regulatory circuits.", "tldr": "Improve Bayesian optimization for perturbation design with biological priors.", "keywords": ["Bayesian optimization; Biological priors; Perturbation design"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/3bb9fa4b53a9466b6243f61af30bad2a15fe3949.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes _Biology-Informed Bayesian Optimization (BioBO)_, which addresses challenges in drug discovery that require genomic intervention experiments. The authors introduce two key innovations: (1) a multimodal gene representation to improve the surrogate model in Bayesian Optimization (BO), and (2) the integration of enrichment analysis (EA) into a biology-prior–augmented acquisition function through a principled πBO framework. This integration provides a theoretical “no-worse” guarantee and establishes a foundation for incorporating broader sources of biological knowledge in similar ways.\n\nExperiments on real-world problems demonstrate the effectiveness of both proposed components — the multimodal embeddings and the biological priors. The results produced by BioBO are also biologically interpretable."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "- The paper addresses a well-motivated and highly important problem.\n    \n- It integrates EA-based experimental design common in biology into the πBO framework,  bridging knowledge from two domains, and offers a principled non-worse theoretical guarantee.\n    \n- The ablation studies sufficiently demonstrate the contributions of the multimodal representations and the EA integration. **Furthermore, the genes selected by BioBO align with known biological interpretations of central regulatory genes, indicating strong real-world potential.**\n    \n- The multimodal surrogate model is modular, allowing a wide range of biological and machine learning encoders, which enhances its practicality for real-world applications."}, "weaknesses": {"value": "- According to the appendix, the width of the error bars is ±1 s.e.m., which is less convincing compared to the standard ±1.96 s.e.m. used for 5% significance. Could the authors justify this choice?\n\n- _(Minor)_ The generality of the method is limited. Although the proposed approach is termed “Biology-Informed BO,” it applies primarily to biological problems where EA is feasible. The authors might consider adjusting the algorithm’s name to better reflect its domain specificity."}, "questions": {"value": "1. The multimodal design appears to involve simple concatenation of multiple gene embeddings. Is there a specific reason for choosing this approach to combine different embeddings?\n    \n2. There is little discussion of the individual contributions of each gene embedding or the rationale for selecting each. Could the authors provide more insight into how one should choose among available gene embeddings?\n    \n3. If I understand correctly, the so-called “biological prior” is derived from statistical patterns in the training data, rather than from external biological knowledge. Could the authors clarify how EA can still enhance BO performance under this setup, even without access to external priors?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "OIDLwLbLRN", "forum": "CF3kJrAwmV", "replyto": "CF3kJrAwmV", "signatures": ["ICLR.cc/2026/Conference/Submission9047/Reviewer_ohwq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9047/Reviewer_ohwq"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9047/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760860190901, "cdate": 1760860190901, "tmdate": 1762920761736, "mdate": 1762920761736, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes BioBO* a biology-informed Bayesian optimization framework for efficient design of genomic perturbation experiments. The goal is to prioritize which gene knockouts to test in costly CRISPR assays. BioBO integrates two main ideas:\n1. **Multimodal gene embeddings (Fusion)** – combining Achilles (functional dependency), Gene2Vec (co-expression), and GenePT (text-derived) representations to improve surrogate modeling.\n2. **Enrichment analysis (EA)** – incorporating biologically meaningful pathway priors into acquisition functions via the π-BO framework (Hvarfner et al., 2022), guiding the search toward biologically coherent gene clusters.\n\nThe method is evaluated on five CRISPR datasets from GeneDisco, showing 25–40% labeling efficiency improvement over standard BO, and stronger enrichment signals in discovered pathways. The authors also provide theoretical guarantees that integrating EA priors does not worsen regret asymptotically."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **Strong biological motivation**: Addresses a key challenge in experimental design for genomics, where exhaustive perturbation is infeasible.\n- **Principled integration of biology and machine learning**: The use of the π-BO formalism to incorporate enrichment priors is theoretically grounded and non-trivial.\n- **Novel multimodal surrogate modeling**: Demonstrates empirically that fusing heterogeneous biological embeddings (Achilles + Gene2Vec + GenePT) yields better performance near optima.\n- **Comprehensive experiments**: The evaluation on multiple datasets (IFN-γ, IL-2, Tau, NK, SARS-CoV-2) with ablations and sensitivity analyses is thorough and carefully executed.\n- **Interpretability and biological validation**: The enrichment results (e.g., MYC and E2F target pathways) provide mechanistic insight into immune regulation and show that the discovered perturbations are biologically meaningful.\n- **No-harm theoretical guarantee**: Retains the asymptotic regret bounds of standard BO, ensuring robustness to potentially noisy enrichment priors."}, "weaknesses": {"value": "- **Limited novelty in BO theory**: The core algorithmic novelty is the integration of known biological priors within an existing π-BO framework; the BO component itself remains myopic and standard.\n- **Empirical improvements modest in some datasets**: While fusion provides consistent gains, improvements are smaller or marginal in certain conditions (e.g., BioEI on IL-2), suggesting dataset-dependent benefits.\n- **Dependence on predefined pathway databases**: The approach relies on GO and Hallmark annotations; biases or incompleteness in these resources may limit generalization, especially in less-studied cell types.\n- **Simple fusion strategy**: Concatenation is effective but basic. More principled fusion (e.g., learned or attention-based integration) could enhance representation quality.\n- **No analysis of computational cost**: Training BNN surrogates with multimodal embeddings and enrichment updates may be computationally heavier than standard BO, but runtime comparisons are not reported."}, "questions": {"value": "1. **Prior calibration**: How sensitive are the results to the choice of temperature parameter *t* and β in Eq. 4 and Eq. 6? The appendix shows some analysis, but can the authors comment on interpretability of these hyperparameters across datasets?\n2. **Fusion mechanism**: Have the authors considered learning the fusion weights (e.g., via gating or attention) instead of static concatenation? Would that risk overfitting given small training sets per iteration?\n3. **Pathway dependence**: Since GO and Hallmark differ in coverage and granularity, could BioBO dynamically switch or ensemble multiple enrichment sources?\n4. **Scalability**: How would BioBO scale to genome-scale design (>20k genes) when multiple priors and embeddings are used? Are there computational bottlenecks?\n5. **Biological interpretability**: Can the authors provide further examples where enrichment priors led to selection of underexplored but biologically novel genes, beyond MYC/E2F modules?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "7ZtdW2IeLi", "forum": "CF3kJrAwmV", "replyto": "CF3kJrAwmV", "signatures": ["ICLR.cc/2026/Conference/Submission9047/Reviewer_cXha"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9047/Reviewer_cXha"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9047/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761778585641, "cdate": 1761778585641, "tmdate": 1762920761408, "mdate": 1762920761408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Biology-Informed Bayesian Optimization (BioBO) for designing genomic perturbation experiments. The method makes two main contributions: (1) integrating multimodal gene embeddings (Achilles, Gene2Vec, GenePT) to improve surrogate modeling, and (2) augmenting acquisition functions with biological priors from enrichment analysis using the πBO framework. Experiments on GeneDisco benchmarks show 25-40% improvement in labeling efficiency compared to standard BO, with the method identifying biologically coherent pathways. The authors demonstrate that multimodal embeddings improve surrogate model performance particularly near the optimum, and provide theoretical no-harm guarantees for their enrichment-augmented acquisition strategy."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.\tThe combination of multimodal gene embeddings with enrichment-based priors in BO is novel for this application domain. The analysis showing that surrogate model performance near the optimum (rather than globally) correlates with BO performance provides useful insights.\n2.\tThe experimental evaluation is thorough, covering five datasets across multiple modalities and acquisition functions with proper error estimation. The theoretical grounding via πBO provides principled guarantees. The correlation analysis between surrogate quality and BO performance is well-executed.\n3.\tThe paper clearly motivates the problem and explains why existing BO methods for gene perturbation are limited. The two-pronged approach (better embeddings + biological priors) is logical and well-presented.\n4.\tThe problem of efficient gene perturbation design is important for drug discovery. The 25-40% improvement in labeling efficiency could translate to meaningful cost savings. The interpretability aspect through enrichment analysis is valuable for practitioners."}, "weaknesses": {"value": "1.\tLimited Technical Novelty: The core techniques are straightforward applications of existing methods. Simple concatenation for multimodal fusion is the most basic approach; more sophisticated fusion architectures (attention mechanisms, learned fusion) are not explored. The enrichment prior construction (Eq. 6) is relatively simple. The paper primarily validates that combining these existing techniques works for this domain rather than introducing new methodology.\n2.\tInsufficient Biological Validation: Only one detailed biological case study (IFN-γ, Table 2) is provided. The biological interpretations feel somewhat post-hoc rather than predictive. The paper would benefit from: (1) validation with domain experts, (2) wet-lab validation of predictions, (3) deeper mechanistic explanations beyond pathway enrichment, and (4) analysis of failure cases where the method selects biologically implausible genes.\n3.\tExperimental Limitations: The experiments are restricted to GeneDisco datasets which represent a limited evaluation scope. Key concerns include: (1) DiscoBAX performing poorly contradicts Lyle et al. 2023 without adequate explanation, (2) high variance in some results suggests instability, (3) no comparison with other multimodal fusion approaches or alternative biology-informed methods beyond pure EA, (4) computational costs are not reported, (5) the choice of hyperparameters (beta, temperature, top-10%) lacks principled justification.\n4.\tAnalysis Depth: The correlation analysis reveals interesting patterns but lacks deeper explanation. Why does global LL negatively correlate with BO performance? Why does fusion specifically help near the optimum? The paper states these observations but does not provide mechanistic understanding. The no-harm guarantee is asymptotic, but finite-sample behavior is not analyzed. The sensitivity to beta (Appendix C) shows significant variation that undermines the robustness claims.\n5.\tScalability and Generalization: All experiments use the same 10,556 genes common across all embeddings, which is a restricted setting. How does the method perform with missing modalities? What about other organisms beyond human? The batch size is always 1, but practical screens often label batches; how does this affect the approach? The paper does not address these practical considerations.\n6.\tPresentation Issues: While generally clear, some aspects need improvement: Figure 3 and similar correlation plots are central to the argument but the negative global correlation is counterintuitive and poorly explained. Some claims are overstated (e.g., \"dramatically stronger enrichment signals\" in Section 4.5 when comparing different experimental settings). The main paper could better synthesize the extensive appendix results."}, "questions": {"value": "1.\tCan you provide more detailed analysis or ablation studies on why multimodal fusion specifically helps near the optimum but not globally? What properties of the fused representation drive this?\n2.\tThe DiscoBAX performance is substantially worse than reported in Lyle et al. 2023. Can you investigate and explain this discrepancy? Is it due to implementation differences, hyperparameters, or dataset characteristics?\n3.\tHow sensitive are the results to the choice of top-k% for enrichment analysis? You use 10% but provide no justification or sensitivity analysis for this critical hyperparameter.\n4.\tCan you provide computational cost comparisons between BioBO and baseline methods? How does the enrichment analysis overhead scale?\n5.\tFor the biological interpretation (Table 2), can you provide additional case studies beyond IFN-γ? Are there cases where the method fails to identify biologically meaningful pathways?\n6.\tHow does performance change when some modalities are missing? This is a practical scenario but not addressed.\n7.\tHave you validated any of the predicted gene perturbations experimentally or with domain experts? The biological interpretations would be more convincing with external validation.\n8.\tWhy use simple concatenation for fusion rather than more sophisticated approaches like attention-based fusion or learned gating mechanisms? Have you experimented with alternatives?\n9.\tThe beta parameter shows significant impact on performance (Appendix C). Can you provide principled guidelines for setting beta, or ideally, an adaptive approach?\n10.\tHow does the method perform with batch acquisition (B > 1), which is more common in practical CRISPR screens?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "wLGRxb2PED", "forum": "CF3kJrAwmV", "replyto": "CF3kJrAwmV", "signatures": ["ICLR.cc/2026/Conference/Submission9047/Reviewer_tp66"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9047/Reviewer_tp66"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9047/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761798984348, "cdate": 1761798984348, "tmdate": 1762920761053, "mdate": 1762920761053, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes to enhance Bayesian optimization for genomic perturbation experiment design with multi-modal gene embeddings and enrichment analysis, essentially incorporating biological knowledge as prior to Bayesian optimization."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The methodology component of the paper is generally easy to follow and clearly presented. Figure 1 is particularly helpful for a high level perception of the proposed framework.\n\n- Ablation studies are presented in the experiment section, which helps the understanding of each component's contribution."}, "weaknesses": {"value": "- Novelty: I think novelty of the proposed methodology is lacking. This work is more about how to incorporate biological knowledge and analysis into existing methods such as $\\pi$BO. I think sometimes combining existing methods could be interesting, but if it's more of a realization of an approach in a specific domain, I think it's less interesting. To be honest I'm a little surprised that this work was submitted to this venue instead of some computational biology journal, since it has a quite heavy dose of biological content and analysis.\n\n- Clarity & practicality: Although the methodology component of the paper is generally easy to follow and clearly presented, I find the biological experiment setup not so easy to follow (as a person who does not have abundant biology knowledge). From Figure 1, it seems that there is an online component of the UCB update (wet lab perturbations) being conducted, but I assume this is not actually carried out in the experiment section? How are the unlabeled perturbations evaluated online given a dataset in the experiment? And is the proposed method with wet lab perturbation actually practical given the significant efficiency concern with 20 cycles?"}, "questions": {"value": "Please see above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4FyoF1KplO", "forum": "CF3kJrAwmV", "replyto": "CF3kJrAwmV", "signatures": ["ICLR.cc/2026/Conference/Submission9047/Reviewer_FsM3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9047/Reviewer_FsM3"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9047/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762164042528, "cdate": 1762164042528, "tmdate": 1762920760664, "mdate": 1762920760664, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}