{"id": "CkfUFwYyr0", "number": 22324, "cdate": 1758329664702, "mdate": 1759896872356, "content": {"title": "Optimal Sub-data Selection for Nonparametric Function Estimation in Kernel Learning with Large-scale Data", "abstract": "This paper considers estimating nonparametric functions in a reproducing kernel Hilbert space (RKHS) for kernel learning problems with large-scale data. Kernel learning with large-scale data is computationally intensive, particularly due to the high cost and complexity of tuning parameter selection. Existing sampling methods for scalable kernel learning, such as the leverage score-based sampling method and its variants, are designed to select subsamples that minimize the expected global (in-sample or out-of-sample) prediction error. In complement to existing methods, this paper proposes an optimal informative sampling method to estimate nonparametric functions pointwise when the subsample size is potentially small. Our method is tailored for scenarios where computational resources are limited, yet accurate pointwise prediction at each test location is desired. It also serves as a complement to existing fast kernel learning algorithms, such as the Nyström method and FALKON, which rely on randomly selected sub-datasets. Theoretical studies compare the efficiency of the proposed method to that based on the full data with optimally selected tuning parameters.\nNumerical experiments demonstrate the statistical efficiency of the proposed method over some existing methods based on randomly sampled data.", "tldr": "", "keywords": ["Nonparametric function estimation", "kernel learning", "subdata selection", "large-scale data"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a19421fa444aa90269013290a92038e6af80e86f.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper deals with the problem of estimating a nonparametric function from a given reproducing kernel Hilbert space, when using large-scale (possibly with large sample size) training data.\nThis is a recurring problem in the field.\nSpecifically, the work focuses on a kernel Ridge Regression (KRR) problem where the RKHS is assumed given. Then, the goal is to estimate the kernel expansion coefficients and regularization weight (called tuning parameter in the paper) in a data-scalable manner.\nFor that, the proposed method looks for a fixed number of clustered data subsets whose centers act as a representative values of all the data samples in the cluster, and then solves the KRR problem over the resulting (smaller) data.\nFinally, a theoretical discussion about the rate of convergence of the proposed method and experimental results are presented."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "The presented approach seems novel and is well motivated."}, "weaknesses": {"value": "**W1**: To me, the biggest weakness of this paper is an inconsistent, and sometimes vague, mathematical notation. \nThis makes following the main claims of the paper a tedious task.\nOverall, this paper would benefit substantially from a consistent and properly introduced mathematical notation.\n\nTo give some examples: \\\n**W1.1**: The equation in line 132 defines the optimal argument as $\\hat{f}\\_{N,\\lambda\\_T}$ . \nIn the ensuing sections the comma in the subindex disappears. \\\n**W1.2**: In the expression in line 140, the authors use brackets [ ] to denote a vector. Later, vectors are denoted with parenthesis ( ), e.g., line 177, or curly braces { }, e.g., line 195, instead. Same for the transpose symbol, sometimes is an apostrophe $'$, e.g., line 266, and sometimes a superscript $^T$, e.g., line 268. \\\n**W1.3**: Some notation is introduced without definition, such as $\\hat{f}\\_{s\\lambda}\\^\\*$ in line 151, and $\\theta_i$ and the subscript $\\_{n*n}$ in line 226.\n\nI believe there are also some minor typos/mistakes such as: \\\n**W1.4**: The sentence spanning lines 158 to 161 defines the centers of the clusters redundantly. \\\n**W1.5**: In line 192, $\\bar{\\epsilon}_i$ is using the definition intended for $\\bar{y}_i$. \\\n**W1.6**: In line 196 the $(i,j)$-th element is a set. It should likely be $K(C_i,C_j)$ or a singleton. \\\n**W1.7**: In line 277 $\\mathscr{S}(x_0)$ is defined as a set of $x^*_i$ values; however, in line 279 it is used as the set of indices of those values. \\\n**W1.8**: There is typo in line 476, ``can effectively use~~s~~''.\n\n**W2**: A discussion of the memory and time complexity comparing the proposed method to alternatives (e.g., Nyström and FALKON) would have been appreciated.\nFor instance, in a comparison table."}, "questions": {"value": "**Q1**: In table 3, I assume that ``centers-time'' refers to the execution time of the clustering algorithm. Taking that into account, the computation time of the proposed method is still one, or even two, orders of magnitude larger than FALKON and Nyström. \nCan you elaborate on that?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8sSndEV23S", "forum": "CkfUFwYyr0", "replyto": "CkfUFwYyr0", "signatures": ["ICLR.cc/2026/Conference/Submission22324/Reviewer_c2tu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22324/Reviewer_c2tu"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761057910951, "cdate": 1761057910951, "tmdate": 1762942170595, "mdate": 1762942170595, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a subset selection method for large-scale nonparametric regression in reproducing kernel Hilbert spaces (RKHS). The main goal is to improve prediction accuracy when computational resources limit the use of all available data. The proposed approach first partitions the dataset using clustering methods such as k-means to identify representative centers, then assigns optimal sampling weights to clusters in order to minimize the pointwise mean squared error of the resulting kernel estimator. Weighted subsampling is performed multiple times, kernel ridge regression models are trained on each subset, and their predictions are averaged. The authors claim to achieve better MSE error compared with basic Nyström or FALKON (but its first version in 2017 in Matlab)."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The topic is interesting and the paper targets the well-known bottleneck of kernel methods, i.e. scalability. The clustering and sampling procedure with optimal weights can be interesting, but a clearer and more precise exposition, and deeper experiments are needed to evaluate it."}, "weaknesses": {"value": "### **Critical Observations**\n\n1. **Outdated comparison**  \n   The paper compares only against the *original* **FALKON (2017)** and a basic **Nyström** baseline, but not against more recent or optimized implementations — for example, *“Kernel methods through the roof: handling billions of points efficiently”* (Meanti et al., NeurIPS 2020), which provides a **modern, fast version of FALKON**. As a result, the experimental comparison does not reflect the current state of the art.\n\n2. **Misleading comparison and trivial findings**  \n   The comparison is conceptually weak. Works such as *“Less is more: Nyström computational regularization”* (Rudi et al., 2015) and *“FALKON: An optimal large scale kernel method”* (Rudi et al., 2017) have already shown that Nyström-based methods can **achieve optimal learning rates** while maintaining **computational efficiency**, provided that a **sufficient number of landmarks** are used (e.g., √n in kernel ridge regression).  \n   It is therefore **expected** that using too few subsampled points degrades accuracy, and that more sophisticated (but slower) sampling strategies can improve MSE. Even a fully greedy point-selection scheme — which maximizes accuracy at each step — would outperform uniform sampling, but at a much higher computational cost.  \n   -> Consequently, the reported “superior accuracy” is **trivial and somewhat misleading**: it arises from sacrificing scalability, missing the main purpose of FALKON, which is to remain **fast while preserving accuracy** once enough centers are used.\n\n3. **Computational inefficiency**  \n   The proposed method is **consistently slower** than FALKON (often by an order of magnitude) while achieving only **moderate MSE improvements**.  \n   -> The key insight of FALKON — maintaining accuracy while being computationally efficient — is not addressed or appreciated in this work.\n\n4. **Clarity and presentation issues**  \n   The paper is **poorly structured and very difficult to follow**. Among all, definitions and notations are often unclear or inconsistent:  \n   - The meaning of \\( y_{ij} \\) (double index) is never explained.  \n   - The notation \\( \\hat{w}_{x,i,C} \\) contains an unexplained hat (possibly a typo).  \n   - \\( K_{xi} \\) is defined *after* Equation (2) but used *before* it.  \nMore than that, theoretical assumptions are **scattered and vaguely presented**, often embedded directly within theorem statements without being clearly introduced and discussed.  How do these assumptions compare with the rest of the literature (which is **largely** missing in the entire paper)?\n\n   Overall, the exposition lacks precision and logical flow, making the paper unnecessarily hard to read and evaluate."}, "questions": {"value": "Most perplexities are already expressed above under Weaknesses. \n- Why is the most recent literature (both theory and algorithms) not considered?\n- in Results at pag. 8 it's said that the method \"remains efficient\", but it is 100x slower than old version of FALKON, how can be considered efficient when datasets contain billions of points?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "juNCAStjoE", "forum": "CkfUFwYyr0", "replyto": "CkfUFwYyr0", "signatures": ["ICLR.cc/2026/Conference/Submission22324/Reviewer_dGCQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22324/Reviewer_dGCQ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761213792338, "cdate": 1761213792338, "tmdate": 1762942170420, "mdate": 1762942170420, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the computational challenge of large-scale nonparametric function estimation in Reproducing Kernel Hilbert Spaces (RKHS) by proposing a weighted sub-data selection method. Theoretical results show that the proposed method achieves a faster convergence rate than simple random sampling (SRS)."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "S1. The paper provides a theoretical analysis, demonstrating that its proposed estimator achieves a convergence rate superior to Simple Random Sampling.\n\nS2. The method demonstrates superior performance in MSE compared to established benchmarks."}, "weaknesses": {"value": "W1. The technical components of the proposed method rely on established algorithms and principles that lack innovation. For instance, the core clustering step relies on k-means, a classical algorithm initially proposed more than six decades ago (e.g., by Stuart Lloyd in 1957). Similarly, the use of variance minimization to derive optimal weights is a long-standing principle in classical optimization and statistics. While the integration of these elements for point-wise prediction in RKHS is applied to a specific setting, the overall methodology constitutes a recombination of existing techniques rather than a conceptually novel contribution. Furthermore, the problem being addressed, scaling kernel methods,does not align with pivotal frontier challenges in contemporary AI research, thereby limiting the broader impact and relevance of this work.\n\nW2. The paper suffers from several issues in scholarly rigor and exposition that impact its professionalism and readability, for example:\n1. In Section 2, the theoretical foundation lacks references to crucial theorems like Mercer's theorem and the Representer Theorem. Their absence makes the theoretical setup incomplete.\n2. The meaning of notation is sometimes unclear. For instance, in Section 2.1, the expression {K(x, C_1), ...} does not specify whether the braces {} denote a set or a vector, creating unnecessary confusion.\n3. Incorrect formatting of references is present throughout the manuscript, which diminishes the work's professionalism and adherence to standard academic conventions."}, "questions": {"value": "Q1. In the first part of Section 2, the parameter $\\lambda_T$ is introduced. Could you please clarify the relationship and distinction between $\\lambda_T$ and the regularization parameter lambda used later in Section 2.1? Specifically, what does the subscript $T$ denote, and what is the conceptual or mathematical difference between these two symbols?\n\nQ2.The proposed sampling strategy appears to rely on a clustering step. Could you please discuss the potential sensitivity of your method's final performance to the specific clustering algorithm chosen? Have you experimented with different clustering methods?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "No ethics review needed."}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "s5BKbY3r2j", "forum": "CkfUFwYyr0", "replyto": "CkfUFwYyr0", "signatures": ["ICLR.cc/2026/Conference/Submission22324/Reviewer_Xqhh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22324/Reviewer_Xqhh"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761889825843, "cdate": 1761889825843, "tmdate": 1762942170176, "mdate": 1762942170176, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies kernel ridge regression (KRR) in reproducing kernel Hilbert spaces (RKHS) in the context of large sample sizes (N) and proposes a sub-data selection scheme aimed at matching or improving the statistical accuracy while simultanesouly reducing computational complexity. The method clusters inputs into L groups (via $k$-means or variants), chooses a tuning parameter using only the cluster centers, and then, for each test location $x$, assigns sampling probabilities to training points proportional to $ | K_x|$ (a transformed kernel vector that depends on $x$, the chosen kernel, the center kernel matrix, and the tuning parameter $\\lambda$). The estimator averages KRR fits over \\$B\\$ resampled subsets of size $n$ much smaller than the sample size $N$. The paper provides a clean derivation of KRR rates and optimal tuning parameter value $\\lambda_T\\$ under eigenvalue decay (Theorem 1) and an asymptotic IMSE rate for the proposed estimator (Theorem 2) showing improvement over simple random sampling (SRS) under assumptions on the informativeness profile based weights $\\omega_{x_{0},j}$. Simulations and real-life data study show competitive IMSE vs. full-data KRR and improved test MSE versus Nyström method and FALKON at comparable budgets."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The consitional MSE‑minimizing weights $w_{x,i,C}(x)\\propto |K_{xi}|$ derived from the cluster‑center surrogate model are simple, somewhat interpretable, and targeted at the desired loss (pointwise prediction at a given $x$). Theorem 1 recovers the optimal full‑data KRR rate of convergenceunder different choices of target RKHS function class and eigendecay rate, while Theorem 2 formalizes how an informative sampling profile (captured by $\\omega_{x_{0},j}$) yields an IMSE rate faster than SRS for fixed $n$. The paper shows the value of using information in the full input data to determine sub‑data selection."}, "weaknesses": {"value": "Theorem 2 makes the assumption : $\\omega_{x_0,j}\\asymp j^{2\\beta}$ with $0\\le 2\\beta<k$ (and $2\\beta\\le k\\le 4\\beta$). However, it is not shown that the proposed $k$‑means + $|K_x|$ weighting mechanism induces such a condition, for any $\\beta>0$, even under standard kernels and benign marginal input disribution $\\pi(x)$. As written, the theorem establishes rates for a class of informative samplers rather than for the concrete algorithm. A lemma connecting cluster geometry and $K_x$ to eigenfunction mass can strengthen the result. Also, using Euclidean $k$‑means to define centers may not align with the RKHS geometry for non‑RBF kernels. A short discussion (or a kernel‑$k$‑means variant such as $k$‑medians) would clarify when the centers faithfully represent $K(\\cdot,\\cdot)$. In the definition of Relative efficiency (RE) on Lines 316-318, the choice of the exponents of IMSE and Time is not well-motivated."}, "questions": {"value": "Pleae see Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ZbGY0i9dr0", "forum": "CkfUFwYyr0", "replyto": "CkfUFwYyr0", "signatures": ["ICLR.cc/2026/Conference/Submission22324/Reviewer_bZ3f"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22324/Reviewer_bZ3f"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22324/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762253389085, "cdate": 1762253389085, "tmdate": 1762942169889, "mdate": 1762942169889, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}