{"id": "CUmbgiiNff", "number": 2103, "cdate": 1756989185566, "mdate": 1759898169409, "content": {"title": "Pretrain then Adapt: Uncertainty-Aware Test-Time Adaptation for Text-based Person Search", "abstract": "Text-based person retrieval faces inherent limitations due to data scarcity, driven by stringent privacy constraints and the high cost of manual annotation. To mitigate this, existing methods usually rely on a \\textbf{Pretrain-then-Finetune} paradigm, where models are first pretrained on synthetic person-caption data to establish cross-modal alignment, followed by fine-tuning on labeled real-world datasets. However, this paradigm lacks practicality in real-world deployment scenarios, where large-scale annotated target-domain data is typically inaccessible. \nIn this work, we propose a new \\textbf{Pretrain-then-Adapt} paradigm that eliminates reliance on extensive target-domain supervision. \nThe key underpinning our approach is Uncertainty-Aware Test-Time Adaptation (UATTA), a framework enabling dynamic model adaptation using only unlabeled test data, with minimal computational overhead. \nUATTA introduces a bidirectional retrieval disagreement mechanism to estimate uncertainty, \\ie, low uncertainty is assigned when an image-text pair ranks highly in both image-to-text and text-to-image retrieval, indicating high alignment; otherwise, high uncertainty is detected. \nThis indicator drives test-time model recalibration without labels, effectively mitigating domain shift. \nWe validate UATTA on four benchmarks, \\ie,  CUHK-PEDES, ICFG-PEDES, RSTPReid, and PAB, showing consistent improvements across both CLIP-based (one-stage) and XVLM-based (two-stage) frameworks. \nAblation studies confirm that UATTA outperforms existing test-time adaptation strategies, establishing a new benchmark for label-efficient, deployable person retrieval systems.", "tldr": "", "keywords": ["person retreival", "domain gap", "test-time adaptation", "uncertainty"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d732ddd6971ab839e99ef6fcd3f2e71cc7d44f8a.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper pioneers the exploration of the text-based person retrieval task in the absence of labeled target-domain data. The authors propose an uncertainty-aware test-time adaptation framework based on a bidirectional retrieval disagreement mechanism, which measures the discrepancy between image-to-text and text-to-image matching. Extensive experiments demonstrate the effectiveness of the proposed method."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper is well written, and I am able to clearly understand most of its contributions.\n2. This work pioneers the exploration of text-based person retrieval without relying on labeled target-domain data, which could alleviate the dependence on expensive human annotations."}, "weaknesses": {"value": "1. **Logical Flaw**: The proposed bidirectional retrieval pipeline assumes access to the entire set of test textual queries in advance. In real-world scenarios, however, text-based person retrieval is typically performed in an online manner, where user queries arrive sequentially and are not known beforehand. This assumption significantly limits the practical applicability of the method, as it does not align with the dynamic nature of actual deployment environments.\n2. **There is inconsistency in terminology**: the title refers to \"text-based person search,\" whereas the main text uses \"text-based person retrieval.\" Although both terms are acceptable, I recommend maintaining consistency throughout the paper.\n3. **The paper lacks a unique and in-depth discussion of the text-based person retrieval task itself.** In fact, many existing vision-language cross-modal tasks (e.g., image/video-text retrieval) face similar challenges with expensive text annotation. Is the proposed method applicable to these tasks as well?\n4. **The paper does not thoroughly discuss existing test-time adaptation methods.** While related work is mentioned, it remains unclear whether current approaches can be directly applied to text-based person retrieval, and what specific issues the proposed method addresses when adapting test-time adaptation techniques to this task.\n5. **The experimental section lacks citations to several key related works.**"}, "questions": {"value": "1. Equation 2 uses ground-truth labels from the test set for model optimization. Does this violate standard protocol? Typically, ground-truth labels are used only for evaluation, not for model training or adaptation.\n2. Can X-VLM be combined with other test-time adaptation methods to further improve performance? In Table 1(a), only results for X-VLM + Ours are shown, and comparisons with other related methods are missing."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "No Ethics Concerns."}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "lFts1JwF5C", "forum": "CUmbgiiNff", "replyto": "CUmbgiiNff", "signatures": ["ICLR.cc/2026/Conference/Submission2103/Reviewer_aw8W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2103/Reviewer_aw8W"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2103/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761653125975, "cdate": 1761653125975, "tmdate": 1762916028669, "mdate": 1762916028669, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Pretrain-then-Adapt, an innovative framework designed for uncertainty-aware test-time adaptation (UATTA) in text-based person retrieval. The authors aim to address the domain shift problem, which is often observed in models trained on synthetic data but deployed in real-world environments. The method uses unlabeled test data at test time to adapt the model with minimal computational overhead. The core idea is to estimate prediction uncertainty through a bidirectional retrieval disagreement mechanism, which allows the model to recalibrate itself without relying on labeled data. The paper evaluates this approach across multiple benchmarks, showing improvements over traditional Pretrain-then-Finetune methods and existing test-time adaptation strategies."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea of uncertainty-aware adaptation for test-time adaptation (TTA) in text-based retrieval is interesting and addresses a significant gap in existing research. The use of unlabeled test data to adapt models in an efficient manner is a valuable contribution to practical deployment scenario.\n\n2. The framework is designed for real-world applications where fine-tuning on labeled data is infeasible. This makes it a promising alternative to traditional pretrain-then-finetune paradigms."}, "weaknesses": {"value": "1. The confidence filtering mechanism used in the framework is rather simple and somewhat “tricky”. It relies on basic engineering methods, such as disagreement between text-to-image and image-to-text retrieval. While effective, it does not appear to bring significant methodological innovation to the table. This aspect could be seen as a relatively basic engineering approach rather than a novel contribution to the field.\n\n2. Despite its efficiency, the proposed method shows comparatively larger performance gaps when evaluated against fine-tuning-based methods, making it difficult to validate its effectiveness."}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6TohkdYAjs", "forum": "CUmbgiiNff", "replyto": "CUmbgiiNff", "signatures": ["ICLR.cc/2026/Conference/Submission2103/Reviewer_vBDd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2103/Reviewer_vBDd"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2103/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891881868, "cdate": 1761891881868, "tmdate": 1762916028398, "mdate": 1762916028398, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new paradigm for text-based person retrieval called “Pretrain-then-Adapt,” which replaces the traditional “Pretrain-then-Finetune” approach. The core contribution is an Uncertainty-Aware Test-Time Adaptation (UATTA) framework that allows models to adapt to new target domains using only unlabeled test data, without requiring labeled target-domain data. It offers a label-free, uncertainty-driven test-time adaptation method that enhances the robustness and deployability of text-based person retrieval systems in real-world scenarios."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. This paper introduces a label-free \"Pretrain-then-Adapt\" framework, eliminating the need for annotated target data.\n\n2. This paper proposes a simple yet effective bidirectional retrieval disagreement to reliably detect uncertainty and prevent overconfidence.\n\n3. The experiments demonstrate some improvements across multiple models and benchmarks with minimal computational cost."}, "weaknesses": {"value": "1. The proposed \"Pretrain-then-Adapt\" paradigm appears functionally similar to unsupervised domain adaptation (UDA) or unsupervised learning for text-based ReID. The core distinction—adapting only a few parameters (LN layers) at test time—is an incremental engineering contribution rather than a foundational shift in paradigm, as claimed.\n\n2. The core innovation, using bidirectional retrieval disagreement as an uncertainty signal, is a straightforward application of cross-modal consistency. This concept is a well-established principle in cross-modal and unsupervised learning. The method essentially uses this consensus as a pseudo-label quality signal, an approach that is not novel in the broader machine learning context.\n\n3. The empirical evaluation lacks critical comparisons with state-of-the-art unsupervised text-based ReID methods. This omission makes it difficult to assess the true contribution of UATTA versus simply applying established unsupervised learning techniques to the test set.\n\n4. The paper relies solely on quantitative results. Qualitative visualizations (e.g., t-SNE plots of features before/after adaptation, examples of successful/failed adaptations) are missing. Such analysis would greatly strengthen the claim of mitigating domain shift and provide intuitive insights into the method's behavior.\n\n5. The theoretical derivation linking parameter variance to bidirectional disagreement, while a nice addition, relies on strong assumptions (e.g., symmetric consistency for an ideal model) and first-order approximations. A more rigorous analysis or an ablation on the impact of this specific theoretical motivation is needed."}, "questions": {"value": "What is the fundamental conceptual and methodological distinction between the proposed \"Pretrain-then-Adapt\" paradigm and standard Unsupervised Domain Adaptation (UDA) or unsupervised learning for text-based ReID? The process of adapting a pre-trained model using unlabeled target data appears to align closely with the core objective of UDA. Please clarify the novel theoretical or practical contribution of the paradigm itself, beyond the specific mechanism of UATTA.\n\nFor other questions, please refer to the points raised in the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4tMZ909i9z", "forum": "CUmbgiiNff", "replyto": "CUmbgiiNff", "signatures": ["ICLR.cc/2026/Conference/Submission2103/Reviewer_P9ac"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2103/Reviewer_P9ac"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2103/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762253948177, "cdate": 1762253948177, "tmdate": 1762916028131, "mdate": 1762916028131, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes UATTA (Uncertainty-Aware Test-Time Adaptation), a novel framework for text-based person retrieval that eliminates the need for labeled target-domain data. The authors introduce a new paradigm — Pretrain-then-Adapt, replacing the traditional Pretrain-then-Finetune pipeline. The key idea is to leverage Bidirectional Retrieval Disagreement (BRD) as an uncertainty measure between text-to-image and image-to-text retrieval rankings. This uncertainty guides test-time entropy minimization to avoid overconfident false positives during adaptation.The method is theoretically grounded through an analysis showing proportionality between parameter variance and retrieval disagreement, and empirically validated on four datasets (CUHK-PEDES, ICFG-PEDES, RSTPReid, and PAB) using both CLIP and XVLM frameworks. UATTA improves retrieval accuracy while requiring minimal computational cost and no labeled data."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed Pretrain-then-Adapt pipeline directly addresses the impracticality of relying on labeled target-domain data in text-based person retrieval. This design is timely and pragmatic for real-world deployment under privacy and resource constraints.\n\n2. Extensive evaluations on several benchmarks confirm consistent gains, and the proposed method can achieve competitive results while requiring only 0.08 GPU-hours for adaptation. The ablation studies are thorough and insightful."}, "weaknesses": {"value": "1.This paper adopts many hand-crafted parameters and designs, like K and uncertainty formulation. Would these designs affect the generalization performance across different models?\n\n2.The authors only update LayerNorm affine parameters to ensures stability, but it might limit adaptability. Hence, could lightweight tuning modules (e.g., LoRA, adapters) provide a better performance–efficiency tradeoff?"}, "questions": {"value": "see weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "htADvNAe8l", "forum": "CUmbgiiNff", "replyto": "CUmbgiiNff", "signatures": ["ICLR.cc/2026/Conference/Submission2103/Reviewer_AFxn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2103/Reviewer_AFxn"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2103/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762254651998, "cdate": 1762254651998, "tmdate": 1762916027408, "mdate": 1762916027408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}