{"id": "CZOb6ljxhQ", "number": 13659, "cdate": 1758220532586, "mdate": 1759897421730, "content": {"title": "UNSUPERVISED MEMBRANE SUBTRACTION IN CRYOGENIC ELECTRON MICROSCOPY IMAGES", "abstract": "Cryogenic electron microscopy (cryo-EM) of membrane proteins often requires extracting them from their membrane to simplify downstream image processing. While this step reduces the influence of membranes on 3D reconstruction, it also prevents proteins from being observed in their natural state. To overcome this limitation, we propose a two-step machine learning framework that avoids protein extraction: (1) membrane detection, which identifies the bilayer membrane, and (2) membrane subtraction, which digitally removes the detected membrane from the cryo-EM micrograph. Recent work has introduced supervised algorithms for membrane detection, but membrane subtraction remains relatively underexplored. Here, we present a novel unsupervised approach to membrane subtraction that models membranes using a general representation and computes a smooth estimate, which can then be subtracted from the original cryo-EM micrograph. Experimental results show that our method outperforms existing membrane subtraction alternatives and enables reliable 3D reconstruction of membrane proteins using cryo-EM without protein extraction.", "tldr": "We present a novel method for unsupervised membrane subtraction from cryogenic-electron microscopy images of membrane proteins.", "keywords": ["cryo-EM", "membrane", "proteins", "image processing", "unsupervised", "membrane representation"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/5bff6be5d89ec4a7d64562a9c0ed2efb2f07ee66.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper titled “Unsupervised Membrane Subtraction in Cryogenic Electron Microscopy Images” introduces a new unsupervised framework for subtracting membranes from cryo-EM micrographs, given their segmentation is known. The authors introduce two main novelties. First a mathematical framework for representing biological membranes and second based on that representation an iterative unsupervised algorithm that estimates each unique membrane within micrographs. By estimating and  removing the membrane signal, the method produces micrographs denoised from membrane interference. The proposed framework is evaluated against existing methods, demonstrating better performance in terms of the membrane subtraction fraction. Finally, the authors validate their method’s effectiveness by reconstructing a membrane protein at high resolution."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The main strength of the paper lies in its solid mathematical foundation for defining and estimating membrane structures in cryo-EM micrographs. Building on this framework, the authors develop an iterative approach to estimate membrane signal contributions in experimental data and remove them in order to obtain higher-resolution membrane protein reconstructions. The theoretical rigor and clear formulation demonstrate strong technical expertise, along with improved evaluation and presentation. The method has the potential to become a valuable contribution to the field."}, "weaknesses": {"value": "1. The claim of an “unsupervised membrane subtraction algorithm” is not entirely accurate, as the membrane detection step within the pipeline relies on a supervised U-Net model. This dependence weakens the claim of unsupervision.\n\n2. The evaluation is based on limited data diversity, while similar micrographs are used both for training the U-Net and for comparison with other methods. This setup makes the evaluation potentially biased and less fair to the baselines.\n\n3. The experimental analysis could be strengthened through ablation studies (e.g., iteration count, grid spacing, weighting function) and by including more 3D reconstruction results, especially from unseen experiments. Additionally, the validity of the proposed evaluation metrics (the membrane similarity index and subtraction fraction) remains somewhat uncertain, as their correlation with reconstruction quality is not demonstrated."}, "questions": {"value": "1. Please clarify whether the U-Net segmentation output is applied uniformly across all compared methods (SA-algorithm, BM3D, SwinIR) or used only for the proposed approach. This point is essential to assess fairness in the comparison.\n2. Could the authors provide evidence or discussion on how the membrane similarity index and subtraction fraction correlate with reconstruction quality? It is unclear whether these metrics meaningfully reflect improvements in 3D reconstruction outcomes.\n3. Minor: In line 319 “ pixel sizes of 1.06, 1.09, and 0.825” please add the unit of length."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jYP1qoL8bv", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_nL2m"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_nL2m"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761906289509, "cdate": 1761906289509, "tmdate": 1762924230255, "mdate": 1762924230255, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents an “unsupervised membrane subtraction” approach for cryo-electron microscopy (cryo-EM) images of membrane proteins, aiming to reduce interference from membrane signals during single-particle reconstruction. The method first detects membrane regions using a U-Net model, then performs local geometric modeling with iterative smoothing to estimate and subtract membrane intensity. Experiments on three representative protein systems (Kv1.2, KCNQ1, and Na,K-ATPase) demonstrate that the approach effectively suppresses membrane artifacts while preserving protein details. Overall, the paper proposes a mathematically grounded and reproducible framework that can improve the preprocessing quality of cryo-EM data."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper tackles a practical problem in cryo-EM image preprocessing with a clear and well-formulated approach.\n\nThe method combines geometric modeling and optimization in a coherent framework. \n\nExperimental results clearly show reduced membrane artifacts."}, "weaknesses": {"value": "My background differs somewhat from the authors’, so the following comments are offered from a broader, cross-disciplinary perspective. \n\nOverall, the topic is meaningful and relevant, but from a machine learning and modeling standpoint, the paper’s originality appears moderate. The method mainly systematizes existing geometric and variational techniques rather than introducing new learning or representation mechanisms, and the term “unsupervised” is somewhat misleading given that membrane detection still relies on a supervised U-Net. The experimental dataset is relatively small (around 200 micrographs for training and 5000 for testing in one system) and not publicly available, limiting the assessment of generalization. The comparison includes BM3D, SwinIR, and SA, but omits recent self-supervised or EM-specific baselines. The theoretical derivations are thorough, but the link to implementation details is unclear, and there are minor inconsistencies between text and figures (e.g., missing subpanel in Figure 4). \n\nIn summary, the paper demonstrates solid engineering work and numerical stability, yet from a broader ML audience’s viewpoint, it would benefit from stronger methodological originality, more comprehensive experiments, and clearer narrative integration."}, "questions": {"value": "1) Please clarify the scope and assumptions of unsupervised. The paper states supervised membrane detection and “unsupervised” subtraction, but does not formally specify the learning or optimization assumptions for the unsupervised stage (priors, regularizers, observables).\n\n2) Please map theory to implementation explicitly. While implementation details and iterative optimization in PyTorch are described, the correspondence from specific equations (core objectives and regularizers) to actual loss terms and update steps is not clear. An equation to code/loss term mapping would help.\n\n3) Have you considered adding self-supervised or EM-specific baselines? The current comparisons (SA, BM3D, SwinIR) are reasonable but omit domain-relevant unsupervised approaches, which could contextualize the method’s advantages more fairly.\n\n4) Any plans for data release and larger-scale validation? The paper describes two datasets but does not mention public availability or evaluation across more diverse imaging conditions. Releasing sample data or testing on larger datasets would strengthen reproducibility and generality.\n\nBTW, as my expertise is outside the cryo-EM field, these questions are raised from a broader “non-specialist reviewer” perspective. I would appreciate clarifications from the authors on these points and would be interested to see how their responses and the ensuing discussion with other reviewers might address these concerns."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "SiwsE4MHDL", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_caJJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_caJJ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761982310379, "cdate": 1761982310379, "tmdate": 1762924229916, "mdate": 1762924229916, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the problem of membrane subtraction in cryo-EM images of membrane proteins. To this end, it proposes a mathematical framework to represent membranes in an image and an iterative unsupervised algorithm to subtract them. The paper argues that the proposed method results in better subtraction of membranes than alternate ways."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "+ A novel mathematical framework is presented for membranes, which to the best of my knowledge, is the first of its kind\n+ Experiments were performed on real cryo-EM datasets instead of just simulated data"}, "weaknesses": {"value": "- I do not think the problem is significant enough for ICLR conference. Furthermore, the membrane subtraction did not result into significant discoveries, such as, increasing resolution of membrane proteins or discovery of novel membrane proteins. \n\n- The paper itself mentions that proposed mathematical framework for membranes can be used for other membrane-like image features which are not membranes. This is contradicting, in such a case, the definition is wrong. Without taking into account the scale of the image, I do not think it is possible to mathematically define membranes. Membrane-like structures inside the cell are not membranes. Just because the method treats them as so does not make them membranes.\n\n- The reconstruction aspect of the evaluation is not clear. Figure 6 does not demonstrate the benefit of doing membrane subtraction using the proposed method"}, "questions": {"value": "Please explain the reconstruction aspect of evaluation. How Figure 6 is showing the need of your membrane subtraction method? Why the alternate methods can not be used?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "5FdLP8AwYI", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_yDpV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_yDpV"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761986417552, "cdate": 1761986417552, "tmdate": 1762924229620, "mdate": 1762924229620, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the problem of membrane subtraction in cryo-EM images of membrane proteins. To this end, it proposes a mathematical framework to represent membranes in an image and an iterative unsupervised algorithm to subtract them. The paper argues that the proposed method results in better subtraction of membranes than alternate ways."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "+ A novel mathematical framework is presented for membranes, which to the best of my knowledge, is the first of its kind\n+ Experiments were performed on real cryo-EM datasets instead of just simulated data"}, "weaknesses": {"value": "- I do not think the problem is significant enough for ICLR conference. Furthermore, the membrane subtraction did not result into significant discoveries, such as, increasing resolution of membrane proteins or discovery of novel membrane proteins. \n\n- The paper itself mentions that proposed mathematical framework for membranes can be used for other membrane-like image features which are not membranes. This is contradicting, in such a case, the definition is wrong. Without taking into account the scale of the image, I do not think it is possible to mathematically define membranes. Membrane-like structures inside the cell are not membranes. Just because the method treats them as so does not make them membranes.\n\n- The reconstruction aspect of the evaluation is not clear. Figure 6 does not demonstrate the benefit of doing membrane subtraction using the proposed method"}, "questions": {"value": "Please explain the reconstruction aspect of evaluation. How Figure 6 is showing the need of your membrane subtraction method? Why the alternate methods can not be used?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "5FdLP8AwYI", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_yDpV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_yDpV"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761986417552, "cdate": 1761986417552, "tmdate": 1763573079342, "mdate": 1763573079342, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose an image artifact detection method that first estimates the artifact signal by iteratively fitting an artifact-specific mathematical model to the noisy input images. Authors then remove the artifacts by simple subtraction. The scope of the study is limited to membranes in CRYO-EM images."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Clarity: The paper is clearly written.\nResults: Proposed method outperforms the reported baselines."}, "weaknesses": {"value": "The main issue of the paper is its extremely limited scope. While the work is worthwhile, it is extremely niche to be in the main ICLR conference.\n\n\nOriginality: \n\nDomain specific modelling of objects is a valid approach but iterative smoothing and subtraction steps of the core algorithm is very similar to expectation maximization-based methods like Richardson-Lucy. As far as I can see, the difference here is that the authors' “prior” is their membrane model which is a Gaussian mixture. I do not see this as a significant novelty.\n\n\nSignificance: \n\nThe scope of the paper is extremely limited. Authors only address membrane removal in cryo-em. While this is a valid problem to address, I doubt the method is applicable to other tasks (authors do not make such a claim either)  nor is it interesting to the ICLR community.\n\n\nExperiments: \n\nThis is tied to the scope of the paper but results in 3 cryo-em datasets does not tell the reader much."}, "questions": {"value": "Can the proposed smoothing–subtraction procedure be formulated as an optimization problem or probabilistic model to justify the “unsupervised” claim?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "zX4IXUPBwu", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_Lhgf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_Lhgf"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761993165804, "cdate": 1761993165804, "tmdate": 1762924229135, "mdate": 1762924229135, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes an unsupervised method to remove membranes from cryo-EM micrographs while keeping the embedded membrane proteins intact. The goal is to enable 3D reconstruction of membrane proteins without physically extracting them from the lipid bilayer, which often alters their native structure. The method has two main parts: membrane detection (done with a standard supervised U-Net) and membrane subtraction (the new part). The subtraction part models the membrane using local basis functions aligned with membrane curvature, and iteratively smooths and subtracts it. The authors test the method on several datasets of ion channel and ATPase proteins, comparing it to semi-automatic and denoising-based methods. Results show that their approach produces smoother, more realistic membrane estimates and improves 3D reconstructions."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* The problem is meaningful for cryo-EM and real biological research.\n   * The approach is original and mathematically well grounded.\n   * The iterative smoothing framework is intuitive and effective.\n   * The results clearly beat older baselines like SA and BM3D.\n   * The authors validate their method through both visual results and reconstruction quality.\n   * The writing is careful and figures are clear."}, "weaknesses": {"value": "* The unsupervised part still depends on supervised membrane detection.\nThis makes the claim of “fully unsupervised” less accurate. A discussion on how segmentation errors affect subtraction would help.\n   * Besides, the evaluation is quite narrow. Only a few proteins are tested, and all data are from a small number of labs. There is no test on synthetic data or other public cryo-EM datasets. It would be nice to see quantitative results on a broader range of conditions.\n   * The mathematical theory section is long and difficult to read. Many parts of Section 3 could be simplified. Readers might find it hard to connect the math to the algorithm.\n   * The visual comparison with other methods is convincing but limited.\nAdding a quantitative measure of protein preservation would make the results stronger.\n   * Finally, computation time is not discussed. The iterative process may be slow on high-resolution images, but this is not reported."}, "questions": {"value": "1. How sensitive is the subtraction to errors in membrane segmentation?\nFor example, what happens if part of the membrane is missed or mislabeled?\n      2. How long does the full process take for a 5760×4092 micrograph? Can it scale to thousands of images efficiently?\n      3. Could your algorithm handle multiple membranes or overlapping vesicles in the same image?\n      4. Is it possible to use this approach directly on tomograms or 3D cryo-ET data?\n      5. What would happen if the membrane is not bilayer-like, for example in irregular cell membranes?\n      6. Do you plan to release the code and dataset so that others can reproduce your results?\n      7. Could your iterative smoothing be replaced or combined with modern unsupervised denoising networks for speed improvement?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "8YoIoOxm6x", "forum": "CZOb6ljxhQ", "replyto": "CZOb6ljxhQ", "signatures": ["ICLR.cc/2026/Conference/Submission13659/Reviewer_roRs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13659/Reviewer_roRs"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission13659/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761999787832, "cdate": 1761999787832, "tmdate": 1762924228693, "mdate": 1762924228693, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}