{"id": "E7mrnBuMFd", "number": 3254, "cdate": 1757388293691, "mdate": 1763642697418, "content": {"title": "Learning Molecular Chirality via Chiral Determinant Kernels", "abstract": "Chirality is a fundamental molecular property that governs stereospecific behavior in chemistry and biology. Capturing chirality in machine learning models remains challenging due to the geometric complexity of stereochemical relationships and the limitations of traditional molecular representations that often lack explicit stereochemical encoding. Existing approaches to chiral molecular representation primarily focus on central chirality, relying on handcrafted stereochemical tags or limited 3D encodings, and thus fail to generalize to more complex forms, such as axial chirality. In this work, we introduce \\textbf{ChiDeK} (\\textbf{Chi}ral \\textbf{De}terminant \\textbf{K}ernels), a framework that systematically integrates stereogenic information into molecular representation learning. We propose the chiral determinant kernel to encode the SE(3)-invariant chirality matrix and employ cross-attention to integrate stereochemical information from local chiral centers into the global molecular representation. This design enables explicit modeling of chiral-related features within a unified architecture, capable of jointly encoding central and axial chirality. To support the evaluation of axial chirality, we construct a new benchmark for electronic circular dichroism (ECD) and optical rotation (OR) prediction. Across four tasks, including R/S configuration classification, enantiomer ranking, ECD spectrum prediction, and OR prediction, ChiDeK achieves substantial improvements over state-of-the-art baselines, most notably yielding over 7\\% higher accuracy on axially chiral tasks on average.", "tldr": "", "keywords": ["chirality", "molecular representation learning", "axial chirality"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/fbb8877a6cf3624f2b8c82b4b7de42c55dd26c61.pdf", "supplementary_material": "/attachment/48068f040dee743fb11b0e194d12e01358c872e8.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes ChiDeK, a novel framework that explicitly models molecular chirality using chiral determinant kernels and a chiral-aware cross-attention transformer to capture stereochemical interactions. It achieves chiral-sensitive, rotation- and translation-invariant molecular representations for tasks like chirality classification and spectrum prediction."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- Paper is well written\n- Introduces differentiable chiral determinant kernels to encode stereochemistry.\n- Uses chiral-aware cross-attention to capture interactions between atom types."}, "weaknesses": {"value": "- How does the chiral matrix characterize the axial chirality? It seems it can only characterize central chirality. \n- What is the computational complexity of the method, since it computes the determinant, which is expensive in higher dimensions?\n- Can this method be generalizable to the datasets where we have a combination of molecules, of which some are chiral and some are not?\n- Can the method characterize Diastereomers?"}, "questions": {"value": "See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "IrgTfq2JzL", "forum": "E7mrnBuMFd", "replyto": "E7mrnBuMFd", "signatures": ["ICLR.cc/2026/Conference/Submission3254/Reviewer_QnyP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3254/Reviewer_QnyP"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3254/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761565042333, "cdate": 1761565042333, "tmdate": 1762916629877, "mdate": 1762916629877, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General response"}, "comment": {"value": "Dear Reviewers and Chairs,\n\nWe sincerely thank all reviewers for their constructive and insightful comments, which are invaluable for improving our manuscript. We also appreciate the Chairs for their time and efforts in coordinating the review process.\n\nWe are encouraged by the positive recognition that our work introduces a **novel unified chirality representation** capable of capturing both central and axial stereochemistry (Reviewers VtGG, pVhT, 97qz), and that our experiments across R/S classification, enantiomer ranking, and ECD prediction demonstrate **clear improvements** (Reviewers pVhT, 97qz). The reviewers further highlight the **mathematically well-motivated chiral determinant kernel** (Reviewer pVhT), the **chirality-aware cross-attention mechanism** (Reviewer QnyP), the **new AxialECD dataset** (Reviewers VtGG, pVhT), and the clear, **well-written** presentation of the manuscript (Reviewer QnyP). We are grateful for this recognition.\n\n**Summary of common concerns and our responses**\n\n- *Computational cost*: Reviewers expressed concerns regarding runtime and efficiency. In practice, the main computational cost lies in the attention layers rather than in QR decomposition and determinant calculation. Training on the axial chiral ECD tasks requires **<1 minute per epoch** on a single high-end GPU with **~1 GB** of memory. QR-based chiral determinant computation remains efficient due to PyTorch's optimized batched routines and our masking strategy for padded atoms.\n- *Performance on central-chiral ECD prediction*: As reviewers noted, the performance on central-chirality ECD peak-height prediction is low. This is a **dataset-quality issue**: the public CMCDS dataset [1] provides RDKit-generated conformers that are **inconsistent** with the DFT-optimized geometries used to compute the original ECD labels. All baseline models perform near-random under this mismatch, confirming that the limitation arises from **inconsistent coordinates** rather than our architecture.\n- *Broader downstream tasks and ablations*: Reviewers required more valuable downstream tasks and ablation studies. In response to reviewer suggestions, we have conducted additional experiments: (1) **Optical rotation prediction task** for axial chirality; (2) **Mixed-type chiral classification** incorporating both chiral and achiral molecules; (3) Ablation on **missing or mislabeled chiral atoms**; (4) **General molecular property prediction** on MoleculeNet tasks where chirality plays a limited role.\n\nWe have revised the manuscript and supplementary material according to the concerns raised in the rebuttal, with changes highlighted in blue and summarized as follows:\n\n- Revised the abstract and introduction to more clearly state our contributions.\n- Added ablation results on missing or mislabeled chiral atoms (Appendix B.3).\n- Added axial-chirality optical rotation prediction (Section 5.1.2) and detailed dataset construction (Appendix A.2).\n- Clarified the cause of poor central-chiral ECD results and emphasized the dataset inconsistency issue (Section 5.1.1).\n- Added a fine-grained breakdown of axial-chirality ECD prediction across seven subtypes (Appendix B.1).\n- Added evaluations on MoleculeNet datasets [2] where chirality is less relevant (Appendix B.2).\n- Added SPMS [3] as a baseline in Section 5.\n- Updated the supplementary material with detailed code and an expanded README.\n\nWe sincerely thank all reviewers again for their valuable feedback. If there are any remaining or new concerns, we will be happy to address them in detail.\n\n---\n\n**References**\n\n[1] Hao Li, Da Long, Li Yuan, Yonghong Tian, Xinchang Wang, and Fanyang Mo. Decoupled peak property learning for efficient and interpretable electronic circular dichroism spectrum prediction. *Nature Computational Science*, pp. 1–11, 2025. doi: 10.1038/s43588-024-00757-7.\n\n[2] Zhenqin Wu, Bharath Ramsundar, Evan N. Feinberg, Joseph Gomes, Caleb Geniesse, Aneesh S. Pappu, Karl Leswing, and Vijay Pande. Moleculenet: a benchmark for molecular machine learning. *Chem. Sci.*, 9:513–530, 2018. doi: 10.1039/C7SC02664A.\n\n[3] Li-Cheng Xu, Xin Li, Miao-Jiong Tang, Luo-Tian Yuan, Jia-Yu Zheng, Shuo-Qing Zhang, and Xin Hong. A molecular stereostructure descriptor based on spherical projection. *Synlett*, 32(18): 1837–1842, 2021. doi: 10.1055/s-0040-1705977.\n\nBest regards,\n\nThe Authors"}}, "id": "nNQekXHQ2G", "forum": "E7mrnBuMFd", "replyto": "E7mrnBuMFd", "signatures": ["ICLR.cc/2026/Conference/Submission3254/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3254/Authors"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3254/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763642995973, "cdate": 1763642995973, "tmdate": 1763642995973, "mdate": 1763642995973, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors developed a deep learning-based tool named ChiDeK for distinguishing point chirality and axial chirality, and applied it to tasks including R/S label classification, enantiomer ranking, and prediction of the sign and position of ECD."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Chirality recognition is a central issue in chemical research, and accurately capturing the stereochemical environment of molecules is key to distinguishing enantiomers. The proposed ChiDeK architecture leverages an SE(3)-invariant chirality matrix and cross-attention mechanisms to effectively extract molecular stereochemical information, enabling the simultaneous identification of both point and axial chirality. The model demonstrates strong performance in R/S label classification, enantiomer ranking, and ECD sign and position prediction for chiral molecules, achieving particularly notable accuracy in the binary classification of ECD signs for axially chiral molecules."}, "weaknesses": {"value": "1. Although acquiring chiral information of molecules is important, using a model to distinguish R/S configurations of point and axial chirality appears to be of limited practical significance. Well-established chemical rules, such as those implemented in RDKit, already exist for such differentiation. While the authors generate discriminative features for enantiomers via the chirality matrix and deep learning—which can indeed distinguish R/S configurations—this should not be the ultimate goal. The application of these chirality-related features should target more valuable downstream tasks, such as predicting enantioselectivity in asymmetric catalytic reactions or binding affinity between chiral drug molecules and protein targets.\n2. This work can largely be viewed as an extension of the ChIRo study, expanding its scope from point chirality to axial chirality. However, after demonstrating that ChIRo could generate discriminative features for enantiomers, its authors further conducted a practically meaningful downstream application: ranking enantiomers by docking scores in an enantiosensitive protein pocket. In contrast, the present authors only replicated similar benchmark tests on point chiral data and did not perform valuable downstream application experiments on the axially chiral molecules emphasized in this work.\n3. The authors claim that this is the first architecture capable of jointly encoding central and axial chirality. In reality, existing methods such as ChiralFinder and SPMS, which are mentioned in the paper, can also extract features that distinguish point and axial chirality. Moreover, the authors' model itself utilizes the chirality matrix generated by ChiralFinder. To ensure a rigorous performance comparison, the authors should benchmark their model against features derived from ChiralFinder and SPMS on the same set of tasks.\n4. The core chiral information in this work is derived from ChiralFinder, which appears crucial to ChiDeK's ability to distinguish chirality. As a result, the unique contribution of ChiDeK itself to the task of axial chirality discrimination remains unclear.\n5. According to the results in Table 1 for point chiral molecules across R/S classification, enantiomer ranking, and ECD prediction tasks, the model does not show a significant advantage in point chirality-related predictions. In particular, the accuracy for ECD sign prediction is only 53.3%, which—assuming a 1:1 positive-to-negative sample ratio—is barely better than random guessing (50%).\n6. The authors do not appear to have provided the complete data used in the study. The data folder supplied is empty, and the accompanying README file is too brief, offering no guidance on how to obtain the necessary dependencies or datasets."}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "No"}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "py1WJbFlqf", "forum": "E7mrnBuMFd", "replyto": "E7mrnBuMFd", "signatures": ["ICLR.cc/2026/Conference/Submission3254/Reviewer_97qz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3254/Reviewer_97qz"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3254/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761822229352, "cdate": 1761822229352, "tmdate": 1762916629688, "mdate": 1762916629688, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes ChiDeK, a unified framework for learning molecular chirality representations. The method introduces a chiral determinant kernel to encode stereochemical information derived from the chirality matrix, and integrates it into a cross-attention architecture to propagate chiral information across the molecular graph. The model is able to jointly handle central and axial chirality, and a new benchmark dataset for axial-chiral ECD prediction is constructed. Experiments show improvements across R/S classification, enantiomer ranking, and ECD spectrum prediction tasks."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Provides a unified representation for both central and axial chirality, which is not addressed by prior models.\n\n2. The chiral determinant kernel is mathematically well-motivated and reflection-sensitive.\n\n3. The newly constructed AxialECD dataset fills a gap in evaluating axial chirality.\n\n4. Demonstrates clear improvements in ECD prediction, especially peak sign prediction for axial chirality."}, "weaknesses": {"value": "1. Limited diversity and size of the AxialECD dataset. \n\nThe proposed AxialECD benchmark includes ~600 axial chiral molecules, which represents a relatively narrow stereochemical space and may not generalize to other classes of axial chirality such as atropisomeric biaryls with flexible steric barriers or complexes with metal-coordinated axes. I recommend that authors report performance breakdown by molecular subtypes, or perform zero-shot or cross-dataset evaluation if another axial-chirality dataset (or cases from published articles) becomes available.\n\n2. Scalability and efficiency of the chiral determinant kernel.\n\nThe chiral determinant kernel relies on QR decomposition for each chiral center, which may incur non-trivial computational overhead when scaling to large molecules (e.g., natural products, macrocycles) or conformer ensembles. Provide runtime comparisons with SE(3)-equivariant baselines and discuss strategies for batch-efficient QR computation.\n\n3. Lack of evaluation beyond chirality-sensitive tasks.\n\nWhile the model is clearly designed for chirality-aware tasks, all experiments are conducted on datasets where chirality is explicitly involved in the label. It is unclear whether ChiDeK introduces unnecessary inductive bias or reduced performance in general molecular property prediction tasks where chirality is less relevant. Please include control experiments on standard property prediction datasets (e.g., QM9, PCBA, MoleculeNet) to confirm no loss of expressivity."}, "questions": {"value": "1. How does the model’s performance vary when using different conformer generation pipelines? For example, RDKit vs. xTB-relaxed vs. DFT-optimized conformers.\n\n2. Could the authors provide runtime and memory usage comparisons, particularly regarding QR decomposition, compared to SE(3)-equivariant baselines?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QLgk08O7QQ", "forum": "E7mrnBuMFd", "replyto": "E7mrnBuMFd", "signatures": ["ICLR.cc/2026/Conference/Submission3254/Reviewer_pVhT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3254/Reviewer_pVhT"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3254/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761878035400, "cdate": 1761878035400, "tmdate": 1762916629520, "mdate": 1762916629520, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes ChiDeK (Chiral Determinant Kernels), a new architecture for learning stereochemistry-aware molecular representations. The key goal is to encode both central chirality (classical R/S stereocenters) and axial chirality (stereogenic axes, e.g. biaryls with restricted rotation) in a unified framework."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. A major strength of the paper is that it propose an approach to build a representation that can capture both central and axial chirality, which has practical important in drug discovery.\n\n2. The paper contributes the AxialECD dataset , providing a good benchmark for the analysis in the area."}, "weaknesses": {"value": "1. The method assumes a correct partition of atoms (and axes) into chiral / chiral-related / non-chiral, in some cases with manual labeling by chemists. The model does not learn these on its own. Robustness to mistakes in this preprocessing step is not evaluated, so it’s unclear how well the approach holds up under noisy or incomplete chirality annotations. For example, if the stereocenter or chiral axis is mislabeled or partially missed, does performance degrade sharply, or is the model tolerant to some noise in these assignments?\n\n2. The strongest axial chirality results are on ECD peak-sign prediction. It is not shown that the same architecture improves other chirality-sensitive endpoints (e.g., enantioselective binding, optical rotation). This leaves open whether the method is generally useful for axial chirality in drug discovery, or mainly tuned to ECD-style tasks. \n\n3. For central chirality ECD prediction, the model’s sign accuracy is near random (~53%), and the explanation is attributed to noisy conformers. The paper does not test whether using higher-quality conformers fixes this. So it’s not clear whether the limitation is data quality or a weakness of the architecture on central chirality.\n\n4. Most of the axial chirality evaluation is framed around ECD spectrum prediction. Do you expect the same architecture to transfer to other chirality-sensitive endpoints (e.g., enantioselective binding affinity, optical rotation, chiral toxicity)?"}, "questions": {"value": "1. The method assumes a correct partition of atoms (and axes) into chiral / chiral-related / non-chiral, in some cases with manual labeling by chemists. The model does not learn these on its own. Robustness to mistakes in this preprocessing step is not evaluated, so it’s unclear how well the approach holds up under noisy or incomplete chirality annotations. For example, if the stereocenter or chiral axis is mislabeled or partially missed, does performance degrade sharply, or is the model tolerant to some noise in these assignments?\n\n2. The strongest axial chirality results are on ECD peak-sign prediction. It is not shown that the same architecture improves other chirality-sensitive endpoints (e.g., enantioselective binding, optical rotation). This leaves open whether the method is generally useful for axial chirality in drug discovery, or mainly tuned to ECD-style tasks. \n\n3. For central chirality ECD prediction, the model’s sign accuracy is near random (~53%), and the explanation is attributed to noisy conformers. The paper does not test whether using higher-quality conformers fixes this. So it’s not clear whether the limitation is data quality or a weakness of the architecture on central chirality.\n\n4. Most of the axial chirality evaluation is framed around ECD spectrum prediction. Do you expect the same architecture to transfer to other chirality-sensitive endpoints (e.g., enantioselective binding affinity, optical rotation, chiral toxicity)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BqmDLocxKF", "forum": "E7mrnBuMFd", "replyto": "E7mrnBuMFd", "signatures": ["ICLR.cc/2026/Conference/Submission3254/Reviewer_VtGG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3254/Reviewer_VtGG"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3254/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761969157988, "cdate": 1761969157988, "tmdate": 1762916629341, "mdate": 1762916629341, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}