{"id": "ecbEfXdqrV", "number": 10784, "cdate": 1758181877100, "mdate": 1759897628829, "content": {"title": "Why Is the Counterintuitive Phenomenon of Likelihood Rare in Tabular Anomaly Detection with Deep Generative Models?", "abstract": "Deep generative models with tractable and analytically computable likelihoods, exemplified by normalizing flows, offer an effective basis for anomaly detection through likelihood-based scoring. We demonstrate that, unlike in the image domain where deep generative models frequently assign higher likelihoods to anomalous data, such counterintuitive behavior occurs far less often in tabular settings. We first introduce a domain-agnostic formulation that enables consistent detection and evaluation of the counterintuitive phenomenon, addressing the absence of precise definition. Through extensive experiments on 47 tabular datasets and 10 CV/NLP embedding datasets in ADBench, benchmarked against 12 baseline models, we demonstrate that the phenomenon, as defined, is consistently rare in general tabular data. We further investigate this phenomenon from both theoretical and empirical perspectives, focusing on the roles of data dimensionality and feature correlation difference. We find that NF-SLT offers a practical and reliable approach for anomaly detection in tabular domains.", "tldr": "", "keywords": ["Deep Generative Models", "Tabular Anomaly Detection", "Likelihood Paradox of Deep Generative Model"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/aa37dbbd5fcf3f78a42eb8ab7749a11584bb24b2.pdf", "supplementary_material": "/attachment/44c9d061a0af175d7581ac14f54211414cccea19.zip"}, "replies": [{"content": {"summary": {"value": "The present work investigates the *counterintuitive phenomenon* of likelihood in the context of structured tabular data. In the weakly supervised anomaly detection (AD) setup, where one disposes of a labeled dataset of normal and anomaly samples, one can train a generative model solely on the normal samples. The counterintuitive phenomenon describes the situation where a generative model, that provides an estimate of the likelihood of a sample given the learned **normal** distribution, e.g., Normalizing Flow, gives on average a higher likelihood to anomaly samples than to normal samples. This phenomenon has been mostly observed in the CV field and has yet to be investigated in the tabular domain.\n\nThe authors provide a formal definition of this counterintuitive phenomenon and investigate whether it arises in the tabular domain. They do so by comparing a Likelihood-based anomaly detection method to competing AD methods. They posit that if (i) likelihood as estimated by their model is sometimes higher for anomaly samples than for normal samples, but (ii) the other AD methods display an equivalent behavior with the anomaly score being higher for normal samples than for anomalies, this may be a sign that a different underlying phenomenon might be the cause.\n\nThey provide extensive experiments on a widely used AD benchmark, ADBench, and demonstrate that this counterintuitive phenomenon almost never happens when it comes to tabular data. The authors provide empirical and theoretical explanations as to why they observe these results."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "**S1:** Experiments are rigorous and extensive. Authors rely on a widely used benchmark in the AD literature on tabular data.\n\n**S2:** The results are **fully reproducible** as the authors provide the code to run their experiments.\n\n**S3:** The research question is interesting and is worth investigating. The approach chosen by the authors is relevant and well-motivated."}, "weaknesses": {"value": "**W1:** Overall the paper is **very hard to follow**. The structure is somewhat disorganized, and the formulations occasionally make it difficult to understand the points made by the author. Similarly, the paper contains **many typos**, we invite the authors to more thoroughly proofread their manuscript before submitting it.\n\n**W2**: The authors should **avoid citing preprints (e.g., from arXiv) when the papers have been published**. A few examples found in the reference section with arXiv citations:\n- A geometric explanation of the likelihood OOD detection paradox (Kamkari et al. 2024) has been accepted to ICML 2024.\n- Density estimation using real nvp. (Dinh et al., 2017) has been accepted to ICLR 2017.\n- On the universality of volume-preserving and coupling-based normalizing flows (Draxler et al., 2024) has been accepted to ICML 2024.\n- Beyond individual input for deep anomaly detection on tabular data (Thimonier et al., 2024) has been accepted to ICML 2024.\n\n**W3**: The method NF-SLT put forward by the authors is not explained in the main part of the paper."}, "questions": {"value": "**Q1**: As mentioned in **W1** the paper should be **reorganized significantly** as it suffers from (i) unclear turns of phrases, (ii) many typos, (iii) unnecessary formalization. A few non-exhaustive examples:\n- lines 54 to 68 are very hard to follow and can be confusing.\n- line 114: \"it follows a simple distribution $p_{\\mathbf{z}}$ that tipically selected standard Gaussian\".\n- line 116: \"$p_{\\mathbf{x}}$ can be expressed as a formula expressed in terms of $p_{\\mathbf{z}}$. The authors then proceed to use the term 'expressed' twice again in the following sentence.\n- lines 141-143: the authors mention performance improvement twice, but never truly explain to what performance they are referring.\n- line 148: \"overcame disadvantage\"\n- Section 3: The beginning of Section 3 repeats more or less what is already being said in the introduction.\n- Definition 3.3 appears as an overcomplication to formalize a simplistic problem that can be easily explained in plain words (as done in lines 204 to 208). Moreover, I do not think this can be considered a definition. \n- The acronym NF-SLT is used on several occurrences throughout the manuscript but is never defined (e.g., in the abstract).\n- line 296: 'we extend the expression which expresses the expected'\n- On several occasions, the authors mention \"the d\" to refer to the feature dimension. This is an odd turn of phrase.\n- lines 340 to 361 are tough to follow and would benefit from smaller sentences.\n\n**Q2**: As observed in Table 1 (lower part) and mentioned in section 4, it appears that **on the CV and NLP datasets, the *counterintuitive phenomenon* is not observed as NF-SLT outperforms all competing methods**. Since the premise is that this phenomenon is widely observed in the CV field, how do you account for the fact that it disappears when using the embedding representations rather than the original pixel representation? These embeddings do not suffer from the heterogeneity of features that tabular data displays. This should thus push this counterintuitive phenomenon according to section 5.2.\n\n**Q3**: Could you provide **in the main text** the hyperparameter setting and overall training settings? While I acknowledge that some information is given in section 4, I would recommend providing more details (on architecture for example).\n\nI lean towards reject due to the listed weaknesses. While I believe that this work might prove valuable in the future, it still needs significant improvement to enhance its clarity."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WSI43Ut5MV", "forum": "ecbEfXdqrV", "replyto": "ecbEfXdqrV", "signatures": ["ICLR.cc/2026/Conference/Submission10784/Reviewer_Bu6W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10784/Reviewer_Bu6W"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10784/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760612211123, "cdate": 1760612211123, "tmdate": 1762922001147, "mdate": 1762922001147, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper asks whether the likelihood paradox that is well known from image out of distribution settings truly holds for tabular anomaly detection. The authors propose a clear operational definition of a counterintuitive effect based on the relative area under the receiver operating curve gaps against a pool of comparison methods. They study a normalizing flow model with a simple likelihood test on a large collection of tabular datasets and on several vision and language embedding datasets, and they compare against many classical and modern baselines. The main empirical message is that for ordinary tabular anomaly detection, the paradox is rare and that a straightforward flow plus likelihood test is frequently competitive and often strong. To explain why images behave differently, the paper develops a theoretical account in which increasing dimensionality and strong feature correlation tend to shrink the likelihood gap that separates in distribution and out of distribution. Additionally, the analysis is complemented with synthetic studies and an intrinsic dimension survey that suggests that common tabular datasets have an effective dimension closer to the ambient one than typical image data.\n\nI find the overall direction valuable. The study addresses a common confusion in practice. The experimental sweep across many datasets is helpful for practitioners who need a dependable baseline.\n\nAt the same time, some choices reduce my confidence in the strength of the conclusions. The formal definition of a counterintuitive effect depends on fixed thresholds and on the exact competitor pool, yet there is no sensitivity analysis to show that the conclusion does not hinge on these choices. Several baselines appear under tuned or restricted, for example one class support vector machines only with a linear kernel, and some stronger recent tabular methods are not included. The paper repeats runs many times but does not report confidence intervals or statistical tests, and for heavily imbalanced problems I would also like to see area under the precision recall curve with uncertainty. The theoretical results rely on independence or near independence assumptions that are not directly checked on real data, while the empirical link through intrinsic dimension uses estimators that are known to be noisy and sensitive to scaling and sample size. The cross domain comparison also leans on experiments with embeddings for images rather than raw pixels in the main table, which weakens the bridge to the classical image paradox. With stronger baseline fairness, sensitivity checks, and uncertainty reporting, the message would be much firmer."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The paper addresses a real and timely question and does so with a broad empirical study. The message that tabular anomaly detection does not inherit the image likelihood paradox by default is useful and somewhat surprising to many readers. The definition of what counts as a counterintuitive phenomenon makes the discussion concrete and allows consistent counting across datasets. The theoretical story is appealing and connects intuition with mathematics. Higher dimension and stronger correlation often make pure likelihood less discriminative, and the synthetic ablations support this picture. The writing is mostly clear, tables are compact, and the appendices contain many implementation details that will help reproduction. As a practical takeaway, the flow plus likelihood recipe emerges as a credible line in the sand for tabular anomaly detection."}, "weaknesses": {"value": "The credibility of the main claims would benefit from additional controls. The decision rule that declares a counterintuitive effect uses thresholds and a chosen competitor set. Without a sensitivity study, it is difficult to determine the stability of the conclusion under reasonable alternatives. Baseline coverage and tuning are uneven. Some classical methods are limited to narrow settings, and several stronger tabular anomaly approaches are missing. Hyperparameter search spaces differ across methods, which can favor the proposed approach. \n\nAlthough the authors repeat experiments multiple times, providing more information on confidence intervals, significance tests, and the area under the precision-recall curve could help assess the general quality, especially for imbalanced datasets. \n\nThe theoretical analysis assumes independence or weak dependence for parts of the argument, yet there is no diagnostic that checks these assumptions on the real datasets. The bridge from theory to practice relies on intrinsic dimension estimators that are sensitive to preprocessing.\n\nThe work standardizes features but does not report how scaling choices and one hot encodings influence the intrinsic dimension statistics. I am missing a discussion of contamination or near duplicate risks in the benchmark pool, which is relevant for widely reused repositories."}, "questions": {"value": "1) Can you provide a short sensitivity analysis of the counterintuitive definition with several reasonable choices of thresholds and with alternative competitor pools, and report how often the decision flips?\n\n2) Can you include at least one strong one-class support vector machine with a radial basis kernel under a time budget, and add one or two recent tabular anomaly detectors that you excluded, so that the baseline set reflects the current state of the art?\n\n3) Could you report diagnostics that test the independence or weak dependence assumptions on the real datasets, for example, correlation summaries or partial correlation sparsity, and discuss how violations would affect the theory.\n\n4) For the intrinsic dimension link, can you show robustness to different scalings, to sub-sampling, and to an estimator beyond the two nearest neighbor and maximum likelihood ones, and clarify the handling of categorical variables and one-hot encodings\n\n5) Please move at least a small pixel-level image comparison into the main text or summarize it more clearly, so that the reader can judge the cross-domain claim without digging through the appendix.\n\n6) Did you run a near duplicate or contamination check across the dataset pool, and if not, can you comment on this risk"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ErLeXSEt3E", "forum": "ecbEfXdqrV", "replyto": "ecbEfXdqrV", "signatures": ["ICLR.cc/2026/Conference/Submission10784/Reviewer_58vu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10784/Reviewer_58vu"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10784/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761398072771, "cdate": 1761398072771, "tmdate": 1762922000345, "mdate": 1762922000345, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates why the counterintuitive phenomenon observed in image-domain anomaly detection—where deep generative models assign higher likelihoods to out-of-distribution data than to in-distribution data—rarely occurs in tabular data. The authors propose a formal definition of this phenomenon and conduct extensive experiments on 47 tabular datasets from ADBench using normalizing flows with simple likelihood tests (NF-SLT). They provide both theoretical and empirical explanations focusing on two factors: (1) lower dimensionality, and (2) lower feature correlation in tabular data. The results show that NF-SLT achieves competitive performance among 13 baselines without suffering from the counterintuitive phenomenon."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The theoretical analysis connecting dimensionality to likelihood gap and AUROC bounds is mathematically rigorous, the d Ratio analysis connecting intrinsic dimension to feature correlation provides valuable insights.\n\n2. A comprehensive set of experiments was conducted, encompassing synthetic Gaussian experiments, dimensionality reduction studies, intrinsic dimension analysis, and performance evaluation on real-world datasets, ensuring the reliability and robustness of the findings.\n\n3. The paper addresses a genuine gap in understanding why likelihood-based anomaly detection behaves differently across domains."}, "weaknesses": {"value": "1. The authors conduct only simple likelihood testing with normalizing flows but provide no improvement strategies for scenarios where their analysis predicts poor performance. Through theoretical (Theorem 5.4, Corollary 5.6) and empirical analyses (Section 5.2, Table 3), the paper establishes that high dimensionality and strong feature correlation lead to SLT failure. However, no solutions are proposed or discussed for such cases.\n\n2. The paper's contribution is weakened by defining a problem specifically to prove its absence. The authors construct Definition 3.3 based on observed characteristics of image-domain failures, then demonstrate that tabular data rarely exhibits this specific pattern. Definition 3.3's thresholds (β, γ) are empirically calibrated rather than theory-derived, and disconnected from Theorem 5.4's absolute failure conditions (entropy/dimension bounds). The paper proves tabular data lacks image-specific failure patterns, not that SLT genuinely succeeds. This reduces to showing \"tabular ≠ images\" rather than establishing reliability, limiting research contribution.\n\n3. Lack of Failure Case Analysis: The paper briefly mentions \"yeast\" dataset failure but doesn't deeply analyze when and why NF-SLT fails."}, "questions": {"value": "See Weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "xjYMAGcXRn", "forum": "ecbEfXdqrV", "replyto": "ecbEfXdqrV", "signatures": ["ICLR.cc/2026/Conference/Submission10784/Reviewer_f1P3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10784/Reviewer_f1P3"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10784/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761640221664, "cdate": 1761640221664, "tmdate": 1762921999917, "mdate": 1762921999917, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper studies the “counterintuitive likelihood” phenomenon in deep generative models, where anomalies sometimes receive higher likelihoods than normal data. While this issue is common in image domains, the authors show it is rare in tabular settings. They formalize a domain-agnostic definition of the phenomenon and evaluate normalizing flows and baselines across 47 tabular and 10 embedding datasets from ADBench. Results indicate that normalizing flow with Simple Likelihood Test is reliable for tabular anomaly detection. The authors further analyzes why the issue is less prominent in tabular data, highlighting the roles of dimensionality and feature-correlation differences."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The empirical study is comprehensive and the analysis is reasonable.\n\n- The finding that normalizing flow with Simple Likelihood Test outperforms other complicated methods is meaningful."}, "weaknesses": {"value": "- The conclusion that normalizing flow with Simple Likelihood Test performs well on tabular data is indeed not surprising. As suggested by Kirichenko et al. (2020) and Schirrmeister et al. (2020), the counterintuitive phenomenon in the image domain is mainly caused by the strong local correlations in images, which is clealry not the case for tabluar data.\n\n- The analysis from the perspective of intrinsic dimensionality and feature correlation is not novel. The impact of feature correlation is studied by Kirichenko et al. (2020) and Schirrmeister et al. (2020), and a deeper analysis of intrinsic dimensionality is provided in [1].\n\nThe present paper extends these arguments to a tabular benchmark but does not dramatically advance the theoretical understanding beyond existing literature.\n\n[1] Kamkari, Hamidreza, et al. \"A Geometric Explanation of the Likelihood OOD Detection Paradox.\" International Conference on Machine Learning. PMLR, 2024."}, "questions": {"value": "How sensitive are the results to the particular choice of model architecture (e.g., flow-based vs autoregressive)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "TEFpZDmMyN", "forum": "ecbEfXdqrV", "replyto": "ecbEfXdqrV", "signatures": ["ICLR.cc/2026/Conference/Submission10784/Reviewer_N87H"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10784/Reviewer_N87H"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10784/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761884618563, "cdate": 1761884618563, "tmdate": 1762921999369, "mdate": 1762921999369, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}