{"id": "egTQgf89Lm", "number": 15542, "cdate": 1758252518509, "mdate": 1759897300759, "content": {"title": "LLM-based Multi-Agent Blackboard System for Information Discovery in Data Science", "abstract": "The rapid advancement of Large Language Models (LLMs) has opened new opportunities in data science, yet their practical deployment is often constrained by the challenge of discovering relevant data within large data lakes. Existing methods struggle with this: single-agent systems are quickly overwhelmed by large, heterogeneous files in the data lakes, while multi-agent systems designed based on a master–slave paradigm depend on a rigid central controller that requires precise knowledge of each sub-agent's capabilities. To address these limitations, we propose a novel multi-agent communication paradigm inspired by the blackboard architecture for traditional AI models. In this framework, a central agent posts requests to a shared blackboard, and autonomous subordinate agents--either responsible for a partition of the data lake or general information retrieval--volunteer to respond based on their capabilities. This design improves scalability and flexibility by eliminating the need for a central coordinator to have prior knowledge of all sub-agents expertise. We evaluate our method on three benchmarks that require explicit data discovery: KramaBench and modified versions of DS-Bench and DA-Code to incorporate data discovery. Experimental results demonstrate that the blackboard architecture substantially outperforms baselines, including RAG and the master–slave multi-agent paradigm, achieving between 13% to 57% relative improvement in end-to-end task success and up to a 9\\% relative gain in F1 score for data discovery over the best-performing baselines across both proprietary and open-source LLMs. Our findings establish the blackboard paradigm as a scalable and generalizable communication framework for multi-agent systems.", "tldr": "A new blackboard-based multi-agent system helps LLMs accurately discover relevant data in large data lakes, significantly outperforming existing methods on data discovery and end-to-end task success.", "keywords": ["multi-agent", "data science", "data discovery", "large language models"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d1b2b2c6bae56f511f8a1da605725b2cdce6e497.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes a multi-agent communication framework for data discovery in data science based on a blackboard architecture. Instead of a master–slave controller assigning subtasks, a main agent posts requests (what information/data is needed) to a shared blackboard. Subordinate agents—each specializing in a partition of the data lake or general retrieval—self-select to respond if they can help. This shifts coordination from centralized routing to decentralized volunteering, improving scalability and flexibility when data lakes contain thousands of heterogeneous files. The system is evaluated on KramaBench and modified DS-Bench/DA-Code with explicit discovery phases, showing 13–57% relative gains in end-to-end task success and up to 9% relative F1 improvement in file discovery over strong baselines (RAG, master–slave multi-agent), across both proprietary and open-source LLMs."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Scalable, decentralized coordination: The blackboard lets agents volunteer based on capability, avoiding brittle central task routing and scaling better to large, heterogeneous data lakes.\nPractical for real data discovery: Partitioning the lake and binding agents to clusters reduces context overload and noise sensitivity versus single-agent or naïve RAG setups.\nConsistent empirical gains and generality: Outperforms RAG and master–slave baselines across multiple benchmarks and LLM types, indicating robustness and portability of the paradigm."}, "weaknesses": {"value": "- Incremental novelty: The “blackboard” paradigm is a classic AI architecture; the paper mostly repackages it for LLM agents without a clear, principled advance in control or learning. The comparison to master–slave is framed conceptually, but the paper lacks a formal analysis of when/why blackboard wins (e.g., under capability uncertainty, overlapping expertise, or partial observability).\n- No isolation of the communication factor: what if master–slave uses the same file/search agents but with learned routing or voting?\n- Data-lake partitioning is done by filename-only clustering with Gemini. This is fragile for enterprise lakes (cryptic names, mixed schemas) and may bias results. No ablation compares filename-only vs content-aware clustering (embeddings, schema inference), nor sensitivity to cluster granularity.\n- The paper repeatedly refers to the benchmark as “DS-Bench,” but the correct name is DSBench"}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "n8GPzVt6Fa", "forum": "egTQgf89Lm", "replyto": "egTQgf89Lm", "signatures": ["ICLR.cc/2026/Conference/Submission15542/Reviewer_HNzs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15542/Reviewer_HNzs"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15542/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760805933093, "cdate": 1760805933093, "tmdate": 1762925818641, "mdate": 1762925818641, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a multi-agent system to find relevant information from large data lakes. Instead of using a master-slave model, this paper proposes a multi-agent communication paradigm inspired by the blackboard architecture of traditional AI. Experiments on three data discovery benchmarks show that the proposed method significantly outperforms existing techniques (RAG and master-slave)."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.  Developing an LLM-driven system for automating end-to-end data science pipelines is interesting and can augment human analysts.\n\n2. This paper is well-organized and easy to read."}, "weaknesses": {"value": "1. The technical contribution of the work is marginal. The whole pipeline is somewhat not novel and relies on LLM API calls. \n\n2. The proposed framework relies on multiple LLM API calls throughout its pipeline. A comparative analysis of its computational cost and latency against the baseline methods should be included to provide a complete assessment of its efficiency. In particular, we usually use BM25 and BGE embedding to retrieve relevant files from a large pool in practice. The proposed method may face scalability challenges when retrieving relevant files from a large candidate pool, leading to potentially prohibitive latency in real-world applications.\n\n3. More advanced baselines should be compared in terms of both automatic data science and file discovery."}, "questions": {"value": "1. The proposed framework relies on multiple LLM API calls throughout its pipeline. A comparative analysis of its computational cost and latency against the baseline methods should be included to provide a complete assessment of its efficiency. In particular, we usually use BM25 and BGE embedding to retrieve relevant files from a large pool in practice. The proposed method may face scalability challenges when retrieving relevant files from a large candidate pool, leading to potentially prohibitive latency in real-world applications.\n\n2. More advanced baselines should be compared in terms of both automatic data science and file discovery."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "s3GG4ybdJu", "forum": "egTQgf89Lm", "replyto": "egTQgf89Lm", "signatures": ["ICLR.cc/2026/Conference/Submission15542/Reviewer_f4CA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15542/Reviewer_f4CA"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15542/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761381344928, "cdate": 1761381344928, "tmdate": 1762925818265, "mdate": 1762925818265, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose a multi-agent communication paradigm inspired by the classical blackboard architecture in traditional AI systems. In the proposed framework, a central agent posts queries or requests to a shared blackboard, and a set of autonomous subordinate agents, each responsible for a specific partition of the data lake or a particular retrieval strategy, volunteer to respond based on their capabilities."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper offers a fresh perspective on coordination and task allocation in multi-agent systems, drawing inspiration from classical AI architectures but applying it to modern data retrieval challenges."}, "weaknesses": {"value": "1. The motivation for adopting a blackboard-style coordination mechanism is somewhat underdeveloped. Given the reasoning ability of LLM-based agents, a master agent could, in theory, dynamically decide which sub-agent to query without needing an explicit shared blackboard. This concern is particularly relevant because the current instantiation only includes two helper agents (file and search agents), making the benefits of the blackboard design less evident.\n2. It would make this paper stronger if the authors could show more fine-grained analysis on benchmarks. For example, the performance of different architectures based on the number and types of data files."}, "questions": {"value": "Please check the weaknesses section for more details."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "S1uO5QorgO", "forum": "egTQgf89Lm", "replyto": "egTQgf89Lm", "signatures": ["ICLR.cc/2026/Conference/Submission15542/Reviewer_Fxbd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15542/Reviewer_Fxbd"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15542/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761895546125, "cdate": 1761895546125, "tmdate": 1762925817573, "mdate": 1762925817573, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel multi-agent system for information discovery in data science. Specifically, it proposes a blackboard multi-agent system in which the main agent does not assign tasks to subordinate agents but posts requests to the blackboard. And the subordinate agents autonomously decide whether to respond based on their expertise. The paper evaluates its proposed agent system on three benchmarks including KramaBench, DSBench, and DA-Code and shows its advantage over existing agent systems related to RAG and Master-Slave systems."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "1. The blackboard multi-agent system is an interesting idea. Similar systems are practically used in large-scale Internet services such as Uber and other on-demand shared riding platforms. It is excellent to apply similar ideas to LLM-based multi-agent systems.\n\n2. The experiments on three benchmarks including KramaBench, DSBench, and DA-Code show advantages over popular agent systems related to RAG and Master-Slave systems."}, "weaknesses": {"value": "1. It would be interesting to further analysis how the “Answering” agents behave in the multi-agent system. For instance, how to handle cases that none of the existing subordinate systems choose to respond? Or, on the opposite, how to handle cases that multiple subordinate systems are competing to respond? More analysis or details would further enhance the depth of the paper.\n\n2. The paper seems to lack the integration or comparison with multi-turn agent system like the ReAct systems. The agent performance typically improves significantly by planning, acting, and reflecting for multiple turns. It is unclear how the blackboard agent system can be integrated into the multi-turn ReAct framework.\n\n3. It is unclear why or how the work modifies DSBench and DA-Code for evaluation. It is recommended to release the modification details for the community to reproduce and align the results. Also, for DSBench, it is unclear whether the data analysis task or data modeling task are considered in the evaluation."}, "questions": {"value": "Typo & Formatting: The Jing et al., 2025 paper uses DSBench instead of DS-Bench. It is recommended to align with the original paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "diVnyahgl1", "forum": "egTQgf89Lm", "replyto": "egTQgf89Lm", "signatures": ["ICLR.cc/2026/Conference/Submission15542/Reviewer_aVX6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15542/Reviewer_aVX6"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15542/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989744277, "cdate": 1761989744277, "tmdate": 1762925817190, "mdate": 1762925817190, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}