{"id": "EL1esipMln", "number": 19073, "cdate": 1758293320369, "mdate": 1762931889060, "content": {"title": "Context-Aware Autoregressive Models for Multi-Conditional Image Generation", "abstract": "Controlling generative models with multiple, simultaneous conditions is a critical yet challenging frontier. Mainstream diffusion models, despite their success in single-condition synthesis, often exhibit performance degradation and condition conflicts in this setting. We identify the root cause of this limitation as the inherent *parallel* generation process of these models. By applying all conditional constraints globally and concurrently, they create a \"tug-of-war\" between competing guidance signals, forcing suboptimal compromises. This paper advocates for a paradigm shift to *serial* generation. We posit that autoregressive models, by constructing images token-by-token, can resolve conflicting constraints locally and sequentially, enabling a more harmonious and precise integration of multiple conditions. To realize this paradigm, we introduce **ContextAR**, an autoregressive framework that represents diverse conditions within a unified sequence. It employs a novel Conditional Context-aware Attention mechanism that restricts inter-condition communication, enhancing both compositional flexibility and computational efficiency. Extensive experiments validate our hypothesis: ContextAR significantly outperforms state-of-the-art parallel (diffusion-based) methods in controllability and faithfulness to multiple conditions, without a trade-off in image quality. Our work establishes serial generation as a more powerful and flexible paradigm for the complex task of multi-conditional image synthesis.", "tldr": "", "keywords": ["autoregressive image generation", "multi-conditional control"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/8f71b125f57656e14934434bc042c09679c55f74.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The authors propose ContextAR, an autoregressive image generation model that can take in multiple (dense) conditional images (e.g. pose, canny edge maps, etc.)."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "ControlAR outperforms previous baselines on MultiGen-20M."}, "weaknesses": {"value": "1. My largest reservation is that the method is poorly motivated. All of section 3 is vague. At best, this is a hypothesis with no backup theory or empirical validation.\n\n1-1. The main claim for switching from parallel generation to sequential generation is that the conditions provide contradictory information for the same region. This also holds true for autoregressive models as the conditions are given in the same way. Generating an image patch-by-patch does not prevent this from happening.\n\n1-2. To backup the claim, the authors point to figure 3, which is not an experimental figure. This is conceptual, which does not provide evidence.\n\n2. Limited novelty: The method uses a standard autoregressive architecture formulation with multiple conditions.\n\n3. In table 1, the authors show that the proposed method outperforms previous methods, with smaller number of parameters. While this is appealing, a better comparison would be to train a (parallel) diffusion model with the same architecture (with modifications in the attention), with matched compute to truly see the advantage. Even better would be to show the scaling property of both methods - which scales better?"}, "questions": {"value": "Please see weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "CEXiv3FpsP", "forum": "EL1esipMln", "replyto": "EL1esipMln", "signatures": ["ICLR.cc/2026/Conference/Submission19073/Reviewer_3rqa"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19073/Reviewer_3rqa"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19073/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760495822170, "cdate": 1760495822170, "tmdate": 1762931098116, "mdate": 1762931098116, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "zy9V8LFaMY", "forum": "EL1esipMln", "replyto": "EL1esipMln", "signatures": ["ICLR.cc/2026/Conference/Submission19073/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19073/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762931815194, "cdate": 1762931815194, "tmdate": 1762931815194, "mdate": 1762931815194, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the challenge of multi-conditional image generation, where multiple input constraints (e.g., canny edges, depth, pose, or subject identity) must be harmonized to produce a single coherent image. Existing diffusion-based approaches often suffer from condition conflicts, where competing guidance signals degrade image fidelity or cause inconsistent adherence to conditions.\n\nThe authors attribute this issue to the parallel generation process in diffusion models, which applies all conditions globally and simultaneously at each denoising step. To overcome this, they propose shifting to serial (autoregressive) generation, arguing that token-by-token synthesis can resolve local conflicts more naturally.\n\nThey introduce ContextAR, an autoregressive framework that concatenates multiple condition tokens (encoded via VQ-VAE) into a unified sequence and processes them through a transformer equipped with a Conditional Context-Aware Attention mechanism. This includes Cross-Condition Perception Restriction (CCPR) to block inter-condition attention and Intra-Condition Bidirectional Perception (ICBP) to improve spatial coherence within each condition. Experiments on MultiGen-20M and SubjectSpatial200K demonstrate improved controllability and competitive FID compared to diffusion-based baselines like UniControl, Cocktail, and PixelPonder."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "**Empirical performance**: The method achieves strong controllability (highest SSIM) and comparable image quality (FID) to state-of-the-art diffusion systems despite using a smaller AR backbone.\n\n**Unified formulation**: The design supports flexible combinations of conditions during inference without retraining, highlighting modularity in condition composition."}, "weaknesses": {"value": "**Limited model novelty.**\n\nThe architectural contribution appears incremental. The proposed ContextAR primarily concatenates multiple condition tokens (encoded via VQ-VAE) into a unified sequence and slightly modifies the attention pattern to restrict cross-condition interaction. Such conditioning strategies have already been explored in ControlAR (Li et al., 2024c, ICLR’25) and EditAR (Mu et al., 2025, arXiv’25). As a result, the novelty lies mostly in implementation refinements rather than in introducing a fundamentally new modeling principle or generative paradigm.\n\n**Limited flexibility.**\n\nThe method requires retraining a full autoregressive transformer (LlamaGen-XL) to support multiple conditions, whereas diffusion-based control frameworks (e.g., ControlNet, T2I-Adapter) can often be applied as lightweight plug-in modules. This reduces its practicality and contradicts the paper’s claim of offering a flexible and general multi-condition generation framework.\n\n**No quantitative evaluation of condition conflict resolution.**\n\nThe central claim, that serial autoregressive generation inherently resolves condition conflicts, is not empirically substantiated. The paper provides only qualitative visualizations, without any quantitative metric or analysis (e.g., per-condition attention overlap or a condition consistency score) to verify conflict mitigation. This weakens the validity of its main motivation."}, "questions": {"value": "Q1. How exactly does the proposed serial generation resolve conflicts rather than merely distribute them temporally? Wouldn’t attention at each step still aggregate multiple conflicting condition signals?\n\nQ2. How scalable is the unified-sequence formulation? As the number or resolution of conditions increases, does the token sequence length and attention cost grow prohibitively?\n\nQ3. Could the authors compare with other AR-based conditional methods (e.g., EditAR, ControlAR) under identical datasets and conditions to isolate the gain from the proposed attention design?\n\nQ4. Can the model support dynamically weighted or adaptive condition fusion (e.g., prioritizing one condition over another) without retraining?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dkh3kIJxcC", "forum": "EL1esipMln", "replyto": "EL1esipMln", "signatures": ["ICLR.cc/2026/Conference/Submission19073/Reviewer_EQNZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19073/Reviewer_EQNZ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19073/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761890077049, "cdate": 1761890077049, "tmdate": 1762931097770, "mdate": 1762931097770, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This study introduces ContextAR for autoregressive image generation conditioned on multiple conditions. The authors claim that diffusion models inherently fail to leverage multiple conditions due to the issue of tug-of-war and autoregressive models can resolve the issue. Fine-tuning an image generation model conditioned on multiple conditions shows remarkable performance compared with previous frameworks after adding learnable positional embedding and the attention mask for intra-condition bidirectional perception."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "S1. The proposed methods, learnable positional embedding and various attention masks for effectively leveraging multiple conditions, make sense.\n\nS2. Empirical results show promising and competitive performance."}, "weaknesses": {"value": "Although I think the experiments present promising results, I have serious concerns regarding the rationale behind the key claims and experiments.\n\nW1. The key motivation lacks theoretical or empirical support. The paper claims that diffusion models inherently suffer from a “tug-of-war” between conditions, whereas autoregressive models can resolve this issue. However, there is neither theoretical nor empirical analysis to support this claim, since Section 3 is merely based on an assumption. In fact, this assumption may be incorrect — although diffusion models denoise all latent vectors jointly, each latent vector can attend to multiple condition tokens through multi-head attention. Because of positional embeddings, each noised latent vector can sufficiently attend to the corresponding local information of each conditioning image, so the image condition does not necessarily serve as a global guidance for the diffusion model. Moreover, diffusion models can leverage diffusion time steps to condition on multiple images: high-level noises attend to semantic-level conditions (coarse information), while low-level noises attend to pixel-level conditions (fine-grained information), which is different from autoregressive models. Considering these different behaviors, the authors should conduct a thorough analysis to justify the assumption in Section 3, given that it forms the key motivation for adopting autoregressive models as the main contribution of this paper.\n\nW2. There is no specific experiment that fairly compares diffusion and autoregressive models. Therefore, it remains difficult to substantiate the authors’ main claim — that autoregressive models perform better than diffusion models under multiple conditioning images."}, "questions": {"value": "Please refer to the weakness above. My major concerns are based on W1 and W2. I suggest resolving my major concerns above can improve the overall logic and make this paper more strong."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "2QabkzXYbu", "forum": "EL1esipMln", "replyto": "EL1esipMln", "signatures": ["ICLR.cc/2026/Conference/Submission19073/Reviewer_jPUv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19073/Reviewer_jPUv"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19073/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762166932123, "cdate": 1762166932123, "tmdate": 1762931097395, "mdate": 1762931097395, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors observe that the parallel generation process in mainstream diffusion models leads to condition conflicts when multiple controls are applied. They argue for a paradigm shift to serial generation, which can resolve these conflicts locally.\nBased on this insight, the paper proposes ContextAR. The \"Context\" here refers to two aspects: the \"Conditional Context\" (i.e., the user-provided controls like Canny or Subject) and the \"Sequential Context\" (the sequence of already-generated tokens, $q_{<t}$). The core \"Context-Aware\" capability of the model lies in its use of the sequential context ($q_{<t}$) to dynamically and locally decide which conditional context (e.g., Canny vs. Subject) to prioritize at each generation step."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* This paper is well-motivated. In practical applications, users often wish to impose multiple constraints simultaneously (e.g., specifying pose, depth, and subject appearance). The paper clearly identifies a key limitation of parallel generation in diffusion models: when guidance signals from different conditions (like Canny edges and subject textures) are applied globally and concurrently, they can conflict, forcing the model to produce a sub-optimal, \"compromised\" result. The core idea of using autoregressive generation to shift this \"global conflict\" into a series of \"local decisions\" is intuitive and interesting. The model can, for instance, prioritize the Canny condition when generating an outline and then shift its focus to the Subject condition for the internal texture.\n* A novel aspect of the methodology is the Conditional Context-aware Attention mechanism. Specifically, the Cross-Condition Perception Restriction (CCPR) prevents attention between different condition types (like Canny and Depth)."}, "weaknesses": {"value": "**Extensibility to New Conditions:** A primary weakness concerns the extensibility to new, unseen conditions. The paper's method relies on jointly training all conditions (Canny, Depth, HED, Pose, etc.) as part of a unified sequence. This contrasts with the models like ControlNet, which allow for \"plug-and-play\" training and addition of new control types onto a frozen base model. The paper does not explicitly discuss how a new condition (e.g., \"Scribble\" or \"Segmentation\") could be efficiently added to an already-trained ContextAR model, which would be a significant limitation if retraining from scratch is required."}, "questions": {"value": "* A key design choice in the framework is the Cross-Condition Perception Restriction (CCPR), which explicitly forbids attention between different condition types. The authors justify this as a way to improve flexibility and computational efficiency. However, might this assumption be too rigid? In cases where different conditions have a high degree of synergy (for example, a \"Pose\" map and a \"Canny\" map that both describe the same person), could allowing some form of cross-condition attention lead to a more coherent result?\n* The ablation study (Variant A, w/o CCPR) shows only a \"minimal performance gain\" when this restriction is removed.  Does this finding indicate that the model simply failed to learn how to effectively utilize this cross-condition information during training (perhaps as a side-effect of the random condition dropping strategy)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "oVGpH16JJi", "forum": "EL1esipMln", "replyto": "EL1esipMln", "signatures": ["ICLR.cc/2026/Conference/Submission19073/Reviewer_hoUq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19073/Reviewer_hoUq"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission19073/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762230484687, "cdate": 1762230484687, "tmdate": 1762931096919, "mdate": 1762931096919, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}