{"id": "F2USOqa0La", "number": 18374, "cdate": 1758286959174, "mdate": 1763647456026, "content": {"title": "What We Don't C: Manifold Disentanglement for Structured Discovery", "abstract": "Accessing information in learned representations is critical for annotation, discovery, and data filtering in disciplines where high-dimensional datasets are common. We introduce What We Don't C, a novel approach based on latent flow matching that disentangles latent subspaces by explicitly removing information included in conditional guidance resulting in meaningful residual representations. This allows factors of variation which have not already been captured in conditioning to become more readily available. We show how guidance in the flow path necessarily represses the information from the guiding, conditioning variables. Our results highlight this approach as a simple yet powerful mechanism for analyzing, controlling, and repurposing latent representations, providing a pathway toward using generative models to explore what we don't capture, consider, or catalog.", "tldr": "We use latent flow matching to disentangle latent subspaces from VAE latent variables, recovering meaningful residual representations.", "keywords": ["supervised representation learning", "disentanglement", "flow matching"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b7fbff28cea456838d520c12826949a65104c90e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces What We Don’t C (WWDC), an approach aimed at uncovering residual factors of variation in latent spaces by intentionally removing information associated with known conditioning signals (e.g., class labels). The method starts from a pretrained VAE, then uses latent flow matching with classifier-free guidance to subtract the influence of a chosen conditioning signal. By reversing that guided flow, the model produces a latent representation where that signal is minimized, making it easier to see what other structure was hidden underneath."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper has a clear and compelling motivation: instead of continuing to reinforce information we already understand in a dataset, it focuses on uncovering what remains after known factors are removed. This conceptual reframing is refreshing and feels genuinely useful, especially for exploratory scientific analysis. The authors present the idea in an intuitive way, and the progression of experiments (from synthetic data to real astrophysics imagery) helps build trust in the approach. The qualitative results are effective in showing how the method reveals subtle structure in the data that wasn’t obvious before. Additionally, the fact that WWDC operates on top of pretrained models makes it practical and easy to adopt in real workflows, instead of requiring heavy retraining or specialized architectures."}, "weaknesses": {"value": "The main limitation is that the evaluation remains largely qualitative, making it difficult to assess how well the method performs relative to established baselines in representation learning or disentanglement research. The paper would benefit from more systematic quantitative comparisons or metrics to support its claims. Some of the theoretical explanations around how information is preserved or removed during the latent flow process are also hard to follow and could use clearer intuition rather than relying primarily on equations. Finally, while the galaxy experiment is visually compelling, the paper does not fully explore the robustness or generality of the method across other complex real-world domains, which leaves questions about how broadly applicable the approach truly is."}, "questions": {"value": "1. How sensitive is WWDC to the choice of pretrained VAE or latent dimensionality? The method is demonstrated on a particular architecture setup, but it's unclear whether the residual patterns remain stable if the base model or latent size changes. Some ablation or robustness analysis would help clarify whether the effect is consistent or dependent on specific model configurations.\n\n2. Can you quantitative evaluation for the “emergent residual factors” revealed by WWDC? While the visualizations are compelling, it would strengthen the work to include metrics showing how well the extracted residual structure correlates with meaningful latent attributes (e.g., cluster separability, predictive power on downstream labels, or mutual information comparisons)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "u6pemrqnji", "forum": "F2USOqa0La", "replyto": "F2USOqa0La", "signatures": ["ICLR.cc/2026/Conference/Submission18374/Reviewer_GFk4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18374/Reviewer_GFk4"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18374/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761969988314, "cdate": 1761969988314, "tmdate": 1762928082601, "mdate": 1762928082601, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new method for disentanglement of the latent spaces of supervised (e.g., with class labels) generative models, using flow matching."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- addresses an important problem in an interesting way (including allowing further disentanglement of pretrained models)\n- reasonable breadth of experiments, from simple controlled to complex real datasets, including intuitive results in figures 6 and 7\n- intuitive results, especially in figures 6 and 7"}, "weaknesses": {"value": "- no reproducibility statement or opensource code, which is especially important for less theoretical contributions like this\n- no (argument for the lack of) clear contextualization or comparison against existing disentanglement approaches\n- hard-to-follow theory presentation in sections 2 and 3; maybe I just lack the background, but I guess I'm not the only reader who would benefit from gentler, more precise guidance through it\n- unpolished writing"}, "questions": {"value": "My main questions, following from the weaknesses above, are:\n1. can the authors can precisely explain and formalize the notion of disentanglement being used?\n2. having done that, can the authors motivate this notion? Is it just \"yet another\" disentanglement notion, or is it somehow more fundamentally a better notion that others in the literature?\n3. and can the authors relate this to other formalizations of disentanglement, including experimental comparisons where appropriate?\n\nLess important, but still helpful for me to better understand the work:\n1. can the authors rephrase the sentence starting at L085? I don't really understand it or even how to parse it.\n2. L212: what does \"ideal\" mean here? Is it not ideal just in practice, or also at a more fundamental level?\n3. L234: how do Markov chains come into play here? Is this related to eq. (2)?\n4. L238: what does \"information is not a sufficient criteria to enable access to that information\" mean? \n5. L276: what expected structure \"is not obvious\" here? Is it obvious in the right panel? I don't understand what I'm supposed to be seeing here.\n6. L278: (related to my main questions about disentanglement above,) why is it desirable that \"the class information has been entirely remove\" here?\n7. L317: what's \"minimal weighting\" mean here? Is this some hyperparameter selection method?\n8. L347: what's the \"clear pattern across the space\" here? I'm not sure I see it.\n\nTypos:\n- L029: the YM reference here is formatted incorrectly (also in the bibliography), mixing up last name and fist/middle initials.\n- L080: missing space \"models(Fuest\"\n- L087: \"to to\"\n- L138 and beyond: math formatting could be improved, e.g.,\n    - $D_{\\mathrm{KL}}$\n    - $\\mathcal{L}_{\\mathrm{CFM}}$\n    - $p_{\\mathrm{cfg}}$\n    - ${u_t}^{\\mathrm{CFG}}$\n- L174: \"trained used\"\n- L207: VAEs -> VAE's\n- L305: \"features.Figure\"\n- L313: \"a random RGB values\"\n- L238: \"a sufficient criteria\" (\"criteria\" is plural; the singular is \"criterion\")\n- L444: \"Uunbarred\"\n- L466: \"we propose to be used to\"\n- L467: \"surveys(e.g.\"\n- L478: \"representations of the data that emerge secondary features\"\n- L485: \"in assisting researchers explore what information\""}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "rp09C3kTV3", "forum": "F2USOqa0La", "replyto": "F2USOqa0La", "signatures": ["ICLR.cc/2026/Conference/Submission18374/Reviewer_M6hy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18374/Reviewer_M6hy"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18374/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761993713473, "cdate": 1761993713473, "tmdate": 1762928082068, "mdate": 1762928082068, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this paper, the author proposes applying flow matching to disentangle the latent space. The main method is designed for variational autoencoders (VAEs), whose latent space approximates a normal distribution, allowing the use of Gaussian conditional optimal transport probability paths for interpolation."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea of combining flow matching with variational autoencoders (VAEs) is interesting and has potential to inspire further exploration in disentangled representation learning.\n\n2. The paper is well-structured."}, "weaknesses": {"value": "1.  Since the method is built on top of VAEs and relies on the approximately Gaussian distribution of their latent space, its use is restricted to this specific class of generative models.\n\n2. The paper lacks sufficient supporting evidence. In the experimental section, the author evaluates the method on synthetic 2D Gaussian data, CMNIST, and a real-world dataset. All three datasets are relatively simple, and other existing disentanglement methods are known to perform well on them—particularly on 2D Gaussian and MNIST, which are common benchmarks. More importantly, the paper does not include comparisons between the proposed approach and other established disentanglement methods, which makes it difficult to assess the effectiveness and advantages of the method.\n\n3. If the key claim of the paper lies in achieving meaningful disentanglement, there appears to be no theoretical guarantee or clear intuition explaining why such disentanglement can be discovered using the proposed approach."}, "questions": {"value": "1. What is the most significant difference between the proposed method and other state-of-the-art disentanglement approaches that makes it stand out? Is there any theoretical justification or empirical evidence supporting this distinction?\n\n2. Can this method be extended or adapted to other types of generative models beyond VAEs?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "vCpXlwA3nz", "forum": "F2USOqa0La", "replyto": "F2USOqa0La", "signatures": ["ICLR.cc/2026/Conference/Submission18374/Reviewer_E5oq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18374/Reviewer_E5oq"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18374/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762059670529, "cdate": 1762059670529, "tmdate": 1762928081716, "mdate": 1762928081716, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}