{"id": "F7iGQGPy5p", "number": 22866, "cdate": 1758336509958, "mdate": 1759896841987, "content": {"title": "Spectral Retrieval-Augmented Time-Series Forecasting", "abstract": "Time series forecasting leverages historical patterns to predict future values, but traditional methods face challenges when dealing with complex, non-stationary patterns that are difficult to memorize during training. Retrieval-augmented approaches have emerged as promising solutions by retrieving similar historical patterns to enhance predictions. However, existing retrieval methods suffer from two fundamental limitations: spectral blindness, which overlooks critical frequency-domain characteristics that capture underlying periodic structures, and temporal recency, which treats all historical data equally without emphasizing recent, more relevant patterns. In this paper, we propose SpecReTF, a novel retrieval method that addresses these issues by converting time series into windowed frequency representations, measuring similarity with a combined metric that captures both amplitude and phase information. To balance recency and historical context, we apply an exponential moving average weighting scheme that emphasizes recent windows. Extensive experiments on benchmark datasets demonstrate that SpecReTF outperforms time-domain retrieval methods, achieving superior forecasting accuracy across diverse, non-stationary time series.", "tldr": "", "keywords": ["time-series forecasting", "multimodality", "frequency domain"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1a840e1099404004308c8d2728ccd4e8ccc43101.pdf", "supplementary_material": "/attachment/db5569802992ea06c86a47070768affaece75ed2.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a novel frequency-domain-based similarity method, SpecReTF, for Retrieval-Augmented time series forecasting. The work aims to address two identified limitations in existing approaches: \"spectral blindness\" and \"temporal recency\". The motivation is intuitive, and the experimental setup is relatively comprehensive."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper is clearly structured, making the proposed methodology easy to follow.\n- The identification of \"spectral blindness\" and \"temporal recency\" provides an easily understandable motivation for the work.\n- The results demonstrate the effectiveness of the proposed method against the chosen baselines."}, "weaknesses": {"value": "1. The two primary solutions, while effective, appear somewhat heuristic and lack elegance or a learned approach. Specifically:\n- In Equation (7), the amplitude and phase similarities are combined through a simple, unweighted summation. This approach may be suboptimal, especially given that these two similarity measures are on different scales and capture distinct aspects of the signal. The work would significantly benefit from exploring automated methods for adaptively tuning or weighting the contribution of amplitude versus phase similarity.\n- Similarly, the Recency-Weighted Aggregation employs a relatively rigid weighting scheme. Investigating more data-driven weighting mechanisms could be a valuable direction for future work.\n2. The paper would be strengthened by a more profound discussion contrasting frequency-domain matching with established time-domain methods. Key questions remain unexplored:\n3. What is the unique advantage and necessity of frequency-domain features compared to time-domain shape features (e.g., DTW) or deep learning-based embeddings? Under what scenarios would frequency-domain matching be uniquely superior?\n4. What would be the effect of a hybrid approach that combines both time-domain and frequency-domain information?"}, "questions": {"value": "See Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "HuUfgKqdVI", "forum": "F7iGQGPy5p", "replyto": "F7iGQGPy5p", "signatures": ["ICLR.cc/2026/Conference/Submission22866/Reviewer_UYLi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22866/Reviewer_UYLi"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22866/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761530750261, "cdate": 1761530750261, "tmdate": 1762942418811, "mdate": 1762942418811, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes the SpecReTF method to address the shortcomings of existing RAG methods in time series prediction, which neglect key frequency domain features of potential periodic structures and fail to emphasize capturing recent, more relevant patterns in time. The pipeline (i) converts times series into windowed frequency representations using Short-time Transform(STFT), (ii) uses a combined metric that incorporates amplitude and phase information to measure similarity, (iii) apply an exponential moving average weighting scheme that emphasizes recent windows. Extensive experiments on benchmark datasets demonstrate that SpecReTF outperforms time-domain retrieval methods, achieving superior forecasting accuracy across diverse, non-stationary time series."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "（i）This work focuses on the practical and important issue of the ignoring the distribution of energy across frequency bands leads to the misidentification of periodic patterns and temporal relevance.\n\n（ii）This paper proposes a novel retrieval-augmented time series forecasrting method that performs similarity matching in frequency domain, which integrates similarity score for each frame is calculated by combining Jensen-Shannon divergence (to measure amplitude distribution) and cosine similarity (to measure phase alignment). An exponential moving average is then used to weight the frame-level similarity scores, thereby enhancing the influence of the most recent window while gradually reducing the weight of older windows.\n\n(iii) SpecReTF is a novel retrieval-augmented forecasting architecture that combines frequency-domain analysis with recency-weighted pattern retrieval to address non-stationarity."}, "weaknesses": {"value": "(i) It lacks hyperparameters (step size, embedding dimension, etc.) for automatic selection or robustness analysis of the Short Time Fourier Transform (STFT).\n\n(ii) Calculated a composite similarity score for each frame using only Jensen-Shannon divergence (to measure amplitude distribution) and cosine similarity (to measure phase alignment), without comparing it with other methods to explain its advantages.\n\n(iii) The computational complexity and actual inference overhead are not detailed, but frequency domain retrieval/STFT will significantly increase the cost.\n\n(iv) Although frequency domain similarity is emphasized, no real-world examples are shown to illustrate that the retrieved segments are indeed more reasonable.\n\n(v) The lack of comparative experiments with other time series prediction methods that also employ retrieval-augmented demonstrates the effectiveness of the proposed method."}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "hpNb2YWipI", "forum": "F7iGQGPy5p", "replyto": "F7iGQGPy5p", "signatures": ["ICLR.cc/2026/Conference/Submission22866/Reviewer_jmvm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22866/Reviewer_jmvm"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22866/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761804558171, "cdate": 1761804558171, "tmdate": 1762942418605, "mdate": 1762942418605, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a retrieval-based time-series forecasting framework that incorporates both a spectral perspective and temporal recency into the retrieval process."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Although the work may appear somewhat incremental - mainly replacing the similarity measurement in conventional retrieval-based time-series forecasting methods with one based on the frequency domain - the authors effectively establish the motivation through Figure 1 in the introduction. The intuition behind adopting the spectral view is clearly conveyed."}, "weaknesses": {"value": "1. In Figure 3, the model’s performance appears insensitive to the decay factor $\\alpha$. This raises doubts about whether temporal recency, one of the paper’s main claimed contributions, is truly impactful. Moreover, it remains unclear how practitioners should determine an appropriate value of $\\alpha$ in real-world settings.\n\n1. In the experiments, the “No Retrieval” configuration (a simple linear predictor) in Table 2 outperforms most baselines in Table 1. This makes me question whether the experiments were conducted under a fair and consistent setting."}, "questions": {"value": "1. Justify the necessity of temporal recency.\n\n2. Verify the experimental setting and guarantee the fair comparison."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Z49QsQBJuc", "forum": "F7iGQGPy5p", "replyto": "F7iGQGPy5p", "signatures": ["ICLR.cc/2026/Conference/Submission22866/Reviewer_9JN7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22866/Reviewer_9JN7"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22866/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761945060072, "cdate": 1761945060072, "tmdate": 1762942418321, "mdate": 1762942418321, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces SpecReTF, a spectral retrieval-augmented time series forecasting method that overcomes key limitations in existing approaches by decomposing time series into frequency-domain components, measuring similarity using a combined amplitude and phase metric, and incorporating temporal recency weighting. The proposed method demonstrates superior forecasting accuracy across multiple benchmark datasets, establishing new state-of-the-art performance."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThe paper effectively identifies and analyzes \"spectral blindness\" as a key limitation in existing time-domain retrieval methods, providing compelling evidence through both theoretical discussion supported by visual examples.\n2.\tThe combination of amplitude spectrum analysis (Jensen-Shannon divergence) and phase coherence measurement (cosine similarity) effectively addresses the identified spectral blindness problem.\n3.\tExtensive experiments across eight diverse benchmark datasets demonstrate consistent improvements over state-of-the-art baselines, with the method achieving superior performance on most evaluation metrics."}, "weaknesses": {"value": "1.\tThe \"no retrieval\" results in Table 2 (which uses only two linear layers) are significantly better than the DLinear results in Table 1 on several datasets. This is contradictory because DLinear, a purpose-built linear model, should perform at least as well as this simple baseline. This inconsistency raises concerns about whether all baselines in Table 1 were evaluated under the same experimental settings as SpecReTF. Please clarify this discrepancy to ensure the fairness and validity of the comparisons.\n\n2.\tThe paper claims three contributions, but they are largely overlapping and describe a single core innovation: the frequency-aware similarity metric. The architectural framework and the recency-weighting scheme, while useful, appear to be supporting components rather than distinct conceptual advances. This conflation could be seen as overstate the breadth of methodological contribution. The work's primary novelty resides in the new similarity measure, and the contributions should be reframed to more accurately reflect this.\n\n3.\tThe hyperparameter study in Appendix D reveals that the model's performance is sensitive to the number of retrieved segments (K) and the STFT window size, and that the optimal values for these parameters vary across different datasets.  This observed sensitivity appears to be at odds with the paper's claim of the method's robustness."}, "questions": {"value": "1.\tWhy does the simple \"no retrieval\" linear model in Table 2 outperform the purpose-built DLinear in Table 1? Does this indicate inconsistent experimental settings for the baseline models? \n\n2.\tThe three contributions essentially revolve around the frequency-domain similarity measure. Could the main contribution be reframed to focus on this core innovation?\n\n3.\tGiven the sensitivity to K and STFT window size shown in Appendix D, how does this align with the paper's claim of robustness? Furthermore, how should these hyperparameters be determined in practice for new datasets?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "RyxO6sT8fS", "forum": "F7iGQGPy5p", "replyto": "F7iGQGPy5p", "signatures": ["ICLR.cc/2026/Conference/Submission22866/Reviewer_jqrN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22866/Reviewer_jqrN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22866/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761985744289, "cdate": 1761985744289, "tmdate": 1762942418115, "mdate": 1762942418115, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}