{"id": "Fhp2uUGpgd", "number": 3800, "cdate": 1757527905479, "mdate": 1759898069181, "content": {"title": "A Semi-Decentralized and Parallel Bidirectional Deep Learning (SDP-BiDL) Framework for Binary Classification of Diabetic Retinopathy", "abstract": "Diabetic Retinopathy (DR) remains a critical healthcare challenge, where timely and accurate assessment is essential to prevent vision loss and associated cardiovascular complications. Existing machine learning models often suffer from limited robustness, interpretability, and scalability in clinical environments. To address these issues, we introduce a semi-decentralized and parallel Bidirectional Deep Learning (SDP-BiDL) framework for joint DR classification and cardiovascular disease risk prediction. Our approach leverages a dataset of 1,151 patients with clinically validated DR, incorporating nineteen covariates derived from retinal images, including lesion features, anatomical descriptors, and global image statistics. To enhance predictive reliability, we employ statistical feature selection and address class imbalance using oversampling techniques. The proposed SDP-BiDL architecture integrates parallel bidirectional modules—based on BiGRU / BiLSTM / BiRNN—trained on complementary feature subsets, enabling independent temporal modeling and effective fusion of representations for final prediction. In extensive experiments, the proposed SDP-BiLSTM, SDP-BiGRU, and SDP-BiRNN variant achieves 98.94\\%, 98.72\\%, and 97.34\\%, respectively accuracy with an area under the curve of 0.99, 0.98, 0.97, respectively, surpassing both traditional machine learning and conventional deep neural architectures. Moreover, the framework supports real-time inference, producing predictions in under one second, which is crucial for clinical applicability. These results demonstrate that SDP-BiDL offers a scalable and interpretable solution for multimodal healthcare analytics, effectively combining imaging phenotypes, biomarkers, and medication records, and holds strong promise for deployment in real-world clinical decision support systems.", "tldr": "We propose a semi-decentralized bidirectional deep learning framework (SDP-BiDL) that integrates multimodal patient data to achieve state-of-the-art accuracy and real-time inference for diabetic retinopathy prediction.", "keywords": ["Diabetic Retinopathy", "Deep Learning", "Semi-Decentralized Framework", "Bidirectional Neural Networks", "Multimodal Healthcare Analytics", "Class Imbalance Handling", "PCA Feature Extraction", "SMOTE Oversampling"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e5d266b238652212f2dfc1dd074a1ef72a5ea6f9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This manuscript introduces LEGA-FL, a Label-Embedded Graph Attention framework designed for federated multi-label classification. The framework addresses the challenges of data heterogeneity in graph structures and label correlation divergences across decentralized clients by integrating masked label correlation graphs, multi-scale graph auto-encoders, and an adversarial-fairness aggregation algorithm. The proposed method demonstrates improved performance on multiple benchmarks, showcasing its capability to enhance privacy-preserving federated multi-label graph learning."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The semi-decentralized architecture enhances scalability and modularity, enabling efficient parallel training and fusion of multimodal data. The framework supports real-time inference with sub-second prediction times, making it suitable for clinical decision support systems."}, "weaknesses": {"value": "1. The method section in the paper describes the three modalities (clinical/derived features/original retinal images) and the CNN/ResNet branch, but the dataset introduction and feature list only contain 19 tabular features (Messidor derived), and do not explicitly provide the original images. Details of image branches (input size, preprocessing, CNN structure, parameter quantity, whether transfer learning is used or not) did not appear in the result table or process either.\n2. If PCA, StandardScaler and SMOTE are first fitted/synthesized on the entire data and then K=10 segmentation is performed, it will introduce serious data leakage. It is necessary to ensure that within each fold, only the training fold is used to fit Scaler/PCA and generate SMOTE samples, and then the validation fold is used for evaluation.\n3. The currently reported high scores (Acc≈99%, AUC≈0.99) are abnormally high in the small sample (1,151 cases) and tabular feature tasks, and are highly likely to be affected by the overfitting/resampling information leakage introduced by SMOTE-5X. A strict \"leak-free\" pipeline and results must be provided, including the scores from SMOTE tests conducted only within the training set and with the original imbalanced validation set.\n4. The current input is static features (non-sequential), and the motivation for time series modeling using BiRNN/BiLSTM/BiGRU is insufficient. It is necessary to explain why bidirectional cycling can bring gain and compare it with non-sequential strong baselines (MLP, residual MLP, Transformer-MLP).\n5. It is recommended to provide code or pseudo-code, a data partitioning list (fold index), and environment configuration to ensure independent reproduction."}, "questions": {"value": "See the Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "alEn437JEx", "forum": "Fhp2uUGpgd", "replyto": "Fhp2uUGpgd", "signatures": ["ICLR.cc/2026/Conference/Submission3800/Reviewer_8Emi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3800/Reviewer_8Emi"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3800/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761481400344, "cdate": 1761481400344, "tmdate": 1762917040640, "mdate": 1762917040640, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes an SDP-BiDL framework for the binary classification of DR and associated cardiovascular disease risk. The framework is applied to a relatively small dataset of 1,151 patient records derived from the Messidor image set, using 19 pre-extracted covariates. The core component lies in the semi-decentralized fusion of multimodal features, where parallel bidirectional recurrent modules (Bi-GRU, Bi-LSTM, Bi-RNN) are trained on complementary feature subsets and their representations are fused using a gating mechanism before final prediction. In 10-fold cross-validation experiments, the SDP-BiDL models demonstrate superior performance, significantly outperforming traditional machine learning and conventional deep learning baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. The paper clearly outlines the methodology, including feature selection, data pre-processing (PCA, SMOTE), and the overall system pipeline.\n2. The SDP-BiDL models consistently and substantially outperform a comprehensive set of baselines (RF, SVM, LSTM, GRU)."}, "weaknesses": {"value": "1. The novelty of the work appears limited. A substantial portion of the paper is devoted to describing well-established techniques such as PCA and SMOTE, offering little evidence of any genuine methodological contribution.\n2. The entire study relies on a very small dataset comprising only 1,151 patient records. Attaining near-perfect performance (98.94% accuracy, 0.99 AUC) on such a limited dataset—particularly with an aggressive fivefold oversampling strategy (SMOTE-5X)—raises serious concerns regarding potential overfitting to synthetic samples and limited generalizability to unseen data.\n3. The manuscript claims to integrate “raw imaging data” processed by a “CNN/ResNet.” However, the reported results appear to be derived solely from 19 tabular covariates rather than genuine image-based features."}, "questions": {"value": "Please clarify the statement on page 3, lines 152–153:\n“Data is split using 10-fold cross-validation (K10 CV) (Kohavi et al., 1995), with nine partitions for training (80%) and one for evaluation (20%) per fold.” Specifically, explain how the use of 10-fold cross-validation relates to the described 80%/20% data split."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BHnmjllxHV", "forum": "Fhp2uUGpgd", "replyto": "Fhp2uUGpgd", "signatures": ["ICLR.cc/2026/Conference/Submission3800/Reviewer_szF6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3800/Reviewer_szF6"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3800/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761733784664, "cdate": 1761733784664, "tmdate": 1762917040184, "mdate": 1762917040184, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a semi-decentralized and parallel Bidirectional Deep Learning (SDP-BiDL) framework within a platform called VeerAI 1.0DL to jointly predict diabetic retinopathy and cardiovascular disease."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "DR and CVD prediction is an important clinical problem to address."}, "weaknesses": {"value": "I think the writing could be greatly improved to make the paper easier to read. \nThe paper claims CVD risk prediction capabilities but I did not see any empirical evidence for this in the paper. As far as I could understand the paper only evaluated their models on a test folds of a single dataset (Diabetic Retinopathy Debrecen dataset from UCI Machine Learning Repository)\n\nI do not think that an empirical paper based solely on results of the Diabetic Retinopathy Debrecen dataset is of sufficient interest for ICLR. \n\nThe paper says “The study cohort consists of 1,151 participants”, I do not believe this is correct. My understanding is that the 1151 refers to the number of fundus images from which the Diabetic Retinopathy Debrecen extracts its derived variables. The number of examinations and participants will be fewer. This should be clarified. \nIt was not clear to me why image quality, pre-screening, and amplitude/modulation frequency were denoted as “clinical/ demographic” parameters as my understanding from the original Antal and Hajdu paper is that these are just derived from the images (and so are just “imaging-derived parameters”). Was it important to performance to group the variables in this way? If so an ablation showing the difference between having separate embeddings for “clinical” and “image-derived” parameters and having them grouped together in the same embedding should be shown. \n\n\nIt was not clear the purpose of the abbreviations in lines 435-439 (within the table 5 caption). Some of the acronyms are only used once in the rest of the paper, often next to the full phrase, and some acronyms don’t appear in the rest of the paper at all. \n\nThe paper says “Data is split using 10-fold cross-validation (K10 CV) (Kohavietal.,1995), with nine partitions for training (80%) and one for evaluation (20%) per fold”. The percentages should be 90% and 10% respectively (unless 9 partitions were not used for training)."}, "questions": {"value": "I found figure 1 confusing and did not fully understand it. As an example, the top shows PCA pooling at the “Preprocessing, Optimization & Imbalance Data Handling” stage prior to data partition. However further down there is a box in the flow diagram saying “19 training features”. Does 19 refer to the 19 original features in the Diabetic Retinopathy Debrecen dataset. If so, was there actually no dimensionality reduction as claimed on line 196? If the PCA does happen before data splitting are the results subject to potential data leakage? Where did the imaging data (shown to be processed by a CNN /ResNet in figure 2) enter in figure 1? Should there be an arrow from the training data to the GT labels node in the flow diagram?\n\nIt was not clear for the paper what all baseline methods received as input. Was it the same processed F_c, F_d, and F_i (mentioned on line 258) features, or was it just the 19 training features?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "uAUEmaVxS5", "forum": "Fhp2uUGpgd", "replyto": "Fhp2uUGpgd", "signatures": ["ICLR.cc/2026/Conference/Submission3800/Reviewer_zone"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3800/Reviewer_zone"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3800/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761826415845, "cdate": 1761826415845, "tmdate": 1762917039271, "mdate": 1762917039271, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a Semi-Decentralized and Parallel Bidirectional Deep Learning (SDP-BiDL) framework for joint diabetic-retinopathy (DR) classification and cardiovascular-disease (CVD) risk prediction. Using 1,151 clinically verified patient records with nineteen retinal covariates, the model integrates multimodal data (imaging, biomarkers, medication records) and parallel BiGRU / BiLSTM / BiRNN modules trained on complementary feature subsets. The approach achieves very high accuracy (≈ 99%) and real-time inference (< 1 s), suggesting strong potential for clinical deployment and scalable multimodal analytics."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Clear motivation linking DR and CVD through shared pathophysiology and clinical relevance.\n\nWell-engineered semi-decentralized design enabling modular parallel training and improved scalability.\n\nComprehensive experiments comparing multiple BiDL variants against both ML and DL baselines.\n\nHigh predictive performance and demonstration of real-time feasibility, which adds translational value for clinical decision support."}, "weaknesses": {"value": "This paper appears to be more suitable for a clinical or applied AI journal rather than a venue like ICLR, which emphasizes methodological novelty and theoretical advancement. The work leverages multimodal integration and a semi-decentralized bidirectional deep learning framework for disease prediction, but the contribution focuses primarily on application effectiveness rather than algorithmic innovation. The claimed key novelty—semi-decentralized training of bidirectional models, where input sequences are distributed across multiple parallel modules and later fused for joint prediction—should be justified more rigorously. Specifically, the authors are encouraged to quantitatively report the training efficiency gains of this design and clarify why such semi-decentralized bidirectional training is particularly effective for modeling complex temporal dependencies in multimodal data. Additionally, several employed techniques (e.g., SMOTE for class balancing) are well-established and do not contribute to methodological originality."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "8PTvl3GEeE", "forum": "Fhp2uUGpgd", "replyto": "Fhp2uUGpgd", "signatures": ["ICLR.cc/2026/Conference/Submission3800/Reviewer_QBJq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3800/Reviewer_QBJq"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3800/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761988306499, "cdate": 1761988306499, "tmdate": 1762917038773, "mdate": 1762917038773, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}