{"id": "FkTEc3XEL6", "number": 20409, "cdate": 1758305690571, "mdate": 1763101890116, "content": {"title": "MOCHA: Multi-sample Omics Cohorts with Human Annotation", "abstract": "In spatially resolved transcriptomics (SRT) research, gene expression profiling with spatial context has enabled spatial domain identification within single tissue samples. Extending these analyses to multiple biological samples presents additional challenges, including cross-sample variability and batch effects. Method development has been limited by the lack of datasets that combine multi-subject cohorts with expert-derived annotations. We present MOCHA ($\\underline{M}$ulti-sample $\\underline{O}$mics $\\underline{C}$ohorts with $\\underline{H}$uman $\\underline{A}$nnotation), a curated resource for developing and evaluating multi-sample SRT methods. MOCHA integrates molecular profiles, spatial profiles, and high-resolution Hematoxylin and Eosin (H\\&E) images across multiple subjects, with each sample paired with domain annotations from expert pathologists. For algorithm development and evaluation, MOCHA provides standardized data organization, efficient storage formats for large-scale processing, and protocols for handling batch effects in multi-sample integration.", "tldr": "MOCHA is a curated multi-sample spatially resolved transcriptomics resource with expert annotations for developing methods and suggesting strategies to address cross-sample variability and batch effects.", "keywords": ["Spatially resolved transcriptomics", "Database", "Multi-sample Annotations"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/5cd4acc871d6e792b2c6c265a3c47e920ca984c0.pdf", "supplementary_material": "/attachment/67642fae3393c28c674abeb8f9caa1bbe52846e4.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces MOCHA (Multi-sample Omics Cohorts with Human Annotation), a curated resource for benchmarking and developing multi-sample spatial transcriptomics (SRT) analysis methods. The dataset integrates molecular profiles, spatial coordinates, and co-registered H&E images across ten cohorts from multiple diseases and species, each annotated by expert pathologists. The authors describe data preprocessing, normalization, and batch correction pipelines, and summarize existing multi-sample clustering methods (BASS, BayeSMART, STAGATE). The work aims to provide a standardized foundation for evaluating spatial domain identification and integration methods across biological replicates."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "The paper addresses an important unmet need in the field: the lack of standardized, well-annotated multi-sample SRT benchmarks. The inclusion of multiple cancer and brain datasets with expert pathologist annotations enhances biological credibility. The organization of data into interoperable formats (Python/R) and detailed preprocessing protocols may facilitate reproducibility and adoption by the community. The authors also provide a clear overview of current computational approaches, positioning MOCHA as a potentially useful testing bed for new methods."}, "weaknesses": {"value": "Despite its relevance, the paper is primarily descriptive and lacks a clear technical or methodological contribution. It does not include quantitative benchmarking or demonstrate the practical impact of MOCHA on existing algorithms. The dataset aggregation appears to rely almost entirely on previously published public data, with limited novelty in curation methodology. The “expert annotation” process is insufficiently detailed — e.g., the number of annotators, inter-rater agreement, and labeling consistency are not reported. The writing also suffers from redundancy and lacks a cohesive narrative connecting the biological motivation with the computational pipeline. Overall, the manuscript feels more like documentation for a dataset release than a scientific study."}, "questions": {"value": "1. There is no demonstration that MOCHA improves method benchmarking, reproducibility, or model generalization compared to existing datasets.\n2. The process for expert-generated labels (criteria, consistency checks, number of annotators) should be clearly described.\n3. The heavy focus on breast and colorectal cancer reduces generalizability; inclusion of more non-cancer datasets would strengthen the resource.\n4. The preprocessing and batch correction pipelines largely follow standard protocols (Harmony, HVG, Seurat/Scanpy), offering little methodological novelty.\n5. The paper should include code examples or benchmark tasks to illustrate MOCHA’s practical integration into real-world pipelines.\n6. Figures are low-impact and primarily procedural; replacing some with visual summaries of data diversity or annotation quality would improve readability.\n7. There is no explicit discussion of licensing, data provenance, or privacy compliance for reused human data."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "toWA29jnot", "forum": "FkTEc3XEL6", "replyto": "FkTEc3XEL6", "signatures": ["ICLR.cc/2026/Conference/Submission20409/Reviewer_aMDZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20409/Reviewer_aMDZ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20409/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760477198208, "cdate": 1760477198208, "tmdate": 1762933852983, "mdate": 1762933852983, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We appreciate the reviewers’ evaluations. After reviewing the feedback, we have decided to withdraw the paper from the ICLR."}}, "id": "xBwCFETQ4D", "forum": "FkTEc3XEL6", "replyto": "FkTEc3XEL6", "signatures": ["ICLR.cc/2026/Conference/Submission20409/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20409/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763101889295, "cdate": 1763101889295, "tmdate": 1763101889295, "mdate": 1763101889295, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper wants to talk about MOCHA but seems unfinished."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "N/A"}, "weaknesses": {"value": "Unfinised paper."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "VtbJ75abJ9", "forum": "FkTEc3XEL6", "replyto": "FkTEc3XEL6", "signatures": ["ICLR.cc/2026/Conference/Submission20409/Reviewer_Xti7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20409/Reviewer_Xti7"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20409/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989694654, "cdate": 1761989694654, "tmdate": 1762933852406, "mdate": 1762933852406, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces MOCHA, a curated resource designed to accelerate the development and evaluation of multi-sample spatially resolved transcriptomics (SRT) methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper clearly identifies and addresses a significant bottleneck for progress in computational spatial biology. While many SRT analysis methods exist, robust benchmarking has been hampered by the lack of multi-sample datasets with expert-annotated ground truth. This paper provides a direct and practical solution to this problem.\n- The core contribution is the thoughtful curation and aggregation of these 10 diverse cohorts. The value is in establishing a strict selection criterion (requiring gene expression, spatial coordinates, H&E, and pathologist annotations) and assembling them into a single, cohesive resource spanning multiple cancer types, technologies, and species.\n- By including standardized pre-processing and batch correction protocols (e.g., outlining the use of HVGs and Harmony), the authors lower the barrier to entry for researchers and help ensure that future methods can be compared in a more standardized and reproducible manner."}, "weaknesses": {"value": "- The paper's primary contribution is the aggregation and standardization of 10 existing public datasets . It is not entirely clear what the novel \"deliverable\" is beyond a list of these datasets. The abstract mentions \"standardized data organization\" and \"efficient storage formats\", but this is not detailed. What specific standardization or re-formatting was applied that provides value beyond what a user could get from downloading each dataset from its original source? Overall this paper seems to be better suited for a conference with a separate dataset track.\n- The paper stops short of providing any baseline benchmark results with the curated datasets. How do the authors proposed to validate the resource's utility in this case?\n- The key value addition is the \"expert pathologist\" annotations. However, these annotations come from 10 different studies, presumably by 10 different experts with different goals. The paper mentions grouping them into \"immune, stroma, tumor, and normal\". How consistent are these labels, and what was the mapping process?"}, "questions": {"value": "- Is MOCHA a single downloadable package (e.g., on Zenodo) containing all 10 processed cohorts? Or is it a code repository (e.g., GitHub) with scripts to download and pre-process each dataset from its original source? The paper would benefit from a Data Availability type section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "bOVljQYSQu", "forum": "FkTEc3XEL6", "replyto": "FkTEc3XEL6", "signatures": ["ICLR.cc/2026/Conference/Submission20409/Reviewer_fkum"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20409/Reviewer_fkum"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20409/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762036810761, "cdate": 1762036810761, "tmdate": 1762933851762, "mdate": 1762933851762, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work presents MOCHA, a curated spatial transcriptomics (ST) dataset resource for the research community. MOCHA is a curated collection of ten 10x Visium datasets with batch correction. The authors plan to make this resource available."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "If made available, MOCHA would be a good resource for researchers in the biomedical / AI community to use for method development in ST."}, "weaknesses": {"value": "- Paper is not organized very well with a paper length of 4 pages. A section on spatial clustering is introduced but does not tie in with the rest of the paper, and it is hard to follow.\n- No comparison with SKT-142M or HEST-1k in terms of how their dataset is curated and organized differently.\n- No technical novelty or any research experiments produced in this paper."}, "questions": {"value": "No questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "h4cXxija0i", "forum": "FkTEc3XEL6", "replyto": "FkTEc3XEL6", "signatures": ["ICLR.cc/2026/Conference/Submission20409/Reviewer_HMKS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20409/Reviewer_HMKS"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20409/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762663107442, "cdate": 1762663107442, "tmdate": 1762933851414, "mdate": 1762933851414, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}