{"id": "FZGMgNV6EE", "number": 21479, "cdate": 1758318038308, "mdate": 1759896919641, "content": {"title": "Wavelet Diffusion Posterior Sampling with Frequency Domain Guidance", "abstract": "Inverse imaging problems often involve the reconstruction of high-fidelity signals from noisy and incomplete measurements. Recent advances in diffusion models have achieved strong results for these tasks, yet most approaches operate in the spatial domain and struggle to preserve high-frequency details under noise. We introduce Wavelet diffusion posterior sampling (WDPS), a frequency domain framework that integrates wavelet transforms with posterior sampling. By decomposing images into multiscale frequency subbands, WDPS performs posterior updates adaptively across low- and high-frequency components, enabling more stable sampling trajectories and improved detail recovery. To further enhance robustness, we propose a wavelet-regularized diffusion strategy that dynamically adjusts the influence of frequency-domain constraints during sampling. We demonstrate our approach on both linear and nonlinear inverse problems. We also extend our task to the lensless camera task to show the applicability of our approach. Our results highlight the effectiveness of frequency-domain posterior diffusion as a general and efficient solution to noisy inverse problems.", "tldr": "", "keywords": ["Machine Learning", "Diffusion Model", "Inverse Problem", "Lensless Camera"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/12e91d2038dfa72bfe37dec334e59db2ff2d0eae.pdf", "supplementary_material": "/attachment/5105dda7b904e8f60d665bd96321644befafa6d4.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes Wavelet Diffusion Posterior Sampling (WDPS), which integrates wavelet transforms into diffusion posterior sampling to perform frequency-aware updates for inverse imaging tasks. While the idea of frequency-guided sampling is conceptually reasonable, the novelty over existing diffusion-based inverse problem solvers is limited, and the technical contribution is incremental. The paper also suffers from serious formatting issues, incomplete quantitative evaluations, and weak baseline comparisons. Overall, despite some interesting intuition, the work is not sufficiently strong or polished for acceptance at a top-tier venue."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The paper introduces a moderately novel idea of incorporating wavelet-based frequency guidance into diffusion posterior sampling, offering a limited but interesting extension of existing diffusion inverse problem frameworks."}, "weaknesses": {"value": "1. **Formatting Issues:**\n   The manuscript suffers from several serious formatting problems. For instance, some tables are stored as images and then placed alongside other figures using the *subfigure* (or similar) command, without providing an overall caption. As a result, the document lacks clear and consistent figure/table captions. This leads to confusion—for example, in the *Ablation Study* section, the first sentence states “We conduct an ablation study on the proposed dynamic wavelet regularization schedule. Results are provided in Tables 2b,” yet there is actually no Table 2b. In addition, captions appear inconsistently—sometimes above, sometimes below, and sometimes missing altogether.\n\n2. **Baseline Comparison Issues:**\n   The selection of baseline algorithms is problematic. On one hand, the paper does not compare with the latest state-of-the-art diffusion-based inverse problem solvers such as **SITCOM** or **DAPS** [1,2], whose performance is significantly superior to the reported methods. On the other hand, including algorithms like *Score-SDE*, which is a pure diffusion model rather than an inverse-problem solver, is confusing and makes the comparison less meaningful.\n\n3. **Quantitative Metric Issues:**\n   The quantitative evaluation lacks key metrics. The main body of the paper does not report **PSNR** or **SSIM**, which are standard in diffusion-based inverse problem literature. These metrics appear only in the appendix and only for the DPS baseline, which makes the comparison incomplete and less convincing.\n\n[1] Alkhouri, Ismail, et al. *“SITCOM: Step-wise Triple-Consistent Diffusion Sampling for Inverse Problems.”* Proceedings of the **42nd International Conference on Machine Learning (ICML)**.\n\n[2] Zhang, Bingliang, et al. *“Improving Diffusion Inverse Problem Solving with Decoupled Noise Annealing.”* Proceedings of the **IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)**, 2025."}, "questions": {"value": "1. **Formatting issues** – Can the authors provide a corrected version where all tables and figures have proper captions and numbering (e.g., fixing the missing “Table 2b” in the Ablation Study)?\n\n2. **Baseline selection** – Why were recent SOTA diffusion-based inverse solvers not included? Please justify the inclusion of Score-SDE, which is not an inverse solver.\n\n3. **Quantitative metrics** – Could the authors report standard metrics (PSNR, SSIM) for all methods, and compare them with SOTA diffusion-based inverse solvers to ensure fair evaluation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "C8Hpsx2WfJ", "forum": "FZGMgNV6EE", "replyto": "FZGMgNV6EE", "signatures": ["ICLR.cc/2026/Conference/Submission21479/Reviewer_CTH8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21479/Reviewer_CTH8"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission21479/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761474882783, "cdate": 1761474882783, "tmdate": 1762941799508, "mdate": 1762941799508, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles inverse problems of the form $Y=A(X)+\\epsilon$ using diffusion models. Building on Diffusion Posterior Sampling (DPS), which enforces measurement consistency via a gradient update $\\nabla_{X_t}\\|Y-A(\\hat{X}_0)\\|^2_2$ during sampling, the authors propose performing the posterior update in the frequency (wavelet) domain instead of the spatial domain.\n\nSpecifically, each intermediate sample $X_i$ is decomposed into its wavelet representation $W_i$ using the discrete wavelet transform (DWT), and the posterior update is computed on $W_i$. After the update, the inverse DWT is applied to obtain the updated spatial representation.\nTo achieve coarse-to-fine restoration, the authors introduce a wavelet-strength scheduling function $r(i;a,b)$ that preserves the low-frequency subband while gradually amplifying the high-frequency components, scaling $W^{LH, HL, HH}_i$ as $r(i;a,b)\\cdot W^{LH, HL, HH}_i$. By integrating this wavelet posterior update and wavelet-strength scheduling, the proposed method demonstrates improved performance over DPS across both linear and non-linear degradation scenarios."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Novelty\n\nThe application of posterior updates in the wavelet domain is novel and provides fresh insight into how frequency-domain representations can be leveraged for diffusion-based inverse problem solving. This idea can inspire further research in frequency-aware diffusion methods.\n\n2. Technical soundness\n\nThe proposed strategy of controlling individual wavelet subbands to achieve coarse-to-fine restoration is conceptually sound and empirically effective, enabling better separation of global and local structures during reconstruction.\n\n3. Experimental validation\n\nThe paper demonstrates consistent improvements across diverse degradation types, including both linear and non-linear cases, as well as challenging lensless camera setups, showing the robustness and generality of the proposed approach."}, "weaknesses": {"value": "1. Posterior update in the wavelet domain itself is not effective.\n\nThe main claim of the paper is that performing the posterior update in the wavelet domain is more effective than doing so in the spatial domain. However, the experimental results (Table on page 9) show that the posterior update in the wavelet domain without wavelet-strength scheduling performs worse than the spatial-domain update. This indicates that the proposed “wavelet-strength scheduling” is the actual key component.\n\nI think applying wavelet-strength scheduling after using original \"spatial-domain\" posterior update might be a more effective design according to the presented results.\n\n2. Limited comparative methods.\n\nThe paper primarily compares the proposed approach with DPS, which was introduced in 2023.\nAs DPS is now considered a baseline, more recent zero-shot inverse problem solvers such as DAPS [1] or ReSample [2] should be included for a fair evaluation of current performance.\n\n3. Evaluation limited to low resolution.\n\nAll experiments are conducted only at 256x256 resolution.\nSince frequency-based posterior updates are potentially sensitive to image resolution, additional experiments at higher resolutions (e.g., 512x512) are needed to demonstrate robustness and scalability.\n\n4. Potential diffusion off-manifold issue.\n\nThe proposed scaling of high-frequency wavelet subbands $W_{i}$ with a factor less than 1 will reduce the noise level of the current sample $X_{i}$.\nThis operation may make the noise variance is inconsistent with the expected variance at the corresponding diffusion timestep, potentially causing the sample to deviate from the learned diffusion manifold.\nSuch deviation could lead to error accumulation or unstable sampling behavior.\nA clearer theoretical justification or empirical evidence is needed to demonstrate why this scaling does not compromise the diffusion process’s stability.\n\nReference\n\n[1] Improving Diffusion Inverse Problem Solving with Decoupled Noise Annealing (CVPR 2025)\n\n[2] Solving Inverse Problems with Latent Diffusion Models via Hard Data Consistency (ICLR 2024)"}, "questions": {"value": "1. Ablation on spatial-domain posterior update with wavelet-strength scheduling\n\nIt would be valuable to examine how performance changes when applying the proposed wavelet-strength scheduling after the original spatial-domain posterior update. This comparison would clarify whether the key improvement stems from operating in the wavelet domain or from the wavelet-strength scheduling itself.\n\n2. Inclusion of more recent comparative methods\n\nIncorporating recent zero-shot inverse problem solvers, such as DAPS or ReSample, would provide a fairer and more comprehensive evaluation of the proposed method’s effectiveness relative to the current state-of-the-art.\n\n3. Evaluation on higher-resolution images\n\nExtending experiments to higher resolutions (e.g., 512x512) would strengthen the paper by demonstrating the robustness and scalability of the frequency-based posterior update.\n\n4. Clarification on noise variance inconsistency\n\nAdditional explanation is needed regarding how scaling high-frequency wavelet subbands affects the noise variance at each diffusion step. Specifically, clarifying why this operation does not push the sample off the learned diffusion manifold would improve theoretical soundness and reader confidence."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "p485ctGLzL", "forum": "FZGMgNV6EE", "replyto": "FZGMgNV6EE", "signatures": ["ICLR.cc/2026/Conference/Submission21479/Reviewer_bbJY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21479/Reviewer_bbJY"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission21479/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761615821552, "cdate": 1761615821552, "tmdate": 1762941799123, "mdate": 1762941799123, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose Wavelet Diffusion Posterior Sampling (WDPS), which modifies DPS to operate in the wavelet domain rather than pixel space. This helps stabilize sampling, especially with particularly ill-posed or nonlinear forward models. Wavelet-based regularization helps stabilize sampling by starting with low-frequency structure and then refining high-frequency details when sampling is stabilized. The authors show qualitative and quantitative improvements across a variety of challenging inverse imaging tasks compared to DPS and popular baselines. They highlight lensless imaging as an application where their method shines."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "* The results are quite impressive, especially for lensless imaging.\n* The algorithm is a simple yet effective way to solve the problem of unstable sampling with DPS. The wavelet-based regularization is particularly effective.\n* Although the wavelet strength schedule introduces hyperparameters, the authors provide some amount of theoretical justification for it."}, "weaknesses": {"value": "* The chosen baselines are somewhat out-of-date. Consider adding a newer baseline like DAPS (Zhang et al. CVPR 2025).\n* The wavelet strength schedule introduces another hyperparameter in addition to the hyperparameters that are already tricky to calibrate for DPS. I noted in the strengths, though, that this is less of a problem since the authors provide some theoretical justification."}, "questions": {"value": "Please comment on the two weaknesses I mentioned."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "1PSua4yzZt", "forum": "FZGMgNV6EE", "replyto": "FZGMgNV6EE", "signatures": ["ICLR.cc/2026/Conference/Submission21479/Reviewer_DqWE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21479/Reviewer_DqWE"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission21479/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761777469443, "cdate": 1761777469443, "tmdate": 1762941798910, "mdate": 1762941798910, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper targets the issue of poor high-frequency reconstruction in training-free diffusion-based inverse imaging. Unlike standard Diffusion Posterior Sampling (DPS), which applies spatial-domain guidance uniformly across pixels, the authors propose Wavelet Diffusion Posterior Sampling (WDPS)—a multiscale, frequency-domain approach that performs posterior updates separately across wavelet subbands. By decomposing the intermediate latent into $(LL, LH, HL, HH)$ bands, WDPS applies distinct step sizes and dynamic weighting per frequency band. A wavelet-regularized diffusion scheme further stabilizes the process by gradually relaxing high-frequency constraints as denoising progresses.\n\nExperiments span inpainting, deblurring, and super-resolution on FFHQ and ImageNet, plus a simulated lensless imaging setup. WDPS consistently improves sharpness and quantitative scores (PSNR, SSIM, LPIPS, FID) compared to DPS and similar plug-and-play baselines. The improvement is most prominent in high-frequency detail restoration (e.g., textures, edges). However, the paper lacks any analysis on sample diversity or how the frequency decomposition affects the stochasticity and bias of the posterior sampling trajectory."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Addresses a key limitation of DPS—uniform spatial guidance—by enabling per-frequency adaptation.\n\nThe approach is simple, plug-and-play, and computationally light since DWT/IDWT operations are orthonormal transforms.\n\nExperiments demonstrate clear perceptual and quantitative gains, especially in high-frequency recovery under noise.\n\nThe intuition that guidance strength should differ per subband is sound and relevant for inverse problems with structured degradation."}, "weaknesses": {"value": "The method is tailored to DPS and doesn’t generalize to variational oroptimization-based samplers such as RED-Diff, MPGD, or TMPD.\n\nThe so-called “stability analysis” (Theorem 1) is a conventional Lipschitz argument for deterministic inverse problems and doesn’t address the stochastic reverse process or the approximation bias of Tweedie-based guidance.\n\nThe paper does not analyze or quantify diversity. Since different subbands use different step sizes and strength schedules, the diversity of generated reconstructions could be heavily impacted—potentially either improving variety (through relaxed high-frequency control) or collapsing modes (through over-regularization).\n\nMissing discussion of prior related works that also exploit multiscale or frequency decomposition in diffusion guidance (e.g., Sadat, Seyedmorteza, et al. \"Guidance in the Frequency Domain Enables High-Fidelity Sampling at Low CFG Scales.\" arXiv:2506.19713 (2025).)\n\nThe paper does not demonstrate whether frequency-domain separation alleviates the known likelihood approximation bias in DPS, i.e., whether it reduces the variance or error of $\\nabla_{x_t}\\log p(y|x_t)$ estimates."}, "questions": {"value": "Can the authors formally show that operating in wavelet space improves the conditioning or variance of the likelihood score approximation? This could explain the observed stability gains beyond heuristic intuition.\n\nHow does the dynamic wavelet strength schedule $r(i;a,b,C)$ affect convergence and sample diversity? Has its sensitivity been studied?\n\nDoes the per-band step size scheme effectively perform an anisotropic preconditioning of the posterior gradient? If so, can this be linked to improved bias-variance properties?\n\nThe method heavily relies on orthonormal wavelets (e.g., Haar). What happens with biorthogonal or learned transforms that break orthogonality?\n\nThe paper includes no metrics on sample diversity (e.g., variance, FID dispersion, or multi-sample PSNR spread). Since frequency-specific control can influence diversity significantly, such analysis is critical.\n\nThe theoretical section should clarify whether the stability result applies to the full stochastic diffusion chain or only to the deterministic gradient descent substep.\n\nFor completeness, the authors should discuss compatibility or contrast with RED-Diff (Mardani et al., 2023), MPGD (He et al., 2024), and TMPD (Boys et al., 2023)—all of which provide alternative corrections to the biased DPS surrogate and use momentum or covariance adjustments."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "niFT5C1WLX", "forum": "FZGMgNV6EE", "replyto": "FZGMgNV6EE", "signatures": ["ICLR.cc/2026/Conference/Submission21479/Reviewer_fJ3F"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21479/Reviewer_fJ3F"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission21479/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762133011533, "cdate": 1762133011533, "tmdate": 1762941798681, "mdate": 1762941798681, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}