{"id": "g0EbJrKFQJ", "number": 13126, "cdate": 1758213837437, "mdate": 1763737612014, "content": {"title": "BoGrape: Bayesian optimization over graphs with shortest-path encoded", "abstract": "Graph-structured data are central to many scientific and industrial applications where the goal is to optimize expensive black-box objectives defined over graph structures or node configurations---as seen in molecular design, supply chains, and sensor placement. Bayesian optimization offers a principled approach for such settings, but existing methods largely focus on functions defined over nodes of a fixed graph. Moreover, graph optimization is often approached heuristically, and it remains unclear how to systematically incorporate structural constraints into BO. To address these gaps, we build on shortest-path graph kernels to develop a principled framework for acquisition optimization over unseen graph structures and associated node attributes. Through a novel formulation based on mixed-integer programming, we enable global exploration of the combinatorial graph domain and explicit embedding of problem-specific constraints. We demonstrate that our method, BoGrape, is competitive both on general synthetic benchmarks and representative molecular design case studies with application-specific constraints.", "tldr": "We introduce Bayesian optimization for functions over general graph spaces by encoding shortest-paths in mixed-integer programming.", "keywords": ["Bayesian optimization", "graph optimization", "mixed-integer programming", "shortest-path"], "primary_area": "optimization", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/f095845ff84934002d66b67568b6a420f31dac2a.pdf", "supplementary_material": "/attachment/179b6c434f8d1009f6438283fa4badc226272874.zip"}, "replies": [{"content": {"summary": {"value": "- This paper proposes a Bayesian optimization (BO) framework for optimizing black-box functions whose inputs are graphs, which commonly arise in domains such as molecular design, supply chains, and sensor placement.\n- The authors study four variants of the shortest-path graph kernel (SP, SSP, ESP, and ESSP) and integrate them within a Gaussian process surrogate model.\n- The main methodological contribution is the formulation of the acquisition function optimization as a mixed-integer programming (MIP) problem, which enables global optimization using off-the-shelf MIP solvers.\n- The MIP has the acquisition function (in this paper, the authors consider the lower confidence bound, LCB) as its objective and includes constraints that ensure the predictive mean and variance from the GP model are consistent with the graph kernel, as well as additional constraints enforcing valid shortest-path relationships within the graph.\n- The authors theoretically prove that each feasible MIP solution corresponds bijectively to a valid connected graph in the search space.\n- The proposed framework, named BoGrape, is evaluated on both synthetic graph benchmarks and real-world molecular design tasks, demonstrating competitive or superior performance compared to baseline methods."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- This paper proposes a method to optimize an acquisition function in BO for a graph-input framework. This area of research is under-explored and has only a limited amount of literature.\n- The method proposed here, i.e., formulating the acquisition function optimization problem as a mixed-integer programming (MIP) problem, is novel in the BO literature for graph functions.\n- Formulating the acquisition function as an MIP also generalizes the capability of BO for graph functions, extending it from optimizing functions defined over graph nodes to functions defined over graph structures.\n- The authors also provide a fruitful discussion on how to generalize the framework to other scenarios, such as graph structures with varying but bounded sizes and other nonlinear acquisition functions."}, "weaknesses": {"value": "- The presentation of the paper needs improvement. Many typos and a wrong reference in the main part cause some confusion. For example, there is no Eq. (5) in the paper, and it seems that the authors were trying to refer to Eq. (MIP-SP).\n- The main limitation of this paper is the high computational cost of solving the mixed-integer programming (MIP) formulation, which may restrict scalability to large graph sizes or complex kernels. More discussion on this limitation is required. This includes considering larger problems and presenting the comparison in a more informative way, for example by showing the Pareto front between acquisition optimization runtime and BO performance.\n- There is a lack of explanation on the choices of parameters used in the competitor methods. For example, for methods that sample random graphs, why did the authors consider only 20 candidate graphs in each iteration? Since random sampling is cheap, it would be nice to see an ablation study with higher numbers.\n- It is unclear how feasibility constraints of valid molecules are encoded in the method; more explanation on this part is needed.\n- The authors considered several kernels but did not discuss the pros and cons of each of them. This discussion would help readers choose kernels that encode the properties relevant to their applications."}, "questions": {"value": "- In the introduction, it is stated that there are two scenarios of graph optimization problems: optimizing over nodes and optimizing over graph structure, and this paper considers only the second case. If the algorithm is not applicable to the first case, this point should be specifically mentioned in the abstract to avoid overclaiming the ability of the framework. If the framework can be generalized to the first scenario, a brief idea on how to do it should be discussed.\n- It is difficult to distinguish between node labels and node features. An explanation through an example would be helpful.\n- The notation $\\beta$ is used twice: in the objective of the MIP in Eq. (1a) and in the graph kernel weights in Eq. (3). I suggest changing the notation for clarity.\n- In the last two constraints of (MIP-SP), what indices are the summations over? $w$?\n- Should the $\\alpha$ and $\\beta$ in Eq. (3) be positive?\n- Line 290: superscript $I$.\n- Line 411: What is NAS? Network Architecture Search?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "mhdWPx2EzQ", "forum": "g0EbJrKFQJ", "replyto": "g0EbJrKFQJ", "signatures": ["ICLR.cc/2026/Conference/Submission13126/Reviewer_uSM7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13126/Reviewer_uSM7"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13126/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761370292797, "cdate": 1761370292797, "tmdate": 1762923849084, "mdate": 1762923849084, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Response to common comments"}, "comment": {"value": "Thanks to all Reviewers for providing insightful comments on BoGrape. Here we respond to the comments that multiple Reviewers mention. We provide responses to individual Reviewer comments separately. \n\n**[Scalability]**\n\nAs Reviewer Tm62 states, scalability is indeed a common challenge in combinatorial optimization settings such as the field of graph optimization. Therefore, the referenced scalability issue is more a known characteristic of the problem setting, rather than a BoGrape weakness. Nevertheless, we agree that practical performance is important. Appendix B.6 discusses several possible avenues to improve BoGrape scalability and Section 4 performs experiments up to graph sizes of 30. Note that, given its emphasis on sample efficiency, even standard (non-graph) BO is often ''practically limited to optimizing 10–20 parameters'' (Moriconi et al., 2020), and popular high-dimensional BO implementations employ approximations such as trust regions (TuRBO; Eriksson et al., 2019) or low-dimensional subspaces (SAASBO; Eriksson \\& Jankowiak, 2021). \n\nIn line with these observations, and in cases with relatively small graph sizes, BoGrape is computationally tractable and provides the solid theoretical guarantees accompanying global acquisition optimization. For larger problems where optimality is impractical, BoGrape can still return good feasible graph solutions by partially solving large-scale MIPs or by employing MIP heuristics. See in Figure 5 of our revised PDF version of the paper (caption beginning *Performance of varying the time limit ...*) that using BoGrape as a MIP heuristic is effective: we take the best feasible solution found by the solver in a short period of time and get good BO performance despite not having the time to prove global optimality of the optimization problem. Future work may consider approximation methods, such as the above, to extend the graph BO framework to ''high-dimensional'' BO.\n\nBoGrape fills in the gap where a principled BO framework over graph spaces from a discrete optimization viewpoint is missing. Highlights of BoGrape include  equivalently encoding the graph space consisting of all connected graphs and global optimizing the graph acquisition functions. Despite the scalability issues characteristic of this setting, BoGrape represents the first approach to tackle global optimization over black-box graph functions even in small and moderate graphs cases. As such, BoGrape provides a foundation for developing more scalable graph optimizers (see Appendix B.6 for possible options). \n\n**[Other baselines for molecular design experiments ]**\n\nBoGrape is a general graph BO approach and we use molecular design as a representative case study. Our experiments highlight the efficiency of BoGrape across both synthetic benchmarks and real-world applications. We include relevant baselines in our experiments and ablation studies in Appendix C.3 to justify excluding certain methods.  Appendix B.7 further documents our choice of molecular design as a real-life case study.\n\nThere are indeed many interesting approaches specifically for molecular design, but a full computational comparison is challenging since different approaches consider different, nuanced problem settings. Our work views molecular design as a heavily-constrained, expensive-to-evaluate, black-box graph optimization problem. In other words, we consider the two generalizable concerns of feasibility and optimality, but remain otherwise agnostic to the problem setting. Specialized methods such as string kernels for molecules do not consider the same general setting, but rather employ domain-specific encodings, and often use tailored procedures to learn the feasible space. While adapting domain-specific methods to our general setting may indeed be possible with engineering efforts, we want to maintain the focus of this paper as a theoretical- and methodology-based study of general graph optimization, rather than a particular application. An interesting future extension would indeed be a molecular-design-tailored variant of BoGrape and comparison to domain-specific methods.\n\n**[References]**\n\nEriksson, D., Pearce, M., Gardner, J., Turner, R. D., \\& Poloczek, M. Scalable global optimization via local Bayesian optimization. NeurIPS, 2019.\n\nEriksson, D., \\& Jankowiak, M. High-dimensional Bayesian optimization with sparse axis-aligned subspaces. UAI, 2021.\n\nMoriconi, R., Deisenroth, M. P., \\& Sesh Kumar, K. S. High-dimensional Bayesian optimization using low-dimensional feature spaces. Machine Learning, 2020."}}, "id": "NXX2SxR6Di", "forum": "g0EbJrKFQJ", "replyto": "g0EbJrKFQJ", "signatures": ["ICLR.cc/2026/Conference/Submission13126/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13126/Authors"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13126/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763736047015, "cdate": 1763736047015, "tmdate": 1763736047015, "mdate": 1763736047015, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents BoGrape, a new Bayesian optimization framework designed for black-box functions defined over graphs. The authors introduce four shortest-path-based graph kernels: SP, SSP, ESP, and ESSP; and then use them in BO with a global acquisition optimization scheme formulated as a mixed-integer optimization problem. Experiments are carried out on both synthetic and real-world scenarios, where the authors validate their proposed kernels and use them for BO on QM7 and QM9 datasets."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This paper is well-written with clear logic and is very easy to follow.\n\n- Unlike previous works on graph BO, which use evolutionary algorithms to explore the search space, this paper proposes a global optimization framework over the feasible graph space based on mixed Integer programming. This idea sounds very novel to me.\n\n- The proposed graph kernels based on shortest-path look solid to me.\n\n- I am happy to see that the authors compared the performance of their proposed kernels to previous graph kernels (but why are the results in the appendix?)\n\n- I am also glad to see that the authors use baselines based on graph BO rather than simply comparing to random sampling. \n\n- The authors also provide further details on the computational complexity, scalability, and limitations of their proposed framework, which help the audience better understand the pros and cons of this new method."}, "weaknesses": {"value": "While the authors said their method can be easily applied to other common acquisition functions, they only consider LCB in their methodology and experiments. Is it possible to extend BoGrape to UCB (this one should be straightforward) or EI?\n\nAnother limitation, as mentioned by the authors in the appendix, is the scalability issue when the underlying graph is large. The maximum size of the graphs used in the experiments is 25, but in many real-world applications (e.g., social networks and infrastructure networks), the network size may go up to $10^5$. In these cases, I am unsure whether using a global optimization based on MIP is more efficient than adopting evolutionary algorithms. \n\nBut I don't think this is necessarily a \"weakness\" of the current work, since most of the graph-level optimization algorithms suffer from the scalability problem. Overall, I have a positive evaluation of this work."}, "questions": {"value": "- On Figure 2, why is there no error bar on the first plot for the SSP kernel?\n\n- Instead of comparing among your proposed kernels in Figure 2, I think it will be better to show the performance of other graph kernels in the main text (I notice that they are in Appendix C) by making each subplot a bit smaller. The reason is that the audience will be more interested in how your proposed kernels compare to previous graph kernels, rather than solely comparing among the new ones.\n\n- A minor suggestion: it's better to briefly mention the testing accuracy of the GNNs that are used as ground-truth.\n\n- I am a bit curious about the learned values of $\\alpha$ and $\\beta$ in your kernels, e.g., results in Section 4.1 Model Performance. (I think they should reflect the \"importance\" of graph structure and node feature in the underlying function?)\n\n- Another minor suggestion: please consider using a larger font size for x and y labels, ticks on x and y axes, titles, and legends in Figures 2, 3, and 4."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "nptLe8cbUu", "forum": "g0EbJrKFQJ", "replyto": "g0EbJrKFQJ", "signatures": ["ICLR.cc/2026/Conference/Submission13126/Reviewer_Tm62"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13126/Reviewer_Tm62"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13126/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761718254925, "cdate": 1761718254925, "tmdate": 1762923848674, "mdate": 1762923848674, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a graph-based Bayesian optimization that efficiently solves graph-level optimization problems using shortest-path encoding and mixed-integer programming (MIP). It establishes a bijective mapping between shortest-path MIP encoding and the set of connected graphs, thereby addressing the challenge of modeling graph structural constraints. Additionally, it introduces four variants of shortest-path kernels and a mixed kernel formulation to balance structural and feature similarity, and achieves constrained global acquisition optimization over mixed discrete–continuous spaces, with validated effectiveness on both synthetic and molecular design tasks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper proposes a shortest-path-based MIP encoding strategy that establishes a strict bijection between connected graphs and the optimization constraint space.\n2. It designs four positive-definite graph kernel variants and a mixed kernel formulation to adapt to different graph scales and nonlinear characteristics, integrating structural and attribute similarities.\n3. It achieves global acquisition optimization within the MIP framework, explicitly modeling problem constraints and avoiding the local optima issues of traditional heuristic methods."}, "weaknesses": {"value": "1. Since the computational complexity of MIP solving increases exponentially with the number of nodes, the current method only supports graphs with ≤30 nodes, making it challenging to handle large-scale graph scenarios.\n2. The experiments mainly focus on undirected connected graphs, with insufficient validation of adaptability to directed and disconnected graphs, and a lack of related experiments, as well as detailed discussion and verification."}, "questions": {"value": "1. The current MIP encoding only supports undirected connected graphs with no more than 30 nodes, and its scalability to large graphs has not been fully verified. Additionally, the proposed extensions for directed and disconnected graphs lack empirical support. It is recommended that the authors include corresponding validation experiments to enhance the method's generality and practicality.\n2. The current experimental benchmarks do not include domain-specific Bayesian optimization methods, such as those for molecular design. The authors are encouraged to incorporate domain-relevant baselines to more comprehensively evaluate the performance and practical applicability of the proposed approach."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "yGJpqxDj6X", "forum": "g0EbJrKFQJ", "replyto": "g0EbJrKFQJ", "signatures": ["ICLR.cc/2026/Conference/Submission13126/Reviewer_bwgA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13126/Reviewer_bwgA"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13126/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761892302778, "cdate": 1761892302778, "tmdate": 1762923848362, "mdate": 1762923848362, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces BoGrape, a novel framework for Bayesian optimization (BO) over graph-structured domains. The key idea is to encode shortest-path relations in a mixed-integer programming (MIP) formulation, enabling global optimization of acquisition functions over combinatorial graph spaces while incorporating explicit structural constraints. The method is evaluated on synthetic benchmarks and molecular design tasks, showing superior performance to several baselines including random search, evolutionary algorithms, and existing graph BO methods."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.The proposed approach is novel. The paper presents the first unified framework that formulates BO directly over graph structures. The use of MIP for global acquisition optimization is technically innovative and allows explicit incorporation of hard structural constraints, which is critical for applications such as molecular design.\n\n2.The authors provide formal proofs ensuring the feasible domain of the formulation is equivalent to the graph space consisting of all connected graphs. This gives BoGrape a solid theoretical grounding compared to heuristic approaches.\n\n3.The paper is generally well-written, with a clear motivation and logical flow from problem definition to methodology and results."}, "weaknesses": {"value": "Overall, the main issues of the paper lie in two aspects.\n\nScalability concerns:\nThe proposed MIP formulation scales poorly with the number of nodes O(n3) variables due to shortest-path encoding. The largest experiments involve small graphs (n < 20), limiting its practical applicability. See questions 1 and 2.\n\nLimited baselines:\nComparisons mainly include random, evolutionary, and one BO-based baseline.\nMissing comparisons with recent neural graph optimization methods. see question 3."}, "questions": {"value": "1. How would BoGrape perform on larger graphs (e.g., n>50)?\n\n2. In line 52, the paper states that existing methods are “incapable of efficiently exploring the search domain.”However, based on later sections, the proposed method does not appear to demonstrate clear improvements in efficiency. \nCould the authors provide quantitative comparisons of training and inference time costs for all methods across different tasks to substantiate this claim?\n\n3. Why were recent neural graph optimization methods not included for a more comprehensive and up-to-date comparison? For instance, in the molecular experiments (Section 4.3), it is recommended that the authors extend the comparison beyond Bayesian optimization and evolutionary algorithms to include recent domain-specific neural graph optimization methods. Incorporating these approaches would provide a more comprehensive and up-to-date evaluation and better demonstrate the practical potential of the proposed method in real-world applications."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Xfx0PRfCAe", "forum": "g0EbJrKFQJ", "replyto": "g0EbJrKFQJ", "signatures": ["ICLR.cc/2026/Conference/Submission13126/Reviewer_shL1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13126/Reviewer_shL1"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission13126/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761901413527, "cdate": 1761901413527, "tmdate": 1762923848026, "mdate": 1762923848026, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}