{"id": "G7Dan0L7ho", "number": 22655, "cdate": 1758334032814, "mdate": 1763674041347, "content": {"title": "How Dark Patterns Manipulate Web Agents", "abstract": "Deceptive UI designs, commonly known as dark patterns, manipulate users into\nperforming actions misaligned with their goals. In this paper, we show that dark\npatterns are highly effective in altering web agent behavior, posing a significant\nrisk given the wide applications of web agents. To quantify this risk, we introduce\nDECEPTICON, an environment for testing individual dark patterns in isolation.\nDECEPTICON includes 850 web navigation tasks with dark patterns—600 generated \ntasks and 250 real-world tasks, designed to evaluate both task success and\ndark pattern effectiveness. Testing frontier large language models and state-of-\nthe-art agent scaffolds, we find dark patterns succeed in 70% of tested generated\nand real-world tasks. Moreover, the effectiveness correlates positively with model\nsize and test-time reasoning, making larger, more capable models more susceptible. \nLeading defense methods, including in-context prompting and multi-agent\nverification, fail to consistently reduce dark pattern success. Our findings reveal\ndark patterns as a latent, unmitigated risk to web agents, highlighting the urgent\nneed for robust defenses against manipulative designs.", "tldr": "Dark patterns are a category of adversarial attack that de", "keywords": ["Agents", "Redteaming", "Evaluations", "Reasoning", "Foundation Models"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/de2494ab89b47cd0835c5d37fb67ad09b653bfda.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper studies the threat of dark patterns to web-browsing agents. The authors constructed Decepticon, a dark pattern evaluation framework with generated and real-world tasks. The authors conducted experiments to verify the effectiveness of most dark patterns, and gained further insights into what affects the effectiveness of dark patterns. Finally, the paper tests two defence mechanisms and found that they are only partly effective."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "-\tThe paper formally introduces the threat dark patterns pose to web-browsing agents. While prior work has explored specific attacks such as pop-up window attacks, dark patterns represent a more generalized and widespread threat, making this contribution both novel and important.\n-\tThe evaluation demonstrates comprehensiveness in covering multiple types of dark patterns across different categories, providing broad coverage of the threat landscape. \n-\tThe paper provides valuable insights into attack mechanisms and effectiveness, as well as identifying limitations in simple defense strategies."}, "weaknesses": {"value": "-\tRegarding the high effectiveness of dark patterns, the experimental design cannot rule out a confounding possibility: the observed high effectiveness may be partially attributed to issues with SoM annotation. If SoM labels/transcripts are inaccurate, or if the SoM action space is inappropriate, agents may be unable to detect or avoid dark patterns. The paper lacks ablation studies on the same agent to clarify this potential confound.\n-\tThe analysis of failure modes could be more thorough. For example, what specific reasoning patterns lead agents to fail for dark patterns? How do agnets’ CoT traces behave in cases where the defences fail?\n-\tThe presentation of Figure 2 is non-academic. The horizontal axis is qualitative and represents different meanings for different models. The authors should revise this figure to clearly convey the meaning of each data point (e.g., through separate panels or explicit labelling, or by other means). \n\nMinor issue\n\n-\tIn the introduction: “Although many users…” (near line 52), this sentence needs citations to support."}, "questions": {"value": "-\tRegarding Figure 5 (in the appendix): Why would dark patterns manipulate Terms and Conditions of Use? For such dark patterns, what is the success rate of human users in avoiding them? \n-\tWhy is there no evaluation with Computer Use Agents, such as OpenAI CUA? Are there technical difficulties (such as action space misalignment) that prevented this evaluation?\n-\tCould you explain lines 2 and 4 of Algorithm 1? For example, what is the prompt behind `LLM.generate_task()`? Could you provide an example of what the `trajectory` variable contains?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "pu809hmoST", "forum": "G7Dan0L7ho", "replyto": "G7Dan0L7ho", "signatures": ["ICLR.cc/2026/Conference/Submission22655/Reviewer_zQXh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22655/Reviewer_zQXh"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761372299777, "cdate": 1761372299777, "tmdate": 1762942323154, "mdate": 1762942323154, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Relative to existing web-agent benchmarks (e.g., WebArena, VisualWebArena, WorkArena, BrowseComp) and agent attack studies (e.g., pop-up attacks, environmental injection, jailbreaks), the paper positions DECEPTICON as a dark-pattern–specific benchmark that isolates human-targeted manipulative UI designs. Its key differentiators are a taxonomy-driven task set, matched treatment-control pages for causal attribution on generated tasks, archived in-the-wild pages for realism, explicit “avoidability” constraints, and dual outcome metrics for task success versus dark-pattern effectiveness. The paper also adds systematic analyses of scaling and defenses under this threat model."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Problem and threat-model focus: Unlike general web task suites (WebArena; VisualWebArena; WorkArena; BrowseComp), DECEPTICON centers exclusively on human-targeted dark patterns rather than generic navigation. This fills a gap distinguished from agent-optimized attacks like pop-up prompt-injection or environmental injection that manipulate agents directly rather than leveraging deceptive design intended for humans.\n\nSeparating task success (SR) from dark-pattern effectiveness (DP) highlights that agents can both “succeed” at the user goal and still be manipulated. This disentanglement is not emphasized in the cited previous benchmarks."}, "weaknesses": {"value": "Positioning against closely related attacks could be tighter. While the paper distinguishes dark patterns from agent-targeted injections (e.g., pop-ups; environmental injection) in Related Work, some instantiations (e.g., coercive pop-ups) straddle both spaces. A crisper delineation of what DECEPTICON includes/excludes versus those settings would sharpen the novelty.\n\nThe manuscript does not present transfer or overlap results on existing suites (e.g., taking WebArena/VisualWebArena tasks that contain pop-ups or consent flows) or quantify how DECEPTICON’s tasks differ in difficulty or failure modes compared to those environments.\n\nThe Related Work cites a contemporaneous study on dark patterns and GUI agents. The manuscript claims unique emphasis but does not explicitly articulate dataset, metric, and protocol differences (e.g., treatment-control design, avoidability constraint, detector assumptions) to separate contributions."}, "questions": {"value": "Please add a concise table contrasting DECEPTICON with WebArena, VisualWebArena, WorkArena, BrowseComp, and the cited pop-up/environmental-injection attack settings along these axes: threat model (human-targeted vs. agent-optimized), control pages, archival determinism, avoidability constraint, category taxonomy, metrics (SR vs. DP), and defense/scaling evaluations."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "KyQfleIo7M", "forum": "G7Dan0L7ho", "replyto": "G7Dan0L7ho", "signatures": ["ICLR.cc/2026/Conference/Submission22655/Reviewer_DGCb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22655/Reviewer_DGCb"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761747493621, "cdate": 1761747493621, "tmdate": 1762942322896, "mdate": 1762942322896, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this study, the authors propose DECEPTICON, a benchmark designed to evaluate the behavior-altering effects of dark patterns on web navigation agents.\nDECEPTICON includes 850 tasks that incorporate various dark patterns such as obstruction and social proof, mimicking manipulative elements that may appear on real web pages.\nThe authors investigate whether these dark patterns can manipulate the behavior of agents, and find that models with stronger reasoning abilities are, more susceptible to manipulation.\nThey also evaluate the defensive effectiveness of In-Context Prompting and Multi-agent Verification within this benchmark."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This paper introduces a dark pattern benchmark, proposing that various patterns such as Social Proof and Urgency, which commonly appear on real websites, can potentially influence or control agent behavior.\n\n- The fact that these dark patterns can be easily created by real web hosts demonstrates that this benchmark effectively simulates situations web AI agents are likely to encounter in the real world.\n\n- The authors also evaluate the defensive capabilities of In-Context Prompting and Multi-agent Verification on this benchmark.\n\n- The finding that models with stronger reasoning abilities are actually more susceptible to manipulation is particularly intriguing."}, "weaknesses": {"value": "- The study focuses only on single-step deception, without addressing multi-turn manipulations.\n\n- The automated labeling process may contain some errors, and the criteria for defining vulnerabilities could be ambiguous."}, "questions": {"value": "- The authors define six categories based on the seven-category structure from Mathur et al. (2019). Are there examples of dark patterns not covered by these categories?\n\n- Could webpage archiving cause the agent to perceive the environment differently compared to a live webpage? For instance, is the agent restricted from viewing or accessing the URL (if they can see url, can they realize that this is a mock-up webpage)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "9cayoRhc9s", "forum": "G7Dan0L7ho", "replyto": "G7Dan0L7ho", "signatures": ["ICLR.cc/2026/Conference/Submission22655/Reviewer_x4y6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22655/Reviewer_x4y6"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966493598, "cdate": 1761966493598, "tmdate": 1762942322706, "mdate": 1762942322706, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the robustness of web agents against deceptive UI designs, also known as dark patterns, which target human users to alter their behavior for adversarial goals. The authors construct DECEPTICON, a novel benchmark consisting of 250 real-world tasks and 600 synthetic tasks that evaluate the dark pattern risk in the web search agent applications. The experiments on frontier LLMs and different agent scaffolds show that dark patterns succeed in majority of tasks and the risk grows with the capability of underlying LLMs, highlighting the significance of examining dark pattern risks during the web agent development process."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- construct an effective, isolated environment for studying dark patterns, which is both deterministic and repeatable to enable controlled experimentation. \n- the novel benchmark DECEPTICON covers diverse categories and common cases of dark patterns we can see on the internet.\n- use realistic dark patterns that target human users, focusing on attacks that exploit human cognitive biases and decision-making processes."}, "weaknesses": {"value": "- don't have a human user baseline\n- no evaluation on open-sourced LLMs-driven web agents\n- the standard deviation in Table 2 is large, especially on the generated evaluation set. Please add discussions about this observation in the text."}, "questions": {"value": "no other questions"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "oyAa1OqjF4", "forum": "G7Dan0L7ho", "replyto": "G7Dan0L7ho", "signatures": ["ICLR.cc/2026/Conference/Submission22655/Reviewer_Swb4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22655/Reviewer_Swb4"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22655/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762167297014, "cdate": 1762167297014, "tmdate": 1762942322490, "mdate": 1762942322490, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}