{"id": "GEsTLuJy1q", "number": 9760, "cdate": 1758138849717, "mdate": 1763753207747, "content": {"title": "Interaction Field Matching: Overcoming Limitations of Electrostatic Models", "abstract": "Electrostatic field matching (EFM) has recently appeared as a novel physics-inspired paradigm for data generation and transfer using the idea of an electric capacitor. However, it requires modeling electrostatic fields using neural networks, which is non-trivial because of the necessity to take into account the complex field outside the capacitor plates. In this paper, we propose Interaction Field Matching (IFM), a generalization of EFM which allows using general interaction fields beyond the electrostatic one. Furthermore, inspired by strong interactions between quarks and antiquarks in physics, we design a particular interaction field realization which solves the problems which arise when modeling electrostatic fields in EFM. We show the performance on a series of toy and image data transfer problems.", "tldr": "", "keywords": ["generative models", "distribution transfer", "electrostatics"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b1931d46686d218a83a5e51bdf2eb7128b60b776.pdf", "supplementary_material": "/attachment/b5d45210fb102b2e25062a5dfc3ff9ff6e23fd43.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a generative model based on EFM, which allows using general interaction fields beyond the existing electrostatic ones. The main theorem shows that IFM can recover the target distribution successfully. Experimental results show that it can outperform competitive models in image generation and image-to-image translation."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The mathematical results look sound. And it identifies and resolves some problems from previous EFMs.\n\n2. The empirical results are solid, and they are able to demonstrate stronger performance than GANs and DDPMs."}, "weaknesses": {"value": "1. Ablation studies are not presented in the main paper. It's hard to know what components contribute to the final model gain.\n\nRunning speed isn't provided. So we don't know whether this presented model is, in fact, scalable.\n\nThe resolution of the images used in this paper is quite low.\n\n2. Presentation issues:\n\n(1)  It is better to mark z=L line in Figure 2. It's not very clear now.\n(2)  Equation 11 seems to be incomplete. Or maybe it means an SGD step. It's unclear.\n(3) In Table 1, our->ours."}, "questions": {"value": "1. Why does EFM get completely wrong results?\n\n2. Why was this ODE better than a straight-forward linear ODE?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2zIJt19Ncz", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Reviewer_PXv4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Reviewer_PXv4"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760636015979, "cdate": 1760636015979, "tmdate": 1762921252577, "mdate": 1762921252577, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a generative model based on EFM, which allows using general interaction fields beyond the existing electrostatic ones. The main theorem shows that IFM can recover the target distribution successfully. Experimental results show that it can outperform competitive models in image generation and image-to-image translation."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The mathematical results look sound. And it identifies and resolves some problems from previous EFMs.\n\n2. The empirical results are solid, and they are able to demonstrate stronger performance than GANs and DDPMs."}, "weaknesses": {"value": "1. Ablation studies are not presented in the main paper. It's hard to know what components contribute to the final model gain.\n\nRunning speed isn't provided. So we don't know whether this presented model is, in fact, scalable.\n\nThe resolution of the images used in this paper is quite low.\n\n2. Presentation issues:\n\n(1)  It is better to mark z=L line in Figure 2. It's not very clear now.\n(2)  Equation 11 seems to be incomplete. Or maybe it means an SGD step. It's unclear.\n(3) In Table 1, our->ours."}, "questions": {"value": "1. Why does EFM get completely wrong results?\n\n2. Why was this ODE better than a straight-forward linear ODE?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "2zIJt19Ncz", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Reviewer_PXv4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Reviewer_PXv4"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760636015979, "cdate": 1760636015979, "tmdate": 1763760607209, "mdate": 1763760607209, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose Interaction Field Matching (IFM), a generalization of electrostatic field matching. The authors further design a particular instance of IFM that solves several problems with EFM and show promising performance on several toy and image data transfer problems. The authors further provide extensive theory to show that their model provably transfers between distribution and provide the most general set of requirements for the interaction field to perform data transfer."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- The authors provide a strong theoretical contribution by generalizing EFM and providing the most general set of requirements for the interaction field to perform data transfer.\n- The paper is very clearly written, intuitive, and easy to understand\n- The proposed IFM solves several problems with EFM and achieves better performance on several tasks. \n- The proposed IFM is even competitive with/outperforms diffusion/flow-matching methods.\n- Overall, the paper has both very strong theoretical results and promising empirical studies"}, "weaknesses": {"value": "- This is somewhat of a minor point, but the authors only provide experiments on relatively \"toy\" problems. It would be more convincing if the authors included additional experiments on other, more challenging image generation tasks.\n- The paper could use some additional discussion on diffusion/flow matching to situate the work in the broader context of generative modeling"}, "questions": {"value": "As someone less familiar with the IFM, I am curious what is the connection between IFM/EFM and flow-matching? Is it possible to generalize them with a single theory?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "wmE0L4Jpjv", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Reviewer_gzz2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Reviewer_gzz2"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761702439871, "cdate": 1761702439871, "tmdate": 1762921252197, "mdate": 1762921252197, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Interaction Field Matching (IFM), a physics-inspired method for data distribution transfer problems. In comparison to Electrostatic Field Matching (EFM), IFM generalized to arbitrary interactions between charges and doesn’t suffer the same problems with tracing backward-oriented field lines. The paper presents the main theorem that movement along interaction field lines provably transfers one data distribution to another. Experiments demonstrate that IFM performs comparably in image generation tasks to well-known approaches such as flow-based models and DDPM."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper is well written and easy to follow, with careful explanations of the limitations of EFM (e.g. the line termination problem in Figure 2). It creatively draws from ideas in physics to propose reasonable properties of interaction fields (e.g. the start/termination of lines and flux conservation). It is especially useful that IFM provably transfers one data distribution to the other. From the visualizations in Figure 9 and the numerical results in Table 1, it seems that IFM is comparable to other state-of-the-art methods for image generation (slightly outperformed by PGFM), illustrating that this could be a promising method for data to data transfer."}, "weaknesses": {"value": "The main weakness of this work is that it seems to be a repacking of the Maximum Mean Discrepancy with a field-induced kernel. Thus, I am unsure of the novelty. Given two probability distributions $p(x), q(x)$ the MMD is the squared distance between their mean embeddings in a reproducing kernel Hilbert space with some kernel $k(x,x’)$. See [1]. From my understanding, in IFM, you are replacing the kernel $k(x,x’)$ with the interaction field (so this is essentially MMD with a field-induced kernel). The IFM loss is then the MMD$^2$. Thus, to me this represents a “repackaged” MMD in the language of fields, and not really a new generative principle. I believe one can derive this mapping to the empirical MMD$^2$ from Eq. 7/the IFM loss. It is essentially comparing distributions via pairwise kernel sums (so is a kernel-based MMD method, e.g. in section 3.2.3). Please correct my understanding if this is wrong, but I think it would be worth addressing the connection to MMD/other distribution alignment techniques.\n\nThe method relies on choosing an interaction field, but there aren’t many details provided about how one should choose this field/in which scenarios it may be beneficial to choose a certain field over others.\n\nThe IFM method performs comparatively well to other methods on image generation tasks but does not outperform significantly. It would be helpful to discuss specific scenarios where IFM could provide advantages over existing methods.\n\nI’m not sure what the point of the image-to-image translation task is besides showing that IFM can do what EFM cannot. It seems relatively simple compared to standard benchmarks in image-to-image translation (e.g. Cityscapes)."}, "questions": {"value": "How is this related to kernel-based MMD methods (see above)? It might strengthen the paper to explicitly discuss the connection to MMD and clarify what additional value this perspective of field interactions brings.\n\nAre there guidelines besides the general requirements for choosing the interaction field? Did the authors do ablations on different choices of interaction field?\n\nCan the authors motivate why one would want to use IFM over existing generative frameworks?\n\n[1] Gretton, A., Borgwardt, K. M., Rasch, M. J., Schölkopf, B., & Smola, A. J. A Kernel Two-Sample Test. Journal of Machine Learning Research (JMLR), 2012."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "4p6O6jHdkK", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Reviewer_TnaZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Reviewer_TnaZ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761927922210, "cdate": 1761927922210, "tmdate": 1762921251848, "mdate": 1762921251848, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Interaction Field Matching (IFM), a novel physics-inspired framework for data generation and transfer designed to overcome limitations of existing Electrostatic Field Matching (EFM) models. The authors identify issues with EFM such as curved field lines, extension beyond target regions, and insufficient coverage of the target distribution. IFM addresses these problems by introducing a new field structure that results in nearly straight field lines between planes, prevents extension beyond z>L, and adequately covers the entire target distribution. The paper provides theoretical foundations for the method, including proofs of flow conservation properties, and validates it through experiments on multiple datasets. Results show that IFM performs well on datasets like 64×64 CelebA where EFM fails. Additionally, IFM demonstrates competitive performance in generation quality compared to state-of-the-art methods such as PFGM, Flow Matching, DDPM, and StyleGAN."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper proposes a novel physics-inspired framework that addresses key limitations of existing EFM methods. IFM produces nearly straight field lines and effectively covers the target distribution, which is significant both theoretically and practically.\n2. The authors provide solid theoretical foundations, including proofs of flow conservation properties and mathematical analysis of field line behavior. Theorems and lemmas in the appendix guarantee the correctness of the method.\n3. The experimental design is comprehensive, comparing not only with EFM, PFGM, and PFGM++ but also with modern flow-based methods (Flow Matching), diffusion-based methods (DDPM), and adversarial approaches (StyleGAN), demonstrating IFM's effectiveness.\n4. Figure 3 clearly illustrates IFM's advantages over EFM, visually explaining why IFM better handles data transfer problems. This visualization is extremely helpful for understanding the method's improvements.\n5. The authors honestly discuss the limitations of their method, particularly the numerical precision issues that may arise in high dimensions (1/σ(z)^D potentially producing values close to machine precision). This transparency enhances the paper's credibility."}, "weaknesses": {"value": "1. Although the paper mentions potential numerical precision issues in high dimensions, it lacks systematic analysis of their practical impact. In real applications, when dimension D is large, this issue could cause algorithm instability or failure, but the paper does not provide solutions or mitigation strategies.\n2. The experimental section only presents qualitative results (such as Figures 9a and 9b) without quantitative evaluation metrics. In the field of generative models, standard metrics like FID and IS are crucial for objective performance comparison, but the paper does not report these.\n3. The paper does not provide detailed analysis of IFM's computational complexity and runtime. Compared to existing methods, does IFM introduce significant computational overhead? This is crucial for practical applications, but the paper does not provide relevant information.\n4. Insufficient parameter sensitivity analysis. IFM likely depends on key parameters (such as distance L, function σ(z), etc.), but the paper does not systematically study how these parameters affect performance. Figure 4 shows results for different L values, but lacks analysis of other parameters.\n5. The comparison with existing methods is not comprehensive. While the paper mentions comparisons with PFGM and PFGM++, it does not detail the specific theoretical and implementation differences between IFM and these methods, or why IFM performs better in certain cases.\n6. The paper does not explore IFM's applicability to other data types (such as text, audio, or graph-structured data). While the focus is on image generation, discussion of extension to other data modalities would enhance the method's generality."}, "questions": {"value": "1. How does the small value problem from 1/σ(z)^D practically affect algorithm performance in high dimensions (e.g., D>100)? Have you tried any numerical stability techniques (such as log-space calculations) to mitigate this issue?\n2. Figure 4 shows the impact of different L values on results but does not explain how to select the optimal L value. In practical applications, is there an automatic method to determine L? Is there any relationship between L and dataset characteristics?\n3. How does IFM's training and sampling efficiency compare with other generative models? Could you provide quantitative comparisons with methods like PFGM and DDPM in terms of computational time and memory usage?\n4. How is the \"crucial flow conservation property\" mentioned in Appendix A.4 ensured? Could you explain in more detail why IFM's field structure maintains this property while EFM cannot?\n5. Can the IFM framework be extended to conditional generation tasks? For example, could class information or text descriptions be incorporated into the field structure for conditional image generation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "5hEcPLuS4n", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Reviewer_KeQQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Reviewer_KeQQ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762085631037, "cdate": 1762085631037, "tmdate": 1762921251576, "mdate": 1762921251576, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General response"}, "comment": {"value": "Dear reviewers, we want to express our gratitude for dedicating your valuable time to review our paper. Your feedback means a lot to us, and we are delighted that many of you found the theoretical and methodological contributions of our work to be significant and experiments to be sufficient. \n\n\n**Revised paper:** In the revised manuscript, we have included several new appendices to address the reviewers' comments:\n\n- **Appendix C**: An ablation study of our method IFM ( *for Reviewers KeQQ, PXv4* ).\n- **Appendix D**: More challenging Image generation on CelebA 128×128 ( *for Reviewers gzz2, PXv4* ).\n- **Appendix E**: Conditional Image generation on CIFAR-10 ( *for Reviewer KeQQ* ).\n- **Appendix F**: Discussion of differences between our method (IFM) and Flow Matching (FM) ( *for Reviewers gzz2, TnaZ* ).\n \n**All the edits are highlighted with the blue color.** Please take a look."}}, "id": "LNRdAsi7pE", "forum": "GEsTLuJy1q", "replyto": "GEsTLuJy1q", "signatures": ["ICLR.cc/2026/Conference/Submission9760/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9760/Authors"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission9760/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763751282653, "cdate": 1763751282653, "tmdate": 1763751282653, "mdate": 1763751282653, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}