{"id": "GgBrQCdC2L", "number": 7473, "cdate": 1758023674229, "mdate": 1759897850928, "content": {"title": "Predictive Spike Timing Enables Distributed Shortest Path Computation in Spiking Neural Networks", "abstract": "Efficient planning and sequence selection are central to intelligence, yet current approaches remain largely incompatible with biological computation.  Classical graph algorithms like Dijkstra's or A* require global state and biologically implausible operations such as backtracing, while reinforcement learning methods rely on slow gradient-based policy updates that appear inconsistent with rapid behavioral adaptation observed in natural systems.\n\nWe propose a biologically plausible algorithm for shortest-path computation that operates through local spike-based message-passing with realistic processing delays.  The algorithm exploits spike-timing coincidences to identify nodes on optimal paths: Neurons that receive inhibitory-excitatory message pairs earlier than predicted reduce their response delays, creating a temporal compression that propagates backwards from target to source.  Through analytical proof and simulations on random spatial networks, we demonstrate that the algorithm converges and discovers all shortest paths using purely timing-based mechanisms.  By showing how short-term timing dynamics alone can compute shortest paths, this work provides new insights into how biological networks might solve complex computational problems through purely local computation and relative spike-time prediction.  These findings open new directions for understanding distributed computation in biological and artificial systems, with possible implications for computational neuroscience, AI, reinforcement learning, and neuromorphic systems.", "tldr": "We show how spiking neural networks find shortest paths using local timing predictions, where neurons become \"tagged\" when receiving signals earlier than expected, creating backward waves without biologically infeasible back-tracing.", "keywords": ["shortest path", "spiking neural networks", "neural computation", "distributed graph algorithms", "neuromorphic computing", "temporal dynamics"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/5e94d89139bf2bb7a0041c3840916ecf77a8bebf.pdf", "supplementary_material": "/attachment/3af10dcfad583bd2af895afd699507ffbca9e379.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces a novel, biologically-inspired algorithm for shortest path (SP) computation in Spiking Neural Networks (SNNs) that successfully eliminates the need for back-tracing - a process that renders classic SP algorithms (e.g., Dijkstra's Algorithm) biologically implausible.\n\nThe algorithm frames SP search as a problem of distributed temporal prediction. Units are modeled as Timed State Machines. The core mechanism is predictive tagging: a neuron becomes tagged when it receives an Inhibitory (I)-Excitatory (E) message pair earlier than anticipated, based on network timing predictions. This initiates a backward-propagating wave of temporal compression from the target to the source. The mechanism requires that tagged neurons can send both I and E signals, while untagged neurons send only E. The authors use mathematical induction to prove the algorithm’s convergence and effectiveness in discovering the shortest path."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The proposed algorithm is conceptually novel. The use of short-term timing dynamics to replace global state management (back-tracing) is an interesting contribution to bio-inspired computation. The convergence proof is clear and straightforward, providing theoretical foundation for the proposed mechanism."}, "weaknesses": {"value": "Despite its novelty, the work presents multiple significant limitations, primarily revolving around claims of biological plausibility and empirical robustness.\n\n## 1.⁠ ⁠Weak Biological Assumptions\nThe model makes two key assumptions that severely compromise its biological realism:\n- ⁠Global Inhibition: The algorithm critically depends on global inhibitory signals broadcast from every tagged neuron to the entire network. While the brain utilizes some diffuse modulation, the vast majority of biological inhibition is local and precisely targeted (Markram et al., 2004). This global signal introduces massive scalability and metabolic feasibility issues.\n- Violation of Dale's Principle: The model requires neurons to release both Excitatory and Inhibitory messages depending on their state. This explicitly violates Dale’s Principle (Strata and Harvey, 1999), which asserts that a mature neuron releases the same transmitter at all its synapses, defining it as either excitatory or inhibitory. This violation is a convenient algorithmic shortcut but weakens the paper's claim of biological fidelity.\n\n## 2.⁠ ⁠Lack of Quantitative Comparison and Robustness\nThe empirical results are largely qualitative, lacking the necessary quantitative comparisons and robustness checks expected for a ICLR paper:\n- Absence of Comparative Benchmarking: The paper does not quantitatively compare its performance (e.g., convergence time, energy efficiency) against other algorithms proposed for biologically plausible pathfinding in SNNs, such as the weight-modification approaches in Ponulak & Hopfield (2013) or the threshold-adaptation method in Dietrich et al. (2025). This makes it difficult to ascertain the practical advantage of the new mechanism.\n- Sensitivity to Jitter/Noise: The entire mechanism relies on precise spike-timing coincidences to detect the \"earlier than expected\" I-E pair. This makes the algorithm inherently fragile. The current results lack a sensitivity analysis showing how performance degrades under realistic biological conditions, such as synaptic delay jitter, heterogeneous neuron properties, or ambient network noise (Faisal et al., 2008).\n\n______________________________________\n## Recommended Focus for Rebuttal\nGiven these limitations, I encourage the authors to focus their rebuttal work and future directions on the following critical points:\n1. ⁠Local Inhibition Generalization: The authors must explore and demonstrate how the algorithm behaves when the inhibitory signal is constrained to be local (i.e., the inhibition radius is small). Providing simulation results with varying inhibition radius as a hyperparameter is essential to defend the biological plausibility claim.\n2. Quantitative Comparison: A head-to-head quantitative comparison against the closest related biologically-inspired shortest-path or search algorithms is required to contextualize the work's practical value.\n3. Noise and Robustness Testing: Implement and report results using noisy neural units to establish the practical robustness of the spike-timing prediction mechanism."}, "questions": {"value": "Please refer to the Weakness section for the core issues. Some additional questions are reported below.\n\n1. How exactly would you encode edge weights via axonal delays $\\Delta t_E$, inhibitory timing $\\Delta t_I$, or processing delays $\\tau$ so that the tagging condition still corresponds to geodesics in a weighted metric?\n2. What is the expected number of $I$ broadcasts and $E$ messages per iteration as a function of degree and frontier size? Any bounds or empirical curves?\n3. Can the author include a pseudocode block and tables for relevant parameters and assumptions?\n4. Since runtime scales with path length $k$, can you provide preliminary multi-scale results (e.g., 2–3 scales) to quantify it?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "UJjWv7JknA", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_A1yw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_A1yw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761736734846, "cdate": 1761736734846, "tmdate": 1762919587991, "mdate": 1762919587991, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a biologically plausible algorithm for shortest-path computation using local spike-timing mechanisms instead of global state tracking or backpropagation. By leveraging excitatory-inhibitory (E-I) spike timing coincidences and predictive delay adaptation, neurons self-organize to identify the shortest paths through purely local interactions. The authors provide formal convergence proofs, simulation results on spatial networks, and discuss the biological and computational implications of their model."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. This paper is novel. The work introduces an innovative spike-timing-based protocol for solving shortest-path problems without backtracing or weight updates, a rare combination of biological plausibility and algorithmic rigor.\n2. The convergence proof and formal timing analysis add strong theoretical support to the proposed mechanism."}, "weaknesses": {"value": "I am not a researcher in this area. I have several concerns:\n1. Could the approach be extended to weighted graphs or dynamic environments where connectivity changes over time?\n2. The model relies on highly idealized timing precision and static network topology, which may limit its biological and practical applicability.\n3. Simulations are restricted to simple 2D mazes; no quantitative comparison with existing algorithms or noisy neural environments is provided.\n4. The global inhibition mechanism may not scale efficiently to large or hierarchical networks, as acknowledged by the authors.\n5. How might this framework integrate with known hippocampal replay or grid-cell models to explain real neural navigation behaviors?\n6. How robust is the proposed algorithm to temporal noise or variability in spike delays typical of biological neurons?\n\nHope that the authors can answer the above questions. Thank you."}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "RH6xmLysF7", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_zXYC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_zXYC"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761827480659, "cdate": 1761827480659, "tmdate": 1762919587452, "mdate": 1762919587452, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a biologically plausible algorithm for shortest-path computation using local spike-timing mechanisms instead of global state tracking or backpropagation. By leveraging excitatory-inhibitory (E-I) spike timing coincidences and predictive delay adaptation, neurons self-organize to identify the shortest paths through purely local interactions. The authors provide formal convergence proofs, simulation results on spatial networks, and discuss the biological and computational implications of their model."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. This paper is novel. The work introduces an innovative spike-timing-based protocol for solving shortest-path problems without backtracing or weight updates, a rare combination of biological plausibility and algorithmic rigor.\n2. The convergence proof and formal timing analysis add strong theoretical support to the proposed mechanism."}, "weaknesses": {"value": "I am not a researcher in this area. I have several concerns:\n1. Could the approach be extended to weighted graphs or dynamic environments where connectivity changes over time?\n2. The model relies on highly idealized timing precision and static network topology, which may limit its biological and practical applicability.\n3. Simulations are restricted to simple 2D mazes; no quantitative comparison with existing algorithms or noisy neural environments is provided.\n4. The global inhibition mechanism may not scale efficiently to large or hierarchical networks, as acknowledged by the authors.\n5. How might this framework integrate with known hippocampal replay or grid-cell models to explain real neural navigation behaviors?\n6. How robust is the proposed algorithm to temporal noise or variability in spike delays typical of biological neurons?\n\nHope that the authors can answer the above questions. Thank you."}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "RH6xmLysF7", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_zXYC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_zXYC"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761827480659, "cdate": 1761827480659, "tmdate": 1763529218818, "mdate": 1763529218818, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose a computational mechanism on graphs that is aimed at generating sequential neural activity by computing the shortest path between nodes with a biologically plausible mechanism. The graph is a recurrent neural network with neurons that transition between 5 discrete states, and these states are preceded by delays. The mechanism of finding the shortest path relies on a local computation where neurons that receive messages earlier than expected reduce their state transmission delays and thus creates a firing sequence with the shortest path."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The idea of predictive spike timing where neurons form sequential firing sequence as they receive recurrent inputs earlier than \"expected\" is of interest."}, "weaknesses": {"value": "1) Neurons are non-Dalian, i.e., the same neuron sends both excitatory and inhibitory messages to other neurons. This strongly decreases the appeal of the algorithm to describe computations in biological networks.\n\n2) The main mechanism relies on shorter processing delay of a tagged neuron compared to a non-tagged neuron. This also does not seem to be biologically relevant mechanism. Synaptic (transmission) delays in biological networks are biopysical and not functional properties, meaning they cannot change in order to accomplish a functional computation. Also, refractory period after spiking is a biophysical property. I do not see how biological neurons could shorten these time constants to accomplish a computational function.\n\n3) In biological networks of the hippocampus, many place cells (in particular in the dentate gyrus and CA1 which are coding for spatial navigation) are strongly driven by feedforward inputs. Sequential firing would in this case importantly depend on the tuning of the cell and its feedforward current rather than a recurrent mechanism as proposed here. \n\n4) While the mechanism of predictive spike timing seems of general interest, its implementation in the present setting is biologically implausible and the application of the algorithm to place cells does not seem to be a good choice, at least not in the way it is described in the present setting.\n\n5) The paper promises \"analytical convergence proof\" but I do not see any analytical analysis beyond presenting an algorithm and running simulations."}, "questions": {"value": "1) [195-196] \".. tagged neurons can transit from inhibited to processing upon receiving E messages, modelling neuromodulator-gated disinhibition\". Can authors explain what is meant here? What is neuromodulator-gated disinhibition?\n\n2) Why authors think that the implementation of the shortest path computation should necessarily be based on local timing relationships ( as mentioned in lines [199-203]) ? In biological networks in the cortex, the connection probability between Excitatory and Inhibitory neurons is high (going beyond the connection probability of 0.5 for several types of inhibitory-excitatory and inhibitory-inhibitory connections). Would this justify global coordination  as biologically plausible?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rYbnvPtSrO", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761904866645, "cdate": 1761904866645, "tmdate": 1762919586828, "mdate": 1762919586828, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose a computational mechanism on graphs that is aimed at generating sequential neural activity by computing the shortest path between nodes with a biologically plausible mechanism. The graph is a recurrent neural network with neurons that transition between 5 discrete states, and these states are preceded by delays. The mechanism of finding the shortest path relies on a local computation where neurons that receive messages earlier than expected reduce their state transmission delays and thus creates a firing sequence with the shortest path."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The idea of predictive spike timing where neurons form sequential firing sequence as they receive recurrent inputs earlier than \"expected\" is of interest."}, "weaknesses": {"value": "1) Neurons are non-Dalian, i.e., the same neuron sends both excitatory and inhibitory messages to other neurons. This strongly decreases the appeal of the algorithm to describe computations in biological networks.\n\n2) The main mechanism relies on shorter processing delay of a tagged neuron compared to a non-tagged neuron. In biology, this maps to a potential effect of neuromodulation, but it is unclear how neuromodulation could tag individual neurons in the neuronal assembly.\n\n3) In biological networks of the hippocampus, many place cells (in particular in the dentate gyrus and CA1 which are coding for spatial navigation) are strongly driven by feedforward inputs. Sequential firing would in this case importantly depend on the tuning of the cell and its feedforward current rather than a recurrent mechanism as proposed here. \n\n4) While the mechanism of predictive spike timing seems of general interest, its implementation in the present setting is biologically implausible and the application of the algorithm to place cells does not seem to be a good choice, at least not in the way it is described in the present setting.\n\n5) The paper promises \"analytical convergence proof\" but I do not see any analytical analysis beyond presenting an algorithm and running simulations."}, "questions": {"value": "1) [195-196] \".. tagged neurons can transit from inhibited to processing upon receiving E messages, modelling neuromodulator-gated disinhibition\". Can authors explain what is meant here? What is neuromodulator-gated disinhibition?\n\n2) Why authors think that the implementation of the shortest path computation should necessarily be based on local timing relationships ( as mentioned in lines [199-203]) ? In biological networks in the cortex, the connection probability between Excitatory and Inhibitory neurons is high (going beyond the connection probability of 0.5 for several types of inhibitory-excitatory and inhibitory-inhibitory connections). Would this justify global coordination  as biologically plausible?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rYbnvPtSrO", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761904866645, "cdate": 1761904866645, "tmdate": 1763290369702, "mdate": 1763290369702, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose a computational mechanism on graphs that is aimed at generating sequential neural activity by computing the shortest path between nodes with a biologically plausible mechanism. The graph is a recurrent neural network with neurons that transition between 5 discrete states, and these states are preceded by delays. The mechanism of finding the shortest path relies on a local computation where neurons that receive messages earlier than expected reduce their state transmission delays and thus creates a firing sequence with the shortest path."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "The idea of predictive spike timing where neurons form sequential firing sequence as they receive recurrent inputs earlier than \"expected\" is of interest."}, "weaknesses": {"value": "1) Neurons are non-Dalian, i.e., the same neuron sends both excitatory and inhibitory messages to other neurons. This decreases the power of the algorithm to describe computations in biological networks.\n\n2) The main mechanism relies on shorter processing delay of a tagged neuron compared to a non-tagged neuron. In biology, this maps to a potential effect of neuromodulation, but it remains unclear how neuromodulation could tag individual neurons in the neuronal assembly.\n\n3) In biological networks of the hippocampus, many place cells (in particular in the dentate gyrus and CA1 which are coding for spatial navigation) are strongly driven by feedforward inputs. Sequential firing would in this case importantly depend on the tuning of the cell and its feedforward current in addition to the recurrent mechanism proposed here. \n\n4) While the mechanism of predictive spike timing seems of general interest, its implementation in the present setting is not mapped onto biophysically realistic circuits."}, "questions": {"value": "1) [195-196] \".. tagged neurons can transit from inhibited to processing upon receiving E messages, modelling neuromodulator-gated disinhibition\". Can authors explain what is meant here? What is neuromodulator-gated disinhibition?\n\n2) Why authors think that the implementation of the shortest path computation should necessarily be based on local timing relationships ( as mentioned in lines [199-203]) ? In biological networks in the cortex, the connection probability between Excitatory and Inhibitory neurons is high (going beyond the connection probability of 0.5 for several types of inhibitory-excitatory and inhibitory-inhibitory connections). Would this justify global coordination  as biologically plausible?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rYbnvPtSrO", "forum": "GgBrQCdC2L", "replyto": "GgBrQCdC2L", "signatures": ["ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7473/Reviewer_ig1o"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7473/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761904866645, "cdate": 1761904866645, "tmdate": 1763670278351, "mdate": 1763670278351, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}