{"id": "GlHoWr8JMm", "number": 9890, "cdate": 1758146712139, "mdate": 1759897689050, "content": {"title": "TRANSPORT-BASED MEAN FLOWS FOR GENERATIVE MODELING", "abstract": "Flow-matching generative models have emerged as a powerful paradigm for continuous data generation, achieving state-of-the-art results across domains such as images, 3D shapes, and point clouds. Despite their success, these models suffer from slow inference due to the requirement of numerous sequential sampling steps. Recent work has sought to accelerate inference by reducing the number of sampling steps. In particular, Mean Flows offer a one-step generation approach that delivers substantial speedups while retaining strong generative performance. Yet, in many continuous domains, Mean Flows fail to faithfully approximate the behavior of the original multi-step flow-matching process. In this work, we address this limitation by incorporating optimal transport–based sampling strategies into the Mean Flow framework, enabling one-step generators that better preserve the fidelity and diversity of the original multi-step flow process. Experiments on controlled low-dimensional settings and on high-dimensional tasks such as image generation, image-to-image translation, and point cloud generation demonstrate that our approach achieves superior inference accuracy in one-step generative modeling. The code for re-\nproducing all the numerical results is available in the anonymous repository at \\url{https://anonymous.4open.science/r/OT-flow-FE8F/}.", "tldr": "", "keywords": ["flow matching; generative model; optimal transport"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/03432f9bc927e0e4ef108570af67c755c7ea36bf.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes to improve the training of Mean Flow models by incorporating optimal transport. Specifically, minibatch OT methods (i.e. computing OT on the empirical distribution represented by the minibatch) define a coupling on the elements of a batch that is used to train the models. Intuitively, this results in straighter trajectories that should be simpler to learn with Mean Flows. Experiments on toy data, MNIST, shapes, and paired image-to-image translation are presented."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Clear presentation of mathematics and motivation\n- Good overview of relation to previous work\n- Proposes a natural - yet novel - idea.\n- A diverse set of experiments is performed and some improvements are shown"}, "weaknesses": {"value": "- While a natural idea, the method has limited novelty.\n- The experiments are limited: MNIST is still a toy data and it is only performed on a latent space of size 4x4x4. All improvements are paid for by significant longer training times per epoch. Therefore, it is unclear how much the use of the OT coupling is really useful here."}, "questions": {"value": "Typos/comments:\n- Abstract, first word: Flow-matching -> Flow matching\n- Page 3: “and introduces stochasticity into the model”. It does not introduce further stochasticity and I would remove that comment.\n\nMissing references:\n- Introduction: Mean Flow is equivalent to Flow Map Matching [1] and they should be cited together\n\n[1] https://arxiv.org/abs/2406.07507"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "srylIZDGFO", "forum": "GlHoWr8JMm", "replyto": "GlHoWr8JMm", "signatures": ["ICLR.cc/2026/Conference/Submission9890/Reviewer_3Yge"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9890/Reviewer_3Yge"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9890/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760557424656, "cdate": 1760557424656, "tmdate": 1762921354011, "mdate": 1762921354011, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes optimal transport MeanFlow (OT-MF), which integrates OT-based sampling with the MeanFlow framework for one-step generative modeling. The training samples obtained via OT couplings (e.g., Sinkhorn or Linear OT) exhibit geometrically straighter trajectories compared to independent Gaussian-data pairs. This coupling strategy, when combined with the time-averaged MeanFlow formulation, can reduce inference steps while preserving the fidelity of the multi-step flow process. Experiments on diverse modalities (image generation, image-to-image translation, and point cloud generation) demonstrate that proposed method shows improved sample quality, faster inference, and better trajectory alignment compared to vanilla MeanFlow."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 1}, "strengths": {"value": "- The proposed combination of OT and MeanFlow is well-motivated to improve trajectory straightness and sampling efficiency.\n- The paper provides comprehensive background and related work on Flow Matching, OT-based methods, and MeanFlow.\n- Experiments are conducted on diverse tasks and demonstrate consistent improvements in sample quality and efficiency.\n- Incorporation of scalable OT solvers enhances computational overhead without major performance loss."}, "weaknesses": {"value": "- Novelty is weak. The main idea (combining existing OT-based coupling with MeanFlow) is conceptually straightforward. While effective, it primarily extends prior techniques rather than introducing a fundamentally new theoretical framework.\n- The proposed method still fails to accurately capture the data distribution, even in a simple 2D toy dataset (Figure 2).\n- (Minor comment) The qualitative difference between MF and OT-MF is subtle in Figure 1 illustration. Using multiple (x0, x1) trajectories or average path visualizations could better highlight the ‘trajectory straightening’ effect."}, "questions": {"value": "- The proposed method primarily combines two existing ideas, OT-based flow matching and MeanFlow. Beyond this integration, is there any novel algorithms, theoretical contribution, or architectural enhancement introduced in the paper?\n- In Table 1, why does Sinkhorn OT often outperform the proposed OT-MF in terms of Wasserstein-2 distance?\n- Is this method still effective in higher-dimensional or sequential generative tasks, such as audio synthesis or text-to-video generation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "qRS4jjHq02", "forum": "GlHoWr8JMm", "replyto": "GlHoWr8JMm", "signatures": ["ICLR.cc/2026/Conference/Submission9890/Reviewer_khDK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9890/Reviewer_khDK"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9890/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761643696277, "cdate": 1761643696277, "tmdate": 1762921353704, "mdate": 1762921353704, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes integrating the Minibatch OT coupling into Mean Flow training. To ensure the training efficiency, various OT computation methods are adopted, including Sinkhorn, Linear OT, and etc. The proposed method is evaluated on image generation (MNIST), shape-conditioned reconstruction (ShapeNet Chairs and ModelNet10), and image-to-image translation (FFHQ), demonstrating improvements over Mean Flow across these tasks."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Extending Mean Flow with Minibatch OT coupling seems to be an interesting approach to improve one-step generative models by leveraging the demonstrated effectiveness of Minibatch OT.\n- Various experiments have shown that the introduction of OT coupling can improve the generation quality.\n- The writing and presentation of the manuscript are overall clear and easy to follow."}, "weaknesses": {"value": "However, with regard to the current manuscript, I still have several major concerns:\n\nLimited Novelty: This work primarily combines Mean Flow (Geng et al. 2025) with Minibatch OT (Pooladian et al., 2023; Tong et al., 2023a). Since minibatch OT approaches have been thoroughly explored and proven effective, it is unsurprising that they improve generation quality over Mean Flow. The contribution to the research community appears limited. \n\nThat said, a thorough evaluation justifying the necessity of Minibatch OT for Mean Flow could still be a valuable contribution. However, I have several questions about the current evaluation. \n\nEvaluation Tasks: The evaluation tasks do not follow standard protocols. The original Mean Flow paper uses ImageNet 256×256, a standard benchmark for image generation. This work evaluates only on MNIST for image generation, making it unclear whether the conclusions hold at scale. For 3D shape generation, the choice of a reconstruction task (using the input shape as conditioning) is unclear when unconditional generation could be evaluated instead, following the protocol in LION [A]. \n\nEvaluation Baselines: The manuscript primarily compares against Mean Flow alone. However, various works have explored techniques for accelerating inference, including adversarial distillation, consistency models, and shortcut models. The current evaluation does not include comparisons with these baselines."}, "questions": {"value": "Overall, I recommend rejection due to limited novelty and insufficient evaluation. The work primarily combines existing techniques (Mean Flow and Minibatch OT) in a straightforward manner, yielding expected rather than surprising improvements. The experimental evaluation uses non-standard benchmarks (MNIST instead of ImageNet 256×256, reconstruction tasks instead of unconditional generation) and lacks comparisons with relevant baselines such as adversarial distillation, consistency models, and shortcut models. A substantially revised submission with comprehensive benchmarking on standard tasks and comparisons against the broader landscape of one-step generation methods would be necessary to assess the true contribution of this work.\n\nBased on these, I have the following questions:\n- The evaluation for image generation is limited to MNIST, while the original Mean Flow paper demonstrates results on ImageNet 256×256, which is a standard benchmark in the field. Can you provide experiments on ImageNet 256×256 to demonstrate that OT-MF's improvements generalize to high-resolution, complex image generation tasks? Without this evaluation, it remains unclear whether the benefits of incorporating OT coupling hold at scale.\n- The manuscript primarily compares OT-MF against Mean Flow. However, there are several other approaches for one-step or few-step generation, including adversarial distillation methods, consistency models, and shortcut models. Can you include comparisons with these baselines to better contextualize OT-MF's performance relative to the broader landscape of accelerated generative modeling techniques? This would help clarify the practical advantages of your approach."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "53KM6Eo25v", "forum": "GlHoWr8JMm", "replyto": "GlHoWr8JMm", "signatures": ["ICLR.cc/2026/Conference/Submission9890/Reviewer_UiSG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9890/Reviewer_UiSG"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9890/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761757105049, "cdate": 1761757105049, "tmdate": 1762921353448, "mdate": 1762921353448, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper integrates optimal transport and mean flows for better one and few steps generation with geometry-aware learning. The author claims the unified framework performs efficiently on few different downstream tasks such as toy example, image generation, point cloud generation and image-to-image translation."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.The paper is well written and easy to follow.\n2.The paper leverages OT coupling mechanisms and mean flows on the training objective to enforce globally optimal source–target alignments, leading to straighter and more stable transport trajectories. \n3.The work achieved good quality performance in multiple tasks with few step generation."}, "weaknesses": {"value": "1.Limited novelty and incremental improvement: The main contribution lies in combining established OT techniques with mean flows. The paper lacks new theoretical developments or formal analysis to differentiate it from prior OT-regularized flow-matching approaches. The authors are encouraged to clarify what is theoretically or algorithmically new beyond the combination itself.\n2.Incomplete baselines of one/few steps generation: The authors achieved better performance compared to meanflow and other OT techniques but the lack of comparison with recent one/few steps SOTA generative models limits the impact of the proposed framework. Models such as consistency/distillation models or few step-diffusion or flow matching baselines are not cited or discussed [1,2,3].\n3. Lack of hyperparameter analysis: The paper does not discuss how the hyperparameters (e.g. batch size, learning rate and etc) are selected. The  paper should explain the procedure or tuning strategy of the models prior to the experiments.\n\nReferences:\n[1] Song, Yang, et al. \"Consistency models.\" (2023).\n[2] Meng, Chenlin, et al. \"On distillation of guided diffusion models.\" Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2023.\n[3] Sauer, Axel, et al. \"Adversarial diffusion distillation.\" European Conference on Computer Vision. Cham: Springer Nature Switzerland, 2024."}, "questions": {"value": "note the weakness above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "HSiGG7BvH7", "forum": "GlHoWr8JMm", "replyto": "GlHoWr8JMm", "signatures": ["ICLR.cc/2026/Conference/Submission9890/Reviewer_nBX3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9890/Reviewer_nBX3"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9890/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761984696195, "cdate": 1761984696195, "tmdate": 1762921353170, "mdate": 1762921353170, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}