{"id": "gNwi9SW3D3", "number": 6232, "cdate": 1757960453830, "mdate": 1759897927821, "content": {"title": "Breaking the Cloud Barrier: Local Deployment of Conversational LLMs for Real Time NPC Interaction in Video Games", "abstract": "This paper explores the integration of a locally hosted Large Language Model (LLM), with Speech-to-Text (STT) and Text-to-Speech (TTS) systems within a real-time, open-world 3D video game produced on Unreal Engine 5. The research evaluates two primary aspects: the computational performance of AI processing on CPU versus GPU configurations and the impact of low-latency AI interactions on player engagement and immersion. Performance benchmarks are conducted to analyze system resource utilization, latency, and frame stability, while user experience assessments gauge the AI companion’s effectiveness in enhancing gameplay dynamics. The results provide insights into the feasibility of offline-AI-driven NPCs, highlighting the trade-offs in computational efficiency and real-time interaction quality. This study provides a practical framework for real-time, offline AI driven game mechanics, enabling immersive and private interactions without cloud infrastructure.", "tldr": "This work demonstrates a locally deployed AI companion system integrating speech recognition, fine-tuned language models, and speech synthesis to enable real-time, privacy-preserving NPC interactions in high-fidelity game environments.", "keywords": ["Representation Learning", "Multimodal Learning", "Speech Processing", "Natural Language Processing", "Offline AI Systems", "Real-Time Interaction"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c84e9f8ba61704f82c2ada165c538e48016b8a6e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents a fully offline, locally hosted AI NPC interaction pipeline for real-time use in 3D video games, integrating speech recognition (OpenAI Whisper), a fine-tuned 1.1B LLM (TinyLlama), and text-to-speech (Kokoro TTS) on consumer-grade hardware within Unreal Engine 5. The paper aims to provide a practical foundation for privacy-preserving, cloud-independent conversational NPCs in games.\n\n**Notably, the submission does not follow the official ICLR 2026 template**. Authors are expected to strictly adhere to the conference formatting guidelines to ensure fairness and consistency in the review process."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "Systematic Integration and Engineering: The work provides a clear, thorough description of a fully offline speech-to-NPC pipeline, detailing each system component (STT, LLM, TTS, networking) and their integration into a popular commercial game engine (Unreal Engine 5)."}, "weaknesses": {"value": "Limited Novelty Beyond Integration: While the engineering integration is strong, there is minimal algorithmic or theoretical innovation beyond assembling existing techniques (Whisper, TinyLlama, LoRA, GGUF quantization, Kokoro TTS). The main novelty lies in system assembly and evaluation within a game context. There are no clear new insights on learning representations, dialog modeling, or interaction paradigms."}, "questions": {"value": "I recommend the authors to revise the formatting and increase innovation related to AI."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "3vQQaFXLXX", "forum": "gNwi9SW3D3", "replyto": "gNwi9SW3D3", "signatures": ["ICLR.cc/2026/Conference/Submission6232/Reviewer_15u3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6232/Reviewer_15u3"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission6232/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761034142553, "cdate": 1761034142553, "tmdate": 1762918559691, "mdate": 1762918559691, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper's format, structure, and academic rigor are entirely unsuitable for submission to ICLR. The work reads more like a technical report, a project showcase, or a blog post rather than a rigorous academic research paper."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "Well, courageous～"}, "weaknesses": {"value": "Fundamentally Misaligned with Academic Standards: The paper's structure, methodology, experimentation, and writing style fall far short of the requirements for a top-tier conference like ICLR. It lacks the academic rigor and depth expected of a research paper."}, "questions": {"value": "Could the authors provide the detailed hyperparameters used for fine-tuning the LLM, including the LoRA configuration, learning rate, number of training steps, and the specific hardware used?\n\nHow was the \"user experience assessment\" conducted? Were participants recruited? What kind of questionnaires or evaluation methods were used? What were the specific data and results?\n\nHow was the system's latency measured? Does it refer to the end-to-end latency from when the player stops speaking to when the NPC begins to respond, or is it just the LLM inference time? Could you provide more detailed latency distribution data (e.g., mean, 95th percentile)?\n\nThe paper mentions creating a custom dataset of over one million conversational exchanges. Could you detail the construction process, data sources, and quality control methods for this dataset? This sounds like a substantial undertaking, yet its description in the paper is overly brief."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "jno6RDEXTI", "forum": "gNwi9SW3D3", "replyto": "gNwi9SW3D3", "signatures": ["ICLR.cc/2026/Conference/Submission6232/Reviewer_kP1V"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6232/Reviewer_kP1V"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission6232/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761575628098, "cdate": 1761575628098, "tmdate": 1762918559309, "mdate": 1762918559309, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper does not use the template of ICLR. Therefore, I have submitted the desk reject suggestions."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "Please refer to the Summary."}, "weaknesses": {"value": "Please refer to the Summary."}, "questions": {"value": "Please refer to the Summary."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "XXN1F2l2kV", "forum": "gNwi9SW3D3", "replyto": "gNwi9SW3D3", "signatures": ["ICLR.cc/2026/Conference/Submission6232/Reviewer_S6Q3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6232/Reviewer_S6Q3"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission6232/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761911129304, "cdate": 1761911129304, "tmdate": 1762918558908, "mdate": 1762918558908, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}