{"id": "grLklvOJt2", "number": 9759, "cdate": 1758138799389, "mdate": 1763462409120, "content": {"title": "Mitigating Exponential Mixed Frequency Growth through Frequency Selection", "abstract": "Quantum machine learning research has expanded rapidly due to potential computational advantages over classical methods. Angle encoding has emerged as a popular choice as feature map (FM) for embedding classical data into quantum models due to its simplicity and natural generation of truncated Fourier series, providing universal function approximation capabilities. Efficient FMs within quantum circuits can exploit exponential scaling of Fourier frequencies, with multi-dimensional inputs introducing additional exponential growth through mixed-frequency terms.\nDespite this promising expressive capability, practical implementation faces significant challenges. Through controlled experiments with white-box target functions, we demonstrate that training failures can occur even when all relevant frequencies are theoretically accessible. We illustrate how two primary known causes lead to unsuccessful optimization: insufficient trainable parameters relative to the model's frequency content, and limitations imposed by the ansatz's dynamic lie algebra dimension, but also uncover an additional parameter burden: the necessity of controlling non-unique frequencies within the model. To address this, we propose near-zero weight initialization to suppress unnecessary duplicate frequencies. For target functions with a priori frequency knowledge, we introduce frequency selection as a practical solution that reduces parameter requirements and mitigates the exponential growth that would otherwise render problems intractable due to parameter insufficiency. Our frequency selection approach achieved near-optimal performance (median $R^2 \\approx 0.95$) with 78\\% of the parameters needed by the best standard approach in 10 randomly chosen target functions.", "tldr": "We show how to mitigate the exponential parameter scaling of truncated Fourier series in angle-encoded QML by introducing frequency selection and near-zero weights initialization", "keywords": ["Quantum", "QML", "Angle Encoding", "Fourier Series"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/beee0878e6f575d3d6fd31debb1a6a973cf78c52.pdf", "supplementary_material": "/attachment/0466aa89e3748e0749a133fb186014897ebfa4c3.zip"}, "replies": [{"content": {"summary": {"value": "This paper considers quantum machine learning and focuses on the angle encoding problem. Due to practical implementation challenges, such as insufficient trainable parameters relative to the model’s frequency content and the ansatz’s dynamic Lie algebra dimension, the paper proposes near-zero weight initialization to suppress unnecessary duplicate frequencies, along with frequency selection as a practical solution. The experimental results demonstrate the effectiveness of the proposed approach."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This paper is well-written. It proposes that near-zero weight initialization can address the model’s frequency content and limitations. Furthermore, the paper introduces a frequency selection method to provide a practical solution."}, "weaknesses": {"value": "The experimental results effectively illustrate the contributions, but I still have doubts about the practical applicability. How to extend the method to 2D should be clearly illustrated. Furthermore, regarding the dataset, a broader variety of data should be included in the experiments."}, "questions": {"value": "see the weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "DAUR8XsNjr", "forum": "grLklvOJt2", "replyto": "grLklvOJt2", "signatures": ["ICLR.cc/2026/Conference/Submission9759/Reviewer_f1sr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9759/Reviewer_f1sr"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9759/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761992158250, "cdate": 1761992158250, "tmdate": 1762921252223, "mdate": 1762921252223, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper \"Mitigating Exponential Mixed Frequency Growth\", presents an analysis of parameter sufficiency conditions. The paper shows that duplicate frequencies are necessary for function approximation with quantum circuits. Furthermore the paper studies initialization, as well as parameter efficient training for quantum machine learning tasks.\n\nThe paper establishes minimum parameter requirements via the Frequency coverage condition,\nFrequency control condition, and Optimization landscape conditions.\n\nThe paper presents quantum computer simulations, as experiments to back up its findings."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Quantum machine learning can potentially unlock progress leaps in the future."}, "weaknesses": {"value": "- The experimental section is does not reference or is integrated into related work.\n- I am not sure it the approach to quantum machine learning presented here allows for non-linearity, which is common in the deep learning world. \n- Section 5.1 (experimental setup) does not discuss the experimental setup at all. The supplementary finally states the we are looking at simulated quantum computing results from a consumer notebook. I am uncertain. How realistic are these simulations? Will they be useful in the future?"}, "questions": {"value": "- Is there a way to add non-linearity to quantum circuits?\n- Is it possible to run some of these experiments on publicly available machines, i.e. the free tier of IBM-Q?\n- According to the supplementary the optimization runs in Jax, to the best of my knowledge Jax would not run on a quantum computer. Would it even be possible to run this code on an actual machine instead of a simulator? How far is this work away from running on an actual device?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "GzXQC8uo8C", "forum": "grLklvOJt2", "replyto": "grLklvOJt2", "signatures": ["ICLR.cc/2026/Conference/Submission9759/Reviewer_syP8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9759/Reviewer_syP8"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9759/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762119864180, "cdate": 1762119864180, "tmdate": 1762921251911, "mdate": 1762921251911, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the exponential growth of parameters in angle-encoded quantum models, which is exacerbated by mixed-frequency terms in high-dimensional data. Through white-box experiments, the authors identify a novel \"additional parameter burden\" stemming from the need to control a large number of non-unique (degenerate) frequencies. To mitigate this, they first propose a near-zero weight initialization heuristic, which proves effective for 1D problems by suppressing these unnecessary frequencies. Second, for cases where the target spectrum is known a priori, they introduce a \"frequency selection\" algorithm to build a sparse model spectrum that matches the target. This selection method is shown to achieve near-optimal performance in 2D examples while using significantly fewer parameters than standard dense-spectrum model"}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The paper's main strength is its focus on a significant and unresolved problem: the exponential parameter scaling in high-dimensional quantum models, which is a major bottleneck for the field. Its originality lies  in attempting to identify a specific experimental failure (the \"serial unary\" case) and proposing a new \"additional parameter burden\" from non-unique frequencies, which seeks to challenge existing theoretical conditions. The paper's clearest contribution is the experimental demonstration of the \"frequency selection\" algorithm, which shows that a model with a sparse spectrum can achieve high $R^2$ scores on 2D tasks with fewer parameters than dense models. The work is structured with reasonable clarity, providing a review of the theoretical background on Fourier analysis and DLA, and its potential for reproducibility is bolstered by an extensive appendix with detailed circuit diagrams. This \"frequency selection\" component, which demonstrates a practical engineering approach for sparse-spectrum targets, stands as the paper's most tangible result, even as its broader theoretical claims remain unsubstantiated"}, "weaknesses": {"value": "The paper's primary weakness is that its central theoretical claim—the \"additional parameter burden\" from non-unique frequencies—appears to be founded on a single, wrongly interpreted experiment. The \"serial unary\" model's failure is presented as evidence for a novel phenomenon, but this result can be explained by a direct violation of the known \"frequency control condition\" $(p\\geq|Ω|)$, which the authors themselves cite. This experiment's 45 parameters are on a single qubit (Figure 10 in App. C) and are thus not linearly independent, a specific limitation the paper explicitly describes [lines 177-178] but fails to apply to its own key experiment. \n\nThis misinterpretation of a known failure mode as a new theoretical discovery significantly weakens the motivation for the proposed \"near-zero weight initialization\" heuristic. Furthermore, the paper's practical contributions are severely constrained by its own admissions: the \"near-zero init\" is a 1D-only solution that \"could not be replicated for higher dimensional target functions\". \n\nAdditionally the \"frequency selection\" algorithm is practically limited to toy problems, as it \"exploits complete domain knowledge\" of the target spectrum a priori."}, "questions": {"value": "Your paper's most novel theoretical claim, the \"additional parameter burden\" from non-unique frequencies , rests almost entirely on the \"unexpected case\" of the 1D \"serial unary\" model's failure. You state this model, with 45 parameters, satisfies the known requirements $p \\geq |Ω|$ (45 > 25) and $p \\geq dim(g)$ (45 > 3). However, this is a single-qubit architecture (Figure 10). As you correctly state in Section 3, parameters added serially on the same qubit \"fail to generate additional linearly independent Fourier coefficients\".   \n\nQuestion: Can you provide a rigorous calculation or a detailed argument that the 45 parameters in the \"serial unary\" model are, in fact, linearly independent and that $p_{ind} \\geq 25$? If they are not, isn't this model's failure an expected result of violating the known \"frequency control condition\", which would undermine the primary evidence for your \"non-unique frequency\" hypothesis?   \n\nThe \"near-zero weight initialization\" heuristic is presented as a solution to the non-unique frequency burden, but you (commendably) note in Section 6 that these successful 1D results \"could not be replicated for higher dimensional target functions\". This lack of generalizability to 2D is a critical limitation for a paper addressing high-dimensional scaling.   \n\nQuestion: Can you provide any insight into why this heuristic fails to generalize? Does its failure in 2D suggest it is not addressing the hypothesized root cause (the non-unique frequency burden), but is perhaps an artifact of 1-qubit optimization dynamics?\n\nThe \"frequency selection\" algorithm is experimentally robust but is prefaced on \"complete domain knowledge\"  of the target function's frequency spectrum. You suggest this could be obtained via \"classical Fourier analysis\".   \n\nQuestion: For high-dimensional datasets (the paper's core motivation), performing a classical multi-dimensional Fourier transform is itself an exponentially hard, and thus intractable, problem. Could you elaborate on a realistic path to applying this method to high-dimensional, real-world data where the target spectrum is unknown and classically intractable to obtain?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "2m8LSniJ89", "forum": "grLklvOJt2", "replyto": "grLklvOJt2", "signatures": ["ICLR.cc/2026/Conference/Submission9759/Reviewer_fHUG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9759/Reviewer_fHUG"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9759/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762507224683, "cdate": 1762507224683, "tmdate": 1762921251548, "mdate": 1762921251548, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In the manuscript titled \"Mitigating Exponential Mixed Frequency Growth Through Frequency Selection,\" the authors propose a practical approach to address the problem of exponential frequency growth in quantum machine learning. Their main contribution lies in a frequency selection strategy that significantly reduces the number of required parameters. The experimental design is sound, employing white-box target functions (Fourier series with known frequencies) for systematic evaluation, which effectively validates the efficacy of the proposed method. The frequency selection approach achieves comparable performance using only 78% of the parameters required by the best standard method. Finally, I have the following concerns and suggestions:\n\n1. Section 5.3, \"Near-Zero Weight Initialization,\" in the paper states that near-zero weight initialization works well in the 1D case but performs poorly in the 2D case. The authors do not explain why this method deteriorates in higher dimensions—could a more in-depth analysis be provided?   \n2. Section 3.1, \"Multi-Dimensional Extensions and Mixed Frequencies,\" states that \"every frequency in the spectrum requires individual coefficient control...\" but fails to explain why, in quantum circuits, non-unique frequencies necessitate additional trainable parameters. In a classical Fourier series, each frequency component is independent—so why, in a quantum model, must extra parameters be allocated specifically to control non-unique (i.e., duplicate) frequencies? The authors are encouraged to supplement the manuscript with a theoretical analysis of the relationship between frequencies and parameters in quantum circuits, clarifying why controlling non-unique frequencies demands additional parameters.\n3. The practicality of the method presented in the paper relies on prior knowledge of the target function's frequencies, which is often unrealistic in real-world scenarios. The paper does not discuss how to determine the frequencies of the target function in the absence of such prior knowledge. Could the authors provide clarification or suggestions on this aspect?\n4. It is recommended to incorporate a preprocessing step—such as classical Fourier analysis (e.g., the method of Wiedmann et al., 2024, mentioned in the paper)—to extract frequencies, and to compare the performance gap and computational overhead between scenarios with and without prior frequency knowledge. This would help establish a logically complete picture of the method’s applicability.\n5. In Section 4.3, \"Frequency Selection,\" the statement \"By selecting prefactors that deviate from the standard ternary...\" lacks a clear description of the specific strategy for choosing these prefactors, providing only a single example with prefactors 3 and 9. The authors are encouraged to elaborate on this selection methodology.\nIn conclusion, before this paper is accepted for publication, the above-mentioned issues need to be addressed and revised."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The authors propose a practical approach to address the problem of exponential frequency growth in quantum machine learning. Their main contribution lies in a frequency selection strategy that significantly reduces the number of required parameters. The experimental design is sound, employing white-box target functions (Fourier series with known frequencies) for systematic evaluation, which effectively validates the efficacy of the proposed method. The frequency selection approach achieves comparable performance using only 78% of the parameters required by the best standard method."}, "weaknesses": {"value": "1. Section 5.3, \"Near-Zero Weight Initialization,\" in the paper states that near-zero weight initialization works well in the 1D case but performs poorly in the 2D case. The authors do not explain why this method deteriorates in higher dimensions—could a more in-depth analysis be provided?   \n2. Section 3.1, \"Multi-Dimensional Extensions and Mixed Frequencies,\" states that \"every frequency in the spectrum requires individual coefficient control...\" but fails to explain why, in quantum circuits, non-unique frequencies necessitate additional trainable parameters. In a classical Fourier series, each frequency component is independent—so why, in a quantum model, must extra parameters be allocated specifically to control non-unique (i.e., duplicate) frequencies? The authors are encouraged to supplement the manuscript with a theoretical analysis of the relationship between frequencies and parameters in quantum circuits, clarifying why controlling non-unique frequencies demands additional parameters.\n3. The practicality of the method presented in the paper relies on prior knowledge of the target function's frequencies, which is often unrealistic in real-world scenarios. The paper does not discuss how to determine the frequencies of the target function in the absence of such prior knowledge. Could the authors provide clarification or suggestions on this aspect?\n4. It is recommended to incorporate a preprocessing step—such as classical Fourier analysis (e.g., the method of Wiedmann et al., 2024, mentioned in the paper)—to extract frequencies, and to compare the performance gap and computational overhead between scenarios with and without prior frequency knowledge. This would help establish a logically complete picture of the method’s applicability.\n5. In Section 4.3, \"Frequency Selection,\" the statement \"By selecting prefactors that deviate from the standard ternary...\" lacks a clear description of the specific strategy for choosing these prefactors, providing only a single example with prefactors 3 and 9. The authors are encouraged to elaborate on this selection methodology."}, "questions": {"value": "1. Section 5.3, \"Near-Zero Weight Initialization,\" in the paper states that near-zero weight initialization works well in the 1D case but performs poorly in the 2D case. The authors do not explain why this method deteriorates in higher dimensions—could a more in-depth analysis be provided?   \n2. Section 3.1, \"Multi-Dimensional Extensions and Mixed Frequencies,\" states that \"every frequency in the spectrum requires individual coefficient control...\" but fails to explain why, in quantum circuits, non-unique frequencies necessitate additional trainable parameters. In a classical Fourier series, each frequency component is independent—so why, in a quantum model, must extra parameters be allocated specifically to control non-unique (i.e., duplicate) frequencies? The authors are encouraged to supplement the manuscript with a theoretical analysis of the relationship between frequencies and parameters in quantum circuits, clarifying why controlling non-unique frequencies demands additional parameters.\n3. The practicality of the method presented in the paper relies on prior knowledge of the target function's frequencies, which is often unrealistic in real-world scenarios. The paper does not discuss how to determine the frequencies of the target function in the absence of such prior knowledge. Could the authors provide clarification or suggestions on this aspect?\n4. It is recommended to incorporate a preprocessing step—such as classical Fourier analysis (e.g., the method of Wiedmann et al., 2024, mentioned in the paper)—to extract frequencies, and to compare the performance gap and computational overhead between scenarios with and without prior frequency knowledge. This would help establish a logically complete picture of the method’s applicability.\n5. In Section 4.3, \"Frequency Selection,\" the statement \"By selecting prefactors that deviate from the standard ternary...\" lacks a clear description of the specific strategy for choosing these prefactors, providing only a single example with prefactors 3 and 9. The authors are encouraged to elaborate on this selection methodology."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fI5hjauNfK", "forum": "grLklvOJt2", "replyto": "grLklvOJt2", "signatures": ["ICLR.cc/2026/Conference/Submission9759/Reviewer_7UiP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9759/Reviewer_7UiP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9759/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762593676398, "cdate": 1762593676398, "tmdate": 1762921251157, "mdate": 1762921251157, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}