{"id": "GuncMyZ3uN", "number": 22348, "cdate": 1758329920181, "mdate": 1759896871195, "content": {"title": "Filtering with Confidence: When Data Augmentation Meets Conformal Prediction", "abstract": "With promising empirical performance across a wide range of applications, synthetic data augmentation appears a viable solution to data scarcity and  the demands of increasingly data-intensive models. Its effectiveness  lies in expanding the training set in a way that reduces estimator variance while introducing only minimal bias. Controlling this bias is therefore critical: effective data augmentation should generate diverse samples from the same underlying distribution as the training set, with minimal shifts. In this paper, we propose conformal data augmentation, a principled data filtering framework that leverages the power of conformal prediction to produce diverse synthetic data while filtering out poor-quality generations with provable risk control. Our method is simple to implement, requires no access to internal model logits, nor large-scale model retraining. We demonstrate the effectiveness of our approach across multiple tasks, including topic prediction, sentiment analysis, image classification, and fraud detection, showing consistent performance improvements of up to 40\\% in $F_1$ score over unaugmented baselines, and 4\\% over other filtered augmentation baselines.", "tldr": "We propose conformal data augmentation, a lightweight filtering method that keeps only high-quality synthetic samples with provable guarantee.", "keywords": ["synthetic data; data augmentation; conformal prediction; conditional conformal prediction;"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/8dd0feb4007aed391f8c76fd627685cd0c621df3.pdf", "supplementary_material": "/attachment/491a4c1899aa1829cd6e33e65aa8dede03a0d674.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes the use of conformal risk control for the calibration of a threshold used in the selection of synthetic data produced by a generative model. Leveraging the conditional coverage framework of Gibbs et al, the authors prove that, under some assumptions, the model provides some guarantees on the conditional probability of accepting low-quality samples."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The application of conformal risk control to the problem of filtering synthetic data is interesting and timely.\n\nThe submission provides interesting experimental results to validate the main ideas."}, "weaknesses": {"value": "The problem at hand appears to be more naturally addressed via conformal alignment (NeurIPS 2024). With conformal alignment, one can directly control the fraction of \"unaligned\" accepted data points. \n\nThe theoretical guarantees in Lemma 1 rely on an assumption of monotonicity for the loss function. It is unclear when this assumption is verified. If it is not verified, then the guarantee in the Lemma do not hold.\n\nThe approach proposed in Section 3.3 does not seem to have any performance guarantees. It is thus unclear why the authors assume unbiasedness for the surrogate measure. \n\nThe experimental results do not always show consistent and sizable gains for the proposed approach."}, "questions": {"value": "1) How does the proposed method compare to a direct application of conformal alignment? \n\n2) Under what conditions does Lemma 1 hold? How do these conditions compare to the validity of conformal alignment?\n\n3) Under what conditions on the surrogate measure can one prove performance guarantees?\n\n4) Can you please summarize quantitative conclusions regarding the benefits of the proposed filtering method?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "cDcIbXeRBP", "forum": "GuncMyZ3uN", "replyto": "GuncMyZ3uN", "signatures": ["ICLR.cc/2026/Conference/Submission22348/Reviewer_wGSk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22348/Reviewer_wGSk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22348/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760524455581, "cdate": 1760524455581, "tmdate": 1762942178800, "mdate": 1762942178800, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a conformal data augmentation pipeline that generates synthetic samples, scores them with a cheap proxy model, and then uses a conformal calibration step to choose per-example acceptance thresholds so that only “high-quality” generations are kept with a bounded risk of admitting bad ones."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Importance of the problem tackled: data augmentation is of great importance in practice, and this paper addresses an important problem, which is the quality of the synthetic data.\n\nPrincipled filtering: the CP pipeline provides more guarantees than heuristics based on similarities. The method is also interesting given than it provides per sample thresholds.\n\nExperiments across different modalities: the paper proposes experiments across three different modalities (text, tabular, vision).\n\nPresentation: the paper is well written and easy to read."}, "weaknesses": {"value": "Theoretical guarantees and calibration: the paper claims “provable risk control”, but it does not report empirical calibration metrics (for example violation rate of allowing at most rho bad generations) on held-out data. This would be informative to study the risk control.\n\nSurrogate assumption: Section 3.3 assumes that a noisy surrogate signal is an unbiased estimator of a latent true quality function A. This seems to be a strong assumption. The authors should justify when this assumption is expected to hold and provide experiments quantifying the bias between the surrogate and the “true” notion of quality.\n\nHigh-temperature generation motivation: the introduction frames the problem as safely exploiting high diversity high temperature generation, but the experiments do not analyze temperature (there are no sweeps over generation temperature, no demonstrations that naive high-temperature augmentation hurts and that their method fixes this problem).\n\nDomain shift / generalization: while not essential, it would be informative to have results on OOD or cross-domain evaluation, as this would be a nice example for why high temperature /diversity would be needed (and why curation might be needed as well)"}, "questions": {"value": "Can the authors report empirical violation rates of their conformal guarantee with a held out dataset?\n\nCan they also report results in a high temperature setting that they mention in the introduction?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "IksrZaDWAI", "forum": "GuncMyZ3uN", "replyto": "GuncMyZ3uN", "signatures": ["ICLR.cc/2026/Conference/Submission22348/Reviewer_e85B"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22348/Reviewer_e85B"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22348/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761565135709, "cdate": 1761565135709, "tmdate": 1762942178534, "mdate": 1762942178534, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a synthetic data augmentation algorithm equipped with a conformal prediction filter. Experimental results demonstrate that this filtering strategy outperforms both the unaugmented baseline and other filtering methods. However, the study has notable limitations: the comparison methods are outdated, the experiments are confined to small-scale settings, and the performance improvements achieved are marginal."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed conformal prediction filter has theoretical support and detailed explanations.\n2. CondCP can be used for multiple tasks and different data types, including text, images, and tabular data."}, "weaknesses": {"value": "1. In the LLM-augmented scenario, the authors treat Gemini-2.5-pro as an oracle and Gemini-2.5-flash as a lower-cost surrogate. However, synthetic data augmentation is not a scenario where efficiency is critical. If a superior judge model is already available, there is no need for a proxy. This raises a question: is it necessary to design such a complex framework? If the authors aim to highlight CondCP’s annotation efficiency, they would be advised to compare the GPU hours consumed by each component in detail, including synthetic data generation, quality evaluation, and downstream model training.\n2. The experiments are limited to small-scale datasets, and the comparison methods are relatively outdated (e.g., SMOTE, published in 2002). Notably, comparisons with GenAI-based synthetic data augmentation methods are missing.\n3. The improvements are marginal in some scenarios. For example, in the imbalanced classification task on MNIST 7, CondCP only achieves a 0.2% F1-score improvement over the unaugmented baseline and lags behind in other metrics.\n4. The literature review lacks coverage of relevant works. For instance, GenDataAgent [1] also introduces principles of diversity and in-distribution principles for synthetic data augmentation.\n5. There are several typos and errors in the paper. For example, in Line 331, Gemini-2.5-pro was released in 2025, and the authors should cite its latest technical report [2].\n\n[1] GenDataAgent: On-the-fly Dataset Augmentation with Synthetic Data, ICLR, 2025.\n\n[2] Gemini 2.5: Pushing the Frontier with Advanced Reasoning, Multimodality, Long Context, and Next Generation Agentic Capabilities, 2025."}, "questions": {"value": "1. CondCP requires a more powerful judge model (e.g., in the LLM-augmented scenario). However, if we already have access to such a powerful oracle, why not directly solve the task using this judge model? In that case, would there still be a need to train another model with synthetic data augmentation?\n2. For other questions, please refer to the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "h0tGtPzUeL", "forum": "GuncMyZ3uN", "replyto": "GuncMyZ3uN", "signatures": ["ICLR.cc/2026/Conference/Submission22348/Reviewer_AWXm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22348/Reviewer_AWXm"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22348/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761717347639, "cdate": 1761717347639, "tmdate": 1762942178285, "mdate": 1762942178285, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies the problem of data augmentation with synthetic data. The authors propose leveraging conformal prediction to filter out low-quality synthetic samples, thereby improving model performance. The approach builds on the framework of Gibbs (2025), \"Conformal Prediction with Conditional Guarantees.\" The paper provides experiments across text, image, and tabular data, and shows improved performance when applied."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "*   **S1:** The paper introduces a principled method for filtering synthetic data using conformal prediction. Specifically, the authors employ the conditional conformal approach of Gibbs (2025), enabling instance-adaptive filtering rather than relying on a global threshold.\n*   **S2:** As a result of utilizing conformal prediction, the method is model-agnostic and requires no access to the model’s internal logits.\n*   **S3:** The experiments are diverse and demonstrate improved performance across multiple domains. \n* **S4:** The paper is clearly written."}, "weaknesses": {"value": "*   **W1:** The paper lacks an analysis of sensitivity to the choice of hyperparameters, such as $\\alpha$ and $\\rho$. It would be helpful to discuss their effects and empirically demonstrate it.\n*   **W2:** The authors did not report the loss of the remaining (not filtered) synthetic samples, which could empirically illustrate that the proposed approach controls the risk.\n*   **W3:** The method’s effectiveness heavily depends on the quality of the surrogate scores, but this aspect is not discussed (or perhaps I missed it)."}, "questions": {"value": "1. Could the authors justify the use of the margin $|p(y∣x)−0.5|$ as a filtering score in the image task, given that it does not provide a meaningful ranking of samples?\n2. Given the formulation in Section 3.3 and the way this section is presented, where the gold-standard score $A$ is unavailable and a learned surrogate $\\hat{A}$ is used instead, I would have expected a corollary or lemma characterizing how the risk-control guarantees are affected under this approximation. Could the authors provide a theoretical result for this case (which I believe is quite straightforward), or is this extension intended as a heuristic only?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "d7d9YWABNO", "forum": "GuncMyZ3uN", "replyto": "GuncMyZ3uN", "signatures": ["ICLR.cc/2026/Conference/Submission22348/Reviewer_RqAx"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22348/Reviewer_RqAx"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22348/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761858144378, "cdate": 1761858144378, "tmdate": 1762942178057, "mdate": 1762942178057, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}