{"id": "Gyy6clUUHD", "number": 16153, "cdate": 1758260733107, "mdate": 1759897257826, "content": {"title": "Trustworthy Retrosynthesis: Eliminating Hallucinations with a Diverse Ensemble of Reaction Scorers", "abstract": "Retrosynthesis is one of the domains transformed by the rise of generative models, and it is one where the problem of nonsensical or erroneous outputs (hallucinations) is particularly insidious: reliable assessment of synthetic plans is time-consuming, with automatic methods lacking. In this work, we present RetroTrim, a retrosynthesis system that successfully avoids nonsensical plans on a set of challenging drug-like targets. Compared to common baselines in the field, our system is not only the sole method that succeeds in filtering out hallucinated reactions, but it also results in the highest number of high-quality paths overall. The key insight behind RetroTrim is the combination of diverse reaction scoring strategies, based on machine learning models and existing chemical databases. We show that our scoring strategies capture different classes of hallucinations by analyzing them on a dataset of labeled retrosynthetic intermediates. To measure the performance of retrosynthesis systems, we propose a novel evaluation protocol for reactions and synthetic paths based on a structured review by expert chemists. Using this protocol, we compare systems on a set of 32 novel targets, curated to reflect recent trends in drug structures. While the insights behind our methodology are broadly applicable to retrosynthesis, our focus is on targets in the drug-like domain. By releasing our benchmark targets and the details of our evaluation protocol, we hope to inspire further research into reliable retrosynthesis.", "tldr": "We built RetroTrim, a retrosynthesis system that combines ML scoring with retrievals to filter out hallucinated reactions, yielding more reliable synthetic routes on drug-like targets.", "keywords": ["Trustworthy ML", "Reliable AI", "Robustness", "Computer-Aided Synthesis Planning (CASP)", "Retrosynthesis", "Reaction Feasibility", "Graph Neural Networks", "Transformer Models"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/58120815513f7a1ba866de7c918fcac99a5ac7c9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The authors propose a post-processing approach for retrosynthesis model outputs that employs three filters, which are then integrated into a meta-filter to refine and eliminate implausible reactions."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The method is well-motivated and logically structured.\n- The approach effectively incorporates substantial human chemical expertise."}, "weaknesses": {"value": "### **Major Comments**\n1. **Scope of Hallucination Types**  \n   The abstract claims that the method can “capture different classes of hallucinations.” However, in the main paper, only one type—*Nonsense* hallucinations—is addressed. The authors should clarify whether other classes were considered or provide justification for focusing only on one type.\n\n2. **Claim of Avoiding All Hallucinations**  \n   The claim that RetroTrim “avoids all hallucinated reactions” appears overstated. Figure 4 suggests that the outcome heavily depends on the threshold and likely other hyperparameters. The authors should discuss how recall and precision are balanced to produce the results in Table 3—for example, how the threshold value is selected, and what trade-offs exist between filtering false positives and removing valid reactions.\n\n3. **Design and Normalization of RP Scores**  \n   The rationale behind the design choices for the reaction plausibility (RP) metrics requires clarification. Why is \\( S_{RP} \\) normalized by \\(\\sqrt{T}\\), while \\( S_{RC}\\) is normalized by \\(T\\)? How were these normalization schemes determined? Furthermore, practical guidance on how to choose the parameters \\(\\alpha\\), \\(\\beta\\), and \\(\\gamma\\) would improve the applicability of the method.\n\n4. **Dataset Reproducibility**  \n   Although the Pistachio dataset offers advantages over USPTO, it is proprietary and not publicly accessible, which limits reproducibility. The authors are encouraged to also evaluate their method on the USPTO dataset to enhance comparison and ensure open benchmarking.\n\n5. **Missing Reference in Figure 3**  \n   The caption of Figure 3 mentions “Our generator w/o scorer,” but this variant does not appear in the figure. Please verify and correct the figure or the caption.\n\n---\n\n### **Minor Comments**\n- Some reference formatting issues exist (e.g., missing brackets in lines 73, 318, 319).  \n- Text in Figures 5 and 6 is too small to read and should be enlarged for clarity."}, "questions": {"value": "see weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "uwDACbrLQQ", "forum": "Gyy6clUUHD", "replyto": "Gyy6clUUHD", "signatures": ["ICLR.cc/2026/Conference/Submission16153/Reviewer_38oB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16153/Reviewer_38oB"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16153/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761553353679, "cdate": 1761553353679, "tmdate": 1762926322186, "mdate": 1762926322186, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Single-step predictions in multi-step retrosynthesis often accumulate false positives because single-step models remain imperfect (typical top-1 ≈60%). To assess true multi-step accuracy, this paper presents RetroTrim, an evaluation protocol that scores each proposed reaction by combining machine-learning models with reaction databases. At its core is a Reaction Prior scorer, complemented by two additional scorers tailored to distinct error modes. These three signals are then aggregated into a Meta-Scorer that delivers a robust, final judgment of reaction correctness for each step—and, by extension, the overall route."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper tackles a real deficit in multi-step retrosynthesis evaluation. It highlights that single-step models are not oracles (typical top-1 ≈60%) and that search success rate is an unreliable metric. The work introduces a new evaluation metric specifically designed to address these shortcomings.\n\n2. The study validates the proposed metric(s) with expert assessment, reducing reliance on potentially biased or error-prone model signals."}, "weaknesses": {"value": "1. The conceptual rationale behind the proposed metrics (Reaction Prior Score etc.) is not fully articulated, making it hard to understand why they should correlate with true reaction correctness.\n\n2. The sample set used for assessment is small, weakening the statistical confidence in the method’s reported accuracy and robustness. 4500 reactions and 32 samples are not enough. \n\n3. The work does not compare against standard molecule synthesizability indicators (e.g., SA score), leaving open whether the metric adds value beyond established proxies."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "xebHiXMx1o", "forum": "Gyy6clUUHD", "replyto": "Gyy6clUUHD", "signatures": ["ICLR.cc/2026/Conference/Submission16153/Reviewer_qjSH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16153/Reviewer_qjSH"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16153/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761603665620, "cdate": 1761603665620, "tmdate": 1762926320810, "mdate": 1762926320810, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a practical method to reduce hallucination rate and increase robustness of a retrosynthesis system by employing a combination of three complementary filters. The authors design each filter carefully and in a way that makes sense for the domain, show they are all helpful but complementary, and finally demonstrate that on their test set the combined filter removes all hallucinated predictions while maintaining a high solve rate."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "**(S1)**: Hallucinated single-step predictions are a big issue in retrosynthesis systems. The approach designed by the authors is highly practical, and precisely targets the largest obstacle to real-world adoption for many existing retrosynthesis frameworks. Each of the three filters is designed in a way that builds on top of what worked in prior work, but extending those substantially.\n\n**(S2)**: Authors set out to collect a dataset of chemist-annotated single-step predictions, which they then use to calibrate and evaluate their filters; this is precisely the right approach in my opinion. The dataset they generate is also fairly large given the context (and would be highly useful if released to the community).\n\n**(S3)**: Experiments convincingly show that the filters are complementary, and using a combination of them is highly effective in increasing the robustness of the pipeline."}, "weaknesses": {"value": "**(W1)**: There are some aspects of this work that are not clear to me:\n\n- **(W1a)**: Authors explain that synthetic negative reactions are generated by applying random templates in both forward and backward direction. For the forward direction, this is standard; applying a random template to reactants from the dataset can be assumed to produce a negative reaction as long as the product differs from the one recorded in the data (this hinges on the assumption that a given set of reactants can only react to produce one potential product, which is not necessarily true due to missing conditions and reagents, but approximately this assumption would hold in most cases). However, for the backward direction, how to guarantee that the proposals are not valid ways of synthesizing the given product? Are the backward-generated synthetic negatives only accepted if they then fail round-trip with a forward model?\n\n- **(W1b)**: Every score that is part of RP uses a different normalization (e.g. dividing by number of summed probabilities vs by the square root of that number). Is there an intuition behind this, or was this simply determined empirically to maximize the predictive power of each score?\n\n- **(W1c)**: What does \"reaction count within the candidate reaction’s coarse-grained cluster and fine-grained cluster\" mean? Are the authors referring to former or latter? I suppose one could also read this as intersection of coarse-grained and fine-grained, but I assume the latter is a subset of the former.\n\n- **(W1d)**: In Section 3.5, authors mention a \"BART generator\" is used as the single-step model, yet later it seems RootAligned was their default choice?\n\n- **(W1e)**: Authors mention a subset of the chemist-annotated dataset of good/bad single-step model generations will be \"released as a benchmark for the community\". How many reactions/annotations are being released?\n\n- **(W1f)**: In Section 5.2, authors mention the retrosynthetic paths were assigned a confidence score determined by the lowest-scoring reaction within them. However, doesn't this mean a human would have to score the routes generated in this experiment to obtain the confidence score?\n\n---\n\n**Other comments**\n\n**(O1)**: It would be good to relate the results from this work to those from the recent RetroChimera paper [1], which also shows strong results based on ensembling. That work employs an ensemble of complementary single-step models, and shows this significantly improves both coverage and ranking of the proposed reactions. However, although hallucinated predictions are pushed down to lower ranks, and may potentially get truncated out when limiting the number of predictions to include in search, some incorrect reactions still remain (see Extended Data Figures 12-14 in [1]). RetroTrim mirrors these findings, showing ensembling is highly successful also for the case of reaction scorers.\n\n**Nitpicks**\n\n- The use of parentheses around citations is not consistent with common practice. Whenever citation appears as part of the sentence it should not be parenthesized, but if it appears as a remark outside of sentence it should be. There are cases of this throughout the manuscript, e.g. at the beginning of introduction or beginning of Section 2.1.\n\n- Would be nice to also include which version of Pistachio was used (i.e. from which quarter).\n\n- Some parts of equations, e.g. Equation 1, use long words without special formatting, which can make them look a bit unprofessional. I would consider using the `\\texttt` command around words like `reaction` or `ref`.\n\n**References**\n\n[1] \"Chemist-aligned retrosynthesis by ensembling diverse inductive bias models\""}, "questions": {"value": "See the \"Weaknesses\" section above for specific questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "4hCRJ4IC0d", "forum": "Gyy6clUUHD", "replyto": "Gyy6clUUHD", "signatures": ["ICLR.cc/2026/Conference/Submission16153/Reviewer_pA39"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16153/Reviewer_pA39"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16153/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966208851, "cdate": 1761966208851, "tmdate": 1762926319745, "mdate": 1762926319745, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces RetroTrim, a trustworthy retrosynthesis framework designed to eliminate hallucinated reactions. The method integrates three complementary reaction scorers to prune invalid reactions dynamically during multi-step retrosynthetic search. The authors further propose a human expert annotation protocol, defining seven hallucination types and three severity levels. On 32 drug-like benchmark targets, RetroTrim is reported to completely remove hallucinated reactions, outperforming all baselines both in accuracy and the number of valid synthetic routes found."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* The paper focuses on the trustworthiness of synthetic route prediction in retrosynthesis and clearly illustrates the negative impact of hallucinated reactions on the reliability of computational synthesis planning.\n\n* The proposed method mimics the multi-dimensional reasoning process of human chemists when evaluating reaction feasibility, combining both novelty and practical utility.\n\n* The authors establish a well-structured expert annotation protocol, defining explicit error categories and severity levels, which are consistently recognized among annotators.\n\n* The proposed method outperforms all existing baselines across every major metric and shows strong potential for direct integration into existing retrosynthesis platforms."}, "weaknesses": {"value": "* The proposed method increases inference time by approximately 2.3× compared to baseline systems, which may limit its scalability in high-throughput drug discovery pipelines.\n\n* The RRS scorer's reliance on existing reaction precedents could introduce bias against novel yet chemically valid reactions, thereby potentially suppressing creative synthetic pathways.\n\n* The ensemble aggregation is based on a fixed weighted average, lacking adaptive or learnable optimization mechanisms that could further improve robustness.\n\n* While the paper reports pruning efficiency, it does not provide an analysis of the trade-off between hallucination filtering strength and route diversity or completeness."}, "questions": {"value": "* How sensitive is RetroTrim's performance to the choice of the ensemble threshold?\n\n* Among the few reactions that were incorrectly filtered out (\"false negatives\"), what is their chemical nature or common pattern?\n\n* Could the scoring ensemble be integrated end-to-end with the single-step retrosynthesis generator?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "J4VkfiiD6T", "forum": "Gyy6clUUHD", "replyto": "Gyy6clUUHD", "signatures": ["ICLR.cc/2026/Conference/Submission16153/Reviewer_M6L6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16153/Reviewer_M6L6"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16153/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762004975363, "cdate": 1762004975363, "tmdate": 1762926318751, "mdate": 1762926318751, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}