{"id": "h0N5dXe7Dm", "number": 6625, "cdate": 1757990853142, "mdate": 1759897904370, "content": {"title": "Multi-Scale Adaptive Hypergraph Learning for High-Order Brain Connectivity Analysis", "abstract": "Understanding complex interactions between brain regions is critical for early neurodegenerative disease classification such as Alzheimer’s Disease (AD) and Parkinson’s Disease (PD). Graph-based models are typically employed to investigate brain networks with regional features and their interconnectivity. However, traditional approaches primarily focus on pairwise node interactions between directly connected nodes, limiting their ability to capture higher-order dependencies from multiple brain regions. In this regard, we introduce an adaptive multi-scale hypergraph learning framework, i.e., MASH, which constructs hierarchical node representations and dynamically learns high-order interaction via hyperedges to capture the interactions beyond pairwise structural connections. Through extensive experiments on the ADNI and PPMI dataset, we demonstrate the superiority of MASH by improving classification of different disease stages. Our model further identifies key regions of interest (ROIs) and their group-wise interactions from the learned hyperedges that are closely associated with disease progression, highlighting its potential as a powerful tool for brain network analysis with neurodegenerative disorders.", "tldr": "", "keywords": ["Neurodegenerative Disease", "Brain Network Analysis", "High-Order Graph Learning"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d53bffa5a58e048e681bab7dfa94c5aa65c273be.pdf", "supplementary_material": "/attachment/8330692fcf0e0985b05fb3cdb39a6ef1691ea1da.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes MASH (Multi-Scale Adaptive Hypergraph Learning), which couples learnable multi-scale spectral wavelet representations with a learnable hypergraph incidence to capture high-order (group-wise) dependencies in brain networks for disease staging. Experiments on ADNI and PPMI show improved classification and interpretable hyperedges that highlight biologically plausible ROIs."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.The proposed MASH framework effectively integrates multi-scale spectral graph wavelet representations with a learnable hypergraph incidence matrix. This design enables the model to adaptively discover high-order relationships among brain regions while maintaining spectral interpretability.\n2.The authors conduct extensive experiments on two benchmarks (ADNI and PPMI), including classification tasks, ablation studies, sensitivity analyses, and interpretability visualizations. The results demonstrate consistent improvements over strong baselines (e.g., GCN, HGNN, HyperGT, etc.), supporting the robustness and generalizability of the proposed approach.\n3.Beyond performance gains, the paper provides interpretable insights by visualizing learned hyperedges and identifying biologically plausible regions of interest (ROIs). Additionally, it includes theoretical propositions linking spectral scales to hyperedge expansion, which enhances both conceptual clarity and credibility of the model."}, "weaknesses": {"value": "1.The abstract currently motivates the work by stating that “earlier hypergraph methods were designed to overcome the limitations of pairwise relations,” while the actual contribution of this paper is an improvement upon existing hypergraph approaches. The authors should revise the abstract to (a) acknowledge that hypergraphs have already been used to capture higher-order relations, (b) explicitly identify the shortcomings of previous hypergraph methods, and (c) clearly position MASH as addressing these specific limitations.\n2.The final paragraph of the introduction only cites 2016 and 2019 works as examples of “rigid” hypergraph constructions. However, numerous studies from 2020–2025 have proposed dynamic, adaptive, or learnable hyperedges and hyperedge-weight learning. The authors should update the introduction to reflect this recent progress and clearly distinguish MASH from these newer approaches.\n3.In addition, the Related Work section should include representative dynamic/learnable hypergraph studies from 2025 and articulate how MASH differs from them—not only functionally but also in its relevance to brain-network analysis (e.g., scalability, interpretability, or multi-scale spectral modeling).\n4.The experimental comparisons include baselines only up to 2024. Given that several 2025 works on dynamic or learnable hypergraphs have been released, the absence of these methods weakens the empirical credibility. The authors should either add these recent baselines or explicitly justify their exclusion."}, "questions": {"value": "1.The method uses a combination of one low-pass and (J-1) band-pass kernels. Was an ablation study conducted to justify this specific design choice? For instance, what would be the performance impact of using only low-pass or only band-pass kernels across all scales? \n2.The paper claims a key difference from dwHGCN is the dynamic refinement of connectivity patterns rather than just updating hyperedge weights. Could the authors elaborate on this distinction with a more concrete example or analysis? How significant is the performance gain attributable specifically to this dynamic structure learning, as opposed to simply having multiple scales? \n3.The paper presents qualitative visualizations of learned hyperedges and associated ROIs, but does not quantify their significance. Without permutation or bootstrap tests, it is unclear whether the identified ROIs are statistically meaningful or could arise by chance. A quantitative validation (e.g., comparing with random or shuffled hyperedges) would make the interpretability claims more convincing."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "N18MOCUk0b", "forum": "h0N5dXe7Dm", "replyto": "h0N5dXe7Dm", "signatures": ["ICLR.cc/2026/Conference/Submission6625/Reviewer_dwqn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6625/Reviewer_dwqn"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission6625/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761632500868, "cdate": 1761632500868, "tmdate": 1762918944084, "mdate": 1762918944084, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose an adaptive multi-scale hypergraph learning framework named MASH to address the limitations of existing brain network analysis methods in capturing high-order dependencies among multiple brain regions. By constructing hierarchical node features and dynamically learning high-order interactions among hyperedges, MASH captures complex interactions that go beyond pairwise structural connectivity. Extensive experiments demonstrate the effectiveness of MASH."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Solid theoretical foundation. The paper demonstrates considerable theoretical depth and presents a method of notable theoretical novelty.\n2. Comprehensive experiments were conducted to validate the effectiveness of the proposed method. Beyond comparative experiments and ablation studies, the authors also discussed model complexity and provided biological interpretations, offering plausible explanations for the performance improvement from a neuroscience perspective.\n3. The introduction is logically structured, with the research problem clearly articulated by the authors."}, "weaknesses": {"value": "1. The authors claim that \"graph convolution layers indirectly consider high-order interactions at the cost of the oversmoothing problem.\" However, numerous Transformer-based brain network representation learning methods have been proposed — and indeed summarized by the authors in the related work section — which effectively capture long-range dependencies and global graph structural information without suffering from oversmoothing. Could the authors clearly explain why these Transformer-based approaches remain inadequate for capturing high-order associations among brain regions?\n2. The methodology section lacks clarity. Both Adaptive Multi-Scale Feature Filtering and Multi-Scale Hypergraph Structure Learning are crucial components of this work, yet the descriptions of these two modules remain somewhat vague."}, "questions": {"value": "1. Could the authors provide a more detailed explanation of the workflow for Adaptive Multi-Scale Feature Filtering?\n2. Based on the authors' descriptions in lines 132 and 182, where each wavelet basis possesses a specific scale $s$, how was the number of wavelet bases determined? Was the number of scales made learnable within the framework?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "OsGV2hU9tx", "forum": "h0N5dXe7Dm", "replyto": "h0N5dXe7Dm", "signatures": ["ICLR.cc/2026/Conference/Submission6625/Reviewer_UYRR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6625/Reviewer_UYRR"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission6625/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761791938290, "cdate": 1761791938290, "tmdate": 1762918943523, "mdate": 1762918943523, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Existing research primarily focuses on pairwise interactions between nodes and overlooks the challenge of capturing complex dependencies among multiple brain regions. To address this limitation, this paper proposes an adaptive multi-scale hypergraph learning framework. The proposed approach constructs hierarchical node features and dynamically learns high-order interactions through hyperedges. It is claimed that the proposed approach can effectively capture the complex relationships among multiple brain regions."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "S1. The study innovatively introduces multi-scale wavelet coupling to capture how these higher-order dependencies evolve across different scales.\n\nS2. The authors conducted extensive experiments. The results demonstrate both the effectiveness and interpretability of the proposed method."}, "weaknesses": {"value": "S1. This paper focuses on capturing multi-scale high-order relationships in brain graphs. However, the existence of such multi-scale high-order relationships in brain graphs, as well as the precise definition of these relationships, remains unclear.\n\nS2. Ref [1] also employed a hypergraph-based approach to capture high-order relationships in brain graphs. This paper doesn't include a comparison with [1] nor explicitly clarify the differences between the two methods.\n\nS3. The paper’s use of the term “multi-scale” is potentially misleading. In brain network analysis, “multi-scale” typically refers to approaches that construct brain networks for the same subject across different atlases or spatial resolutions [2–4]. The authors should clarify their terminology to avoid any confusion.\n\nS4. Although the authors emphasize the biological significance of hyperedges as \"sets of co-varying ROIs,\" the paper lacks relevant case studies illustrating the key hyperedges learned by the model that possess significant classification power. It remains unclear whether these hyperedges align with known AD/PD-related neural circuits or correspond to clinical outcomes.\n\n[1] Learning High-Order Relationships of Brain Regions. ICML2024.\n\n[2] A mutual multi-scale triplet graph convolutional network for classification of brain disorders using functional or structural connectivity. TMI 2021.\n\n[3] Mamf-gcn: Multi-scale adaptive multi-channel fusion deep graph convolutional network for predicting mental disorder. CBM2022.\n\n[4] A multi-scale multi-hop graph convolution network for predicting fluid intelligence via functional connectivity. BIBM2022."}, "questions": {"value": "Q1. How is the upper limit of the number of hyperedges defined across different datasets?\n\nQ2. How is the initial matrix generated? Is it randomly generated or generated under other constraints? Will different generation methods affect the final performance?\n\nQ3. Is it possible to use other backbone alternatives to the transformer architecture? \n\nQ4. It can be observed that on the PPMI dataset, the performance degradation is most significant when MST is removed. Does this mean that in this method, Transformer contributes more compared to wavelet transform?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "GFS3LEXXCx", "forum": "h0N5dXe7Dm", "replyto": "h0N5dXe7Dm", "signatures": ["ICLR.cc/2026/Conference/Submission6625/Reviewer_TYyY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6625/Reviewer_TYyY"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission6625/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761912671931, "cdate": 1761912671931, "tmdate": 1762918943123, "mdate": 1762918943123, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces MASH, a novel framework for modeling high-order brain connectivity using an adaptive multi-scale hypergraph learning approach. It integrates graph wavelet-based multi-resolution filtering and dynamic hyperedge learning to capture both local and global structural relationships in brain networks. MASH is evaluated on two major neuroimaging datasets ADNI and PPMI demonstrating superior performance over 15 state-of-the-art graph and hypergraph baselines. The model further provides interpretability by identifying key brain regions (ROIs) and their group interactions associated with disease progression."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. Innovative combination of graph wavelet transforms for adaptive multi-scale representation with learned hyperedges for high-order relational modeling.\n2. Comprehensive experiments on two independent, large-scale datasets (ADNI, PPMI). Consistent and statistically significant performance improvements (2–7% absolute gains) across accuracy, precision, recall, and F1-score.\n3. Identifies disease-relevant ROIs (e.g., hippocampus, thalamus, amygdala) with plausible neurological interpretations. Demonstrates hemispheric symmetry and subcortical prominence, aligning with known disease mechanisms."}, "weaknesses": {"value": "1. The combination of multi-scale filtering, dynamic hyperedge construction, and transformer layers may be computationally expensive for larger brain graphs. The paper does not explicitly report runtime or memory overhead compared to baselines.\n2. Evaluation is limited to ADNI and PPMI; additional validation on other disorders or multi-site datasets would strengthen claims of generality. External test sets or cross-study generalization are not explored.\n3. Although ROI identification is discussed, causal or mechanistic interpretations of learned hyperedges are not deeply analyzed. Quantitative validation (e.g., comparison to known biomarkers or clinical scores) is limited."}, "questions": {"value": "1. How does MASH scale computationally with increasing node counts or number of scales (J)? Are there mechanisms to limit the exponential growth of hyperedges?\n2. How stable are the learned hyperedges across folds or random initializations?\n3. Could MASH be adapted to handle temporal dynamics? For example, fMRI data?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FDch6RX7pA", "forum": "h0N5dXe7Dm", "replyto": "h0N5dXe7Dm", "signatures": ["ICLR.cc/2026/Conference/Submission6625/Reviewer_XAdN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6625/Reviewer_XAdN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission6625/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762045977102, "cdate": 1762045977102, "tmdate": 1762918942614, "mdate": 1762918942614, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}