{"id": "Hp2vMoz62H", "number": 15513, "cdate": 1758252178104, "mdate": 1759897301958, "content": {"title": "IgFlow-LM: De Novo Antibody Design via Joint Flow Matching on SE(3) and Protein Language Models Probability Flows", "abstract": "In this work, we present IgFlow-LM, a multi-modal deep generative model for de novo antibody design based on a flow-matching framework that integrates protein language models (PLMs). By learning the joint distribution over SE(3)-equivariant structural flows and PLM-derived probabilistic flows, IgFlow-LM enables the coordinated generation of antibody 3D structures and latent embeddings in the PLM space. Experimental results demonstrate that, in unconditional design, IgFlow-LM generates antibody structures that closely resemble naturally occurring antibodies. The distributions of backbone dihedral angles and PLM embeddings show strong agreement with those of native antibodies. Moreover, the structures generated by IgFlow-LM exhibit smaller deviations from ideal bond lengths and bond angles compared to reference models. Furthermore, we benchmark IgFlow-LM against baseline models on two common conditional complementarity-determining regions (CDRs) design tasks in antibody engineering. Results show that IgFlow-LM achieves superior self-consistency in CDRs design and generates higher sequence diversity within CDR regions compared to baseline approaches, highlighting its potential for producing structurally accurate and diverse antibody variants.", "tldr": "", "keywords": ["antibody", "artificial intelligent", "de novo design", "protein language model"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/20554b69f3affd9519cf4128f08ef3238bee44cb.pdf", "supplementary_material": "/attachment/ca458ae9c575f7b352da7bb429e61f61a05b36e9.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposed a flow-matching-based model for antibody sequence-structure codesign. It consists of a SE(3) equivariant flow matching module for structure generation and a latent flow matching module to generate protein language model embeddings which are then decoded into antibody sequences."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The formulation of sequence-structure joint formulation is natural.\n- Using pretrained protein language models might improve the sequence generation quality."}, "weaknesses": {"value": "- This work overlooked the most of previously published research on generative models for antibody sequence-structure codesign [1,2,3,4,5]. It lacks both discussion and benchmarking.\n- Using the flow matching technique to generate antibody has been explored a lot [1,2,3,5]. Combining diffusion models and protein language models to design antibodies has also been explored [2,6]. Therefore, the core contribution of this work is not novel.\n- The evaluation of this work is mostly limited to comparing the distribution of the model and the datasets (RMSD, Ramachandran, LOGO Plot). There is no metrics that measure the property of the designed antibody (e.g. binding to specific antigens, humanness, etc).\n- The conditional design setting (Section 4.2) is confusing. The section first says the generation is conditioned on the regions other than CDRs, but later it shows DockQ scores. DockQ scores assess the docking quality, so what target is used for docking? Is the antigenic target used as a condition? If so, what is the protocol for docking?\n- Figure 4 and 5 do not convey useful information. Figure 4 shows that tyrosine (Y) dominates the generated antibody CDRs, which is an evidence of the model learning only trivial information. In Figure 5, the data points from Sabdab are smeared. There are no informative patterns shown in the figure.\n\n[1] Antigen-Specific Antibody Design and Optimization with Diffusion-Based Generative Models for Protein Structures. 2022\n\n[2] A Hierarchical Training Paradigm for Antibody Structure-sequence Co-design. 2023\n\n[3] Atomically accurate de novo design of antibodies with RFdiffusion. 2024\n\n[4] GeoAB: Towards Realistic Antibody Design and Reliable Affinity Maturation. 2024\n\n[5] dyAb: Flow Matching for Flexible Antibody Design with AlphaFold-driven Pre-binding Antigen. 2025\n\n[6] Antibody Design Using a Score-based Diffusion Model Guided by Evolutionary, Physical and Geometric Constraints. 2024"}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "sd88YyGsBl", "forum": "Hp2vMoz62H", "replyto": "Hp2vMoz62H", "signatures": ["ICLR.cc/2026/Conference/Submission15513/Reviewer_pKAG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15513/Reviewer_pKAG"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15513/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761611237321, "cdate": 1761611237321, "tmdate": 1762925799416, "mdate": 1762925799416, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "For sequence-structure co-design for de novo antibody, the authors proposed a new IgFlow-LM method that improves the existing IgFlow method by using continuous numerical representations with PLM instead of the discrete flow matching in IgFlow. Experiments showed higher diversity in the generated samples. However, continuous numerical representation PLM has already been used in the existing method, the novelty in terms of methodology seems not significant. I am also not convinced that the generated samples with higher diversity are realistic. Other than diversity, the improvements compared with IgFlow shown in Fig 3 and other tables and figures seem not significant."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "For sequence-structure co-design for de novo antibody, the authors proposed a new IgFlow-LM method that improves the existing IgFlow method by using continuous numerical representations with PLM instead of the discrete flow matching in IgFlow. Experiments showed higher diversity in the generated samples."}, "weaknesses": {"value": "1.\tAs presented in appendix A.1, continuous numerical representation PLM has already been used in the existing method (Ding et al 2019), the novelty in terms of methodology seems not significant.\n2.\tI am not convinced that the generated samples with higher diversity are realistic.\n3.\tOther than diversity, the improvements compared with IgFlow shown in Fig 3 and other tables and figures seem not significant."}, "questions": {"value": "1.\tAs presented in appendix A.1, continuous numerical representation PLM has already been used in the existing method (Ding et al 2019), the novelty in terms of methodology seem not significant.\n2.\tI am not convinced that the generated samples with higher diversity are realistic.\n3.\tOther than diversity, the improvements compared with IgFlow shown in Fig 3 and other tables and figures seem not significant.\n4.\tThe reference of IgFlow is never given.\n5.\tThe meaning of SO(3) and SE(3) should be given. Not all the readers are familiar with these notations."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "azyyo864RP", "forum": "Hp2vMoz62H", "replyto": "Hp2vMoz62H", "signatures": ["ICLR.cc/2026/Conference/Submission15513/Reviewer_W9wW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15513/Reviewer_W9wW"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15513/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761733925351, "cdate": 1761733925351, "tmdate": 1762925798238, "mdate": 1762925798238, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents IgFlow-LM, a novel multi-modal generative model for de novo antibody design. The core contribution is a flow-matching framework that jointly generates the 3D backbone structure of an antibody and its corresponding sequence representation in the continuous latent space of a protein language model (PLM). Specifically, it combines an SE(3)-equivariant flow for the atomic coordinates with a probability flow over the PLM embeddings. The authors claim this joint, continuous approach avoids the limitations of methods that operate on discrete amino acid sequences, leading to generated antibodies with higher sequence diversity, improved structural fidelity, and stronger adherence to biophysical constraints. The authors demonstrate the effectiveness of the mode with two design tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The idea of performing joint flow matching on both the SE(3) manifold for structure and the PLM embedding is simple and an elegant solution to the challenge of co-designing sequence and structure.\n\n2. Experiments demonstrate the efficacy of the proposed method."}, "weaknesses": {"value": "1. The innovation is limited. Adding PLM into a structure-based model is common in many protein-related models. \n\n2. The primary baseline is IgFlow for ablation. The paper would be strengthened by more comprehensive comparisons against other state-of-the-art antibody co-design methods mentioned in the related works. In the evaluation, no sequence diversity is presented.\n\n3. Some descriptions in the paper are not very clear. For example, the model IgFlow is not clearly defined. In table 1, the caption says RFDiffusion, but IgFlow in the table. And the evaluation of DockQ is not clear to me. In lines 407-408, is the framework aligned?"}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "1Yp0yVlP63", "forum": "Hp2vMoz62H", "replyto": "Hp2vMoz62H", "signatures": ["ICLR.cc/2026/Conference/Submission15513/Reviewer_mKqa"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15513/Reviewer_mKqa"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15513/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761809006048, "cdate": 1761809006048, "tmdate": 1762925797854, "mdate": 1762925797854, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes IgFlow-LM, a multimodal generative model for de novo antibody design that unifies SE(3)-equivariant structural flow matching (inspired by FrameFlow) with continuous flow matching in the latent space of a protein language model (PLM)—specifically IgBERT. The method jointly generates 3D backbone structures and PLM embeddings via a shared ODE-based flow-matching framework, followed by a decoder that maps embeddings back to discrete amino acid sequences. The authors evaluate IgFlow-LM on two tasks to validate the effectiveness of the proposed technique."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The integration of PLM latent flows with SE(3) structural flows is conceptually elegant and aligns with recent trends in multimodal protein generative modeling.\n\n2. The paper demonstrates empirical results on structural validity: lower bond/angle deviations, better Ramachandran plot adherence (lower KL divergence), and high self-consistency across multiple folding predictors (ABB2, IgFold, ESMFold).\n\n3. The use of germline-split data partitioning mitigates data leakage, enhancing result credibility."}, "weaknesses": {"value": "1.\tLack of comparison with state-of-the-art diffusion-based PLM-integrated methods: In recent years, numerous works have successfully combined protein language models with diffusion frameworks for antibody design, including AbX, IgGM, and other Model such as DiffAb, dyMEAN, and RFantibody (an antibody-specific adaptation of RFdiffusion. These methods also perform joint or conditional sequence-structure co-design and report strong results on CDR generation, diversity, and structural fidelity. Without head-to-head evaluation on identical metrics and datasets, the performance advantage remains unsubstantiated.\n\n2. Lack of functional validation: Despite claims about improved antigen binding (via DockQ), the docking experiment is based on only 20 antibodies, uses side-chain repacking only on CDRs, and reports high variance (DockQ: 0.47±0.18). Without binding affinity prediction (e.g., via deep learning or Rosetta) or wet-lab validation, functional superiority remains speculative.\n\n3. Computational cost and scalability unaddressed: Flow matching with ODE integration is expensive. The paper does not report generation time, GPU memory usage, or scalability to full-length antibodies (only variable domains). This raises questions about practical utility."}, "questions": {"value": "1. Comprehensive baseline comparison: Could the authors include comparisons with AbX, IgGM, DiffAb, dyMEAN, and RFantibody on the same conditional CDR design tasks using identical metrics (e.g., scRMSD, positional entropy, DockQ, developability scores)? This is essential to establish whether IgFlow-LM offers a genuine advance over current SOTA.\n\n2. Functional relevance: Can the authors provide more robust evidence of improved antigen binding? For example, could they compute binding energy (ΔG) using Rosetta or a deep learning predictor (e.g., ABlooper, DeepAAntibody) on a larger set (≥100 antibodies)?\n\n3. True co-design?: Is the PLM embedding updated during structure generation, or is it fixed from the ground-truth sequence? If fixed, doesn’t this mean the model is essentially doing structure-conditioned sequence generation, not joint co-design?\n\n4.Generalization and robustness: How does IgFlow-LM perform on out-of-distribution antigens or non-canonical CDR lengths? The current test set is derived from SAbDab, which may not reflect therapeutic design scenarios.\n\n5. Efficiency vs. benefit: Please report generation time per antibody and GPU memory consumption. Given the computational overhead of ODE integration, is the marginal gain in diversity/structure worth the cost compared to faster diffusion or inverse folding pipelines?\n\n6. Tyrosine overrepresentation in HCDR3: In Figures 4, the generated HCDR3 sequences show an extreme enrichment of tyrosine (Y), especially at central positions. Is this reflective of the training data, or an artifact of the joint flow-matching objective or decoder bias? Could the authors compare the per-position amino acid frequencies in generated vs. natural HCDR3 (e.g., from SAbDab) to quantify this discrepancy? If Y is overrepresented, does this compromise the model’s capacity to generate non-canonical but functional binders (e.g., those rich in serine, glycine, or charged residues)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "Qhl2i55Yhv", "forum": "Hp2vMoz62H", "replyto": "Hp2vMoz62H", "signatures": ["ICLR.cc/2026/Conference/Submission15513/Reviewer_ABh9"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15513/Reviewer_ABh9"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15513/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762850926547, "cdate": 1762850926547, "tmdate": 1762925797518, "mdate": 1762925797518, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}