{"id": "hwGVfmRxuR", "number": 8966, "cdate": 1758104635539, "mdate": 1759897751262, "content": {"title": "Principled Latent Diffusion for Graphs via Laplacian Autoencoders", "abstract": "Graph diffusion models achieve state-of-the-art performance in graph generation but suffer from quadratic complexity in the number of nodes---and much of their capacity is wasted modeling the absence of edges in sparse graphs. Inspired by latent diffusion in other modalities---a natural idea is to compress graphs into a low-dimensional latent space and perform diffusion there. However, unlike images or text, graph generation demands near-lossless reconstruction, since even a single error in decoding an adjacency matrix can invalidate the entire sample. This challenge has remained largely unaddressed. We propose a latent graph diffusion framework that directly overcomes these obstacles. A permutation-equivariant autoencoder maps each node into a fixed-dimensional embedding from which the full adjacency is provably recoverable, enabling near-lossless reconstruction for both undirected graphs and DAGs. The latent representation scales linearly with the number of nodes---eliminating the quadratic bottleneck and making it feasible to train larger and more expressive models. In this latent space, we train a Diffusion Transformer with flow matching, enabling efficient and expressive graph generation. Our approach is competitive results against prior graph diffusion models, while achieving speed-up ranging from $50\\times$ to $1000\\times$.", "tldr": "We introduce a latent graph diffusion framework that enables near-lossless reconstruction, removes the quadratic bottleneck of standard graph diffusion, and achieves up to $1000\\times$ faster generation while maintaining competitive performance.", "keywords": ["Graph generation", "Latent diffusion"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1897c26181f95902116d4af9f54d0749ed0257a6.pdf", "supplementary_material": "/attachment/ea07dc5e048bcd3746e6a031b2fa57465ed7bfa7.zip"}, "replies": [{"content": {"summary": {"value": "This article proposes a nearly lossless latent graph diffusion method in view of the high complexity limitations of the existing graph diffusion models due to the discrete paradigm. Specifically, considering the strict requirements of graph data for reconstructing encoder-decoder, the authors proposed a Laplacian autoencoder, which was proven to be able to compress graph data into low-dimensional vectors nearly lossless. Then, the author placed it in the framework of stream matching and trained it using DIT. It is worth noting that this method has also been extended to the research in the field of directed graphs generation."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "1.I recognize the contribution of this paper in the field of graph generation. Unlike the mature autoencoders in the field of computer vision, the field of graph learning still lacks such an effective lossless encoding method.\n\n2.This paper extends the framework of graph generation to directed graphs, which is of great significance. Previous work mainly focused on molecular data or synthetic undirected graph structure data. Generating directed graphs is equally important.\n\n3.The paper provides theoretical guarantees for the method.\n\n4.The paper is well-written and the introduction of the motivation is very convincing."}, "weaknesses": {"value": "1.I think that compared with the design in graph generation, the author's contribution mainly focuses on a powerful autoencoder. I think this is very important, but there is a lack of sufficient research and innovation on the generation method. \n\n2.Regarding the autoencoder, the author achieved nearly lossless results in the experiment. However, as the author mentioned, their assumption is that the node order of the graph remains unchanged, but this can cause problems in some specific scenarios (tree-like structure). Their processing method is to use wl-test to color the nodes. I think this point is worthy of exploration and analysis. For instance, if appropriate position encodings are assigned to the graph, is there a possibility of a solution?\n\n3.One concern about the autoencoder is that although this method can be extended to large graphs by virtue of its complexity advantage, the number of samples in large graphs is equally scarce. Then, when only a limited number of large graphs are used for training, can lossless compression still be achieved? I suggest that the author could attempt to train on the sbm datasets(you can generate by yourself) using only 10 graphs each containing 10,000 nodes to train and verify the reconstruction performance of the autoencoder on them.\n\n\n4.Another concern is that this method achieves a lossless effect on the encoder, but it does not have a significant advantage in terms of generation effect. However, the author lacks profound analysis and discussion. Is this due to the error of the generative model or the inherent distribution difference brought about by the training set and the test set?\n\n5.Furthermore, it would be great to be able to see the comparison of the effects of different generation strategies. For instance, the effect differences between ddpm and flow matching, as well as the influence of the selection of different compression dimensions on the reconstruction and generation effects. I hope the author can increase experiments on different diffusion paradigms and, most importantly, compare the impact of choices in different dimensions."}, "questions": {"value": "All my questions are shown in Weakness. I will consider improving my score if the authors can answer my questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "bNSXjHUFjV", "forum": "hwGVfmRxuR", "replyto": "hwGVfmRxuR", "signatures": ["ICLR.cc/2026/Conference/Submission8966/Reviewer_5ueS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8966/Reviewer_5ueS"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8966/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760510743489, "cdate": 1760510743489, "tmdate": 1762920700952, "mdate": 1762920700952, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a latent diffusion framework for graph generation that uses an autoencoder with Laplacian based adjacency identifying positional encodings. The decoder applies bilinear attention style scoring and a row wise DeepSet, and the approach extends to DAGs via a magnetic Laplacian. The authors claim that after freezing the autoencoder, a Diffusion Transformer is trained in latent space with conditional flow matching, which yields mostly linear per node complexity with only the final adjacency decoding quadratic. Experiments report near lossless reconstruction on several datasets, competitive generation quality."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The experiments show competitive reconstruction performance while substantially reducing the runtime.\n- Efficient yet near-lossless graph generation is an important topic."}, "weaknesses": {"value": "- Since the model uses only the lowest Laplacian eigenvalues/eigenvectors (rather than the full spectrum), it leans toward global/low-frequency structure and may miss high-frequency details. It might potentially hurt the exact reconstruction of fine structures.\n- The approach depends on computing Laplacian eigenvectors for positional encodings, which is costly and can dominate preprocessing on large graphs.\n- The promise of near-lossless reconstruction appears to rely on having sufficiently large training corpora of graphs, and performance can degrade on smaller or more complex datasets."}, "questions": {"value": "- Recent graph representation learning works [2] suggest that emphasizing low-frequency components can improve downstream representations (e.g., node classification), so selecting the k smallest eigenpairs is often reasonable in that context. However, for generation, where accurately reconstructing fine structural details could be crucial, restricting to the lowest eigenpairs may suppress high-frequency information. If I am wrong, please correct me.\n- In (e.g., line 174), writing $(\\phi:\\mathbb{R}^2\\to\\mathbb{R}^d)$ can suggest the input itself is 2-dimensional, whereas the actual input per node is an $(n\\times 2)$ table formed by concatenating two vectors row-wise (each row is a 2-vector ($(U_{ij},\\lambda_j{+}\\epsilon_j))$). Could you explicitly state that $(\\phi)$ is applied row-wise and annotate the shapes (input $(n\\times 2)$ → output ($n\\times d)$) to avoid confusion?\n-  In the notation section, node features $X$ are defined as discrete labels. Does the current framework support graphs with dense real-valued node attributes (e.g., Cora dataset $n\\times d$ features)? \n- Several recent works also build graph learning/generation models from spectral perspectives (e.g., using the smallest (k) eigenpairs). Could the authors discuss the key differences between your design and [1,2]?\n\n[1] \"Generating Graphs via Spectral Diffusion.\" The Thirteenth International Conference on Learning Representations, 2025.\n\n[2] \"SDMG: Smoothing Your Diffusion Models for Powerful Graph Representation Learning.\" The Forty-second International Conference on Machine Learning, 2025."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "YXvpxZBAbh", "forum": "hwGVfmRxuR", "replyto": "hwGVfmRxuR", "signatures": ["ICLR.cc/2026/Conference/Submission8966/Reviewer_3gKK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8966/Reviewer_3gKK"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8966/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761490906578, "cdate": 1761490906578, "tmdate": 1762920700319, "mdate": 1762920700319, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "ML graph generation models suffer from poor scalability due to quadratic cost of graph representation and hardness to compress such graphs into revertible latent representation. LG-VAE poses itself as a variational autoencoder that uses the graph laplacian spectrum to bring provable reversibility and enable fast graph generation. LG-VAE is shown to generate graphs up to 1000x faster than state-of-the-art while retaining generative quality."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The proposed method brings outstanding improvements under inference cost compared to the state-of-the-art\n- The proposed method brings comparable generative performance than the state-of-the-art \n- The proposed method covers an extensive set of graphs, including attributed, non-attributed, and directed acyclic graphs"}, "weaknesses": {"value": "- The main contribution of the paper is scalable graph generation. However, the experiments mostly cover the generation of small graphs.\n- How evaluation is conducted is partly unclear, making the validity of the paper’s result debatable. For instance, it is not clear whether LG-- VAE has been tested with the same batch size as the baselines, a detail that could invalidate a significant part of the paper contribution.\n- Experiments on directed graphs seem to be insufficient. First, LG-VAE is tested on one dataset only. Secondly, inference time of the SOTA baseline is inferred by their paper, meaning that it has also been run on a different hardware.\n- The experiment section could cover more ablation studies to properly assess the impact of each of the proposed components.\n- Minor: methodology figure could be improved for clarity and making LG-VAE’s components easier to understand."}, "questions": {"value": "Altogether, I think the paper makes a reasonable amount of contributions and that the experiments showcase that LG-VAE is a superior choice for graph generation with diffusion models. However, I have concerns about how the evaluation of LG-VAE has been performed. Here are my questions for the authors:\n\n- The main contribution of LG-VAE is scalable generation. However, the experiments mostly cover datasets of small graphs. Could the authors perform experiments on datasets with larger graphs? Proteins [1] could be a good choice also used in several papers in this field. If the authors have preference for any other dataset with large graphs over Proteins would also be fine.\n- Have the baselines and LG-VAE tested with the same batch size? If not, what batch sizes have been used in the experiments? This is not clearly explained in the paper content. From what I understand, the reason why LG-VAE is much faster than the SOTA in Table 1 is because the inference has been run with one batch only for LG-VAE but not for the other models. If this is the case could the author measure memory cost and time cost of LG-VAE and the baselines with the same batch sizes?\n- The paper would benefit from more ablation studies to assess the impact of each of the components. For instance, experiments to test the impact of the choice of k as the number of used eigenvectors for encoding on computational costs and generation quality. Could the authors provide such experiments?\n- Could the authors run the experiments of Table 5 on the same hardware to verify the computation efficiency improvement wrt Directo?\n- Could the authors find at least one more DAG dataset to perform experiments on?\n- Fu et al. [2] already provided a method for graph diffusion with cost linear in the number of nodes. The paper cites this work but does not compare LG-VAE performance with this model. Could the authors compare LG-VAE computation time and generation quality with the one of HypDiff?\n\n[1] Dobson, P.D. and Doig, A.J., 2003. Distinguishing enzyme structures from non-enzymes without alignments. Journal of molecular biology, 330(4), pp.771-783.\n[2] Fu, X., Gao, Y., Wei, Y., Sun, Q., Peng, H., Li, J. and Li, X., 2024. Hyperbolic geometric latent diffusion model for graph generation. arXiv preprint arXiv:2405.03188."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4vnQYcG1uU", "forum": "hwGVfmRxuR", "replyto": "hwGVfmRxuR", "signatures": ["ICLR.cc/2026/Conference/Submission8966/Reviewer_d3hS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8966/Reviewer_d3hS"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8966/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761761287660, "cdate": 1761761287660, "tmdate": 1762920699690, "mdate": 1762920699690, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Graph generation suffers from quadratic complexity in the number of nodes stemming from the adjacency matrix, which, however, contains mostly zeros for most datasets. This hinders the generation of large graphs. The paper proposes a permutation-equivariant autoencoder that maps each node into a fixed-size latent space, leveraging the graph Laplacian spectrum to reduce complexity. The latents are then used to train a generic diffusion model."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Strong generation speedup compared to state-of-the-art baselines.\n- Quality-wise, the method achieves the best or second-best performance against the baselines.\n- Experiments on a large variety of different types of graphs, both synthetic and real-world, e.g., DAG, molecules, planar, trees.\n- Good reconstruction results."}, "weaknesses": {"value": "- Motivation stems from limitations affecting the generation of large graphs, but evaluation only covers standard graph benchmark datasets of the same size as tackled by related work. Memory and time might not be the only limits when generating graphs of larger sizes. It is unclear if quality can be maintained.\n- Unclear how comparable the baseline results are on inference time: e.g., how optimal/equal were the used batch sizes and if the same hardware was used. Especially DAG runtimes are inferred from the original authors' paper, which might not have been using the same setup.\n- No ablation studies to better highlight the impact of the different components.\n\nMinor:\n- Table 2: Sample acc. column: wrong row is highlighted in bold"}, "questions": {"value": "- How is the generation quality on larger graphs?\n- A sensitivity analysis on the number of eigenvectors used\n- What batch size is used, and what hardware is used for inference (appendix mentions 2x L40 for training)?\n- How similar is the hw form Directo? Can the experiments be run on the same hardware?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "GjvInszTTg", "forum": "hwGVfmRxuR", "replyto": "hwGVfmRxuR", "signatures": ["ICLR.cc/2026/Conference/Submission8966/Reviewer_VxLZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8966/Reviewer_VxLZ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8966/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761929815277, "cdate": 1761929815277, "tmdate": 1762920698992, "mdate": 1762920698992, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}