{"id": "hwwn9hAAo5", "number": 22460, "cdate": 1758331358455, "mdate": 1759896864837, "content": {"title": "ATLAS: Actor-Critic Task-Completion with Look-ahead Action Simulation", "abstract": "We observe that current state-of-the-art web-agents are unable to effectively adapt to new environments without neural network fine-tuning, without which they produce inefficient execution plans due to a lack of awareness of the structure and dynamics of the new environment. To address this limitation, we introduce \\textbf{ATLAS} (\\textbf{A}ctor-Critic \\textbf{T}ask-completion with \\textbf{L}ook-ahead \\textbf{A}ction \\textbf{S}imulation), a memory-augmented agent that is able to make plans grounded in a \\emph{model} of the environment by simulating the consequences of those actions in \\emph{cognitive space}. Our agent starts by building a \\emph{\"cognitive map\"} by performing a lightweight curiosity driven exploration of the environment. The planner proposes candidate actions; the simulator predicts their consequences in cognitive space; a critic analyzes the options to select the best roll-out and update the original plan; and a browser executor performs the chosen action. On the \\textbf{WebArena-Lite} Benchmark, we achieve a 63\\% success rate compared to ~53.9\\% success rate for the previously published state-of-the-art. Unlike previous systems, our modular architecture requires no website-specific LLM fine-tuning. Ablations show sizable drops without the world-model, hierarchical planner, and look-ahead-based replanner confirming their complementary roles within the design of our system.", "tldr": "", "keywords": ["LLM Agent", "Planning", "Tree Search", "Cognitive Map"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0da8e26a7df591762d98580aaaf9e25085841605.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes a new web agent framework based on LLMs to improve browser-use performance. Specifically, the authors proposes ATLAS, a new framework by prompting LLMs to 1) create a \"cognitive map\" of the corresponding tasks by using the LLM to explore the target websites; 2) use the precomputed cognitive map to enhance planning by employing a best-of-N strategy (prompting an LLM to propose some actions/trajectories, which are then evaluated by prompting the LLM again). The authors evaluated their method on WebArena-Lite and showed that it outperformed previous best method."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- I agree that current web agents lack web/environment understanding, and constructing a knowledge graph via exploration is an interesting method to help address the problem.\n- The proposed framework (ATLAS) achieves performance improvement on WebArena-Lite compared to previous best model.\n- The authors conducted careful ablation studies to justify the performance contribution from each proposed module in ATLAS."}, "weaknesses": {"value": "1. ATLAS is a method that performs look-ahead planning (using cognitive map to perform simulated rollout, judged by an LLM to select the best action before action). This is highly similar to search algorithms such as MCTS (which is mentioned in the paper) but in the experiments no comparisons were made between ATLAS and any search-based methods. Many relevant baselines are thus missing from this paper, including [1-4].\n\n2. ATLAS incurs substantial costs compared to other baselines in Table 1, yet the authors did not report the additional cost/compare against simple methods of similar cost to establish a fair comparison. Specifically, since ATLAS requires 1) calling LLMs many times before testing to construct cognitive map; 2) calling LLM-based planner, actor, and critic multiple times to create multiple trajectories, from which the best is used for execution. Thus, I believe at least the authors should compare against a best-of-N baseline, where the N is chosen to achieve equal-compute compared to ATLAS.\n\n3. The authors introduced many components in ATLAS based on heuristics (e.g., memory with three different layers, action selection via \"confidence weighted uncertainty\" of prompt-based value function, etc) but only evaluated ATLAS on WebArena-Lite. It is thus questionable whether/which proposed component is really critical and generalizable for other web benchmarks such as Mind2Web2.\n\n4. The claim that ATLAS “simulates the consequences of those actions in cognitive space” (L17, Figure 1 caption, L305–307) appears overstated given the described method. As stated in Section 3.3 and L296–300, the cognitive map is constructed through (lots of) *real environment interactions/executions*, and Equation (4) indicates that “simulation” is effectively implemented by retrieving a cached next state from the real executions for a given state–action pair. This raises doubts about whether this process constitutes genuine simulation, as it depends heavily on prior real-world executions. In this sense, ATLAS’s look-ahead planning resembles conventional search-based approaches (e.g., [3], [4]), which are missed baselines in the experiment section.\n\n---\n\nReferences:\n\n[1] Yao, Shunyu et al. “Tree of Thoughts: Deliberate Problem Solving with Large Language Models.” ArXiv abs/2305.10601 (2023): n. pag.\n\n[2] Zhou, Andy et al. “Language Agent Tree Search Unifies Reasoning Acting and Planning in Language Models.” ArXiv abs/2310.04406 (2023): n. pag.\n\n[3] Koh, Jing Yu et al. “Tree Search for Language Model Agents.” Trans. Mach. Learn. Res. 2025 (2024): n. pag.\n\n[4] Yu, Xiao et al. “ExACT: Teaching AI Agents to Explore with Reflective-MCTS and Exploratory Learning.” ArXiv abs/2410.02052 (2024): n. pag."}, "questions": {"value": "- in Equation 1 why is there $s_t$ as well as $o_t$? I believe $s_t$ should not be available for web benchmarks?\n- in Equation 1, why is there no $P_t$ not a function of $P_{t-1}$, assuming that replanning is based on previous plans?\n- while world modeling is not a critical aspect of this work, I believe the authors may have overlooked many existing work on LLM as world models for web agents. Examples include [1-2]. I believe these work should have directly addressed the limitations mentioned in L417-419.\n- Equation 5 mentions a new quantity called \"transition uncertainty U(s,a)\", but it is never explained in the paper how that quantity is calculated.\n- Paper's appendix is formatted incorrectly. Many texts are flowing over the page.\n\n\n---\n\nReferences:\n\n[1] Gu, Yu et al. “Is Your LLM Secretly a World Model of the Internet? Model-Based Planning for Web Agents.” ArXiv abs/2411.06559 (2024): n. pag.\n\n[2] Fang, Tianqing et al. “WebEvolver: Enhancing Web Agent Self-Improvement with Coevolving World Model.” ArXiv abs/2504.21024 (2025): n. pag."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "cetPpqCjah", "forum": "hwwn9hAAo5", "replyto": "hwwn9hAAo5", "signatures": ["ICLR.cc/2026/Conference/Submission22460/Reviewer_HeKd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22460/Reviewer_HeKd"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761183765806, "cdate": 1761183765806, "tmdate": 1762942227634, "mdate": 1762942227634, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces ATLAS (Actor-Critic Task-completion with Look-ahead Action Simulation), a memory-augmented web agent that can adapt to new environments without fine-tuning. ATLAS builds a cognitive map of its environment through lightweight, curiosity-driven exploration and plans actions by simulating their outcomes in cognitive space. Its architecture combines a planner, a simulator, a critic, and an executor to refine action sequences iteratively. On the WebArena-Lite benchmark, ATLAS outperforms the previous state-of-the-art methods, while requiring no website-specific fine-tuning. Ablation studies demonstrate that components such as the world model, hierarchical planner, and look-ahead replanner are all crucial to the system’s performance."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The manuscript is well written, with figures that clearly illustrate the proposed methodology and equations that effectively present its technical foundations.\n\n2. The experimental setup is carefully designed, featuring appropriate choices of baselines. The ablation study offers a comprehensive analysis of the contribution of each component to the overall performance."}, "weaknesses": {"value": "1. Although ATLAS appears to be specifically tailored for the WebArena environment, the paper would benefit from evaluating the agent in more diverse and generalized scenarios. Demonstrating its effectiveness across a broader range of interactive environments would strengthen the claim of generality and provide deeper insights into the agent’s adaptability and robustness beyond the WebArena benchmark.\n\n2. The experimental settings are not described with sufficient clarity. For instance, the number of random seeds used to compute the averaged results and standard deviations is not specified, which raises concerns about the statistical significance and robustness of the reported findings. Furthermore, the paper does not provide an adequate discussion of the time efficiency or computational cost of the proposed method—an important consideration for the practical deployment of modern intelligent agents. Including these details would enhance the reproducibility and credibility of the experimental evaluation."}, "questions": {"value": "1. Can the proposed agent’s generalizability be evaluated on a broader range of environments?\n\n2. Could the authors present the results with greater statistical rigor, specifying details such as the number of random seeds used and the corresponding standard deviations?\n\n3. Would it be possible to include a time analysis—such as total training and inference time—and compare it against other baseline agents to assess computational efficiency?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "zcZH2SVFtQ", "forum": "hwwn9hAAo5", "replyto": "hwwn9hAAo5", "signatures": ["ICLR.cc/2026/Conference/Submission22460/Reviewer_24nw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22460/Reviewer_24nw"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761838666106, "cdate": 1761838666106, "tmdate": 1762942227166, "mdate": 1762942227166, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents ATLAS, an actor–critic web agent that performs look-ahead action simulation using a multi-layer memory system to improve planning and adaptability in web environments.\nBy combining a cognitive map, semantic memory, and hierarchical planner, ATLAS can simulate future action outcomes and dynamically replan without fine-tuning."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. The authors propose ATLAS, an actor–critic framework with look-ahead action simulation for web agents, which achieves strong performance on the WebArena benchmark and demonstrates improved planning and reliability compared to prior methods."}, "weaknesses": {"value": "1. The experimental scope is limited. Although the authors claim that ATLAS is generalizable across various websites, the evaluation is restricted to WebArena. Testing on more diverse and realistic web benchmarks such as WebVoyager [1] would strengthen the claim of generality.\n\n2. The method section lacks clarity and organization. Definitions often appear long after their first use (e.g., $M$ in Section 3), and the section mixes motivation, related work, and algorithms without a clear logical flow. A more structured rewrite is needed.\n\n3. The paper’s novelty appears incremental. The proposed framework seems to be an additive combination of two relatively standard components, planner and memory, without clear evidence of deeper integration or novel mechanisms.\n\n4. The details of the method are insufficient. Key components such as the memory update mechanism (Section 3.5) are only briefly mentioned without details, and the interaction between memory and planning is not clearly described. It is also unclear how the “look-ahead” actions beyond step $t$ are generated.\n\n5. (minor) Some formatting and writing issues remain, including inconsistent variable definitions and minor citation formatting errors (e.g., l226).\n\n[1] WebVoyager: Building an End-to-End Web Agent with Large Multimodal Models."}, "questions": {"value": "1. How does the “look-ahead” process obtain future actions beyond step $t$? I can only understand the the action at step $t$ is generated by the actor.\n\n2. The memory module is described as not directly tied to planning, yet it can trigger replanning. How is this mechanism designed, and how does memory influence the decision-making loop in practice?\n\n3. Section 3.5 emphasizes the importance of memory updates but does not explain how they are performed. Could the authors provide concrete details or pseudocode on the update process?\n\n4. The paper omits important environmental setup details, such as the agent’s observation format (e.g., HTML-based or multimodal) and how actions are interfaced with the environment. Please clarify these points to ensure reproducibility.\n\n5. The experiments are relatively limited in both benchmark coverage and baseline comparison. Are there plans to include broader evaluations or additional baselines to validate generality and robustness?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "YhFnzAjPec", "forum": "hwwn9hAAo5", "replyto": "hwwn9hAAo5", "signatures": ["ICLR.cc/2026/Conference/Submission22460/Reviewer_wke9"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22460/Reviewer_wke9"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761888236868, "cdate": 1761888236868, "tmdate": 1762942226736, "mdate": 1762942226736, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose ATLAS, a web agent consisting of LLM based modules like Planner, Actor, Critic, and Memory interacting with each other to perform a simulated look ahead tree search before selecting the final action. The memory is multilayered consisting of working memory capturing current context, cognitive map encoding state action transitions, and semantic memory capturing environment specific details, constructed through MCTS style exploration and LLM based summarization. On a simulation environment, WebArena Lite consisting of realistic web navigation tasks ATLAS demonstrates overall state of the art performance."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. A modular agentic architecture, ATLAS, is proposed for web navigation tasks like content retrieval, form completion etc, consisting of modules for planning, memory, actor and critic.\n2. Simulated look-ahead tree search using a prebuilt cognitive map through exploration, which is also used for dynamic replanning and memory update.\n3. Overall state of the art performance on WebArena Lite environment.\n4. Ablation studies demonstrate the effectiveness of different components."}, "weaknesses": {"value": "1. There are no analysis of failure modes, specifcially which modules are primarily bottlenecks. \n\n2. The overall system seems costly given that multiple modules are involved with multiple LLM calls and there is a lookahead tree search. Some cost analysis and comparison with other baselines is missing. \n\n3. There is no improvement for multi-site tasks, raising concerns whether this approach would generalize to more complicated tasks.\n\n4. Some key details and analysis are missing like how many action candidates are generated per step, what is the length of the simulated trajectory D, epsilon for replanning, and how sensitive is the overall method to these values?"}, "questions": {"value": "1. How is transition uncertainty U computed?\n\n\n\n2. How does Base + CM + HL perform to justify the importance of look-ahead?\n\n3. Some prompts like for replanning and cognitive map are missing from the appendix. Also the prompts seem to be cut out from the right margin.\n\n4. Results tables are not referred to in the manuscript.\n\n5. It seems some of the baselines reported in Table 1 use a different LLM than the one used in the ATLAS which is Claude 4 Sonnet? For fair comparison all methods should use the same LLM.\n\n6. Are any incontext learning examples used for any of the modules?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "WsmgHBJ06X", "forum": "hwwn9hAAo5", "replyto": "hwwn9hAAo5", "signatures": ["ICLR.cc/2026/Conference/Submission22460/Reviewer_Lbsj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22460/Reviewer_Lbsj"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762676839741, "cdate": 1762676839741, "tmdate": 1762942226298, "mdate": 1762942226298, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}