{"id": "hwYGVPS4dI", "number": 10773, "cdate": 1758181592617, "mdate": 1759897630072, "content": {"title": "MetaRuleReasoner: Beyond Chain-of-Thought—Neural Rule-Based Reasoning for Reliable Mathematical Computation", "abstract": "Chain-of-thought reasoning has emerged as the dominant paradigm for mathematical reasoning in large language models, yet it suffers from fundamental limitations: hallucination in reasoning steps, inconsistent performance, and lack of systematic reliability. We introduce neural rule-based reasoning as a distinct alternative that achieves systematic reliability through explicit rule application and complete domain coverage. Our MetaRuleReasoner demonstrates this approach, achieving 100% accuracy on multi-digit arithmetic tasks, while chain-of-thought models show systematic degradation with increasing complexity—GPT-4 drops to 90.9% accuracy on 10-digit operations. Our neural rule-based approach provides systematic reliability guarantees within learned domains by mastering finite rule sets that compose deterministically, contrasting sharply with the probabilistic reliability of chain-of-thought reasoning that must learn patterns for exponentially many problem combinations.", "tldr": "", "keywords": ["Reasoning", "Neural Rule", "Mathematics", "Large Language Models"], "primary_area": "neurosymbolic & hybrid AI systems (physics-informed, logic & formal reasoning, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/035014c407a57024c80203b505d57a44fa0e138c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes \"neural rule-based reasoning\" as an alternative to chain-of-thought (CoT) reasoning for mathematical computation in language models. The authors assert that their MetaRuleReasoner approach achieves perfect accuracy on arithmetic tasks where CoT methods exhibit performance degradation. The method purportedly integrates the reliability of symbolic AI with the flexibility of neural networks through systematic learning and application of explicit computational rules."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper successfully identifies genuine limitations of chain-of-thought approaches, especially concerning reliability in systematic domains such as arithmetic.\n\n2. The conceptual differentiation between pattern-based and rule-based reasoning presents an interesting avenue worthy of investigation.\n\n3. The manuscript demonstrates clear writing and solid structural organization."}, "weaknesses": {"value": "1. Questionable technical originality: Although the paper frames its approach as fundamentally novel, the underlying concept of training neural networks to execute algorithmic procedures has established precedent. Comparable methodologies appear throughout the Neural Algorithmic Reasoning, Neural Program Induction, and Neuro-symbolic AI literature.\n\n2. Constrained task environment: The evaluation concentrates on arithmetic, which while genuinely rule-based, constitutes an exceedingly narrow subset of mathematical reasoning. The paper provides no evidence of applicability to more sophisticated domains requiring higher-order reasoning capabilities."}, "questions": {"value": "1. **ADD MORE COMPARISION PLEASE**. The paper positions itself as entirely separate from neuro-symbolic approaches while failing to adequately differentiate itself from recent developments in this domain.\n\n2. **Missing ablation analysis**: The absence of component-wise performance analysis prevents understanding which elements contribute most significantly to results. Please add MORE ABLATION analysis"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "v9XXiRJnUV", "forum": "hwYGVPS4dI", "replyto": "hwYGVPS4dI", "signatures": ["ICLR.cc/2026/Conference/Submission10773/Reviewer_X3zF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10773/Reviewer_X3zF"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10773/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761997789618, "cdate": 1761997789618, "tmdate": 1762921985779, "mdate": 1762921985779, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces \"neural rule-based reasoning\" as an alternative to chain-of-thought reasoning for mathematical computation in large language models. MetaRuleReasoner achieves 100% accuracy on multi-digit arithmetic tasks by applying learned computational rules systematically, while CoT models (including GPT-4) show performance degradation with increasing complexity. Unlike CoT's pattern-based approach that generates natural language explanations, neural rule-based reasoning decomposes problems into explicit rule applications with systematic composition and verification at each step."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is clearly written."}, "weaknesses": {"value": "- The paper format violates ICLR'26 requirements.\n- Poor baselines. Experiments are conducted with non-reasoning LLMs (such as GPT-4, Google-PaLM, Qwen-72B). How does MetaRuleReasoner's performance compare to OpenAI's O-series models or Google Gemini Thinking?"}, "questions": {"value": "Please refer to the \"Weaknesses\" Section"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "HB2yPcd0jX", "forum": "hwYGVPS4dI", "replyto": "hwYGVPS4dI", "signatures": ["ICLR.cc/2026/Conference/Submission10773/Reviewer_PttA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10773/Reviewer_PttA"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10773/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762036061830, "cdate": 1762036061830, "tmdate": 1762921984573, "mdate": 1762921984573, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces MetaRuleReasoner, a neural rule-based reasoning approach that aims to address limitations of chain-of-thought (CoT) reasoning in mathematical computation. While CoT generates natural language reasoning steps probabilistically, the proposed approach applies learned computational rules systematically with explicit rule application and verification at each step. Experiments demonstrate that MetaRuleReasoner achieves 100% accuracy on multi-digit arithmetic tasks, while CoT models like GPT-4 show performance degradation as problem complexity increases."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The paper contains good motivations. \n- The paper is easy-to-follow."}, "weaknesses": {"value": "- Formalization of this paper seems to violate ICLR's rules.\n- Baselines of the paper seem out-of-date. Authors should consider adding more strong baselines."}, "questions": {"value": "- Why can MetaRuleReasoner achieve 100% accuracy across all tasks? Is this overfitting?\n- Can MetaRuleReasoner generalize to other math-related tasks?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "WFOdg94q3w", "forum": "hwYGVPS4dI", "replyto": "hwYGVPS4dI", "signatures": ["ICLR.cc/2026/Conference/Submission10773/Reviewer_sKsU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10773/Reviewer_sKsU"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10773/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762041365109, "cdate": 1762041365109, "tmdate": 1762921984229, "mdate": 1762921984229, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces MetaRuleReasoner, a neural rule-based reasoning system as a distinct alternative that achieves systematic reliability through explicit rule application and complete domain coverage."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "maybe nothing"}, "weaknesses": {"value": "1. None of the figures or tables include hyperlinks.\n2. The paper is not using the ICLR template. I’m unsure whether this alone warrants a desk reject, but it could introduce potential unfairness in overall paper length.\n3. The motivation in the introduction (the three deficiency claims) has no supporting citations or experimental evidence.\n4. The writing feels rushed, the references are very sparse, and most are from 2023–2024; given the rapid progress in CoT techniques, the paper’s timeliness is questionable. I don’t think this is an appropriate submission for ICLR 2026.\n5. The method’s generality is clearly very narrow; the paper focuses on toy tasks, and the models are quite outdated—for example, it uses Llama 2 and Qwen—while the latest reasoning models are not considered at all."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["Yes, Discrimination / bias / fairness concerns"]}, "details_of_ethics_concerns": {"value": "Template Usage"}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "4HZZZtuPle", "forum": "hwYGVPS4dI", "replyto": "hwYGVPS4dI", "signatures": ["ICLR.cc/2026/Conference/Submission10773/Reviewer_7569"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10773/Reviewer_7569"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10773/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762266901192, "cdate": 1762266901192, "tmdate": 1762921983813, "mdate": 1762921983813, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}