{"id": "HyB46zt7QX", "number": 462, "cdate": 1756740980736, "mdate": 1759898259455, "content": {"title": "RESIDUAL-GUIDED MULTI-RESOLUTION REFINEMENT OF FOUNDATION MODELS - A CASE STUDY IN CLIMATE FORECASTING", "abstract": "Regional climate prediction presents unique challenges for time series foundation models, which typically process temporal patterns through a single-pass inference. Expert climatologists, in contrast, employ multi-scale temporal analysis and iterative refinement based on systematic error diagnosis. We present RGMR (Residual-Guided Multi-Resolution Refinement), an inference-time framework that adapts pre-trained foundation models to perform structured multi-scale reasoning for climate forecasting without parameter modification. Our approach combines hierarchical coarse-to-fine prediction refinement, and residual-guided error correction that systematically addresses prediction failures at each resolution level. Applied to drought forecasting using the Standardized Precipitation Evapotranspiration Index (SPEI), RGMR consistently enhances foundation model performance across diverse climate regions within an Australian reginal area. Experimental results demonstrate substantial improvements over direct foundation model application, achieving up to 18.9\\% reduction in mean squared error, 10.2\\% reduction in root mean squared error, and 21.1\\% relative gain in $R^2$ when applied to TimesFM, with the largest benefits observed in climatologically complex regions where multi-scale temporal dynamics are most pronounced. The framework's inference-time operation enables immediate deployment on existing operational climate prediction systems without model retraining, offering a practical solution for enhancing foundation model capabilities in specialized forecasting domains.", "tldr": "", "keywords": ["Climate Science", "Drought Prediction", "Time Series"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b52df0c951661a9204201f4ea5f82922f792e840.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Residual-Guided Multi-Resolution Refinement (RGMR), an inference-time framework for improving frozen time-series foundation models (TSFMs) such as TimesFM. Instead of retraining or fine-tuning, RGMR iteratively refines predictions from coarse to fine using residual corrections estimated via Ridge regression and a contraction-style update rule. The method is evaluated on monthly drought forecasting (SPEI) over several sites in Australia."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper addresses an interesting need: improving frozen time-series foundation models (TSFMs) without retraining. RGMR’s inference-time refinement is computationally cheap, deployable, and directly usable in operational settings where model weights can’t be easily updated.\n\n- The two-phase structure (residual learning on short windows + coarse-to-fine iterative refinement) is clean and easy to follow. Each step has a transparent purpose, and the contraction-style update rule offers a simple, intuitive justification for stability."}, "weaknesses": {"value": "- The idea of multi-scale residual refinement strongly overlaps with existing hierarchical and residual forecasting methods. The main novelty, shifting this to inference time, is incremental and not deeply analyzed or positioned against related work.\n\n- Results are limited to a single variable (SPEI) in one region (Australia). There’s no evidence of generalization to other indices, domains, or temporal granularities.\n\n- The fixed resolution ladder (12, 6, 3, 2, 1 months) and block-average projections are arbitrary, with no physical, spectral, or empirical justification. The method’s sensitivity to these choices is not as explored, limiting confidence in robustness or generality.\n\n- Also, the lack of experiments showing robustness to FM that operates in high-dimensional setting (with space component e.g., in weather / climate FM) is not explored much. Having a space-time hierarchy is key for generalization of the method."}, "questions": {"value": "Please see above weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "DkAD1Ee4Br", "forum": "HyB46zt7QX", "replyto": "HyB46zt7QX", "signatures": ["ICLR.cc/2026/Conference/Submission462/Reviewer_RhUR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission462/Reviewer_RhUR"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission462/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760969799830, "cdate": 1760969799830, "tmdate": 1762915525375, "mdate": 1762915525375, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a post-training, inference time technique to enhance the performance of time series models in forecasting weather dynamics one month ahead. The technique leverages multiple inference passes and lightweight ridge regression, outperforming base models significantly in a case study."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "The method is largely agnostic to the underlying model and seems to be generally helpful.\n\nThe authors provide theoretical guarantees on error contraction.\n\nThe results are convincing and the method is computationally lightweight."}, "weaknesses": {"value": "The method is not compared against forecast emulators, just time series models. That’s a significant concern as timeseries models have not necessarily been developed for weather data.\n\nThe work only compares in a specific geo-region (likely due to data restrictions), and a specific forecasting scenario. Given that the method claims to be universal it would be good to either evaluate it also in another domain or compare it against the strongest task specific baselines in this domain (e.g. the best model available for one month ahead forecasts being it numeric or deep learning based).\n\nThe above points are major concerns on the generalizability of the claims made in the paper."}, "questions": {"value": "Can the authors compare their method in either another domain (e.g., finance, manufacturing, health care) or on at least other geo-regions and forecast scenarios? Otherwise, it’s hard to judge how valuable this method can actually be."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "g5h2hsRFZY", "forum": "HyB46zt7QX", "replyto": "HyB46zt7QX", "signatures": ["ICLR.cc/2026/Conference/Submission462/Reviewer_9DCw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission462/Reviewer_9DCw"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission462/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761456678598, "cdate": 1761456678598, "tmdate": 1762915525174, "mdate": 1762915525174, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Standard foundation models are limited in climate prediction because they analyze data in a single pass. This paper introduces RGMR, an inference-time framework that adapts pre-trained models to mimic expert climatologists by using multi-scale analysis and iterative error correction, all without retraining. When applied to drought forecasting in Australia using the TimesFM model, RGMR significantly improved accuracy (up to 18.9% MSE reduction), especially in complex regions. It offers a practical way to enhance existing models for specialized forecasting."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. **Inference‑time adaptation of frozen TSFMs.** Most multi‑resolution models, such as Scaleformer or N‑BEATS, incorporate coarse‑to‑fine processing at training time. RGMR instead leaves the backbone untouched and applies multi‑resolution projections only during inference, enabling immediate use of general‑purpose foundation models without full fine‑tuning. The idea of composing multiple passes of a frozen model with residual corrections is interesting and may be appealing when training resources are scarce.\n\n2. **Structured coarse‑to‑fine refinement.** The method uses block‑average projections to obtain coarse predictions and progressively integrates finer scales, which mimics the multi‑scale reasoning used by human climatologists (e.g. analysing annual cycles, inter‑annual oscillations and short‑term extremes). The inclusion of residual predictors helps correct systematic biases (such as phase shifts) and the adaptive weight mechanism allows the algorithm to downweight corrections when residual predictions are uncertain.\n\n3. **Rigorous Theoretical Guarantees.** A significant strength of this paper is its rigorous theoretical analysis, which provides a formal mathematical justification for the proposed RGMR framework rather than relying solely on empirical performance. The authors establish clear guarantees for the method's stability and error-reduction capabilities.\n\n4. **Ablation and baseline comparisons.** The experiments compare RGMR on TimesFM, TimeGPT and TabPFN against generic deep baselines and multi‑resolution models like N‑BEATS and Scaleformer. They also disentangle the effect of coarse projection, multi‑resolution, residual correction and adaptive weights, which helps understand where the gains come from. The code is promised to be released, and the dataset derives from publicly accessible climate reanalysis, supporting reproducibility"}, "weaknesses": {"value": "1. **Missing connections to test‑time adaptation literature.** Recent work on test‑time adaptation for time‑series forecasting proposes methods that calibrate or update pre‑trained models during inference. For example, PETSA [1] adapts the forecaster at test time by adding low‑rank input and output adapters and using a specialised loss to preserve periodicity, while DynaTTA [2] dynamically adjusts adaptation rates based on detected distribution shifts and applies shift‑conditioned gating. These approaches also avoid full fine‑tuning and operate on frozen backbones.\n\n\n2. **Arbitrary resolution ladder and projection operator.** The resolution hierarchy R={12,6,3,2,1} is fixed for all experiments. There is no justification for choosing these strides or evidence that they match salient periodicities of the dataset. In contrast, MultiResFormer learns the period lengths from the data and adjusts patch sizes adaptively. Rigidly averaging over 12‑month windows may blur important intra‑annual variations (e.g. ENSO events) and introduce aliasing. The projection operator uses simple block averaging and repetition, which is a crude low‑pass filter; more principled decompositions such as wavelet transforms or seasonal–trend decomposition [3] may yield better separation of scales. The authors neither provide ablations on different ladders nor explore alternative projection schemes.\n\n3. **Typographical issues**. There are minor typographical errors (e.g. “reginal” in the abstract)\n\n4. **Limited evaluation scope.** The experiments focus exclusively on one dataset, the monthly SPEI time series at three South‑Australian locations with horizons of 𝐻=1 (one‑month ahead). This is a very narrow testbed for a method claiming to be broadly applicable to regional climate forecasting. No results are provided for longer horizons (e.g. seasonal forecasts), other geographical regions, or other variables (temperature, precipitation), even though foundation models like TimesFM can handle general multivariate series. The authors mention TSFMs like Lag‑Llama and Chronos, but do not evaluate RGMR on them. Existing multi‑resolution and test‑time adaptation methods have been tested on diverse benchmarks covering electricity, traffic and finance; RGMR’s generalizability remains unproven.\n\n\n#### References:\n\n[1] Accurate Parameter-Efficient Test-Time Adaptation for Time Series Forecasting [PUT ICML 2025]  \n[2] Shift-Aware Test Time Adaptation and Benchmarking for Time-Series Forecasting [PUT ICML 2025]  \n[3] Multi-Resolution Diffusion Models for Time Series Forecasting [ICLR 24]"}, "questions": {"value": "1. **Choice of resolution ladder.** Why did you choose the fixed ladder R={12,6,3,2,1}? Have you tried other coarse–fine decompositions (e.g. quarterly, 7‑day or data‑driven periodicities)? Models like MultiResFormer adapt resolutions based on detected periods; would such adaptivity benefit RGMR?\n\n2. **Residual predictor design.** What is the dimensionality of the feature vector zt used in the Ridge regression? How many past residuals and targets are included, and why choose those particular statistics? Have you tried more expressive residual predictors (e.g. small neural networks or tree‑based regressors), and how do they compare?\n\n3. **Hyperparameter sensitivity.** The contraction guarantee depends on α(k), δ(k), γ. Could you provide ablation studies showing how sensitive the performance and stability are to these parameters? In particular, how often does the backtracking line search reduce the step size η(k), and what is the computational overhead?\n\n4. **Evaluation across horizons and datasets.** Have you tested RGMR on multi‑step forecasts (e.g. 3‑month or 6‑month horizons)? Does the method still contract errors when predicting further ahead? Also, why not evaluate on publicly available multivariate benchmarks (electricity, traffic, finance) to demonstrate general applicability? Including comparisons to recent multi‑resolution models like MTST [3] and MultiResFormer would be appreciated and would strengthen the claims.\n\n5. **Comparison to test‑time adaptation methods.** How does RGMR compare to parameter‑efficient adaptation approaches such as PETSA or DynaTTA? Both methods adapt models during inference without retraining the backbone. Could RGMR be combined with such adapters for further gains?\n\n6. **Practical deployment.** The abstract claims that the method is suitable for immediate deployment on operational climate systems. However, training the residual predictors requires historical labels and careful cross‑validation, and inference requires multiple forward passes. Could you clarify the computational requirements and how they fit within the latency constraints of operational drought monitoring?\n\n7. **Impact of context length.** Why does the inference window use 70% of the series length? How does performance change if only recent years are available? A sensitivity analysis would help practitioners choose an appropriate window."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "XJpWgLGzqt", "forum": "HyB46zt7QX", "replyto": "HyB46zt7QX", "signatures": ["ICLR.cc/2026/Conference/Submission462/Reviewer_WjXe"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission462/Reviewer_WjXe"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission462/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761855197077, "cdate": 1761855197077, "tmdate": 1762915525047, "mdate": 1762915525047, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "RGMR (Residual-Guided Multi-Resolution Refinement) is an inference-time framework designed to enhance the performance of frozen Time Series Forecasting Models (TSFMs) in regional climate prediction through structured, coarse-to-fine multi-scale analysis and residual prediction correction. The key contribution of this method lies in providing a general strategy to improve the outputs of SOTA base models without requiring model fine-tuning. Its effectiveness in iterative refinement is further supported by theoretical proof of Geometric Error Contraction, and it achieves significant performance gains in drought prediction tasks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Efficient Inference-Time Adaptability: The RGMR method is conceptually straightforward and simple to implement, enabling the integration of structured multi-scale inference into existing frozen base models. This approach reduces reliance on fine-tuning or re-training, potentially lowering deployment costs. Its compatibility with pre-trained models without architectural modifications may facilitate practical deployment in time-sensitive applications.\n\n2. Solid Theoretical Foundation: The proposed method is supported by theoretical analysis. This analysis provides insight into the behavior of the iterative refinement process, suggesting that errors may decrease monotonically and geometrically across resolution levels under certain conditions. Such theoretical grounding contributes to a better understanding of the method’s mechanisms.\n\n3. Clear Writing and Ablation Analysis: The paper is well-organized and the methodology is presented with clarity. Ablation studies systematically evaluate the contributions of key components to the overall performance. These experiments help clarify the role of each design choice and strengthen the interpretability of the results."}, "weaknesses": {"value": "1. Lack of Global Statistical Verification for Contraction: Although the theoretical analysis guarantees contraction (i.e., update steps with modulus ρ(k) < 1) under stability conditions, the current experimental evidence—such as the single-case illustration in Figure 4—is merely anecdotal and does not constitute a statistical validation over the entire test set. It is recommended that the authors report the percentage of samples across the test set for which actual error reduction occurs at each refinement step (i.e., the proportion of cases where Error(k) < Error(k−1)). Such a metric would provide a quantitative assessment of the empirical robustness of the theoretical contraction property.\n\n2. Missing Experimental Data on Inference Latency: While the paper provides a complexity analysis stating O(K⋅Cθ), indicating that RGMR requires K=5 forward passes through the base model, it lacks empirical measurements of inference time, which is critical for latency-sensitive operational systems. The authors are encouraged to include experimental results comparing: (i) the average inference latency (in milliseconds) of the baseline TSFM (e.g., TimesFM) for a single forward pass, and (ii) the average end-to-end latency of the full TSFM + RGMR pipeline, including all 5 forward passes and the residual prediction steps. This information would significantly strengthen the practical evaluation of RGMR’s deployability in real-world climate forecasting systems."}, "questions": {"value": "1. Source and Sensitivity of Hyperparameters and Features: The paper employs a fixed resolution hierarchy R = {12, 6, 3, 2, 1}. Could the authors clarify the climatological or theoretical rationale for selecting these specific values—particularly 2, 3, 6, and 12? How sensitive is model performance to variations in this hierarchy? Additionally, the features Zₜ used in the residual predictor gϕ₍ₖ₎ (e.g., recent target values, rolling statistics, residual history) are manually designed. What is the necessity and impact of this feature engineering in capturing systematic biases in SPEI? An ablation or analysis on the contribution of individual features would help assess their importance.\n\n2. Comparison to Traditional Climatological SOTA: The current experiments primarily compare against deep learning and time series foundation models. However, in operational practice, are there widely adopted non-deep-learning climatological or statistical methods for forecasting the SPEI index? If so, it would strengthen the paper to include comparisons that position RGMR’s performance gains relative to these domain-specific baselines, providing a more comprehensive assessment of its practical value."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rRYeD46oHQ", "forum": "HyB46zt7QX", "replyto": "HyB46zt7QX", "signatures": ["ICLR.cc/2026/Conference/Submission462/Reviewer_RZQh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission462/Reviewer_RZQh"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission462/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761900139817, "cdate": 1761900139817, "tmdate": 1762915524933, "mdate": 1762915524933, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}