{"id": "hYMlDtplMf", "number": 425, "cdate": 1756739092024, "mdate": 1763747108934, "content": {"title": "Group Critical-token Policy Optimization for Autoregressive Image Generation", "abstract": "Recent studies have extended Reinforcement Learning with Verifiable Rewards (RLVR) to autoregressive (AR) visual generation and achieved promising progress.\nHowever, existing methods typically apply uniform optimization across all image tokens, while the varying contributions of different image tokens for RLVR's training remain unexplored. \nIn fact, the key obstacle lies in how to identify more critical image tokens during AR generation and implement effective token-wise optimization for them. \nTo tackle this challenge, we propose $\\textbf{G}$roup $\\textbf{C}$ritical-token $\\textbf{P}$olicy $\\textbf{O}$ptimization ($\\textbf{GCPO}$), which facilitates effective policy optimization on critical tokens. \nWe identify the critical tokens in RLVR-based AR generation from three perspectives, specifically: \n$\\textbf{(1)}$ Causal dependency: early tokens fundamentally determine the later tokens and final image effect due to unidirectional dependency;\n$\\textbf{(2)}$ Entropy-induced spatial structure: tokens with high entropy gradients correspond to image structure and bridges distinct visual regions;\n$\\textbf{(3)}$ RLVR-focused token diversity: tokens with low visual similarity across a group of sampled images contribute to richer token-level diversity. \nFor these identified critical tokens, we further introduce a dynamic token-wise advantage weight to encourage exploration, based on confidence divergence between the policy model and reference model.\nBy leveraging 30\\% of the image tokens, GCPO achieves better performance than GRPO with full tokens.\nExtensive experiments on multiple text-to-image benchmarks for both AR models and unified multimodal models demonstrate the effectiveness of GCPO for AR visual generation.", "tldr": "A GRPO method designed for autoregressive image generation", "keywords": ["Autoregressive Image Generation", "Text-to-Image Generation", "Reinforcement learning"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0a9011b8c63ec8c4d9d098b67f493a2e99c6df59.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This papers proposes Group Critical-token Policy Optimization for autoregressive image generation models drawing insights from Reinforcement Learning with Verifiable Rewards in the context of LLMs and Chain of Thought reasoning."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper identifies a more efficient and insightful method to improve RL post-training for AR models.\n- The paper shows good empirical performance\n- The paper carries out extensive experiments"}, "weaknesses": {"value": "The paper does not discuss the recent Visual Autoregressive VAR paradigm: https://arxiv.org/pdf/2404.02905\nThere are works that have used Group Relative Policy Optimization for VAR such as 'Fine-Tuning Next-Scale Visual Autoregressive Models with Group Relative Policy Optimization': https://arxiv.org/abs/2505.23331\n\nThese should be discussed in the text, and extensions of GCPO to VAR should be mentioned as a future research direction. The problem with standard AR is that they impose a raster-scan inductive bias on image generation which does not align with the multi-scale nature of images: there is no reason to believe that the top left corner should condition the bottom right corner and not the other way around. As the authors mention 'early tokens serve as global priors and structural guides', which more closely aligns with a multi-scale approach."}, "questions": {"value": "The paper relies on heuristics which may make the method brittle and sensitive to hyper-parameters:\n\n- The assumption is that the first K tokens (e.g., 10% of the sequence length ) are critical because their initial generation decisions propagate and determine the overall image structure (why this particular number?)\n- The 2D gradient of the token entropy map. The authors observed empirically that tokens with high entropy gradients consistently correspond to important image structures and region-bridging elements. This is interesting, any theoretical insights or links to grad-cam and interpretability methods?\n- Token diversity within a group of generated images. The criterion selects tokens with the lowest average pairwise cosine similarity of their embeddings across a batch of images. The rationale is that low-similarity tokens are associated with more complex regional structures that contribute richer information for policy optimization, while high-similarity tokens are mundane background or texture. Any further experiments to check this? Perhaps and appendix with more examples and images."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "p7boI30Pbk", "forum": "hYMlDtplMf", "replyto": "hYMlDtplMf", "signatures": ["ICLR.cc/2026/Conference/Submission425/Reviewer_eipe"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission425/Reviewer_eipe"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission425/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760938052466, "cdate": 1760938052466, "tmdate": 1762915517779, "mdate": 1762915517779, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Group Critical-token Policy Optimization (GCPO), a novel RLVR framework that focuses on optimizing critical tokens, regarding to causal dependency, structure importance, and token diversity, for autoregressive image generation, achieving significant improvements in efficiency and performance over GRPO across benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* Novelty: Introduces a critical-token selection strategy based on causal dependency, entropy gradients, and token diversity.\n* Exploration: Provides intriguing insights into the role of structure in token entropy during text-to-image generation.\n* Comprehensive Validation: Demonstrates improvements across Geneval, T2I-CompBench and DrawBench benchmarks."}, "weaknesses": {"value": "* Limited Gains: Improvements over GRPO are minor, especially for Geneval on 1B models and T2I-CompBench on 7B models, despite added complexity."}, "questions": {"value": "1. Given the limited performance gains, could the authors clarify additional advantages, such as the impact on RL training time due to token filtering?\n2. How would GCPO perform on non-spatial vision tokenizers like VAR’s application on T2I [1] and DDT [2] for vision token extraction?\n\n[1] Infinity∞: Scaling Bitwise AutoRegressive Modeling for High-Resolution Image Synthesis\n\n[2] Generative Multimodal Pretraining with Discrete Diffusion Timestep Tokens"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "pYbqe2Qn9w", "forum": "hYMlDtplMf", "replyto": "hYMlDtplMf", "signatures": ["ICLR.cc/2026/Conference/Submission425/Reviewer_KyYg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission425/Reviewer_KyYg"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission425/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761879770014, "cdate": 1761879770014, "tmdate": 1762915517610, "mdate": 1762915517610, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Current RL methodologies typically assign similar weights to all image tokens, but different tokens are expected to play different roles. To distinguish among tokens, the authors identify three types of critical tokens based on the causal nature of autoregressive models, token entropy, and token diversity. In addition, they apply differentiated weights by comparing each identified token with the initialization model."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- Considering that different image tokens play different roles in image generation, it is reasonable to focus on optimizing critical image tokens using RL.\n- The paper provides the valuable insight that image tokens with high entropy gradients convey spatial structural information of the generated images.\n- The proposed RL method demonstrates better performance than GRPO on both Janus-Pro and LLaMaGen models."}, "weaknesses": {"value": "- Since critical tokens can change during training, they should be re-identified at each training step, which may introduce substantial additional computation. However, the paper lacks a comparison of training cost/consumption.\n- The performance of the 1B model drops on the GenEval benchmark in Table 1. What is the reason?\n- Figure 7(a) only shows the effect of the selection ratio for each token type, while the analysis does not address the choice of the total selection proportion (e.g., 30%)."}, "questions": {"value": "Since critical tokens may overlap across the defined categories, does this situation require additional processing?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FhYhom5BcC", "forum": "hYMlDtplMf", "replyto": "hYMlDtplMf", "signatures": ["ICLR.cc/2026/Conference/Submission425/Reviewer_z8AU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission425/Reviewer_z8AU"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission425/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761994526500, "cdate": 1761994526500, "tmdate": 1762915517430, "mdate": 1762915517430, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes GCPO, which selects critical tokens through multiple criteria to improve GRPO for T2I generation. The authors identify the critical tokens as initial tokens, tokens with high entropy gradients, and tokens with low average similarities. A dynamic advantage weight is also proposed to balance exploration and stabilization."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea is intuitive and well-motivated.\n2. Section 4 provides solid experimental observations, which support the proposed criteria for selecting critical tokens.\n3. The proposed method is simple and appears to be effective in improving generation performance."}, "weaknesses": {"value": "1. Figure 7 shows that “30% Critical Tokens with DAW” performs better than the “100% baseline,” while “30% Critical Tokens” performs worse. How does the model perform when DAW is applied to the “100% baseline”? It is important to determine whether DAW or the critical tokens contribute more to the overall performance.\n2. To my understanding, $Z_{struct}$ is selected within a single image, while $Z_{sim}$ is selected across all images. Should $Z_{struct}$ therefore come from different positions for each image, and $Z_{sim}$ from the same positions across images? If so, why does $Z_{sim}$ come from different positions as shown in Figure 5?\n3. The selection ratio (along with the ratio of each token type) appears to be an important hyperparameter. The current setting is 10%:10%:10%. It would be better if the authors could provide results for additional selection ratio settings."}, "questions": {"value": "1. How does the group size G affect performance? Does it have a strong positive correlation?\n2. Is the local averaging of the entropy map very important? It is intuitively reasonable, but it would be better to include an ablation study to verify its effect."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "ZZA9fXabbG", "forum": "hYMlDtplMf", "replyto": "hYMlDtplMf", "signatures": ["ICLR.cc/2026/Conference/Submission425/Reviewer_MkTp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission425/Reviewer_MkTp"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission425/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762024462109, "cdate": 1762024462109, "tmdate": 1762915517242, "mdate": 1762915517242, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}