{"id": "HYTzGikBkd", "number": 20692, "cdate": 1758309063345, "mdate": 1759896963659, "content": {"title": "The Illusion of Certainty: Uncertainty quantification for LLMs fails under ambiguity", "abstract": "Accurate uncertainty quantification (UQ) in Large Language Models (LLMs) is\ncritical for trustworthy deployment. While real-world language is inherently am-\nbiguous, existing UQ methods are typically benchmarked against tasks with no\nambiguity. In this work, we demonstrate that while current uncertainty esti-\nmators perform well under the restrictive assumption of no ambiguity, they de-\ngrade to close-to-random performance on ambiguous data. To this end, we in-\ntroduce MAQA* and AmbigQA*, the first ambiguous question-answering (QA)\ndatasets equipped with ground-truth answer distributions estimated from factual\nco-occurrence. We find this performance deterioration to be consistent across dif-\nferent modeling paradigms: using the predictive distribution itself, internal repre-\nsentations throughout the model, and an ensemble of models. We show that this\nphenomenon can be explained theoretically, revealing that predictive-distribution\nand ensemble-based estimators are fundamentally limited under ambiguity. Over-\nall, our study reveals a key shortcoming of current UQ methods for LLMs and\nmotivates new approaches that explicitly model uncertainty during training.", "tldr": "We show theoretically and empirically that UQ methods for LLMs fail under ambiguity. We explore alternatives and release 2 datasets with ground truth probabilities", "keywords": ["LLMs", "Uncertainty Quantification"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c32f8b86eb95d52a25d9afde5473762d02799705.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper focuses on ambiguity and uncertainty quantification (UQ) in question answering. The authors first expand existing ambiguous QA datasets by constructing a “ground-truth” answer distribution, where the probability of each candidate answer reflects its frequency in the pretraining corpus. They then evaluate three categories of uncertainty quantification methods on these ambiguous QA datasets and demonstrate that these methods fail to produce reliable uncertainty estimates under ambiguity."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The idea of assigning a ground-truth distribution to ambiguous questions is novel. Prior work primarily focused on collecting ambiguous questions and their corresponding disambiguated versions, whereas this paper explores what the ground-truth distribution should be for ambiguous cases. Also, the problem setting (examining how UQ methods behave under question ambiguity) is relevant to the reliability of LLMs."}, "weaknesses": {"value": "- **Questionable Motivation for the Proposed “Ground-Truth Distribution.”** The authors do not justify why the so-caled ground-truth distribution for ambigous questions is needed. From my perspective, the ambiguity is objective -- it is there, and there are multiple ways to understand an ambigous question, leading to multiple correct answers. What we need is the clarifications for the ambiguity, the disambiguations for the question, and the corresponding correct answers. It does not makes sense to me to create a probability distribution for the ground-truth label for an ambiguous question, where the probability mass for each candidate answer reflects its frequency in the pre-training corpus. I do not think it make sense to define the ground-truth label in this way. LLMs should first recognize there is ambiguity and then provide different answers correspondingly, without assigning a ratio/weight for each answer.\n- **Redundant and Trivial Sections.** Several sections present results that are well-known and widely accepted in the community, without offering new insight. Specifically,\n  - Section 3:The claim that “UQ methods work under zero aleatoric uncertainty” is straightforward and has already been thoroughly addressed in prior works  [1-3]. Reproducing this observation empirically and theoretically seems unnecessary and adds little contribution.\n  - Section 5: The analysis of “why seemingly robust estimators fail once AU is non-trivial” is also trivial. The paper itself notes that “a high-entropy prediction no longer necessarily indicates high epistemic uncertainty, as the entropy may also arise from inherent ambiguity in the ground truth.” I think formalizing it both empirically and theoretically does not advance understanding.\n- **Lack of Substantive Contribution or Solution.** The paper identifies an obvious problem that existing UQ methods fail under ambiguity. However, it offers no new method or framework to address it. The conclusion (“current UQ methods are ineffective under ambiguity”) is expected and unsurprising. As a result, the paper reads more as a descriptive survey or negative result without sufficient theoretical or methodological contribution.\n\n[1] Kuhn, Lorenz, Yarin Gal, and Sebastian Farquhar. \"Semantic uncertainty: Linguistic invariances for uncertainty estimation in natural language generation.\" arXiv preprint arXiv:2302.09664 (2023).\n\n[2] Cole, Jeremy R., et al. \"Selectively answering ambiguous questions.\" arXiv preprint arXiv:2305.14613 (2023).\n\n[3] Shavindra Jayasekera, I., et al. \"Variational Uncertainty Decomposition for In-Context Learning.\" NeurIPS, 2025."}, "questions": {"value": "Please refer to the weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "PjlJUOC56I", "forum": "HYTzGikBkd", "replyto": "HYTzGikBkd", "signatures": ["ICLR.cc/2026/Conference/Submission20692/Reviewer_MuH1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20692/Reviewer_MuH1"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20692/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761871330622, "cdate": 1761871330622, "tmdate": 1762934070375, "mdate": 1762934070375, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper revisits uncertainty quantification for LLMs under conditions of ambiguity. Indeed, current UQ methods are typically benchmarked on datasets that do not contain any ambiguity. For example, on QA tasks, there is exactly one correct answer to each question. The current work drops this assumption and proposes two new benchmarks called MAQA* and AmbiQA*, both being QA datasets, such that the questions have multiple correct answers. Consequently, the empirical evaluation demonstrates that the classical UQ estimators nearly fail on these ambiguous datasets. This is an important result because many realistic use-cases are inherently ambiguous."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Uncertainty quantification for LLMs is a hot topic and therefore advances in this field are definitely warranted.\n\n- The paper sheds new light on UQ especially in the case of ambiguous QA tasks. It also motivates new research on developing UQ estimators that are sensitive to ambiguity."}, "weaknesses": {"value": "- The results aren't that surprising. Recent work that looked at uncertainty quantification for the text-to-SQL task which is inherently ambiguous (namely, for a given natural language query there could be multiple correct SQL queries) already observed significant degradation in AUROC performance for several UQ estimators (see [1,2]).\n \n[1] Bhattacharjya et al. SIMBA UQ: Similarity-Based Aggregation for Uncertainty Quantification in Large Language Models. EMNLP 2025.\n\n[2] Bhattachariya et al. Consistency-based Black-box Uncertainty Quantification for Text-to-SQL. NeurIPS Workshop 2024."}, "questions": {"value": "I suppose text-to-SQL would be a practical yet inherently ambiguous generative task. How would your approach extend to this task?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "f4x4OConDP", "forum": "HYTzGikBkd", "replyto": "HYTzGikBkd", "signatures": ["ICLR.cc/2026/Conference/Submission20692/Reviewer_sxrJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20692/Reviewer_sxrJ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20692/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761938764812, "cdate": 1761938764812, "tmdate": 1762934069882, "mdate": 1762934069882, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper considers uncertainty estimation in the case of ambiguous questions, as defined in a specific manner by the work. The paper is conceptual in nature and slightly different from other work in the space, presenting some results and related insights as to why some existing UQ methods in the literature perform well for standard QA benchmarks with no ambiguity (like TriviaQA). The results rely on decomposing total uncertainty into epistemic and aleatoric components, as defined as cross entropy between the true distribution and predicted distribution over semantic classes of LLM output. The paper proposes datasets with ambiguous questions by modifying a couple of existing ones in the literature, where the main contribution is to provide them with ground truth distributions for the sort of analysis they need to perform. Evidence is provided in a manner that is both theoretical and empirical."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "I think the paper makes some important contributions to understanding when some of the current UQ methods for LLMs perform well and why -- although I think the framing is still quite specific in that only a particular type of task and general setup (like using semantic classes to categorize output) is considered. \n\nIn my view, the insights are useful for the field of UQ for LLMs, novel enough to warrant interest from the broader community. I’m not sure about the practical value of the new datasets but I appreciate the effort and consider it a contribution as well. Overall, I think this is a strong paper."}, "weaknesses": {"value": "I find the work limiting in some ways. The authors use a definition of total uncertainty that is not widely accepted and relies on a ground truth distribution p^*. In my view, they do not provide enough justification for this definition, choosing to merely cite a couple other papers. So while the work is useful and conceptually interesting, not enough is mentioned about the assumptions and cumbersome nature of setup. This is related to creation of the benchmark, which the authors discuss briefly in the limitations section, to their credit.\n\nAnother weakness is the lack of sufficient literature that is cited, both around uncertainty estimation and ambiguity. I suggest expanding the related work section. At the very least, I recommend including some review papers to show that the field is much broader than what is specifically cited and used as baselines."}, "questions": {"value": "Some other comments/questions follow:\n\nWhat are the probabilities mentioned on line 39? What are these probabilities over? Isn’t this a system decision? The authors likely mean some distribution over data. This is a key aspect that is not covered sufficiently in the paper and only mentioned later when the proposed datasets are described.\n\nSome of the statements in the paper feel inappropriately strong, like in lines 83 – 86; several real problems do not have the sort of ambiguity in scope of this work.\n\nHow does one practically ascertain the number of possible classes over which an LLM produces as output? Does this not depend on the number of generated samples? How does this influence the results, if at all?\n\nPlease explain the choice for defining total uncertainty as done in equation (1). I recommend adding more detail in the paper.\n\nIn Section 2.1, please explain how to compute true EU. Mention that p^* is needed.\n\nWhere is Proposition 3, mentioned in line 156?\n\nMinimal maximal confidence in line 192 is confusing. Explain what the min and max are over.\n\nExplicitly mention the term in the inequality of Theorem 2 that represents the model making confident predictions. It would be helpful to explain how the probability term on the right hand side is about confident predictions.\n\nThere is a major typo in line 211 – it should be low predictive entropy.\n\nPlease fix issues with the citation style in many places in the paper. I also noticed several minor typos, like in lines 441 and 447."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "qwVDstKmhQ", "forum": "HYTzGikBkd", "replyto": "HYTzGikBkd", "signatures": ["ICLR.cc/2026/Conference/Submission20692/Reviewer_WuFW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20692/Reviewer_WuFW"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20692/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761955637593, "cdate": 1761955637593, "tmdate": 1762934069489, "mdate": 1762934069489, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}