{"id": "I30HO3xth3", "number": 14512, "cdate": 1758237730849, "mdate": 1763738539977, "content": {"title": "Degree-Corrected Ricci Curvature for Networks", "abstract": "Networks are useful in understanding complex systems. Recently, discrete curvature measures, adapted from smooth manifolds to discrete landscape of networks, have been applied to network data analysis, such as community detection, with encouraging results. A fundamental hypothesis made for using these curvature measures is the diagonal-dominating principle: *the curvature measures are consistently larger within a community than between different communities.*\nHowever, this principle may not hold under all statistical network models. \nWe investigate three existing network curvatures, which satisfy the diagonal-dominating principle under the stochastic block model (SBM) but not under its widely-used degree-corrected version, the degree-corrected block model (DCBM). Observing that these curvature measures are heavily influenced by degree heterogeneity, we propose a new curvature measure, Degree-Corrected Ricci Curvature (DCRC), specifically designed to account for degree heterogeneity. Theoretically, we prove that DCRC always satisfies the diagonal-dominating principle under both SBM and DCBM. We also provide large-deviation bounds and uncertainty quantification. Empirically, we use DCRC to preprocess a network by filtering out low-curvature edges; and we show that this preprocessing step can improve the performance of state-of-art community detection algorithms.", "tldr": "", "keywords": ["Network curvature", "heterogeneity", "community detection", "asymptotics"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/02eb90885de551ee639f90fc4b6a86da2f403412.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents a new mode of discrete curvature and applies it in a community detection problem in the context of the stochastic block model and degree corrected block model."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "- There is quite a wide range of curvature modes tested, though I would have liked to see more (see Questions below).\n- Good range of community detection methods tested after preprocessing."}, "weaknesses": {"value": "- I am not sure about the claim of the authors that their work is the first to study curvature in the context of random graphs, see \"Comparative analysis of two discretizations of Ricci curvature for complex networks,\" Samal et al., Scientific Reports volume 8, Article number: 8650 (2018).  Indeed, the questions and characteristics studied are different, but I think that it is not correct to claim to be the first such study and position it as a main theoretical contribution.\n- The paper is not well written and there were many grammatical errors throughout (e.g., \"optimal transpose\" instead of \"transport\").\n- There appears to be no complexity or convergence analysis.\n- There is not much variation in sizes of networks and so difficult to assess the performance on varying graph sizes and characteristics (such as topological complexity)."}, "questions": {"value": "- Have you considered the augmented Forman and Haantjes curvatures?\n- There is a brief discussion on the computational runtime but there is a vast difference in computing the different modes of curvature studied in the work and it is not clear how each curvature type tested affects the final runtime.  In particular, it is not clear what the computational cost of computing the newly proposed curvature mode is."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "lKtcukdaC2", "forum": "I30HO3xth3", "replyto": "I30HO3xth3", "signatures": ["ICLR.cc/2026/Conference/Submission14512/Reviewer_uZBP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14512/Reviewer_uZBP"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14512/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761779801564, "cdate": 1761779801564, "tmdate": 1762924907118, "mdate": 1762924907118, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "SrcUnKTCyR", "forum": "I30HO3xth3", "replyto": "I30HO3xth3", "signatures": ["ICLR.cc/2026/Conference/Submission14512/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14512/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763738538856, "cdate": 1763738538856, "tmdate": 1763738538856, "mdate": 1763738538856, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the limitations of existing network curvature measures when applied to networks with degree heterogeneity. The authors show that existing curvature measures satisfy the \"diagonal-dominating property\" under the Stochastic Block Model (SBM) but fail under the Degree-Corrected Block Model (DCBM). To address this, they propose Degree-Corrected Ricci Curvature (DCRC), defined as the normalized ratio of triangles attached to an edge. The paper provides theoretical analysis showing DCRC maintains the diagonal-dominating property under both SBM and DCBM, analyzes the properties of DCRC, and demonstrates through simulations and real-world experiments that DCRC-based preprocessing can improve existing community detection algorithms in specific settings."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "**S1.** The paper identifies a limitation of existing curvature measures under degree heterogeneity.\n\n**S2.** The theoretical analysis is substantial, providing population-level analysis and asymptotic distributions with uncertainty quantification."}, "weaknesses": {"value": "**W1.** To my understanding the major weakness is lack of practical motivation. The paper addresses a very specific problem: satisfying the diagonal-dominating property for curvature-based community detection specifically under DCBM. The authors fail to establish why this narrow focus should be of interest to the community at a machine learning venue like ICLR. Not only the ML contribution is unclear, the practical relevance of this in network analysis in general is unclear (I do not find the experiments on real-world networks convincing to show the practical relevance).  \n\n**W2.** The proposed DCRC seems to be an edge-based analog of the well-established local clustering coefficient for the nodes. An unnormalized version of this, referred to as “edge multiplicity” has been in fact studied back in 2006 [1]. The authors don't acknowledge this connection. Moreover, the paper doesn’t clarify why this is referred to as a type of “Ricci curvature”. Ricci curvature characterizes deviation of local geometry from being Euclidean, and it measures volume change as a volume ball travels along a geodesic. The paper should explain how DCRC captures this in graphs.\n\n**W3.** The theoretical results rely on assumptions that make the work less practical in common empirical settings. In particular, on line 251 the authors state that their assumption requires that \"the degree parameter of any single node cannot be excessively dominant with respect to\nother nodes\". My understanding is that this assumption is violated with a power-law degree distribution which is prevalent in real-world networks.\n\n**W4.** The experiments are predominantly on a limited class of synthetic networks. The real-world network experiments are limited and use a preprocessing step (removing edges with low DCRC and low variance) that is not properly explained or justified.\n\n\n**W5.** A minor point: The authors claim that ORC is “less amenable to theoretical analysis”. This is not true to my understanding; especially considering the optimal transport formulation that relates it to well-studied properties of the Wasserstein space of probability measures. \n\n[1] Serrano, M. Á., & Boguna, M. (2006). Clustering in complex networks. I. General formalism. Physical Review E—Statistical, Nonlinear, and Soft Matter Physics, 74(5), 056114."}, "questions": {"value": "**Q1.** How does DCRC relate to the clustering coefficient? Specifically, can you clarify how/whether you can derive one from the other? \n\n**Q2.** Related to W2, can you clarify why this is a notion of Ricci curvature?\n\n**Q3.** Can you elaborate on how and why you preprocess the network in your experiments on real-world networks and remove the low-curvature edges?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "xR7FdpnbDZ", "forum": "I30HO3xth3", "replyto": "I30HO3xth3", "signatures": ["ICLR.cc/2026/Conference/Submission14512/Reviewer_ezgp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14512/Reviewer_ezgp"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14512/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761935036120, "cdate": 1761935036120, "tmdate": 1762924906653, "mdate": 1762924906653, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Degree-Corrected Ricci Curvature (DCRC), a novel graph curvature metric designed to remain informative in the presence of degree heterogeneity. The work formalizes curvature behavior under both SBM and DCBM, proving that DCRC uniquely satisfies a diagonal-dominating property even when node degrees vary substantially. The authors derive population-level expressions, large-deviation bounds, and asymptotic normality results enabling uncertainty quantification. DCRC is then used as a preprocessing mechanism to improve downstream community detection. Extensive simulations and experiments on real-world networks (Caltech, Simmons, Political Blogs) demonstrate consistent improvement of six community detection algorithms over baselines and existing curvature measures."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "1. The theoretical development is rigorous and clearly motivated. The proof strategy is detailed and leverages established DCBM theory. Large-deviation bounds and asymptotic normality significantly strengthen the contribution. Empirical evaluations are thorough in both synthetic and real benchmarks.\n2. The paper is clearly written, well-structured, and provides useful intuition alongside theory. Figures and tables effectively communicate results. Some mathematical exposition is dense and may be challenging for readers without prior exposure to random graph asymptotics, but overall clarity is strong.\n3. This work addresses a fundamental and previously under-studied gap: curvature-based methods degrade under degree heterogeneity, which is ubiquitous in real networks. DCRC makes curvature tools viable for realistic graph regimes and provides new theory for curvature in random graph models. The combination of theoretical guarantees, statistical inference tools, and applied gains is compelling."}, "weaknesses": {"value": "1. The definition of DCRC is elegant, but the intuition could be clarified earlier. The argument about cancellation of degree effects is correct, yet could be enhanced with geometric intuition, connections to Wasserstein curvature, or brief toy examples illustrating why traditional curvature fails."}, "questions": {"value": "1. How sensitive is DCRC to extremely sparse regimes (near connectivity threshold)?\n2. Can the authors comment on the runtime cost relative to FRC/Jaccard beyond ORC?\n3. Can you discuss other applications of curvature except for community detection? \n\nClarifications would enrich the impact and applicability discussion."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "I82Y1E7HSO", "forum": "I30HO3xth3", "replyto": "I30HO3xth3", "signatures": ["ICLR.cc/2026/Conference/Submission14512/Reviewer_UKNG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14512/Reviewer_UKNG"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14512/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761948043497, "cdate": 1761948043497, "tmdate": 1762924906235, "mdate": 1762924906235, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Degree-Corrected Ricci Curvature (DCRC) for edges, defined as n_ij/(n_in_j), to correct degree-heterogeneity effects when using curvature-like scores for community detection. \nThe authors prove that the population-level DCRC separates within- vs across-community edges under both SBM and DCBM, give concentration and asymptotic-normality results, and show that pruning edges by low DCRC improves several community-detection methods on simulated DCBM data and three real networks. \nEmpirical results report some improvements."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "* DCRC intuitively makes sense as a score, but not as a curvature.\n* Paper contains analysis of the proposed score under degree-corrected SBM model assumption. \n* Experiments demonstrate DCRC-based edge-pruning improves performance of six diverse community-detection algorithms across many simulated DCBM settings and three real datasets. \n* Definitions, assumptions, and paper are largely easy to follow."}, "weaknesses": {"value": "tl;dr: The contributions are overstated, the score is seemingly not a curvature, comparable similarity scores have not been discussed, results are minor when assuming degree corrected SBMs.\n\n* Fundamentally, the paper mischaracterizes the novelty and prior work. The proposed DCRC (n_ij/(n_in_j)) seems to be essentially the Leicht–Holme–Newman (LHN) common-neighbor normalization used for link-prediction. The manuscript does not acknowledge or compare to LHN (or other degree-normalized CN measures), so the claimed novelty as a \"Ricci curvature\" is misleading.\n* Calling a designed-to-be nonnegative similarity score a \"Ricci curvature\" is conceptually problematic, wrong, and potentially *very* confusing. Established discrete Ricci curvatures (Ollivier, Forman, etc.) can take negative values (to e.g., signify node dispersion/tree-like graphs over a positive curvature of clique-like graphs); DCRC is apparently nonnegative and lacks sign information entirely. The geometric interpretation and terminology are therefore largely unsupported. In sum, dispersion vs concentration is seemingly not properly encoded. Rather it uses a degree-corrected link prediction score.   \n* No direct empirical comparison to other simple degree-corrected baselines (LHN) or to other link-prediction scores is provided (e.g., Salton Cosine Index); without this the performance gains may be unsurprising and attributable simply to known scores.\n* The theoretical results require relatively dense regimes where nij is meaningful; this reduces the potential applicability to many real-world sparse networks. The paper remarks on this, but more empirical characterization of boundaries would help but are not included.\n* The theoretical results are seemingly straightforward algebraic derivations assuming a degree corrected SBMs.\n* The paper's population separation, concentration bounds, and asymptotic normality for DCRC under a DCSBM follow by straightforward algebraic evaluation of expectations for nij and then application of standard concentration inequalities (Bernstein/Chernoff) and a Lindeberg–Feller CLT; therefore the contribution is mainly a careful, useful instantiation of well-known probabilistic tools to a simple degree-normalized common-neighbour statistic. \n* Labels in at least Fig. 1--5 are minuscule and are hard to read.\n* Motivation behind experimental setup not very clear."}, "questions": {"value": "- Do not oversell the score as Ricci curvature.\n- Contextualize with established measures (e.g., LHS)\n- Improve plots (re label size)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "iojVD3V0z4", "forum": "I30HO3xth3", "replyto": "I30HO3xth3", "signatures": ["ICLR.cc/2026/Conference/Submission14512/Reviewer_rHh9"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14512/Reviewer_rHh9"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14512/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761997210949, "cdate": 1761997210949, "tmdate": 1762924905785, "mdate": 1762924905785, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}