{"id": "I6xjMoLY3j", "number": 20235, "cdate": 1758303966419, "mdate": 1763686760688, "content": {"title": "Disentangled representation learning through unsupervised symmetry group discovery", "abstract": "Symmetry-based disentangled representation learning leverages the group structure of environment transformations to uncover the latent factors of variation. Prior approaches to symmetry-based disentanglement have required strong prior knowledge of the symmetry group's structure, or restrictive assumptions about the subgroup properties. In this work, we remove these constraints by proposing a method whereby an embodied agent autonomously discovers the group structure of its action space through unsupervised interaction with the environment. We prove the identifiability of the true action group decomposition under minimal assumptions, and derive two algorithms: one for discovering the group decomposition from interaction data, and another for learning Linear Symmetry-Based Disentangled (LSBD) representations without assuming specific subgroup properties. Our method is validated on three environments exhibiting different group decompositions, where it outperforms existing LSBD approaches.", "tldr": "", "keywords": ["Representation learning", "Disentanglement", "Group Theory"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/618ca92a311692449528b4de4333eb9bc1fb2402.pdf", "supplementary_material": "/attachment/3a6e67a67bc711ca6cbbdcd147f0dc9547bf2c08.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces a method to learn disentangled representations using symmetry groups without requiring prior knowledge of the group structure. The approach consists of three stages: learning an entangled representation (A-VAE), discovering the group decomposition via clustering, and learning a disentangled representation (GMA-VAE). This addresses a key limitation of existing LSBD methods that assume known group structure, and the work constitutes a valuable contribution to unsupervised representation learning."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper proposes a complete framework for automatically discovering group structure and utilizing it for disentanglement, addressing the limitation of prior LSBD methods that rely on known group structure. This contribution demonstrates considerable novelty and significance.\n2. This paper provides solid theoretical foundations for the proposed method while conducting systematic evaluation on multiple datasets, comparing not only standard disentanglement metrics but also evaluating long-term prediction and generalization capabilities."}, "weaknesses": {"value": "1. The treatment of non-symmetry-based disentanglement methods is insufficient. While the paper situates itself within the LSBD literature, it provides minimal discussion of how symmetry-based approaches compare to traditional disentanglement methods.\n2. The experimental comparison is confined to symmetry-based methods, leaving the performance of the proposed approach against mainstream baselines such as QLAE and FactorQVAE unclear.\n3. The extensive mathematical notation throughout the manuscript hinders readability. A consolidated symbol table would significantly improve accessibility for readers less familiar with group theory."}, "questions": {"value": "1. Could the authors elaborate on the tangible advantages of symmetry-based methods, particularly when augmented by the improvements proposed in this paper, over mainstream approaches like QLAE and FactorQVAE?\n2. How realistic are the underlying assumptions in practical settings? All experiments employ relatively simple synthetic datasets. Would the assumptions hold on more complex benchmarks such as MPI3D or Isaac3D?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QIx97dh1BB", "forum": "I6xjMoLY3j", "replyto": "I6xjMoLY3j", "signatures": ["ICLR.cc/2026/Conference/Submission20235/Reviewer_GrsJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20235/Reviewer_GrsJ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20235/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761713779181, "cdate": 1761713779181, "tmdate": 1762933730998, "mdate": 1762933730998, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles unsupervised symmetry group discovery for Linear Symmetry-Based Disentanglement (LSBD). It proposes a two-stage pipeline: (i) learn an “entangled” action representation and encoder via an Action-VAE trained on transitions, then (ii) cluster actions into subgroup factors using a group-theoretic pseudo-distance, and finally (iii) learn a block-masked GMA-VAE that enforces LSBD without assuming subgroup structure. The paper proves identifiability under injectivity and “disentangled action set” assumptions and evaluates on Flatland-style grids with color cycles/permutations, COIL rotations with permutations, and 3DShapes. Reported wins are on LSBD metrics and long-horizon prediction versus Forward-VAE/SOBDRL/LSBD-VAE variants."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Clear LSBD pipeline that separates (i) equivariant pretraining, (ii) group discovery, (iii) block-structured LSBD learning, with explicit assumptions and a clustering rule grounded in group algebra. \n\n2. Good baseline experiments within the LSBD family (Forward-VAE/SOBDRL/LSBD-VAE variants) and consistent reporting on multiple disentanglement metrics and multi-step prediction. \n\n3. Reproducibility: code, dataset generation, and hyperparameters are described and (per the authors) released."}, "weaknesses": {"value": "1. **Lack of realistic interactive experiments.**\nThe environments are synthetic (Flatland, COIL with permutations, 3DShapes). There are no tests on widely used embodied/control suites (e.g., DeepMind Control/ProcGen/Habitat/ManiSkill) where continuous groups (SO(2), SE(2), SE(3)) and sensor noise dominate, and where symmetries are only approximate. By contrast, prior interactive symmetry/LSBD works motivate interaction explicitly and evaluate on non-trivial dynamics (e.g., SOBDRL/Forward-VAE), and the broader equivariant RL literature demonstrates robustness/sample-efficiency gains in control domains—precisely the use-case this paper claims to address.\n\n2. **Strong assumptions.**\nIdentifiability and clustering rely on (i) fully injective observations, (ii) a disentangled action set with each action belonging to exactly one subgroup, and (iii) the existence of short compositions mediating within-subgroup relations. These are rarely true in practical agents (redundant actuators, coupled controls, unmodelled dynamics). No robustness analyses are provided for violations (e.g., aliased actions, missing transitions, approximate commutativity). The empirical advantage may be specific to the LSBD formulation and the chosen metrics.\n\n3. **Limited group diversity and no continuous-group evaluation.**\nAll experiments use finite groups (cyclic, symmetric). There is no assessment on continuous groups or approximate symmetries (e.g., SE(2)/SE(3) rotations and translations, scaling), where many RL/control tasks live and where identifiability and clustering are harder.\n\n4. **Limited discussion of related work.** This paper is missing a lot of citations and related works from the group structured representation learning in interactive environments literature [1, 2]. Many of these work uses actions of the environment to disentangle or induce structure in the latent space and shows it's benefits in reinforcement learning etc. I would suggest the authors to do a more thorough literature review. \n\n[1] Learning Symmetric Embeddings for Equivariant World Models. JY Park et. al.\n[2] Structuring Representations Using Group Invariants. M Shakerinava et. al."}, "questions": {"value": "1. How does action clustering perform when the action set is not strictly disentangled (shared actuation across factors), or when a subset of transitions is missing/noisy? Please report clustering accuracy and downstream LSBD under controlled violations.\n\n2. Can the pseudo-distance and masking be extended to continuous Lie groups (SO(2), SE(2)/SE(3))? If not, what fails? Compare against Lie-symmetry discovery approaches. \n\n3. Can you demonstrate that discovered groups help in standard control tasks by instantiating ρ inside an equivariant policy/value network (as in group-equivariant RL)? Measure sample efficiency and generalization versus non-equivariant baselines.\n\n4. Partial observability: Your proofs assume injective observations. What happens in POMDPs (occlusions, distractors)? Any way to incorporate history (RNN/state-space models) while preserving identifiability?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "dhBuRe5UVt", "forum": "I6xjMoLY3j", "replyto": "I6xjMoLY3j", "signatures": ["ICLR.cc/2026/Conference/Submission20235/Reviewer_7wnh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20235/Reviewer_7wnh"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20235/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761951775969, "cdate": 1761951775969, "tmdate": 1762933730621, "mdate": 1762933730621, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "They propose an algorithm to learn and disentangle the group structure underlying an environment, through interactions with this environment. Unlike previous methods, their method does not assume specific subgoup properties."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "My understanding of the framework is relatively superficial and I did not check the maths carefully. \nStrengths:\n- Careful explanations.\n- Thorough comparison with other methods and with different metrics of disentanglement, which show an advantage over other unsupervised methods."}, "weaknesses": {"value": "- How is the method less supervised than LSBD-VAE? It seems pretty supervised to me, with access to actions and consequences of these actions? What does it mean that \"Both of our methods rely on a strong assumption which requires the available actions to be disentangled\"?"}, "questions": {"value": "- The \"Geomancer\" should probably be cited as they somehow address a related question: https://arxiv.org/abs/2006.12982\n- How to understand the problem of separating subgroups in different dimensions, when it is not always possible with a continuous encoder, as shown in https://arxiv.org/abs/2102.05623?\n- How did Caselles-Dupre ́et al. (2019) demonstrate that symmetry-based disentanglement is only possible when access is granted to transitions? Consider explaining this in the paper. \n- \"Such an approach to disentanglement,\" => these alternative frameworks seem only tangentially relevant, and could be moved to appendix."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "LTvnL2q7TF", "forum": "I6xjMoLY3j", "replyto": "I6xjMoLY3j", "signatures": ["ICLR.cc/2026/Conference/Submission20235/Reviewer_B8Yx"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20235/Reviewer_B8Yx"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20235/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761963066132, "cdate": 1761963066132, "tmdate": 1762933730141, "mdate": 1762933730141, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studied symmetry-based disentanglement learning. To remove assumption about the symmetry group’s structure,  this work introduces a novel, multi-step approach to learning disentangled representations by having an agent autonomously discover the underlying symmetry group structure of its environment. The proposed method consists of three main steps: 1) Learn an Entangled Representation (A-VAE). 2) Discover the Group Structure. 3) Learn a Disentangled Representation (GMA-VAE). The authors validate their method on three environments with different group structures (Flatland, COIL, and 3DShapes). The results show that their action clustering algorithm perfectly recovers the ground-truth group decomposition , and the final GMA-VAE model achieves disentanglement performance comparable to supervised methods that are given the group structure in advance, outperforming other self-supervised approaches."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. **Novelty:** The core contribution—learning an LSBD representation via three steps—is instructive for disentanglement learning. This shifts the paradigm from requiring prior knowledge to autonomously learning it from interaction.\n2. **Theoretical Grounding:** The paper is built on a solid theoretical foundation, providing formal proofs for its key claims. This guarantees the existence of actions belonging to the same subgroup (Theorem 2) and the  of learning a Linear Symmetry-Based Disentangled (LSBD) representation (Theorem 3).  This level of rigor adds significant weight to the proposed methods.\n3. **Strong Empirical Validation:** The method is thoroughly tested across multiple benchmarks. The final disentanglement performance is shown to be on par with a supervised method (LSBD-VAE), which is a very strong result.\n4. **Other properties:** The paper goes beyond standard disentanglement metrics to show the other properties of the learned representations. The experiments on long-term prediction clearly demonstrate that the entangled methods prefer short-term predictions, while self-supervised ones prefer long-term predicitons."}, "weaknesses": {"value": "1. Multi-Stage Pipeline: The method is not end-to-end. It requires training two separate models sequentially: first the A-VAE to learn action matrices, and then the GMA-VAE to learn the final representation. The authors acknowledge this limitation, noting that a future direction would be to unify these steps into a single optimization process.  \n2. Limited Scope of Environments: The experiments are conducted on synthetic, visually simple datasets.  While these are well-suited for proving the group-theoretic concepts, it is unclear how the approach would scale to more complex, realistic, or stochastic environments where the underlying symmetries might be less perfect or harder to learn from raw pixels.\n3. No visualisation evaluation for  reconstruction quality and latent traversal to explicitly demonstrate the tradeoff. \n4. The number of MIG on 3Dshapes is low."}, "questions": {"value": "Why the MIG score is low on 3Dshapes? The discussion about failing cases is important to understand the drawbacks of proposed method."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "hnYYE3TjXD", "forum": "I6xjMoLY3j", "replyto": "I6xjMoLY3j", "signatures": ["ICLR.cc/2026/Conference/Submission20235/Reviewer_9xAV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20235/Reviewer_9xAV"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20235/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761967772216, "cdate": 1761967772216, "tmdate": 1762933729602, "mdate": 1762933729602, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}