{"id": "ia2ux3ZyZA", "number": 19488, "cdate": 1758296651326, "mdate": 1759897036287, "content": {"title": "Quantum-inspired benchmark for Intrinsic Dimension Estimation", "abstract": "Machine learning models can generalize well on real-world datasets. According to the manifold hypothesis, this is possible because datasets lie on a latent manifold with small intrinsic dimension (ID). There exist many methods for ID estimation (IDE), but their estimates vary substantially.  This warrants benchmarking IDE methods on manifolds that are more complex than those in existing benchmarks. We propose a Quantum-Inspired Intrinsic-dimension Estimation (QuIIEst) benchmark consisting of infinite families of topologically non-trivial manifolds with known ID.  Our benchmark stems from a quantum-optical method of embedding arbitrary homogeneous spaces while allowing for curvature modification and additive noise. The IDE methods tested were generally less accurate on QuIIEst manifolds than on existing benchmarks under identical resource allocation. We also observe minimal performance degradation with increasingly non-uniform curvature, underscoring the benchmark’s inherent difficulty.", "tldr": "We propose a new benchmark for intrinsic dimension estimation techniques inspired from quantum information theory and demonstrate its advantages against existing benchmarks.", "keywords": ["benchmark", "intrinsic dimension estimation", "quantum-inspired", "manifold hypothesis"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c3c13448f579a7f6363c764215d74495921f48d4.pdf", "supplementary_material": "/attachment/0933b8c17dc75928492d47ece139919cd581d45d.zip"}, "replies": [{"content": {"summary": {"value": "This paper discusses a quantum-inspired algorithm for\nintrinsic dimension estimation (IDE) in the context of the \"manifold\nhypothesis\" on the set of data. This is an interesting and important\nquestion.\nThe idea is to constructs infinite\nfamilies of manifolds starting from classical homogeneous spaces\nas quotients of semisimple real or complex Lie groups (e.g. spheres,\ngrassmannians, flags, Stiefel manifolds etc). The authors start from what\nthey call \"quantum optical embeddings\" of homogeneous spaces, though they\ndo not explain and I do not understand the word quantum used in this context.\nStarting with the ground truth of ID, from the manifolds (datasets) they\nconstruct, then they proceed to give IDE with their method QuIIEst and\nthen they benchmark it against more known methods, showing its potential.\nThey also add some noise and make considerations regarding distortion\nand possible topological complexity."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "As far as I know this idea is new, though I do not understand\nthe quantum component of it, I think it is worth exploring and can\nbe of aid in IDE, especially when topology, curvature and more generally\ngeometry plays a role in data distribution. Moreover the authors\nare able to provide a playground for others with \"toy datasets\" that\nmay be of help in answering other questions (eg. knowledge transfer).\nTheir results show performance degradation of existing IDE methods,\nvalidating their QuIIEst model and method."}, "weaknesses": {"value": "There is the surprising fact that the geometry of the manifold\n(curvature, density etc) plays no role: actually this should be better\nmotivated, because it may hide a shortcoming in the theoretical treatment.\nMoreover a comparison on this point with other IDE methods is mandatory.\n\nThe paper shows that IDE methods perform worse on QuIIEst\nbut does not deeply analyze why, eg.\nwhich geometric/topological/other features cause errors (link with\nprevious weakness).\n\nThe experiments appear very limited in scope, though there may\nbe promising as scalability goes.\n\nAt some point code and generation scripts must be released for\nreproducibility."}, "questions": {"value": "How exactly are the “quantum embeddings” implemented? This\npart is not fully clear, it would benefit from more details.\n\nCan QuIIEst generate non-homogeneous manifolds? Can their method\nwork in reducing data parameters and dimensionality (as for any\nhomogeneous space a group action can be of help).\n\nAre there known analytic expressions for curvature and metric tensors\nin these embeddings and after distorsion? (this is actually an\ninteresting mathematical question, how geometry changes with noise\naddition).\n\nHow computationally expensive is manifold generation as ID increases?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "TGVd4r8JhO", "forum": "ia2ux3ZyZA", "replyto": "ia2ux3ZyZA", "signatures": ["ICLR.cc/2026/Conference/Submission19488/Reviewer_5gjM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19488/Reviewer_5gjM"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19488/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891606000, "cdate": 1761891606000, "tmdate": 1762931392299, "mdate": 1762931392299, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work focuses on building benchmarks for intrinsic dimension (ID) estimation. Pointing on that usual benchmarks for ID estimation are simple, the authors build a set of more complex physics-inspired manifolds. Building off of some tractable, well-understood manifolds (e.g., Stiefel manifolds, Grassmanians), the authors apply different embeddings of these classes into higher-dimensional spaces and put these forward as an ID benchmark. A suite of ID methods is evaluated on these benchmarks."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "- The work is well-motivated - it is true that current benchmarks focus on very trivial manifolds that have no relationship to real-world data (though I'm not sure those proposed here have much relationship either - see weaknesses).\n- This paper is well-written and I enjoyed reading it. This may be strange to say in a review, but the authors' passion for the subject really shines through in the level of detail, connections, and examples they give throughout.\n- I do think the experiments are executed nicely. The analysis is unique and interesting, comparing performance to properties like curvature and noise (in addition to ID).\n\nFor these reasons, I am opting for an accept score."}, "weaknesses": {"value": "- It's not clear at all whether these benchmarks are representative of real-world ID estimation problems. The work briefly mentions how Grassmanians and Stiefel manifolds have been studied in ML, but presumably not in a context when their IDs were unknown and needed to be estimated.\n- Although some interesting quantitative analysis is performed showing *when* estimators fail, no insight is provided into *why* these failure cases exist on a per-estimator basis. I don't think I found in the work any suggestions on how to improve ID estimators on the basis of this benchmarking work either. (The notion of generating different embeddings of real-world manifolds is mentioned in the conclusion, but it's not at all obvious what this would entail.)\n- Most benchmark manifolds are constructed using the \"Gilmore-Perelomov\" coherent-state method. But there is no accessible explanation of this concept for a general ML audience. There is a highly technical description in Appendix D.1 which I cannot follow. All I can glean is that it is a piece of math used somewhere in the process of generating embeddings.\n\t- You need to provide more accessible details about this. Is it or does it provide a function of some sort? Surely you can black-box most of the technical details while providing us with a precise description of its purpose here.\n\nSide note: the citation style violates the ICLR 2026 formatting instructions: https://github.com/ICLR/Master-Template/raw/master/iclr2026.zip"}, "questions": {"value": "- Can you give a less technical explanation of what you are doing with the coherent state method?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4JAop3KBTe", "forum": "ia2ux3ZyZA", "replyto": "ia2ux3ZyZA", "signatures": ["ICLR.cc/2026/Conference/Submission19488/Reviewer_wuJs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19488/Reviewer_wuJs"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19488/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761955063785, "cdate": 1761955063785, "tmdate": 1762931391861, "mdate": 1762931391861, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces QuIIEst (Quantum-Inspired Intrinsic-Dimension Estimation benchmark), a benchmark designed to evaluate intrinsic dimension estimation (IDE) methods on synthetic manifolds with known intrinsic dimensions. The authors construct several manifold families, including Stiefel, Grassmann, Flag, and Pauli manifolds, by leveraging the structure of homogeneous spaces (quotients G/H). The benchmark allows controlled sampling and noise perturbation, and the paper compares multiple IDE methods such as PCA, MLE, TwoNN, DANCo, ABID, and CorrInt on these manifolds."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The benchmark provides a consistent way to evaluate intrinsic dimension estimators on known manifolds.\n- The experimental section is well-organized, comparing several established IDE methods under controlled settings and providing clear quantitative results."}, "weaknesses": {"value": "- Fundamentally, the work is unrelated to quantum mechanics. All constructions are standard results from Lie group representation theory and homogeneous space geometry. The “quantum-inspired” terminology appears unnecessary, as the methodology is fully explainable within classical differential geometry. To me, the quantum story is merely a coverage.  \n- All manifolds used in the benchmark are homogeneous manifolds such as Stiefel, Grassmann, and Flag manifolds generated by Lie group actions. Non-homogeneous manifolds are not included. This limits the benchmark’s ability to assess IDE methods on more realistic and asymmetric data manifolds.  \n- The description of the quantum background, especially in Appendix D, is insufficient and lacks rigor. Several notations are either undefined or unclear.  \n\nOverall, the paper mainly reuses known results on homogeneous manifolds to generate a dataset for IDE evaluation. The datasets comprise existing matrix manifolds. While the benchmark may be useful in practice, its conceptual novelty is limited."}, "questions": {"value": "see wk"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "RVw1DEfxG6", "forum": "ia2ux3ZyZA", "replyto": "ia2ux3ZyZA", "signatures": ["ICLR.cc/2026/Conference/Submission19488/Reviewer_q2Vs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19488/Reviewer_q2Vs"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19488/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761962741981, "cdate": 1761962741981, "tmdate": 1762931391477, "mdate": 1762931391477, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}