{"id": "icnIadBCoR", "number": 22711, "cdate": 1758334647296, "mdate": 1759896851193, "content": {"title": "PRISM: Performer RS-IMLE for Single-pass Multisensory Imitation Learning", "abstract": "Robotic imitation learning typically requires models that capture multimodal action distributions while operating in real-time control rates and accommodating multiple sensing modalities. Although recent generative approaches such as diffusion models, flow matching, and Implicit Maximum Likelihood Estimation (IMLE) have achieved promising results in this domain, they satisfy only a subset of these requirements. To satisfy these requirements, we introduce PRISM, based on a batch-global rejection-sampling variant of IMLE. PRISM is a single-pass policy that couples a temporal multisensory encoder (e.g, RGB, Depth, tactile, audio, proprioception) with a linear-attention generator using a Performer architecture. We validate on MetaWorld, CALVIN, Robomimic, and a real hardware suite using a Unitree Go2 with a 7-DoF arm, wrist and shoulder RGB, tactile, audio, and proprioception sensors. PRISM matches or outperforms diffusion, flow-matching, and prior IMLE policies in terms of task success rates, robustness, and sample efficiency. In CALVIN with 10\\% of the data, PRISM improves the success rate by $\\sim$ 10\\% over IMLE, $\\sim$ 20\\% over flow matching, and $\\sim$ 25\\% over diffusion, while reducing the jerk by about $20\\times$. On MetaWorld, PRISM is 5-12\\% on Hard/Very-Hard splits over diffusion and flow baselines. Real-world loco-manipulation shows 10--25\\% higher success and maintains faster inference diffusion policy. These results position PRISM as a fast, accurate, and multisensory imitation policy that retains multimodal action coverage without iterative sampling.", "tldr": "", "keywords": ["Imitation Learning", "Diffusion Policy", "Flow-matching Policy", "Implicit Maximum Likelihood Estimation", "Manipulation", "Quadruped", "Locomotion"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b09c41acf47579665a71f7679d98dd9e4b09470e.pdf", "supplementary_material": "/attachment/8860cc054ed08d48136519fc4f67a5070e7b43da.pdf"}, "replies": [{"content": {"summary": {"value": "PRISM introduces a fast, single-pass imitation learning policy that handles rich sensory streams (vision, depth, tactile, proprioception, and audio when available) and produces full action sequences in one forward computation. Instead of relying on slow iterative sampling like diffusion or flow-matching models, PRISM combines a temporal multisensory encoder with a Performer-based linear-attention generator and augments IMLE training with a batch-global rejection mechanism to maintain multimodal action diversity and trajectory smoothness. The policy generates multiple candidate futures in parallel, selects a coherent action sequence in a receding-horizon manner, and achieves real-time control rates with significantly smoother motions. Experiments across MetaWorld, CALVIN, Robomimic, and Unitree GO2 hardware show that PRISM consistently outperforms recent diffusion, flow-matching, and IMLE baselines in success rates, robustness to missing modalities, and motion quality, especially in low-data settings."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "- The paper provides strong empirical validation through both extensive simulation benchmarks (MetaWorld, CALVIN, Robomimic) and real-world deployment on a Unitree GO2 manipulation platform.\n\n- RS-IMLE enables efficient parallel candidate generation and selection, allowing single-pass inference with low latency and avoiding the costly iterative denoising loops of diffusion and flow-matching methods.\n\n- The Performer-based architecture supports real-time multisensory control, scaling effectively to visual, proprioceptive, depth, tactile, and audio inputs while maintaining smooth and coherent action sequences.\n\n- Sensor ablation experiments reveal robustness to partial observability and provide useful insights into the relative contribution of each sensing modality."}, "weaknesses": {"value": "- The flow in the methodology section is sometimes difficult to follow, particularly around Section 4.3, where the introduction of the robust sequence distance and RS-IMLE steps feels abrupt. Providing clearer preliminaries, unified notation, and a more gradual build-up to the rejection-sampling formulation (e.g., by first introducing standard IMLE objectives before the proposed batch-global extension) would help improve clarity and overall conceptual continuity.\n\n- The paper lacks explicit reporting of model parameter counts and computational footprint across architectures. Since one of the core claims is real-time efficiency, additional information on model size would strengthen the evaluation and help readers contextualize the single-pass efficiency relative to diffusion, flow, and prior IMLE baselines.\n\n- Although trajectory smoothness and jerk metrics are reported, the paper would benefit from more detailed analysis of failure cases, especially in scenarios where multiple candidate trajectories might still produce suboptimal or unstable executions. Understanding when and why the method fails would improve transparency."}, "questions": {"value": "- L220: The latent variable $z$ appears suddenly; consider motivating its role in enabling multimodal action generation before introducing it formally.\n\n- L260: The notation $\\Phi$ is used without explanation; please clarify it refers to the Performer random feature map or provide a pointer to its definition.\n\n- L142: The notation “top-K'” is used without explicit justification, and its difference from the standard top-K criterion may appear counter-intuitive, even though it is later listed in the notation table. A short explanation at first mention would make the intent clearer.\n\n- L1093: Appendix section titled “F Appendix” is empty and looks like a placeholder; consider removing or completing this subsection."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "6UZzaINruO", "forum": "icnIadBCoR", "replyto": "icnIadBCoR", "signatures": ["ICLR.cc/2026/Conference/Submission22711/Reviewer_FNZA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22711/Reviewer_FNZA"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22711/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761813492317, "cdate": 1761813492317, "tmdate": 1762942352405, "mdate": 1762942352405, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents PRISM, a single-pass generative policy for multisensory imitation learning. PRISM integrates a Performer-based linear attention generator with Rejection Sampling Implicit Maximum Likelihood Estimation (RS-IMLE) to achieve real-time inference, handle multisensory observations, and multimodal action distributions. Unlike diffusion or flow-based policies, the proposed method performs one forward pass to produce full action trajectories.\n\nAcross MetaWorld, CALVIN, Robomimic, and real-robot loco-manipulation tasks, PRISM  achieving 10–25% higher success compared to baselines with real-time inference."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The authors tested their method in simulation and on real-robot experiments\n- Outperforms diffusion and flow policies in both simulation and real-world experiments by 10–25%.\n- Ablation studies in the appendix help to understand the impact of the performance of the different components of the method"}, "weaknesses": {"value": "- One of the main motivations for this work is multimodal action distributions. Yet, the authors did not show that their method is actually capable of learning these multimodal behaviours\n- The method has many hyperparameter such as $K’$, $\\epsilon$, Top-K weight\n- Demonstrations limited to small-scale tasks (e.g., pick-and-place, insertion); scalability to larger problems are untested\n- The proposed loss combines many heuristics. There are cleaner probabilistic formulations with the same goal of avoiding mode averaging with convergence guarantees based on e.g. mixture of experts. For example [1]. Did the authors try something along those lines?\n\n[1] Information Maximizing Curriculum: A Curriculum-Based Approach for Imitating Diverse Skills"}, "questions": {"value": "- Did the authors observe diverse behaviors using their method?\n- How robust is PRISM to variations in batch size for $ε$-calibration?\n- What is the speedup for using linear attention? I assume there is no big difference to attention since the authors use a small amount of tokens\n- Why did the authors not compare their method with the results in the official CALVIN benchmark (see http://calvin.cs.uni-freiburg.de/). Outperforming existing methods could show that the different sensor modalities help to improve performance.\n- How does PRISM scale to more complex vision-language-action (VLA) architectures or larger datasets?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None."}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "EesGgFguM2", "forum": "icnIadBCoR", "replyto": "icnIadBCoR", "signatures": ["ICLR.cc/2026/Conference/Submission22711/Reviewer_Wkef"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22711/Reviewer_Wkef"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22711/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761945415690, "cdate": 1761945415690, "tmdate": 1762942352127, "mdate": 1762942352127, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper aims to unify real-time control, multimodal sensor fusion, and multimodal action generation in a single-pass policy for imitation learning. It eliminates iterative diffusion/flow sampling while maintaining multimodal expressivity and temporal smoothness. It reframes that diffusion and flow models can be viewed as approximate stochastic regularizers of an underlying implicit mapping. The idea is to combine a temporal multisensory encoder with a Performer-based generator. The implicit generative framework ensures coverage of multimodal expert behaviors without requiring adversarial or iterative processes."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The central claim is that multimodal diversity can be achieved without iterative sampling, which is conceptually reasonable and empirically validated. It approximates the data distribution by ensuring that every expert trajectory is covered by at least one generated sample, which is a principled alternative to adversarial or diffusion-based modeling, avoiding training instability and heavy computation.\n- The model’s bidirectional attention inherently enforces motion continuity and temporal consistency. The IMLE-based formulation is mathematically consistent with prior works and extended to batch-global coverage.\n- Evaluated across different tasks and environments, including low-dimensional and high-dimensional sensory inputs to show versatility. Real-world deployment at a reasonable frequency shows that the design is practical."}, "weaknesses": {"value": "- RS-IMLE matches samples implicitly but doesn’t yield a tractable log-likelihood or uncertainty measure, limiting interpretability and making it less suitable for planning or risk-sensitive control compared to probabilistic diffusion policies.\n- The threshold scheduling is empirical. Performance can vary significantly with $\\epsilon_{RS}$ choice and the paper lacks theoretical guidance for selecting it. Tasks are short or moderately long. It’s unclear whether the pipeline retains temporal consistency over hundreds of steps.\n- Paper claims it can collapse toward the most frequent modes in the dataset and proposes to handle it by introducing soft coverage term but the justification seems empirical."}, "questions": {"value": "- Would adaptive thresholds based on local manifold density improve robustness across heterogeneous datasets?\n- How does RS-IMLE behave when the dataset contains multimodal clusters that never co-occur in a minibatch?\n- What happens if $\\epsilon_{RS}$ or K is too aggressive? Does the policy overfit to frequent modes or drift to outliers?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "7cZrIlZraG", "forum": "icnIadBCoR", "replyto": "icnIadBCoR", "signatures": ["ICLR.cc/2026/Conference/Submission22711/Reviewer_wdH2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22711/Reviewer_wdH2"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22711/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761976446631, "cdate": 1761976446631, "tmdate": 1762942351834, "mdate": 1762942351834, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces **PRISM**, a novel imitation learning framework built upon a batch-global rejection-sampling variant of IMLE. PRISM integrates inputs from multiple sensors—including RGB, depth, tactile, audio, and proprioception modalities—and employs a Performer-based architecture that enables efficient inference through a single forward pass. Extensive experiments on the MetaWorld, CALVIN, RoboMimic, and real-world Loco-Manipulation benchmarks demonstrate that PRISM consistently outperforms existing transformer- and diffusion-based imitation learning methods. These results highlight PRISM as an efficient and high-performing framework capable of modeling complex multi-modal action distributions."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper presents extensive simulation experiments across diverse tasks from **MetaWorld**, **RoboMimic**, and **CALVIN**, covering a wide range of control scenarios with varying numbers of available modalities.\n\n2. The paper includes **real-robot loco-manipulation experiments**, which validate the effectiveness of the proposed **PRISM** method in real-world settings.\n\n3. The paper is **well-written** and provides comprehensive details."}, "weaknesses": {"value": "1. The proposed **PRISM** method is compared against different sets of baselines across benchmarks. This appears to result from directly adopting results from the original papers, which may not be an ideal practice (please correct me if I am mistaken). It would strengthen the evaluation if the authors could include a consistent set of baselines or at least some major baselines should be available across all benchmarks. Additionally, the naming of baselines varies between benchmarks, which introduces potential ambiguity.\n\n2. The paper lacks detailed descriptions of **baseline implementations**. For example, it is unclear which modalities are used by each baseline and how they are modified to incorporate multiple modalities. A dedicated section detailing the implementation and modality integration of baselines is highly recommended.\n\n3. It is noted that **AdaFlow** outperforms PRISM on the **RoboMimic** benchmark, despite a slightly higher NFE. The authors are encouraged to discuss this result and, if possible, provide additional comparisons across other benchmarks.\n\n4. The authors should consider adding a more **comprehensive breakdown** of PRISM’s performance under different modality combinations. While the current paper includes breakdowns on **CALVIN** with occlusion, depth dropout, and tactile dropout, it would be valuable to explore more modality combinations. Furthermore, the authors should analyze the effect of each modality and discuss whether some modalities are redundant or whether PRISM fails to effectively leverage them."}, "questions": {"value": "1. (Related to Weakness 1) Is **“DP” in MetaWorld**, **“Diffusion Policy” in CALVIN and the real-robot suite**, and **“DDiM” in RoboMimic** referring to the same algorithm? Likewise, does **“FlowPolicy” in MetaWorld**, **“Flow Matching Policy” in CALVIN**, and **“Flow Matching” in the real-robot suite** represent the same method? If so, the same algorithm should be consistently named across different benchmarks to avoid confusion.\n\n2. (Related to Weakness 2) I am unclear about which modalities are used by the baselines and how they are integrated. For example, **3D Diffusion Policy (DP3)** relies on point cloud inputs, which are typically derived from depth maps. However, as stated in **Appendix C.1**, **MetaWorld** does not provide depth information. This discrepancy suggests that the authors may have directly taken results from the original papers (please correct me if I am mistaken).\n\n3. Can the authors explain in detail how action selection is done during inference without action target labels ? I am confused about **ProxyScore** and **deterministic tie-break** in Algorithm 2.\n\n4. As shown in **Figure 1**, text is listed as one of the modalities supported by the proposed method. However, I could not find any experiments involving text inputs. Could the authors clarify why such experiments were not included?\n\n5. Did the authors use any **pre-trained encoders** for sensor feature extraction? If not, it is recommended that they consider incorporating pre-trained encoders in future work."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "LR77IBdOu5", "forum": "icnIadBCoR", "replyto": "icnIadBCoR", "signatures": ["ICLR.cc/2026/Conference/Submission22711/Reviewer_9mYo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22711/Reviewer_9mYo"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22711/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761979151308, "cdate": 1761979151308, "tmdate": 1762942350906, "mdate": 1762942350906, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}