{"id": "iCprPzyrRp", "number": 14824, "cdate": 1758244394929, "mdate": 1763633093513, "content": {"title": "From Cheap Geometry to Expensive Physics: Elevating Neural Operators via Latent Shape Pretraining", "abstract": "Industrial design evaluation often relies on high-fidelity simulations of governing partial differential equations (PDEs). While accurate, these simulations are computationally expensive, making dense exploration of design spaces impractical. Operator learning has emerged as a promising approach to accelerate PDE solution prediction; however, its effectiveness is often limited by the scarcity of labeled physics-based data. At the same time, large numbers of geometry-only candidate designs are readily available but remain largely untapped. We propose a two-stage framework to better exploit this abundant, physics-agnostic resource and improve supervised operator learning under limited labeled data. In Stage 1, we pretrain an autoencoder on a geometry reconstruction task to learn an expressive latent representation without PDE labels. In Stage 2, the neural operator is trained in a standard supervised manner to predict PDE solutions, using the pretrained latent embeddings as inputs instead of raw point clouds. Transformer-based architectures are adopted for both the autoencoder and the neural operator to handle point cloud data and integrate both stages seamlessly. Across four PDE datasets and three state-of-the-art transformer-based neural operators, our approach consistently improves prediction accuracy compared to models trained directly on raw point cloud inputs. These results demonstrate that representations from physics-agnostic pretraining provide a powerful foundation for data-efficient operator learning.", "tldr": "", "keywords": ["Neural Operator", "Pretraining", "Physics-agnostic", "Partial Differential Equation", "Autoencoder"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2c098ba751ab494a416132347a2ff4eecfc72c14.pdf", "supplementary_material": "/attachment/dc8cd22e0d8942404063173fb016afae1bec12d9.zip"}, "replies": [{"content": {"summary": {"value": "Pre-training of neural operators using geometry information."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Well written. The author motivated the geometry-based pre-training strategy well.\n- Considered various benchmark problems.\n- Considered various recently proposed backbone architectures.\n- Error bars."}, "weaknesses": {"value": "- line 53: This method is also limited to varying geometry problems. To say something about applicability to general PDE problems, it is necessary to show effectiveness on a non-varying geometry problem.\n- Relative $L^2$ errors are too high—for engineering applications, two to three digits of accuracy is usually recommended. However, more than 10% of error makes it difficult to see whether the improvement comes from the proposed method or optimization error.\n- The paper tackled data scarcity. However, the reader may not agree that more than 800 training data points are scarce. Especially, the AirfRans dataset provides data data-scarce scenario. Reporting the result in such a scenario may boost the credibility of this work.\n- Asserting the encoder as a learned chart for the moduli space is good, but there was no quantitative validation of it. Reporting the distance between two latent codes from two point clouds representing the same geometry would improve the claim.\n- Perhaps, further truncation of the AirfRans domain was due to failure in the original domain. (In fact, the original domain of the AirfRans dataset had been truncated already.)"}, "questions": {"value": "- Training time ratio for 1st and 2nd stages?\n- LNO is the most recent, but performed the worst. Could you comment on that?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "vJpkdtLO6o", "forum": "iCprPzyrRp", "replyto": "iCprPzyrRp", "signatures": ["ICLR.cc/2026/Conference/Submission14824/Reviewer_pbnB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14824/Reviewer_pbnB"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761166898017, "cdate": 1761166898017, "tmdate": 1762925173871, "mdate": 1762925173871, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a two-stage training framework for neural operator learning that leverages geometry only data (like cheap, unlabeled, physics-agnostic data) to improve performance on PDE solution predictions (via expensive, label-scarce physics data). This approach combines representation learning and operator learning, allowing physics-informed models to benefit from geometry-only datasets. This is typically ignored in standard PDE modeling."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "* well-motivated framework bridging geometric pretraining and operator learning. PDE-based simulations (like CFD, elasticity, electromagnetics and so on) are computationally expensive, while 3D geometries are normally cheap to obtain. \n* The occupancy field proxy is neat. It’s simple, generalizable and physics-agnostic. It seems to effectively force the encoder to learn spatial and structural priors that are transferrable to PDE learning tasks.\n* The authors test some alternative proxy tasks (like signed distance fields, shortest vectors etc) and show comparable or improved results, especially for CFD datasets.\n * There is nice integration with Transformer-based Neural Operators. The latent embeddings are seamlessly fed into three state-of-the-art transformer-based neural operators. This makes for broad applicability and makes the contribution compatible with ongoing work in neural operator transformers.\n* Demonstrated generality across problems and architectures\n* Good experiments\n* The authors are honest about limitations"}, "weaknesses": {"value": "* Lack of joint optimization between pretraining and PDE stages.\n* Limited exploration of theoretical connections between learned latent and PDE operator manifolds.\n* Real-world benchmarks (e.g., turbulence, multiphysics coupling and stuff like that) could further validate scalability. The latter is important yet not discussed enough.\n* The authors themselves allude to some limitations / weaknesses. Complex geometries with multiple interacting components may require multi-class or more expressive proxies. The lack of joint fine-tuning may limit performance."}, "questions": {"value": "On page 1 you comment on fixed-grid structures. Don’t you mean fixed topology?\n\nPg2 input function space is assumed to contain only geometry info. How much of a limitation do you see this as, and how might this be extended?\n\nPg4 you define \\epsilon \\sim N(0,1). Then on pg 5 you have \\epsilon as the scale param in another N(0,\\epsilon I). The latter use implies \\epsilon > 0, at odds with the first usage definition.\n\nPg6 you exclude hyperparam tuning. I get your focus on the 2-stage training – but surely one of the selling points of the work is the superior performance, so it’s important to understand better the context of the reported results. Can you comment more?\n\nPg 7 – re. comment about unnorm data sets and MSE. Can’t you present NMSE, or R^2?\n\nReferences – you should protect capitals – like {N}avier-{S}tokes etc."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "none"}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "yDDHyBsya9", "forum": "iCprPzyrRp", "replyto": "iCprPzyrRp", "signatures": ["ICLR.cc/2026/Conference/Submission14824/Reviewer_hYfi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14824/Reviewer_hYfi"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761679032460, "cdate": 1761679032460, "tmdate": 1762925173421, "mdate": 1762925173421, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors of this work proposed a novel deep learning framework for the prediction of quantities of interest in computational mechanics such as stress, pressure, and velocity, where the solution of PDEs depend on the geometry of the computational domain. The tested their network by choosing dataset from fluid, solid, and electrical engineering and showed the performance by reporting relative errors in L2 norm. The study includes both 2D and 3D examples. At high level, the network has two stages, in the first stage, there is an encoder that only learns the geometric feature of computational domain from a set of point clouds. In stage 2, there is operator learning to learn PDE variables. Combing the features learned from stage 1 and stage 2, the network predicts variables in query coordinates."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The article is about an important subject in computational mechanics where we would like to accelerate geometric design, depending on various parameters, and we use deep learning frameworks for this goal. So, the topic is important. The authors investigated the performance using different datasets both from fluid and solid mechanics as well as electrical engineering (rather than only one dataset or one specific application)."}, "weaknesses": {"value": "As I mentioned in the Strengths section, the problem has been well defined. But I strongly believe that to overcome the challenge of this problem, there have been a class of point-cloud based neural networks (e.g., PointNet, PointNet++, etc.) that have been used for computational mechanics problems. PointNet has been introduced in 2017 and the usage of PointNet in CFD was introduced in 2021 for the first time and later on, there have been so many usage of PointNet in this area. Here is a list of some papers:\n\nPointNet and PointNet ++ in computer graphics:\n\nhttps://openaccess.thecvf.com/content_cvpr_2017/html/Qi_PointNet_Deep_Learning_CVPR_2017_paper.html\n\nhttps://proceedings.neurips.cc/paper/2017/hash/d8bf84be3800d12f74d8b05e9b89836f-Abstract.html\n\nPointNet for CFD:\n\nhttps://doi.org/10.1063/5.0033376\n\nPointNet for PINNs:\n\nhttps://doi.org/10.1016/j.jcp.2022.111510\n\nPointNet for Operator Learning:\n\nhttps://doi.org/10.1016/j.cma.2024.117130\n\nPointNet for KANs:\n\nhttps://doi.org/10.1016/j.cma.2025.117888\n\nNone of these papers have been cited by the authors. So, I imagine that they have been not aware of these methodology. Because these networks handle the same issue mentioned by the authors in more efficient ways. There is only one network that learns both geometric features and also PDE variables (e.g., velocity, pressure, temperature, etc.) simultaneously. The proposed method in this article, while works, but it is very complicated in comparison. It has two stages and requires pre and post processing as explained by the authors. In simple words, the authors tried to learn geometry and variables in two different networks, while both can be learned simultaneously in one network. I like the idea; however, we need to introduce something more efficient compared to what have been developed so far; otherwise, what is the motivation for using this new method.\n\nA few other comments:\n\nI think Figure 1 is redundant, Figure 2 can be also presented better, in the main body of the article, we could have more visual results and comparison between different methods. There are some bold words in abstract, I do not think it is good to make them bold. Introduction is relatively long for ICLR and the methodology has been explained very briefly. Moreover, in the results, again there are some details about the dataset which could be moved to the supplementary sections. Numbers in tables are written using a large, unusual font sizes."}, "questions": {"value": "Have you ever tried PointNet, PointNet++, and other point-cloud based neural networks for solving these problems? Please see the details of my explanation in the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "uKIP4xwc9g", "forum": "iCprPzyrRp", "replyto": "iCprPzyrRp", "signatures": ["ICLR.cc/2026/Conference/Submission14824/Reviewer_xrAn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14824/Reviewer_xrAn"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761917448716, "cdate": 1761917448716, "tmdate": 1762925172683, "mdate": 1762925172683, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a two-stage operator learning framework that first learns a latent geometric representation using an occupancy prediction model, followed by conditional inference for query locations through a transformer-based neural operator. The method is validated on four 2D and 3D examples by comparing relative L2 errors across three major operator learning models. The results consistently demonstrate performance improvements over the baseline models. The paper also discusses how increased dataset variability enhances performance and analyzes the effect of different KL coefficients."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The idea presented in this paper is clear and well-motivated. The use of cross-attention for learning latent geometric representations is interesting and may have broader applicability to PDE-based surrogate modeling approaches.\n2. Table 2 provides a comprehensive comparison between the proposed method and three other approaches, enhancing the credibility of the results.\n3. The ablation studies are clearly presented and address two important aspects: the effect of KL weights and the impact of geometric data variability."}, "weaknesses": {"value": "1. The paper mainly evaluates model performance in terms of relative L2 error. However, introducing Stage 1 may introduce additional computational costs, which are not measured. Moreover, the advantages of transforming the original point cloud into a latent geometric representation are not fully explored. For instance, could this help reduce inference time for temporal propagation since the propagation occurs in latent space?\n2. Table 6 shows that an AE alone suffices for the AirfRANS dataset, making VAE unnecessary. A similar analysis on the other datasets would help clarify this observation.\n3. Finally, there is no comparison with other geometry-agnostic methods, such as “Li, Zongyi, et al. Geometry-informed neural operator for large-scale 3D PDEs. Advances in Neural Information Processing Systems 36 (2023): 35836–35854.” Without such comparisons, it is difficult to assess the effectiveness of the proposed method fully."}, "questions": {"value": "1. A clear computational cost study is needed to show a balance of the performance win and the speed reduction since the proposed approach introduces an additional stage compared to other models.\n2. How to address problems with sharp boundaries and more chaotic dynamics, such as turbulence, with the proposed approach?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "CdnoIQfsH3", "forum": "iCprPzyrRp", "replyto": "iCprPzyrRp", "signatures": ["ICLR.cc/2026/Conference/Submission14824/Reviewer_En7x"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14824/Reviewer_En7x"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762131625291, "cdate": 1762131625291, "tmdate": 1762925172193, "mdate": 1762925172193, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}