{"id": "ifgApKmXIQ", "number": 15251, "cdate": 1758249327250, "mdate": 1759897317935, "content": {"title": "GSPRec: Temporal-Aware Graph Spectral Filtering for Recommendation", "abstract": "Graph-based recommendation systems are effective at modeling collaborative patterns but often suffer from two limitations: overreliance on low-pass filtering, which suppresses user-specific signals, and omission of sequential dynamics in graph construction. We introduce GSPRec, a graph spectral model that integrates temporal transitions through sequentially-informed graph construction and applies frequency-aware filtering in the spectral domain. GSPRec encodes item transitions via multi-hop diffusion to enable the use of symmetric Laplacians for spectral processing. To capture user preferences, we design a dual-filtering mechanism: a Gaussian bandpass filter to extract mid-frequency, user-level patterns, and a low-pass filter to retain global trends. Extensive experiments on four public datasets show that GSPRec consistently outperforms baselines, with an average improvement of 6.77% in NDCG@10. Ablation studies show the complementary benefits of both sequential graph augmentation and bandpass filtering.", "tldr": "GSPRec is a graph spectral model for recommendations using temporal transitions and dual frequency-aware filters to capture user-specific patterns and global trends.", "keywords": ["Recommendation Systems", "Graph Signal Processing", "Spectral Filtering", "Collaborative Filtering"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/01f1ee50e32ba028ed56589383812153c184aae5.pdf", "supplementary_material": "/attachment/46d864a34fe69a4ce19fb4a565c3f689651c0d65.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposed a novel approach that incorporates sequential information to construct an item–item relation graph and to design a bandpass filter. By integrating sequential patterns into user–item interactions, the authors argued that the model can better capture meaningful semantic relationships among users and items. In addition, the proposed method exploited not only low-frequency components, but also mid- and high-frequency components that encode localized and task-relevant variations."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "(S1) The paper proposed a new approach to modeling item–item relations by explicitly utilizing sequential information in a bidirectional manner.\n\n(S2) The newly proposed band-pass filter was theoretically well defined, enabling the model to exploit not only low-frequency components but also mid- and high-frequency components."}, "weaknesses": {"value": "(W1) The method increases computational complexity, while the performance gain from the multi-hop diffusion component is relatively limited.\n\n(W2) The experimental results for hyperparameter sensitivity showed an inconsistent tendency that does not align with the implementation details.\n\n(W3) Most importantly, due to the fact that the method leverages additional information (e.g., sequential information) that is not typically available to conventional collaborative filtering baselines, the comparison with those baselines is not entirely fair."}, "questions": {"value": "1. The proposed method constructed item-item relation graph using sequential information in a bidirectional formulation. However, in sequential settings where order is crucial, doesn’t a bidirectional formulation break the order signal?\n\n2. There exists a graph signal processing-based model for sequential recommendation, namely FIRE (WWW’22). However, the paper did not provide a comparison between FIRE and the proposed model. It would be valuable if the authors could include a performance comparison between the two models.\n\n3. The design of the filter function appeared somewhat arbitrary, as it adopted an exponential-shaped form without a clear theoretical justification. In addition, when the model filtering low-frequency components, it performed eigen-decomposition for the adjacency matrix. If the eigenbasis is already available, why not directly using mid- or high-frequency components instead of designing a bandpass filter?\n\n4. In parameter sensitivity shown in Figures 4 and 5, the proposed models with w = 0.1 appeared to achieve the best performance in most settings. Nevertheless, the models treated w as a tunable hyperparameter. In addition, Table 3 represented the filter parameters across dataset, but these reported values do not seem to match the trends observed in parameter sensitivity. Could the authors clarify why w is left as a tunable hyperparameter, and how the reported parameter choices in Table 3 were determined?\n\n5. In Tables 5 and 6, the results included the notation “SE”, which I interpret as the standard error. However, according to my understanding, the proposed method is based on graph signal processing and does not involve a learning or training process. In that case, the model should be deterministic, and it is not clear why there would be any standard error. Could the authors clarify the source of this standard error and how it was computed?\n\n6. In the proposed model, the band-pass filter component in Eq (8) performs normalization on the item side, while the low-pass filter in Eq (9) performs normalization that jointly considers both users and items. I agree that each choice can be justified individually. However, I am not fully convinced that it is appropriate to apply two different normalization schemes to components derived from the same adjacency structure, and then simply combine them with a weighted sum at the end."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "65mof8pkMv", "forum": "ifgApKmXIQ", "replyto": "ifgApKmXIQ", "signatures": ["ICLR.cc/2026/Conference/Submission15251/Reviewer_nV8G"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15251/Reviewer_nV8G"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15251/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761741471935, "cdate": 1761741471935, "tmdate": 1762925548372, "mdate": 1762925548372, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes GSPRec, a temporal-aware graph spectral filtering approach for collaborative filtering. The method addresses limitations of existing graph-based methods that rely primarily on user-item interactions and low-pass filtering. The key contributions are: (1) a sequential graph construction approach that integrates temporal transition patterns from user sequences through symmetrization and multi-hop diffusion, capturing both direct and indirect item relationships; (2) a novel bandpass filtering design that targets mid-frequency spectral components to extract community-level personalization patterns, distinguishing it from prior work using low-pass or high-pass filtering; (3) a dual-filter architecture combining Gaussian bandpass and lowpass filters to balance personalized recommendations with global popularity. Experiments on four datasets demonstrate consistent performance improvements over baselines, with ablation studies showing bandpass filtering as the primary contributor. The work offers a frequency-aware perspective for analyzing collaborative signals in recommendation systems."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces bandpass filtering to recommendation systems, explicitly targeting mid-frequency components—a distinct approach from prior GSP methods that focus on low-pass or high-pass filtering. The dual-filter architecture combining bandpass and lowpass filters represents a new design for balancing personalization and popularity in spectral collaborative filtering.\n\n2. The paper offers a new lens for understanding collaborative signals through spectral analysis, proposing that different frequency components may capture different aspects of user preferences (e.g., low-frequency for global popularity, mid-frequency for community patterns). While the universality of this hypothesis requires further investigation (as noted in Weaknesses), this frequency-aware perspective provides a valuable framework for analyzing recommendation signals.\n\n3. Experimental results demonstrate the method's effectiveness across multiple datasets with varying characteristics. The approach shows consistent improvements over baseline methods, and ablation analysis indicates that bandpass filtering contributes substantially to overall performance. The results suggest that the proposed frequency-aware filtering approach offers practical benefits for recommendation tasks."}, "weaknesses": {"value": "1.  Unclear Utilization of Temporal Information\n\tThe paper claims to be \"Temporal-Aware\" throughout, but the utilization of temporal order is not clearly demonstrated. Lines 196-198 symmetrize the sequential transition matrix (S⁰[i,j] = 1 if i→j OR j→i exists), and Equation (3) produces a symmetric matrix S̃ where S̃[a,b] = S̃[b,a]. While the authors note this symmetrization is required for spectral analysis (lines 183-185), it remains unclear how the method distinguishes \"a→b\" from \"b→a\" given that undirected graphs with symmetric adjacency do not naturally encode directionality. The method may primarily capture sequential co-occurrence rather than temporal order. The authors should clarify how directional information is preserved or acknowledge this as a limitation.\n\n2.Parameter Inconsistencies with Sensitivity Analysis\n\tFigure 4 reveals apparent contradictions with Table 3 for the Beauty dataset. The sensitivity curves suggest better performance at lower c values (around c=0.25 with w=0.1), while Table 3 reports c=0.8 and w=0.3 as optimal. Additionally, the monotonic decrease in Figure 4 appears inconsistent with the paper's hypothesis that mid-frequency (c≈0.5) captures optimal personalization (lines 294-299). This raises questions about: (1) which parameters were used for Table 4 results, (2) whether the mid-frequency hypothesis applies to all datasets, and (3) whether bandpass filtering is necessary for Beauty. Beauty-specific ablation experiments (analogous to Table 5) would help clarify these points.\n\n3. Missing Comparisons with Sequential Baselines\n\tTable 1 lists BERT4Rec and SASRec as relevant methods, but Table 4 does not include experimental comparisons with them. Given that these methods preserve temporal order through positional encodings and attention mechanisms, they would serve as appropriate baselines for evaluating \"Temporal-Aware\" claims. Comparisons with these sequential recommendation approaches would help assess the trade-offs between the proposed graph-based approach and methods that explicitly maintain temporal information."}, "questions": {"value": "1.How is directional information from sequences preserved after symmetrization, and should the \"Temporal-Aware\" claim be reconsidered?\n2.What explains the parameter discrepancy between Table 3 (c=0.8, w=0.3) and Figure 4 (suggesting c≈0.25, w=0.1) for Beauty? Which parameters were used for Table 4?\n3.Why were BERT4Rec and SASRec (listed in Table 1) not included in experimental comparisons?\n4.Can the authors provide Beauty-specific ablation experiments and clarify the definitions of ablation variants (GSPRec-NB/NL/NS/SE)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "73BHDlNgZG", "forum": "ifgApKmXIQ", "replyto": "ifgApKmXIQ", "signatures": ["ICLR.cc/2026/Conference/Submission15251/Reviewer_oPrG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15251/Reviewer_oPrG"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15251/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761892484344, "cdate": 1761892484344, "tmdate": 1762925547479, "mdate": 1762925547479, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes GSPRec, a graph-spectral recommendation model that first turns user sequences into a symmetric item-item graph via multi-hop diffusion and then applies a dual spectral filter, which is a Gaussian bandpass to mine mid-frequency, user-specific patterns and a lowpass to keep global popularity, before fusing both signals to predict the next interaction."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. By transforming raw click sequences into a symmetric graph before spectral filtering, GSPRec preserves temporal cues while maintaining the stability of eigendecomposition.\n\n2. The entire pipeline requires only matrix decomposition and lightweight filters, demonstrating high efficiency as shown in the experiments.\n\n3. The conducted experiments demonstrate the superior performance of the proposed method."}, "weaknesses": {"value": "1. Throughout the paper the mid-frequency Gaussian bandpass is said to capture ‘user-specific sequential patterns’. Is there any case study to demonstrate it?\n\n2. The experiments only report aggregate top-k accuracy, but emphasizing mid-frequency components may systematically boost long-tail items and thus change the exposure distribution. Could the authors include fairness-aware metrics in the experiments?"}, "questions": {"value": "See Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "21cxVBXvqm", "forum": "ifgApKmXIQ", "replyto": "ifgApKmXIQ", "signatures": ["ICLR.cc/2026/Conference/Submission15251/Reviewer_3fBT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15251/Reviewer_3fBT"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15251/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762247051072, "cdate": 1762247051072, "tmdate": 1762925547005, "mdate": 1762925547005, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}