{"id": "ih1oyr0j6y", "number": 13027, "cdate": 1758212829337, "mdate": 1759897470160, "content": {"title": "Accelerate Diffusion Transformers with Feature Momentum", "abstract": "Diffusion models have demonstrated outstanding generative capabilities in image and video synthesis. However, their heavy computational burden, particularly due to the sequential denoising process and large model sizes, makes them challenging to meet real-time application demands. In this paper, motivated by the continuity of diffusion models in the feature space, we introduce FeMo, which employs a momentum mechanism to stabilize the dynamics of diffusion models in different timesteps, allowing us to accurately predict the features in the future timesteps based on the historical information. Additionally, we further propose an Adapted-FeMo, which allows for adaptive searching for the optimal coefficient for each generated sample. Extensive experiments demonstrate its effectiveness, e.g., a 4.99$\\times$ acceleration on FLUX with 0.86% improvements on image reward.Under the condition of maintaining generation quality, Adapted-FeMo achieves a maximum speedup of 7.10$\\times$ on DiT and 6.24$\\times$ on FLUX. Our codes are available in the supplementary material and will be released on Github.", "tldr": "We propose FeMo, a momentum-based acceleration framework for diffusion models that predicts future features from historical steps, and Adapted-FeMo, which achieving up to 7.1× speedup without sacrificing generation quality.", "keywords": ["Diffusion Models", "Model Acceleration", "Adaptive Momentum"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b3fe12e9bb5f6ca65cb1a8b6e36a2298e84e9c9f.pdf", "supplementary_material": "/attachment/b50c8478896cc97acd1957e182a67f02b49fec75.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a feature momentum mechanism called FeMo, which aims to accelerate diffusion transformers by predicting future step features in the diffusion process using a momentum-inspired adaptive method. Subsequently, Adapted-FeMo is constructed by introducing a momentum coefficient for each sample, further minimizing prediction errors. To verify the effectiveness of FeMo and Adapted-FeMo, the authors conducted extensive comparisons with the latest state-of-the-art baselines in image and text-to-image generation tasks. The results show that while maintaining generation quality, Adapted-FeMo achieves a maximum speedup of 7.10x on the DiT model and a maximum speedup of 6.24x on the FLUX model."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The experiments are sufficiently comprehensive with rich metrics. This paper conducts benchmark tests on text-to-image and class-conditional tasks, and provides multiple metrics (such as FLOP, latency, FID, sFID, LPIPS, etc.) as well as quantitative performance of various acceleration mechanisms.\n2. The paper conforms to the paradigm of \"cache first, then predict\" and effectively solves the problem of finite difference approximation oscillation existing in this paradigm.\n3. The mathematical derivation of the paper is relatively sound, with clear update equations and error proofs for FeMo."}, "weaknesses": {"value": "1. The idea of introducing momentum methods into diffusion models for acceleration has been widely proposed and implemented [1-2], which affects the innovativeness of this paper to a certain extent.\n2. The task scenarios do not cover other diffusion model tasks such as video generation and image editing, and the acceleration effect of FeMo in dynamic sequences or non-generative tasks remains to be verified.\n3. Key parameters (e.g., $\\beta$) need to be set empirically with defined ranges, and the adaptive mechanism is subject to manual constraints.\n\n[1] Wang X, Dinh A D, Liu D, et al. Boosting Diffusion Models with an Adaptive Momentum Sampler[C]//IJCAI. 2024: 1416-1424.\n\n[2] Wu Z, Zhou P, Kawaguchi K, et al. Momentum-accelerated Diffusion Process for Faster Training and Sampling[J]."}, "questions": {"value": "1. Tables 1 and 2 in the appendix show the experimental results of FeMo and Adapted-FeMo respectively, but the difference between the two is not significant under certain configurations (e.g., $\\mathcal{N}=10, \\mathcal{O}=1$ and $\\mathcal{N}=3, \\mathcal{O}=2$). How do the authors view the issue of Adapted-FeMo's ineffectiveness in such cases?\n2. Some previous studies have shown that the sampling trajectories of diffusion models in 3D space are very similar.[1] Is this contradictory to the findings in Figure 2 of this paper?\n3. Have the authors explored the maximum acceleration effect of FeMo and Adapted-FeMo?\n\n[1] Defang Chen, Zhenyu Zhou, Can Wang, Chunhua Shen, and Siwei Lyu. On the trajectory regularity of ode-based diffusion sampling. arXiv preprint arXiv:2405.11326, 2024."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "rSUzUnghXm", "forum": "ih1oyr0j6y", "replyto": "ih1oyr0j6y", "signatures": ["ICLR.cc/2026/Conference/Submission13027/Reviewer_Vsqw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13027/Reviewer_Vsqw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13027/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761722138538, "cdate": 1761722138538, "tmdate": 1762923761893, "mdate": 1762923761893, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes the Feature Momentum (FEMO) algorithm, which leverages a “cache-then-reuse” strategy based on the assumption that features from previous timesteps are similar to those in subsequent ones. The authors incorporate a momentum mechanism that predicts features across different timesteps, which they claim capture the temporal dynamics of diffusion models. Additionally, they propose Adapted-FEMO, an extension that adaptively searches for the optimal momentum coefficient for each generated sample. According to the authors, their approach achieves up to 7.10× speedup on DiT and 6.24× on FLUX."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper proposed a momentum mechanism to model the dynamics of diffusion models in different timesteps to predict features of diffusion models."}, "weaknesses": {"value": "The paper needs to be rewrite to make sure clarity, especially the description of the algorithm. For example,\nThe sub-section: Feature Caching and predicting for Diffusion model did not provide reference."}, "questions": {"value": "What does eqn. (3) means\nFigure 4: what are (a) and (b) referred to in the caption, and the color used is too light. It is hard to read. \n% in T%N is not an standard operator. What is the definition?\nThe authors stated that: \"T is the full activation step closest to the first feature reuse step. It\ntypically does not directly equal the total number of timesteps\"\nPossible mistakes:\n1. I believe there is a mistake in eqn. (1). It should be $\\bar{\\alpha}$, not $\\alpha$, in order to have eqn. (2) follows. Equ. (1) is an approximate of the diffusion model. I suggest to use the SDE form for definition. \n2. $\\epsilon_t$ or  $\\epsilon_{\\theta}$"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6jibdg9jGb", "forum": "ih1oyr0j6y", "replyto": "ih1oyr0j6y", "signatures": ["ICLR.cc/2026/Conference/Submission13027/Reviewer_yGZN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13027/Reviewer_yGZN"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13027/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761843029999, "cdate": 1761843029999, "tmdate": 1762923761442, "mdate": 1762923761442, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a training-free acceleration framework for diffusion transformers, namely Feature Momentum (FEMO) and its adaptive variant Adapted-FEMO. FEMO leverages a momentum mechanism to predict future features from the derivatives of historical representations, thereby skipping redundant computations and significantly accelerating inference. Adapted-FEMO further introduces an adaptive weighting mechanism that dynamically adjusts the momentum coefficient based on the feature trajectory of each sample, improving robustness and generality. Experimental results show that FEMO and Adapted-FEMO achieve up to 7.10× acceleration and 6.24× on DiT and FLUX models while maintaining image quality, demonstrating their effectiveness and applicability in accelerating diffusion model inference."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces the FEMO framework, which employs a momentum-based prediction mechanism to estimate future features and skip computation steps, achieving substantial inference acceleration.\n\n2. Experiments show that FEMO and Adapted-FEMO can achieve high speedup ratios on FLUX and DiT models with almost no degradation in generation quality, indicating that they have high practical value and robustness.\n\n3. The work provides an error-bound analysis and bias correction mechanism, combining theoretical reasoning with empirical validation to support the proposed approach."}, "weaknesses": {"value": "1. **Scalability of the paper.** The experiments focus on visual diffusion models, such as DiT and FLUX, but there are relatively few experiments on other types or for different modalities. It is hoped that relevant experiments can be added to demonstrate the model's generality and scalability.\n\n2. **Limited theoretical depth.** Although the paper provides error bound analysis, the discussion of the theoretical performance guarantees of FEMO and Adapted-FEMO in different models and tasks is not in-depth enough, such as the convergence and stability analysis of the momentum mechanism under different models.\n\n3. **Lack of discussion on limitations** The paper does not adequately analyze potential failure cases. For instance, when feature trajectories change abruptly under high-noise or complex conditions, the momentum mechanism may mispredict feature directions, and the adaptive $\\beta$ update may become unstable under distribution shifts. A more thorough discussion of these limitations would improve transparency."}, "questions": {"value": "1. From a theoretical perspective, can the momentum mechanism in FEMO be interpreted as a first-order integral form of an ODE solver? If so, could this connection to numerical integration theory provide stronger mathematical support for the method’s design?\n\n2. Does the $\\beta$-update rule in Adapted-FEMO have convergence or stability guarantees? If $\\beta$ is iteratively updated, could momentum drift or oscillation occur, and how might that affect robustness? Including a formal analysis or empirical validation would be valuable.\n\n3. Regarding reproducibility: what are the additional computational and memory costs of FEMO? Does the caching process introduce significant overhead? Could the authors provide more details or visualizations on hyperparameter sensitivity and memory consumption?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "nU8yQawhz6", "forum": "ih1oyr0j6y", "replyto": "ih1oyr0j6y", "signatures": ["ICLR.cc/2026/Conference/Submission13027/Reviewer_vmTb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13027/Reviewer_vmTb"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13027/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761917891626, "cdate": 1761917891626, "tmdate": 1762923761030, "mdate": 1762923761030, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose FEMO (Feature Momentum), a training-free method for cache-based sampling acceleration in Diffusion Transformers. This work improves upon the \"cache-then-forecast\" paradigm by introducing a momentum mechanism. Instead of relying on noise-sensitive, high-order derivatives like previous methods , FEMO predicts future features by calculating a stable, weighted trend of historical features, allowing computation steps to be skipped. The method achieves state-of-the-art acceleration compared to existing cache-based methods."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "+ The method achieves a large speedups on Diffusion Transformers sampling acceleration compared to existing cache-based methods.\n+ FEMO is a plug-and-play accelerator that can be applied to pre-trained models without any retraining or fine-tuning."}, "weaknesses": {"value": "+ The paper's central claim to novelty is applying \"Feature Momentum\" for diffusion acceleration. However, the use of momentum in diffusion model acceleration is not new, and the paper fails to cite or discuss the extensive literature on this topic. While the authors may argue that FEMO applies momentum to *feature caching* rather than the *forward/reverse* process, these are deeply related concepts, as both leverage historical information throughout the diffusion process (forward or reverse). This omission prevents a clear differentiation of FEMO's contribution and significantly overstates its originality. For example:\n  +  Sampling Acceleration:\n\n  [1] Wizadwongsa, S., et al. \"Diffusion Sampling with Momentum for Mitigating Divergence Artifacts.\" ICLR 2024.\n\n  [2] Daras, G., et al. \"Soft Diffusion: Score Matching with General Corruptions.\" TMLR.\n\n  [3] Wang, X., et al. \"Boosting Diffusion Models with an Adaptive Momentum Sampler.\" IJCAI 2024.\n\n  + Diffusion Process Acceleration:\n\n  [4] Dockhorn, T., et al. \"Score-Based Generative Modeling with Critically-Damped Langevin Diffusion.\" ICLR 2022.\n\n  [5] Wu, Z., et al. \"Fast diffusion model.\" arXiv 2023.\n\n+ The paper's title and claims are overly broad, suggesting a general method to \"Accelerate Diffusion Transformers\". However, the proposed method is specifically a **cache-based acceleration** technique, and its novelty is primarily within this sub-field. More, the experiments are made exclusively against other feature-caching baselines. The paper does not compare against other major acceleration families, such as fast samplers or model distillation. The claims and title should be refined to more accurately reflect this contribution.\n\n+ The method's mechanism for momentum accumulation requires further justification. It builds a momentum term from a sparse history of computation steps (e.g., <6 steps in a 7.1x speedup setting), which differs significantly from traditional momentum (in optimizers or EMA) that relies on many steps for a stable estimate. The paper would benefit from a theoretical or empirical analysis of the stability and accuracy of this sparse-sampling approach.\n\n+ The \"Adapted-FEMO\" variant introduces a notable number of hyperparameters (e.g., $\\mathcal{N}$, $\\mathcal{O}$, initial $\\beta$, $\\gamma$, and $\\beta$-bounds) that require careful tuning, which could present challenges for reproducibility. There also appears to be a disconnect between the theoretical optimum derived for $\\beta$ (Eq. 13) and the final implementation, which relies on a complex, heuristic-based adaptive search. It is unclear how this compares to prior momentum-based works [4, 5] that directly use the theoretical optimal coefficients.\n\n+ There appear to be citation errors in the manuscript. For instance, the primary baseline \"TaylorSeer\" is repeatedly cited, but the corresponding bibliography entry seems to point to an unrelated paper (\"Timestep embedding tells: It's time to cache for video diffusion model\")."}, "questions": {"value": "see weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "MlKK5k8AmT", "forum": "ih1oyr0j6y", "replyto": "ih1oyr0j6y", "signatures": ["ICLR.cc/2026/Conference/Submission13027/Reviewer_eFwD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13027/Reviewer_eFwD"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission13027/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761936873200, "cdate": 1761936873200, "tmdate": 1762923760576, "mdate": 1762923760576, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}