{"id": "IlBr5JJsCj", "number": 15460, "cdate": 1758251577192, "mdate": 1759897305605, "content": {"title": "MoRA: Mobility as the Backbone for Geospatial Representation Learning at Scale", "abstract": "Representation learning of geospatial locations remains a core challenge in achieving general geospatial intelligence, with increasingly diverging philosophies and techniques. While Earth observation paradigms excel at depicting locations in their physical states, we claim that a location's comprehensive \"meaning\" is better grounded in its internal human activity patterns and, crucially, its functional relationships with other locations, as revealed by human movement. We present MoRA, a human-centric geospatial framework that leverages a mobility graph as its core backbone to fuse various data modalities, aiming to learn embeddings that represent the socio-economic context and functional role of a location. MoRA achieves this through the integration of spatial tokenization, GNNs, and asymmetric contrastive learning to align 100M+ POIs, massive remote sensing imagery, and structured demographic statistics with a billion-edge mobility graph, ensuring the three auxiliary modalities are interpreted through the lens of fundamental human dynamics. To rigorously evaluate the effectiveness of MoRA, we construct a benchmark dataset composed of 9 downstream prediction tasks across social and economic domains. Experiments show that MoRA, with four input modalities and a compact 128-dimensional representation space, achieves superior predictive performances than state-of-the-art models by an average of 12.9\\%. Echoing LLM scaling laws, we further demonstrate the scaling behavior in geospatial representation learning. We open-source code and pretrained models at: https://anonymous.4open.science/r/MoRA-.", "tldr": "We present MoRA, a human-centric geospatial framework that leverages a mobility graph as its core backbone to fuse various data modalities, aiming to learn embeddings that represent the socio-economic context and functional role of a location.", "keywords": ["GeoAI", "spatial representation learning", "location embedding", "multi-modal", "contrastive learning"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ec9ae88a7051e1834fcb454a13d50ffb2bf9e831.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "MoRA presents a human-centric geospatial representation paradigm that uses billion-scale mobility graphs as the backbone: it encodes H3 grid cells into 128-D vectors with GNNs, aligns satellite imagery, POIs and demographics via contrastive learning, boosts downstream socio-economic tasks by 12.9% on average, demonstrates the first scaling laws in GeoAI, and releases a privacy-preserving distilled model that maps coordinates directly to high-quality embeddings."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "MoRA leverages a billion-edge mobility graph as its backbone, aligns imagery, POIs and demographics into a unified 128-D space via contrastive learning, delivers a 12.9% average gain across nine nationwide socio-economic tasks, demonstrates the first scaling laws in GeoAI, and releases a privacy-preserving distilled model that infers embeddings from coordinates alone."}, "weaknesses": {"value": "1. The design of downstream evaluation does not align with main stream methodology.\nWhy utilize LightGBM as the downstream prediction model instead of a linear probing method that is employed by many existing works [1,2,3,4]\n\n2. The coverage of dataset is limited. MoRA only utilized dataset from China. How to ensure the generalization of the induced conclusion?\nIt is suggested to compare more cities in othe counties.\n\n\n3. The technique contribution is limited. Actually, combining mobility with POI and Satellite images is a common practice in region representation learning.\nWhat MoRA has done is move this paradigm into location embedding, while the requirement of multiple different kinds of data modality also diminish the generalization and practicability. That is why previous location embedding work [1,2,3] applied global application while this work only limited on China data.\n\n4. I am confused of the inference practice. The paper states that during inference, it still needs 3 kinds of data (POI, demographic, satellite images) for prediction. If so, what is the meaning of contrastive learning in pretraining stage? The CLIP-based contrastive learning should inject the information of POI, image, demographics data modality into mobility backbone through contrastive alignment in pretraining. In inference, the common practice is to only utilize the pretrained mobility backbone.\n\n---\n[1] Klemmer, Konstantin, et al. \"Satclip: Global, general-purpose location embeddings with satellite imagery.\" Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 39. No. 4. 2025.\n\n[2] Hao, Xixuan, et al. \"Nature makes no leaps: Building continuous location embeddings with satellite imagery from the web.\" Proceedings of the ACM on Web Conference 2025. 2025.\n\n[3] Vivanco Cepeda, Vicente, Gaurav Kumar Nayak, and Mubarak Shah. \"Geoclip: Clip-inspired alignment between locations and images for effective worldwide geo-localization.\" Advances in Neural Information Processing Systems 36 (2023): 8690-8701.\n\n[4] Hao, Xixuan, et al. \"Urbanvlp: Multi-granularity vision-language pretraining for urban socioeconomic indicator prediction.\" Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 39. No. 27. 2025."}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "lWDdDGhqJX", "forum": "IlBr5JJsCj", "replyto": "IlBr5JJsCj", "signatures": ["ICLR.cc/2026/Conference/Submission15460/Reviewer_L9Si"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15460/Reviewer_L9Si"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761345970660, "cdate": 1761345970660, "tmdate": 1762925746201, "mdate": 1762925746201, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "SUMMARY: The authors propose a new geospatial location representation learning framework, leveraging multimodal input data, namely imagery, POI data and demographic information (the latter two available as text). The most unique aspect about this work is that instead of leveraging raw geographic context (e.g. pure coordinates, as used in SatCLIP or GeoCLIP), the authors build a spatial graph between locations based on whether locations are associated with each other in the WeChat Payment system. While this obviously assumes a lot of prior knowledge, it is an interesting approach to explore specifically for geo representation learning in urban areas, where we can assume such data to be available. This gives their whole approach a strongly informed \"geographic prior\". The authors test their geo embeddings on a set of different socio-economic tasks, showing impressive performance and outperforming recent embeddings such as GeoCLIP or AlphaEarth."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "STRENGTHS:\n\n- I like the framing of two paradigms for geo representation learning, the human and EO centric ones. Not sure I necessarily agree but this is an interesting framing to motivate the paper! The argument about the relative nature of a \"place\" (i.e. a location being majorly defined by its relationship with other locations) is thought provoking and interesting. Overall, really great motivation section!\n\n- Exploring scaling laws for geospatial representation learning is a critical research challenge, e.g. also mentioned here [1]. The authors do that a little bit (though I would have liked to see more of that).\n\n- I like that the authors clearly define distinctions from PDFM, which is conceptually closest."}, "weaknesses": {"value": "- I would love to have seen a comparison to a simple neighborhood graph; the way understand it, edges between cells/nodes are based on a-priori known WeChat Pay interactions. This is great if you have access, but what if you didn't have that data? How would this method perform if you simply built your graph based on direct neighborhood/adjacency of cells? How would the model perform then? This seems like a crucial ablation missing, unless I am missing it. This also would allow the authors to compare their approach to PDFM, which is only available for the US - and which would be an important comparison.\n\n- In the abstract, the authors say that \"While Earth observation paradigms excel at depicting locations in their physical states, we claim that a location’s comprehensive “meaning” is better grounded in its internal human activity pattern\". I don't want to start a philosophical discussion about \"place\", but this sentence feels a bit strong / definitive. Human activity might give a location \"meaning\" relevant to some applications - especially human centric ones, but might be irrelevant for other, e.g. natural processes.\n\n- Given that your paper basically argues for a geographic prior for SSL geo-representations (in your case based on payment data), I think it would be important to link your work back to the origins of work on \"geographic priors\", especially [2].\n\n- I don't like averaging over R2 values of different tasks in Tab 2; this does not seem very rigorous and I'd recommend to remove that column.\n\n- Fig 2: sizes of legend circles don't match the circle sizes in the plot"}, "questions": {"value": "Overall this is an interesting, well motivated paper. I like both the methodological innovations and the experiments, though there could be more details and an important ablation is missing. To help with my understanding and the final assessment, I would ask the authors to address my concerns and questions outlined in the \"Weaknesses\" sections.\n\nReferences:\n\n[1] Rolf, Esther, et al. \"Mission Critical--Satellite Data is a Distinct Modality in Machine Learning.\" arXiv preprint arXiv:2402.01444 (2024).\n[2] Mac Aodha, Oisin, Elijah Cole, and Pietro Perona. \"Presence-only geographical priors for fine-grained image classification.\" Proceedings of the IEEE/CVF International Conference on Computer Vision. 2019."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Nd8JFngQuB", "forum": "IlBr5JJsCj", "replyto": "IlBr5JJsCj", "signatures": ["ICLR.cc/2026/Conference/Submission15460/Reviewer_adgb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15460/Reviewer_adgb"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761514914554, "cdate": 1761514914554, "tmdate": 1762925745037, "mdate": 1762925745037, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "### Problem\n\nThe authors tackle the problem geospatial intelligence. Specifically, the seek to convert locations into useful vector embeddings to support tasks such as predicting socio-economic indicators or urban dynamics. They argue existing approaches fall into two silos:\n\t1.\tEarth-observation-centric: learning from satellite imagery and physical features.\n\t2.\tHuman-activity-centric: learning from mobility and demographic patterns.\n\nThese paradigms rarely integrate well, and current models miss long-range functional relationships between places (e.g., commuter flows) and lack scalable benchmarks. The field also lacks foundation-style models trained at national or global scale. The authors argue that (2) Human-centric representations are fundamental the semantics of place and are a first class citizen in their solution\n\n\n### Solution\n\nThe authors propose MoRA, a framework that leverages mobility as the backbone for geospatial representation learning at scale. Their method has the following properties:\n\t•\tAggregates real mobility flows across millions of locations and billions of edges.\n\t•\tBuilds a nationwide mobility graph using H3 spatial grids.\n\t•\tLearns human-centric location embeddings with a graph neural network \n\t•\tAligns mobility with three auxiliary modalities using asymmetric CLIP-style contrastive learning.\n\t•\tDemonstrates scaling laws in geospatial representation learning.\n\t•\tReleases a benchmark of 9 socio-economic tasks and a distilled privacy-preserving model.\n\nMoRA consistently outperforms state-of-the-art representations across prediction tasks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Strong empirical results. Mora outperforms all baselines across several experiments\n- Ablation studies validates the additional complexity of their method\n- Experiments are done across several training runs, informing reproducibility. Means and standard deviations are provided. \n- The introduction of the new geospatial benchmark is noteworthy\n- The experiments around scaling laws are useful for the GeoAI community"}, "weaknesses": {"value": "- Heavy reliance on proprietary mobility data: \n    - This causes concerns related to reproducibility. I don't believe this resource is publicly available\n    - What about rural areas where human activity is sparse?\n- Single country mobility data: The mobility data is unique to china, casting fairly large doubts on the generalizability of the method. For example, does this method generalize to Europe or the US?\n- The new benchmark primarily describes human-centric socio-economic tasks. It would make sense that mobility data would be more useful here (as demonstrated in their experiments). Other tasks such as land cover classification would likely see better results under the more Earth-observation-centric representation learning strategy. Unfortunately, this trade-off is left unexplored."}, "questions": {"value": "- My main question is about generalization outside of China? Can the authors demonstrate that MoRA can perform well in other national geographies?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2ElcLFhZSi", "forum": "IlBr5JJsCj", "replyto": "IlBr5JJsCj", "signatures": ["ICLR.cc/2026/Conference/Submission15460/Reviewer_Ay9J"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15460/Reviewer_Ay9J"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761860976276, "cdate": 1761860976276, "tmdate": 1762925744464, "mdate": 1762925744464, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a graph-based location representation learning framework that is based on relative location transitions from one (hexagonal) grid cell to another. The framework, despite architecturally complex, is well justified and experimentally strong across spcial and economic tasks. While I would also appreciate benchmarking on natural downstream tasks (mentioned in Figure 1, but not benchmarked against), I understand that the premise of mobility mainly works on social and economical processes. \n\nOverall, I find the paper well-written and well-presented and the results convincing."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* Clear and well-justified framework for graph-based location representation learning via relative transitions across hexagonal grid cells.\n* Strong empirical performance on spatial and socioeconomic downstream tasks.\n* Well-written and clearly presented."}, "weaknesses": {"value": "* Fairly complex methodology including single-modality encoders and a separate graph neural network. A joint unifying architecture would be less engineering-focused. However, ablations justify the individual components well\n* It would have been nice to also capturing natural tasks, where mobility matters. For instance, species distribution modelling, like iNaturalist of BirdSnap would be good choices here"}, "questions": {"value": "* With MORA, would it be possible to pre-compute and store embeddings for all H3 cells in a region — similar to how AlphaEarth maintains a precomputed embedding database?\n* At inference time, does one need to supply POI/satellite imagery or demographics to obtain an embedding, or can the trained GNN alone generate embeddings without requiring additional data downloads?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "0ixgM2yUug", "forum": "IlBr5JJsCj", "replyto": "IlBr5JJsCj", "signatures": ["ICLR.cc/2026/Conference/Submission15460/Reviewer_5Ex7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15460/Reviewer_5Ex7"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15460/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762027718861, "cdate": 1762027718861, "tmdate": 1762925744010, "mdate": 1762925744010, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}