{"id": "ilnKzaQSCh", "number": 20071, "cdate": 1758302097874, "mdate": 1759897003327, "content": {"title": "Automatic Dialectic Jailbreak: A Framework for Generating Effective Jailbreak Strategies", "abstract": "Large language models (LLMs) can be jailbroken to produce malicious or unethical content with embedded jailbreaking prompts. Unfortunately, current jailbreak attack techniques suffer from adaptability issues due to reliance on the fixed evaluation models and incapability problems of surviving from a wide range of defense mechanisms. In this work, we propose to model the the jailbreak attack problem as a Stackelberg multi-objective game between two LLMs engaged in a Hegelian-Dialectic-style debate enabling the automatic generation of jailbreak strategy (ADJ). In the ADJ, iterative thesis-antithesis-synthesis cycles of Hegelian dialectical reasoning are executed to guarantee that both attacker and defender can maximize their own utility while minimizing that of their opponent. We propose to map the optimization problem from the original parameter space into a Hilbert space via Haar wavelet transformation, for efficiently extracting localized and structurally significant information. In this functional space, we solve a convex multi-objective optimization problem to construct a common descent direction that better aligns with the objectives in the ADJ. In order to ensure sufficient descent for each objective in ADJ, we construct a subset of descent components and directly integrate them into the optimization objective. We theoretically validate the existence of a Pareto–Nash equilibrium achieved by our Automatic Dialectic Jailbreak method and demonstrate that our algorithm is able to converge to this Pareto–Nash equilibrium.", "tldr": "A fully automated and end-to-end jailbreak pipeline eliminates the need for human-crafted inputs, and is inherently generalizable to black-box models", "keywords": ["Jailbreak Attacks", "Large Language Models", "Multi-Objective Game", "White-box Jailbreak", "Black-box Jailbreak"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/4308327f3ac76a428477f3a1b85dd0da1297fcd9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Automatic Dialectic Jailbreak (ADJ), a novel framework that models LLM jailbreaking as a Stackelberg multi-objective game inspired by Hegelian dialectic reasoning. The framework involves two LLMs engaged in iterative thesis-antithesis-synthesis cycles, where an attacker proposes jailbreak strategies and a defender generates countermeasures. The authors employ Haar wavelet transformation to map the optimization problem into Hilbert space and use Armijo backtracking rules for convergence. They provide theoretical guarantees for Pareto-Nash equilibrium existence and convergence, and demonstrate superior performance over existing methods on AdvBench and HarmBench datasets across multiple LLMs."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "Originality: The application of Hegelian dialectic and multi-objective game theory to LLM jailbreaking is genuinely novel. The combination of philosophical reasoning frameworks with modern optimization techniques represents a creative interdisciplinary approach that hasn't been explored in this domain.\n\nQuality: The mathematical formulation is rigorous and well-developed. The authors provide formal proofs for equilibrium existence and convergence properties. The experimental evaluation is comprehensive, covering multiple models, datasets, and both white-box and black-box settings.\n\nClarity: Despite the mathematical complexity, the paper is generally well-written. The motivation is clearly presented, the methodology is systematically explained, and the results are properly contextualized. The Hegelian dialectic analogy is well-motivated and helps readers understand the framework.\n\nSignificance: This work advances the state-of-the-art in adversarial ML for LLMs by introducing a principled framework for automatic strategy generation. The theoretical contributions to multi-objective optimization in the context of LLM safety are valuable. The demonstrated robustness against existing defenses highlights important vulnerabilities in current safety measures."}, "weaknesses": {"value": "1. Theory-Practice Gap\nInconsistent theoretical guarantees: The paper provides rigorous convergence proofs for white-box settings but lacks theoretical foundations for black-box scenarios, which are more practically relevant. This creates a significant disconnect between the theoretical contributions and real-world applicability, as white-box access to commercial LLMs is rarely available.\n\n2. Computational Efficiency Concerns\nProhibitive resource requirements: The framework requires multiple LLMs to interact simultaneously, leading to substantially higher computational costs compared to existing methods. The scalability becomes questionable as model sizes increase, potentially making the approach impractical for resource-constrained environments.\n\n3. Complexity vs. Benefit Trade-off\nOver-engineering complexity: The introduction of sophisticated mathematical tools (Haar wavelets, Hilbert space mapping, multi-objective optimization) adds considerable complexity without clear justification that the performance gains warrant such elaborate machinery. Some baseline methods might achieve comparable results with simpler modifications\n\n4. Limited Experimental Validation\nNarrow evaluation scope: The evaluation relies primarily on ASR and HS metrics, lacking assessment of content quality, diversity, and semantic coherence. Additionally, only two defense mechanisms are tested, which may not represent the full spectrum of real-world defensive strategies.\n\n5.Little typo: there are double “the”s in the 5th line of Abstract;For formula (1) in 2.1,The subscript n may be replaced with k."}, "questions": {"value": "Given the substantial computational overhead (29K+ seconds vs. 4K-8K for simpler methods), what is the empirical relationship between resource investment and performance gains in ADJ compared to enhanced baseline methods? Specifically, could simpler approaches achieve comparable ASR/HS improvements through targeted optimizations (e.g., better prompt engineering, improved sampling strategies) without requiring the complex multi-LLM dialectical framework?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "v7aEhH9X10", "forum": "ilnKzaQSCh", "replyto": "ilnKzaQSCh", "signatures": ["ICLR.cc/2026/Conference/Submission20071/Reviewer_ttYv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20071/Reviewer_ttYv"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20071/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761712632885, "cdate": 1761712632885, "tmdate": 1762932960342, "mdate": 1762932960342, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes an automated jailbreak method designed to adapt to a wider range of attack scenarios and to bypass defenses. It formulates the jailbreak attack as a Stackelberg multi-objective game. This game is implemented as a Hegelian-Dialectic-style debate between two LLMs, cycling through \"thesis-antithesis-synthesis\" to automatically generate robust jailbreak strategies."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 4}, "strengths": {"value": "1. The proposed attack (ADJ framework) significantly outperforms baselines in both ASR and HS across various models.\n2. The ADJ framework demonstrates robustness against two defense mechanisms. It shows minimal performance degradation against the RAIN defense and perplexity-based defense，which effectively counter other baseline attacks."}, "weaknesses": {"value": "1. The experiments evaluate only two defense methods, which is not sufficient. The paper should include a broader set of defense strategies—including composite or dynamic defenses—to better support its claims.\n2. Some formulas (Eq. (1), $ \\pi_{-i}^{*} $, etc) contain unclear or inconsistent notation. Please review and correct the mathematical expressions to ensure clarity."}, "questions": {"value": "1. Is Equation (1) correct? In Equation (1), the definition of the k-simplex appears to contain an inconsistency. The vector is written as $(x_0, \\ldots, x_n)\\in \\mathbb{R}^{k+1}$, mixing $n$ and $k$. For a k-simplex, the standard definition involves $(k+1)$ coordinates $(x_0, \\ldots, x_k)$. It would be clearer and mathematically consistent to use $k$ instead of $n$ in the index range.\n2. In the black-box setting, is also the same model for Attacker, Defender, and Target?\n3. What is the RAIN defense?\n4. What does the x-axis represent in Figure 4?\n5. What is the compution cost of ADJ in white-box setting?\n6. What is the computation cost of ADJ in the white-box setting?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "bsjSiZkCV1", "forum": "ilnKzaQSCh", "replyto": "ilnKzaQSCh", "signatures": ["ICLR.cc/2026/Conference/Submission20071/Reviewer_gxvD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20071/Reviewer_gxvD"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20071/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761894381421, "cdate": 1761894381421, "tmdate": 1762932959886, "mdate": 1762932959886, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In  this work,  the authors propose to model the the jailbreak attack problem as a Stackelberg multi-objective game between two LLMs engaged in a Hegelian-Dialectic-style debate enabling the automatic generation of jailbreak strategy (ADJ). \n\nIn the ADJ, iterative thesis-antithesis-synthesis cycles of Hegelian dialectical reasoning are executed to guarantee that both attacker and defender can maximize their own utility while minimizing that of their opponent.\n\nExperimental results demonstrate that the paper's method consistently outperforms prior jailbreak approaches across a wide range of models, while also exhibiting superior robustness."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "(1) By simulating the Hegelian-style debate between the attacker and defender, our method enables the attacker to generate diverse jailbreak strategies, thereby mitigating the incapability to any single specific defense method.\n\n (2) Based on the SMOG, the  algorithm does not rely on a fixed auxiliary model, thereby enhancing the attacker’s adaptability against a wide range of defense mechanisms.\n\n (3) The proposed method is applicable to both white-box and black-box settings."}, "weaknesses": {"value": "I only have the following two concerns. \n\n\n1. Why using a Stackelberg multi-objective game and  Hegelian-Dialectic-style debate is a good strategy than other schemes, such as reinforcement learning scheme, is not that clear to me. Please explain.\n\n2. Compared with usual improvement, what is the percentage of  the improvement of you attacking effect on average it is? You study an old problem of  jailbreaking prompts. The novel game strategy is still not persuasive enough for me to think this technical is effective and necessary."}, "questions": {"value": "see above comments"}, "flag_for_ethics_review": {"value": ["Yes, Unprofessional behaviors (e.g., unprofessional exchange between authors and reviewers)"]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "0v5QU42Fcb", "forum": "ilnKzaQSCh", "replyto": "ilnKzaQSCh", "signatures": ["ICLR.cc/2026/Conference/Submission20071/Reviewer_QHqa"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20071/Reviewer_QHqa"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20071/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761959878922, "cdate": 1761959878922, "tmdate": 1762932959436, "mdate": 1762932959436, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a framework, Automatic Dialectic Jailbreak (ADJ), that automatically generates effective jailbreak strategies against large language models (LLMs). The authors formulate the problem as a Hegelian-dialectic (thesis–antithesis–synthesis) Stackelberg multi-objective game (SMOG). Within this framework, an attacker LLM (the leader) and a defender LLM (the follower) co-evolve through an iterative debating process. To address the non-smooth multi-objective optimization problem arising under the white-box setting (W-ADJ), the authors propose employing the Haar wavelet transform to map parameters into a Hilbert space, thereby identifying common descent directions. They provide theoretical proofs establishing the existence of a Pareto–Nash equilibrium for the game and the convergence properties of their method. Additionally, the paper introduces a black-box variant (B-ADJ) that leverages in-context learning (ICL) to simulate the dialectical process. Experimental results demonstrate that the proposed approach outperforms existing baselines in both attack success rate (ASR) and harmfulness score (HS) across multiple models and datasets."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "(1) This paper attempts to frame the LLM jailbreak problem within a dynamic, adversarial game-theoretic framework, representing a novel approach distinct from existing static prompt optimization methods.\n\n(2) The authors evaluate the proposed method on a variety of LLMs, including state-of-the-art closed-source models (such as GPT-4, Gemini 1.5 Pro), and report a high attack success rate.\n\n(3) The paper provides theoretical proofs for the existence of a Pareto–Nash equilibrium (Theorem 1) and the algorithm's convergence (Theorem 2) for the proposed W-ADJ framework."}, "weaknesses": {"value": "(1) The W-ADJ (white-box) method requires white-box access to both LLMs (the attacker and defender) for joint optimization. This is computationally expensive and far beyond the feasibility of most real-world attack scenarios. Although the B-ADJ (black-box) method is more practical, it replaces theoretically guaranteed gradient optimization with heuristic in-context learning (ICL). To make ICL effective (i.e., to build meaningful $R_A$ and $R_D$ histories), a massive number of API calls and evaluations are likely required, leading to very high API costs.\n\n(2) The core theory of the paper (game theory, wavelet transform, convergence proofs) applies solely to W-ADJ. As a simulation based on ICL, B-ADJ's effectiveness heavily relies on the design of system prompts (e.g., the \"Tom and Jerry\" setting in Appendix G). It is unclear how much of B-ADJ's success is due to the cleverness of this meta-prompting and how much is attributable to the \"dialectical game\" process claimed by the paper. There is a lack of argumentation regarding whether B-ADJ truly simulates SMOG or if it is merely an iterative prompt improver.\n\n(3) The paper misuses complex mathematical symbols and terminology, showing a clear tendency toward \"mathematical embellishment.\" Many of the complex derivations (such as the lengthy gradient calculations in the appendix) are not essential for proving the core arguments, but instead obscure the fundamental ideas behind the method. The description of Key Algorithm 1 is confusing, with unclear variable names and a disorganized flow, which severely hampers reproducibility.\n\n(4) The paper constructs a complex theoretical framework (e.g., Hilbert space, wavelet transform, Pareto-Nash equilibrium), but the necessity of applying these advanced mathematical tools is not sufficiently justified. The core driving force behind the method seems to rely more on the \"emergent\" capabilities of LLMs as debate participants, rather than the intricacy of their mathematical optimization process. The theoretical section appears to be \"overkill\" and fails to convincingly demonstrate that these complex tools provide a significant improvement over simpler heuristic methods, such as multi-round self-play."}, "questions": {"value": "(1)Can the authors provide clear evidence through ablation experiments to demonstrate that the complex Haar wavelet transform and Hilbert space mapping yield a statistically significant performance improvement over directly performing multi-objective optimization in the original parameter space? Are these mathematical tools a necessary condition for achieving high performance?\n\n(2)One of the core claims of the paper is the generation of \"diverse\" strategies. Could the authors provide specific qualitative or quantitative evidence to support that the strategies generated by ADJ indeed exhibit diversity?\n\n(3)To what extent does the effectiveness of B-ADJ rely on the role-playing prompts in Appendix G? If the \"Tom and Jerry\" game setting were removed and only a single LLM iteratively optimized its historical attack record through ICL (similar to AutoDAN), how much would performance degrade?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "yWca0HlF3d", "forum": "ilnKzaQSCh", "replyto": "ilnKzaQSCh", "signatures": ["ICLR.cc/2026/Conference/Submission20071/Reviewer_8v1p"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20071/Reviewer_8v1p"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20071/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761980840484, "cdate": 1761980840484, "tmdate": 1762932958927, "mdate": 1762932958927, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}