{"id": "j9mSh3TdZW", "number": 824, "cdate": 1756819894654, "mdate": 1763716637708, "content": {"title": "Channel-Imposed Fusion: A Simple yet Effective Method for Medical Time Series Classification", "abstract": "Medical time series (MedTS) such as EEG and ECG are critical for clinical diagnosis, yet existing deep learning approaches often struggle with two key challenges: the misalignment between domain-specific physiological knowledge and generic architectures, and the inherent low signal-to-noise ratio (SNR) of MedTS. To address these limitations, we shift from a conventional model-centric paradigm toward a data-centric perspective grounded in physiological principles. We propose Channel-Imposed Fusion (CIF), a method that explicitly encodes causal inter-channel relationships by linearly combining signals under domain-informed constraints, thereby enabling interpretable signal enhancement and noise suppression. To further demonstrate the effectiveness of data-centric design, we develop a simple yet powerful model, Hidden-layer Mixed Bidirectional Temporal Convolutional Network (HM-BiTCN), which, when combined with CIF, consistently outperforms Transformer-based approaches on multiple MedTS benchmarks and achieves new state-of-the-art performance on general time series classification datasets. Moreover, CIF is architecture-agnostic and can be seamlessly integrated into mainstream models such as Transformers, enhancing their adaptability to medical scenarios. Our work highlights the necessity of rethinking MedTS classification from a data-centric perspective and establishes a transferable framework for bridging physiological priors with modern deep learning architectures.", "tldr": "We propose a data-centric framework for medical time series using Channel-Imposed Fusion (CIF) and HM-BiTCN. CIF encodes physiological priors for noise suppression, and combined with HM-BiTCN, achieves SOTA results beyond Transformers.", "keywords": ["Medical Time Series Classification", "Channel Imposed Fusion (CIF)", "Data-centric"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/95a77af101e5d1421ea6b4e5bfc3293dc8f1deef.pdf", "supplementary_material": "/attachment/76d565310524e29028d1dabbdab911df6c880ee0.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces a data-centric approach (channel-imposed fusion, CIF) to improve the performance of medical time series classification. Specifically, the authors claims that by linearly combining the a subset of multi-channel signal (ECG or EEG), the combined signal can eliminate the redundancy and  improve SNR of the original signal. The authors also present a mixed bidirectional TCN to further improve the performance. The evaluation results show that the proposed approach achieves the best performance comparing against the baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. I like the the angle of exploring data-centric approach, because I agree that having a high-quality signal can improve the performance without complex model designs. \n\n2. The authors compare the proposed approach with lots of baselines."}, "weaknesses": {"value": "1. My biggest concern comes from the core contribution of the paper - CIF. First, it is unclear how the learnable parameters (a and b) are trained, for instance, what is the loss function? Second, it is unclear how the subset of channels are selected. The authors provide some examples about correlated/un-correlated channels in the introduction. However, these correlations also depend on the context/condition when the signal is collected, and therefore are not determined. Third, I appreciate the authors' analysis using SVD and SNR. But this only applies to two channels, if there are multiple (>2) channels, more learnable parameters are involved and whether the conclusion still holds is not unclear. Overall, the implementation and explanation of CIF is not well presented in the paper. \n\n2. While the authors acknowledge that HM-BiTCN is not an innovation, they still claim it as a contribution in the introduction, which is a bit confusing. Additionally, the connection between CIF and HM-BiTCN is not clear to me. It appears that they authors simply want to increase the contribution of the paper by adding some incremental designs. This is supported by the authors' claim that the CIF can also work well with other model architectures. \n\n3. While the authors compared lots of baselines, the experiments are not properly conducted to support the claims in the paper. Specifically, while table 1 demonstrates that CIF is generalizable to existing model architectures, table 2 failed to infer HM-BiTCN further improve the result (as it is unclear whether the gain comes from CIF or HM-BiTCN). Instead, the authors should also include the results with (1) vanilla TCN, and (2) Vanilla TCN+CIF. \n\n4. While the results seem comprehensive, they also appear to be selectively presented. For example, why not present the result of HM-BiTCN+CIF in table 1? Why not present MedGNN+CIF in table 2? Why table 2 includes five datasets, while table 1 only has one dataset? Why table 3 only present the four datasets with only 2-3 classes, while excluding the complex PTX-XL dataset with five classes? \n\n5. Some evaluations like 4.3 (2)(3) are not self-contained. The authors omitted lots of details. And overall, the evaluation mainly describe the numerical results, without detailed analysis and explanation why the proposed approach works."}, "questions": {"value": "1. The authors should add training and implementation details of the CIF. \n\n2. The authors should properly conduct the evaluations."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FSqnGMXRYq", "forum": "j9mSh3TdZW", "replyto": "j9mSh3TdZW", "signatures": ["ICLR.cc/2026/Conference/Submission824/Reviewer_19bf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission824/Reviewer_19bf"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760624155272, "cdate": 1760624155272, "tmdate": 1762915619101, "mdate": 1762915619101, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This study proposes a novel method termed Channel-Imposed Fusion (CIF) to enhance the performance of medical time-series classification and designs the HM-BiTCN model to work in conjunction with it; the authors experimentally validate its advantages over existing methods on multiple medical datasets."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "CIF explicitly incorporates the \"physiological prior and learnable symbol constraints\" as a plug-and-play channel fusion module for the first time, which is independent of the model structure.\n\nThe manuscript conducted a subject dependent/independent dual protocol comparison on 5 medical datasets and 10 general datasets, including ablation, efficiency, transferability, and multi random seed reproduction.\n\nThe manuscript is well written; notation, algorithmic pseudo-code and figures make CIF instantaneously implementable; physiological motivation is clearly separated from technical derivation.\n\nThe manuscript demonstrates that a lightweight TCN can surpass a heavyweight Transformer, providing a reproducible approach for injecting domain knowledge into low signal-to-noise ratio medical signals."}, "weaknesses": {"value": "The manuscript fails to isolate the source of performance gain: it remains unclear whether the improvement comes from “fixed vs. learnable a, b” or from variations in t and n, as no single-variable ablation is provided."}, "questions": {"value": "1.I noticed that Figure 1 employs images of Transformers characters unrelated to the manuscript content. Perhaps you could consider making some modifications.\n\n2.The CIF method involves multiple hyper-parameters that require tuning. How did you locate the optimal settings? Could automatic hyper-parameter optimization be introduced to improve the model’s usability and adaptability?\n\n3.In Tables 12–14, the same dataset is used to compare frozen versus learnable a/b settings, yet other conditions (t and n) are also allowed to vary simultaneously. How can you ascertain whether the performance difference arises from fixing versus learning a/b, rather than from the changes in t/n?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "I8HHzOtBlQ", "forum": "j9mSh3TdZW", "replyto": "j9mSh3TdZW", "signatures": ["ICLR.cc/2026/Conference/Submission824/Reviewer_XoGR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission824/Reviewer_XoGR"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760949985085, "cdate": 1760949985085, "tmdate": 1762915615436, "mdate": 1762915615436, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a channel-imposed fusion (CIF) method motivated by data-centric domain-specific knowledge for medical time series. The channels are divided into two parts for learnable weighted summation. The goal is to enhance the signal and suppress its noise. The author argues the effectiveness of this simple module by analyzing it using Singular Value Decomposition.  A new backbone, HM-BITCN, is proposed to align with this CIF method and achieve strong performance across 5 downstream tasks, outperforming 12 general and medical time series methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The method is motivated by domain knowledge, and the overall idea is interesting. The ECG and EEG samples illustrated in the introduction for the P-wave and artifact are sound. The theory analysis is good and provides support for this simple method. The new modified TCN backbone looks effective. The results on 4 of 5 datasets are strong, and the ablation study shows clear improvement by adding the CIF module."}, "weaknesses": {"value": "1) The CIF module takes the front N and the result of channels as two parts for fusion. I am curious about whether there are any other ways to combine channels? For example, you mention Fp1 and Fp2 in the introduction part. Are these two channels separate in the two parts of the channels? Because the order of channels in ECG and EEG data can vary in raw data, simply separating them into two parts might not be optimal. \n2) It might be better to apply CIF on more existing methods, such as PatchTST, Medformer, MedGNN, and see if there are improvements, as this CIF module should be plug-and-play.\n3) Minor writing improvement: the citations to Tables 1 and 2 can be removed as you have cited them in the baseline section. The current citations in the table appear redundant."}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "oFklublVC6", "forum": "j9mSh3TdZW", "replyto": "j9mSh3TdZW", "signatures": ["ICLR.cc/2026/Conference/Submission824/Reviewer_KoJF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission824/Reviewer_KoJF"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761810062818, "cdate": 1761810062818, "tmdate": 1762915613447, "mdate": 1762915613447, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a data-centric method, Channel-Imposed Fusion (CIF), to improve the medical time series classification. The authors identify two key challenges in MedTS: the low signal-to-noise ratio (SNR) and the misalignment between generic deep learning architectures and domain-specific physiological knowledge.\n\nCIF addresses this by creating new features through a simple, domain-informed linear combination of channels. This fusion is guided by two physiological hypotheses:\n\n1. Physiological Coupling: In-phase summation of correlated signals to enhance the target signal.\n2. Noise Suppression: Differential fusion of channels with correlated noise to cancel common-mode interference."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The proposed method, CIF, is a simple, interpretable, and effective way to inject physiological domain knowledge into the data itself. This proposal of a transferable data-processing module, rather than yet another complex architecture, is a valuable contribution.\n2. The experimental results are thorough and convincing. The authors evaluate CIF across multiple datasets and model architectures, demonstrating consistent performance improvements. The ablation studies and analyses further strengthen the validity of their claims."}, "weaknesses": {"value": "The paper's primary weakness lies in a significant contradiction between its motivation and parts of its methodological description, specifically the SVD analysis and the apparent default implementation of CIF.\n\n1. The SVD analysis in Section 3.1 is a major weak point.\n\n   - Mathematical Justification: The analysis is questionable. For the \"High Correlation\" case, it approximates $X_{fused}\\approx U_{1}(a\\Sigma_{1}+b\\Sigma_{2})V_{1}^{T}$, which seems to implicitly assume $V_1 \\approx V_2$. However, $U$ matrices represent temporal patterns while $V$ matrices represent channel relationships. The paper provides no justification for why similar temporal patterns ($U_1 \\approx U_2$) would imply similar channel relationships ($V_1 \\approx V_2$).\n   - Disconnect from Motivation: This SVD analysis partitions the data into the first n channels ($X[:,:n]$) and the last n channels ($X[:,-n:]$). This is an arbitrary, index-based split that directly contradicts the paper's core \"domain-informed\" and \"physiological\" motivation (e.g., fusing Fp1 and Fp2, which may be channels 7 and 8, not 0 and -1). This analysis seems to describe a completely different, arbitrary channel-mixing method.\n\n2. Implicit Assumption in SNR Argument: The derivation assumes that the variance of both signals and noise are equal across channels (e.g., $\\sigma_{s1}^2 = \\sigma_{s2}^2$). This is a strong assumption that may not hold in practice, especially in physiological signals where different channels can have vastly different characteristics (e.g., different leads in ECG). The paper does not discuss the implications of this assumption or how it affects the validity of the SNR improvement claim.\n\n3. The paper presents two conflicting versions of CIF:\n\n   - Version 1 (Domain-Informed): The introduction and motivation (and Appendix G) describe fusing specific, physiologically relevant pairs (e.g., C3+C4, Fp1-Fp2). This is named \"Physiological Symmetry Fusion (PSF)\" in Appendix G.\n   - Version 2 (Arbitrary): Section 3.1, Figure 2, and Algorithm 1 describe the arbitrary $n$-channel split (fusing first $n$ with last $n$ channels). Appendix G calls this \"Random Fusion (RF)\".\n\n   This is extremely confusing. The \"RF\" version, which is **not** domain-informed, appears to be the default method described in the main \"Method\" section. Worse, Table 8 shows that PSF outperforms RF. This suggests the main \"Method\" section (3.1) and Algorithm 1 are describing a sub-optimal, arbitrary method (RF) while the paper's actual thesis is proven to be more effective by a different method (PSF) hidden in the appendix.\n\n4. Unclear Experimental Details: Following the previous point, it is not specified which version of CIF (RF or PSF) was used to generate the main results in Tables 1, 2, 3, 4, 5, and Figure 5. If the arbitrary \"RF\" was used, it significantly weakens the paper's central claim about \"bridging physiological priors\". If PSF was used, then Section 3.1 and Algorithm 1 should be completely rewritten to reflect this, and the SVD analysis should be removed."}, "questions": {"value": "1. Which CIF was used for the main experiments?\n2. How to reconcile the \"domain-informed\" claim if \"Random Fusion\" was used?\n\n   - If the \"RF\" method was used for the main results, how do the authors justify the paper's central thesis that CIF \"explicitly encodes causal inter-channel relationships\" and is \"grounded in physiological principles\"? The RF method appears to be an arbitrary channel-mixing augmentation, not an encoding of physiological priors.\n\n3. Suggestion: Revise/Remove Section 3.1.\n\n   - The SVD analysis in Sec 3.1 is confusing and seems mathematically unsound, as pointed out in the weaknesses. It also describes the arbitrary \"RF\" method, which contradicts the paper's motivation and is proven to be sub-optimal in Appendix G. I strongly suggest the authors remove the SVD analysis entirely and rewrite Section 3.1 and Algorithm 1 to describe the actual domain-informed, pairwise fusion (PSF) that supports their thesis. The paper would be much stronger and clearer as a result."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "M5ATXAbVfP", "forum": "j9mSh3TdZW", "replyto": "j9mSh3TdZW", "signatures": ["ICLR.cc/2026/Conference/Submission824/Reviewer_PkxF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission824/Reviewer_PkxF"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761978192392, "cdate": 1761978192392, "tmdate": 1762915613132, "mdate": 1762915613132, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Response to all reviewers regarding the changes in the revised PDF"}, "comment": {"value": "We sincerely thank all reviewers for their valuable comments. We have made comprehensive revisions to the manuscript. In the revised paper, **red** indicates newly added content, and **blue** indicates modified content. A brief summary of the changes is as follows:\n\n## 1. Figures and Illustrations\n\n- Removed the “Transformers” cartoon image in Figure 1.\n - Removed redundant references to Table 1 and Table 2.\n\n## 2. Method (Chapter 3)\n\n- **Section 3.1**: Improved the channel reordering step before applying CIF to better leverage physiological relationships in subsequent feature mixing and highlight the overall motivation of our work. Corrected the description of Algorithm 1 in Appendix E. Additionally, we revised the theoretical analysis of SVD and provided a more comprehensive signal-to-noise ratio enhancement analysis in Appendix A.\n- **Section 3.2**: Strengthened the explanation of the relationship and novelty between CIF and HM-BiTCN, clarifying that CIF operates along the channel dimension while HM-BiTCN operates along the temporal dimension. We also clarified that CIF parameters \\(a\\) and \\(b\\) are trained end-to-end together with the HM-BiTCN structure parameters.\n\n## 3. Experiments (Chapter 4)\n\n- Added explanations regarding “subject-independent” and “subject-dependent” settings, and clarified why “subject-independent” experiments were chosen as our main analysis.\n- **Ablation Study (Section 4.3.1)**: Added results of CIF and HM-BiTCN on the PTB-XL dataset. Additionally, in Appendix J, we included nearly 1000 new experiments on parameters \\(t, n, a, b\\). Due to time constraints, more experiments on \\(t, n, a, b\\) will be provided in the camera-ready version.\n- **Section 4.3.2**: Enhanced the fusion experiments between CIF and the current state-of-the-art methods in Appendix J.2, highlighting the advantage of our data-centric approach.\n- **Section 4.3.3**: Explored additional physiologically motivated fusion strategies."}}, "id": "cKYVSfbtfT", "forum": "j9mSh3TdZW", "replyto": "j9mSh3TdZW", "signatures": ["ICLR.cc/2026/Conference/Submission824/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission824/Authors"], "number": 11, "invitations": ["ICLR.cc/2026/Conference/Submission824/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763716793966, "cdate": 1763716793966, "tmdate": 1763716793966, "mdate": 1763716793966, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}