{"id": "JarDQtUA4A", "number": 6110, "cdate": 1757953023810, "mdate": 1759897935000, "content": {"title": "Sparse-Compression Diffusion Models", "abstract": "Diffusion models have demonstrated capabilities in successful generating synthetic data, especially the pictural ones. However, the conventional reverse diffusion process merely overfits in data denoising. Empirical studies indicate that the denoising mechanism obstructs the diffusion models to generate robust physical synthetic data. In this work, we propose the Sparse Compression-Diffusion Model (SCDM), with a novel reverse diffusion process that enforces compression. The compression attempts to recover the low-dimensional and sparse representations, potentially enabling the ability to capture the intrinsic factors of some hidden physical laws. Experiments prove that the sparse latent representations learned by SCDM align well with top factors identified in physical theories.", "tldr": "", "keywords": ["Sparse Coding", "Diffusion Process", "Representation Learning"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/754850a6b852f21cceadfb254be1ff9ed5b740a0.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes SCDM, a diffusion framework that inserts a compression-sparsity module in each reverse step: encode $x_t\\rightarrow z_t$, project onto a mixture of orthogonal subspaces, apply an ISTA-style soft-threshold, and then predict the noise from the resulting sparse code to form the usual DDPM update rule. The claimed contributions are (1) integrating \"sparse rate reduction\" into diffusion, and (2) demonstrating that sparse latents \"align with scientific theories,\" using toy/small physics datasets (circle, oscillators, pendulums)."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "Pursuing a sparse latent structure during reverse diffusion is a reasonable direction. The paper attempts to formalize this via rate-reduction terms (eq. 5–8)."}, "weaknesses": {"value": "1. The problem statement is very unclear and overstated. The paper asserts that standard reverse diffusion \"merely overfits in data denoising\" and \"obstructs… robust physical synthetic data,\" but provides no evidence or references establishing this problem as real or general. This is presented in the abstract/introduction and is used to justify the method. However, the experiments do not demonstrate real-world failures of DDPM beyond small toy settings, and does not reveal why is it that DDPM fails. To me, this appears to be a flaw in the experiments.\n2. The core claim that the learned latents \"align well with scientific theories\" is asserted (what does scientific theories even mean?), but the evidence is qualitative plots of sinusoidal-like activation norms (Fig. 4) and small metric gains on tiny datasets. This does not validate alignment with the governing physical laws in a robust way.\n3. The projection operator in algorithm 1 is not defined clearly anywhere in the paper.\n4. Eq. 14 mixes the usual DDPM mean with $z_{t-1}^{K}$ in place of $x_{t}$. There is no derivation showing that this substitution yields a valid reverse process.\n5. All datasets are tiny and insufficient to evaluate a general generative modeling claim about \"robust physical data synthesis.\"\n6. The motivation and what exactly is new are very hard to track.\n7. Numerous grammatical errors and awkward phrasing (e.g., \"pictural,\" \"merely overfits in data denoising\" in the abstract), plus inconsistent use of technical terms, make the paper feel unpolished."}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "IUsOjJfbRb", "forum": "JarDQtUA4A", "replyto": "JarDQtUA4A", "signatures": ["ICLR.cc/2026/Conference/Submission6110/Reviewer_g5Ep"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6110/Reviewer_g5Ep"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission6110/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761576914423, "cdate": 1761576914423, "tmdate": 1762918469809, "mdate": 1762918469809, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Sparse-Compression Diffusion Models (SCDM), an extension of DDPMs that introduces a compression–sparsity mechanism into the reverse diffusion step. The method draws heavily on the CRATE (Yu et al., 2023) framework for sparse rate reduction, combining subspace projection and ISTA-style soft-thresholding to encourage low-dimensional latent representations. The authors claim this yields more interpretable and physically robust generative models, supported by experiments on simple physical datasets (oscillators and pendula)."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1. The idea of embedding sparse representation principles into diffusion modeling is conceptually sound and moderately novel in motivation.\n2. The paper is structurally clear and provides a full algorithmic description (Algorithm 1), which makes replication possible in principle.\n3. The attempt to link sparse representations with physical interpretability is an appealing research direction."}, "weaknesses": {"value": "1. Limited Theoretical Novelty\n- Nearly all equations—including the compression objective $$R(z)-R_c(z;U)-\\lambda\\|z\\|_0$$, the log-det rate formulation, the softmax-weighted subspace projection, and the ISTA sparsification step—are taken directly from the CRATE paper with minimal adaptation.\n- The only  change is placing these CRATE blocks inside the DDPM reverse step and feeding the sparse code into the noise predictor. This is an implementation variant, not a new theory.\n- There is no probabilistic or variational derivation showing that the added term improves the diffusion likelihood or score estimation.\n2. Weak Mathematical Rigor\n- Notation and definitions are inconsistent (e.g., non-differentiable $$ \\| \\cdot \\|_0 $$ with no surrogate use).\n- The information-theoretic \"coding rate\" is adopted from CRATE without re-deriving its relevance to diffusion modeling.\n- No analysis is given of how the added compression term affects convergence or stability of the reverse process.\n3. Insufficient Empirical Rigor\n- Metrics: RMAE, MDN %CE, and %VFE measure geometric fidelity of trajectories, not generative quality. They do not test likelihood, diversity, or coverage. \n- Baselines: The comparison excludes the 'Physics-Informed Diffusion Model' (Shu et al., JCP 2023) despite citing it. SCDM also uses an extra ISTA bottleneck, so model capacity differs from DDPM/DDIM baselines.\n- Datasets: All datasets are low-dimensional (2–4 vars) and small. These tasks are trivial for diffusion models and cannot demonstrate generalization or robustness.\n- Reporting: \n    -- No multiple seeds, confidence intervals, or significance tests. Figures lack scales and quantitative analysis.\n    -- Not clear how individual CRATE components influence sample quality\n4. Citation and Scholarly Issues\n- Roughly half the references are arXiv-only. Foundational works (VAE, DDPM, SSC) have wrong years or missing venues(Arxiv references even  for papers which have been published in ML venues)\n5. Writing and Presentation\n- English usage is often incorrect (\"successful generating,\" \"merely overfits in data denoising\") and many claims are vague (\"intrinsic factors of some rules\").\n- Assertions of \"alignment with scientific theories\" are rhetorical; no quantitative mapping to actual equations is shown."}, "questions": {"value": "1. How does the compression–sparsity term modify or complement the diffusion ELBO?  \n2. Why are standard generative metrics (NLL, MMD, FID) absent?  \n3. Why was the physics-informed diffusion baseline omitted despite citation?  \n4. Could simpler non-diffusion models (e.g., sparse VAE) achieve similar performance on these datasets?\n\nSCDM is incremental and under-evidenced. The theoretical framework is a direct transplant of CRATE into diffusion modeling, and the experiments are confined to trivial physical systems with inadequate baselines and metrics. The work lacks the mathematical and empirical depth required for a top-tier venue.\n\n-----\nRecommended Improvements\n------\n1. Provide a formal derivation connecting the compression–sparsity term to diffusion likelihood or score matching.  \n2. Expand experiments to higher-dimensional datasets and include standard generative metrics.  \n3. Add physics-informed diffusion and sparse generative models as baselines.  \n4. Report mean +- std across multiple runs and perform significance tests.  \n5. Correct reference list and cite archival versions where available."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "faCXHgVQyS", "forum": "JarDQtUA4A", "replyto": "JarDQtUA4A", "signatures": ["ICLR.cc/2026/Conference/Submission6110/Reviewer_otdE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6110/Reviewer_otdE"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission6110/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761812964114, "cdate": 1761812964114, "tmdate": 1762918468953, "mdate": 1762918468953, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel reverse diffusion process to force the model to better learn low-dimensional and sparse latent representations. The formula description in the paper is detailed and concise, and experiments have been conducted to verify the effectiveness of this method."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- This paper proposes a novel integration of sparse rate reduction with diffusion models which has not been previously explored in the diffusion model literature. \n- Tests on 7 physical datasets covering diverse low-dimensional physical systems, with rigorous baselines (DDPM, DDIM, SDD) and three physics-relevant metric.\n- The thesis is structured coherently, with clear writing and concise descriptions of the proposed methods. The logical flow of methodology, experiments, and results facilitates easy comprehension of the technical contributions."}, "weaknesses": {"value": "- For quantitative accuracy assessment, the manuscript states that SCDM is compared with 3 baselines (as shown in Table 1), yet Line 346 claims a comparison with 5 baselines—this quantitative discrepancy requires clarification. Furthermore, 3 baselines may be insufficient to fully substantiate the superiority of SCDM, especially given that SCDM does not achieve the best performance across all metrics in Table 1. This limits the persuasiveness of its claimed effectiveness.\n- The work proposes a novel reverse process for diffusion models, which in principle could be extended to downstream tasks such as image generation. However, the current study only focuses on sparse compression, with no supplementary experiments to validate SCDM’s performance in other tasks (e.g., image quality evaluation via FID, or model efficiency metrics like inference time/parameter overhead). This narrow scope fails to demonstrate its versatility as a general-purpose diffusion model.\n- SCDM’s compression process relies on two core steps: projection and transformation. Ablation studies to isolate and quantify the individual contributions of these two steps are critical to dissecting the model’s working mechanism—without such analyses, the relative importance of each component remains unclear, and the rationality of the proposed pipeline cannot be fully verified.\n- The manuscript would benefit from replacing raster graphics with vector graphics (e.g., figure 2). Vector graphics offer higher resolution and scalability, which enhances the clarity and reproducibility of key results—an important aspect of academic manuscript presentation."}, "questions": {"value": "- See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "chQp7PUuyb", "forum": "JarDQtUA4A", "replyto": "JarDQtUA4A", "signatures": ["ICLR.cc/2026/Conference/Submission6110/Reviewer_Qxrv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6110/Reviewer_Qxrv"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission6110/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761858213127, "cdate": 1761858213127, "tmdate": 1762918468309, "mdate": 1762918468309, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose a novel design/regularization procedure incorporated into the noise predictor of a diffusion denoiser. They perform the denoising using a compressed, sparse representation of x_t, referred to as z_t. The compressed, sparse representation is trained to have these properties by following CRATE from Yu et al. 2023. They show that this intervention improves sampling performance on datasets which rightfully lie on a low-dimensional manifold. They also show that these learned representations match the known latent variables of their datasets."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Novel idea, good sampling results on their chosen datasets. I cannot speak to the validity of the sparse latent representations aligning with the known latent variables of the physical systems that these diffusion models are modelling."}, "weaknesses": {"value": "I am a bit confused about the construction of their denoising net. Their noise prediction network takes in z_t, the compressed representation of x_t. Shouldn't the noise component of x_t, which the network is trying to predict, be incompressible? So shouldn't z_t be throwing away information that the noise prediction network g needs to do its job? My best guess is that their implementation doesn't actually work this way and they are really predicting x_0 hat instead of epsilon hat, or something like that. Otherwise I have no idea how this achieves reasonable sampling quality. Perhaps this is all fine and I am just terminally confused. \n\n\"non-markova\"-> non markovian"}, "questions": {"value": "Please address my confusion above in the weaknesses section"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "sCELENHtiI", "forum": "JarDQtUA4A", "replyto": "JarDQtUA4A", "signatures": ["ICLR.cc/2026/Conference/Submission6110/Reviewer_cVea"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6110/Reviewer_cVea"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission6110/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762706711432, "cdate": 1762706711432, "tmdate": 1762918467582, "mdate": 1762918467582, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}