{"id": "jBNGp43uUd", "number": 6936, "cdate": 1758002658988, "mdate": 1759897883000, "content": {"title": "DDM-TS: Decoupled Diffusion Models for Time-Series Generation with Explicit Trend–Seasonality Decomposition", "abstract": "Time-series data are crucial for analysis and prediction across various domains, including finance, healthcare, and energy. However, issues of data scarcity, sensitivity concerns, and privacy regulations limit the availability of high-quality datasets, motivating growing research interest in time-series generation. While recent diffusion models have demonstrated stable learning capabilities and high-quality results for time-series generation, existing approaches face challenges in maintaining structural integrity when generating unconditional multivariate sequences over extended periods. This challenge involves preserving both long-term $\\textit{trends}$ and periodic $\\textit{seasonality}$ simultaneously, as unified frameworks suffer from inherent component interference that diminishes generation quality. To address this challenge, we propose DDM-TS, a novel decoupled diffusion framework that trains independent diffusion models for trend and seasonality components decomposed via STL decomposition. The framework then employs an adaptive gate-based fusion module that provides learnable fusion weights to unify the independently generated components into coherent synthetic time series. By decoupling trend and seasonal processing pathways, DDM-TS effectively alleviates mutual interference while preserving structural characteristics. Comprehensive experiments across benchmark datasets demonstrate that DDM-TS outperforms state-of-the-art baselines across diverse evaluation measures, achieving an average improvement of 33.8\\% in reconstruction metrics (RMSE, PSNR), while preserving distributional coverage and frequency-domain consistency as demonstrated by t-SNE and spectral analysis metrics. Code is available at https://anonymous.4open.science/r/DDM-TS-0D44/.", "tldr": "We introduce DDM-TS, a decoupled diffusion framework that employs separate pathways for trend and seasonality modeling to generate high-fidelity, unconditional multivariate time series across extended temporal lengths.", "keywords": ["Diffusion Models", "Time Series Generation", "STL Decomposition", "Multivariate Time Series", "Unconditional Generation"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/58d5bc87b5e4b1628148c507c2e58dc0e503f330.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes DDM-TS a decoupled diffusion framework that aims to learn trend and seasonality components from STL decomposition for unconditional time series generation. Empirical results demonstrated strong performance in generation quality through many evaluation metrics."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper is well written and clearly presents the questions, proposed methods, and analysis.\n2. As shown in Tables 1 and 2, DDM-TS shows strong performance in selected datasets, especially in the low-dimensional dataset."}, "weaknesses": {"value": "1. As shown in Table 2, DDM-TS has demonstrated strong performance in low-dimensional datasets like (Stock and ETTh). It seems the performance degrades with the Energy dataset, which is inconsistent with Table 1. \n2. Due to randomness in generation, it is common to perform DA and PD evaluation multiple times with the standard deviation reported. It will be more compelling if the authors report the STD as commonly used.\n3. Only three datasets are evaluated throughout the paper. The proposed methods could be more compelling if more diverse datasets were used in evaluation.\n4. Minor: In Figure 2, it will be great to write the name of the dataset in the description."}, "questions": {"value": "1. As written in W1, do the authors have any suggestion why DDM-TS’s performance degrade in high-dimensional datasets?\n2. As commonly used in diffusion-based generation models, they usually operate in the raw value space. How does DDM-TS perform if STL decomposition is removed? It will be great to include this experiment in the Ablation study (Table 3)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ulG7oEE6rH", "forum": "jBNGp43uUd", "replyto": "jBNGp43uUd", "signatures": ["ICLR.cc/2026/Conference/Submission6936/Reviewer_Y7Lw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6936/Reviewer_Y7Lw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission6936/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761575202916, "cdate": 1761575202916, "tmdate": 1762919168967, "mdate": 1762919168967, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes DDM-TS, a novel decoupled diffusion architecture specifically designed for time-series generation. The core mechanism involves a pre-processing step using STL decomposition to separate the long-term trend and seasonal components. Subsequently, two independent Denoising Diffusion Probabilistic Models (DDPMs) are trained—one dedicated to each component. A final fusion stage then reconstructs the full signal. This architectural separation is motivated by the aim to mitigate frequency interference (or gradient conflict across different scales) that typically hinders a single diffusion network. Empirical evaluation on standard benchmarks demonstrates improved reconstruction accuracy (lower RMSE and higher PSNR) when compared to prior time-series diffusion models like Diffusion-TS and TimeGrad, though this gain is reported to come at the cost of reduced spectral fidelity."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The decoupled architecture is soundly implemented, and the underlying rationale of frequency disentanglement is theoretically reasonable for addressing gradient conflicts in multi-scale time series. \n\n- The authors conduct systematic experiments that successfully demonstrate strong reconstruction accuracy ($\\downarrow$ RMSE, $\\uparrow$ PSNR) compared to existing diffusion models. \n\n- The work represents sound engineering and provides a practical, easily implementable solution well-suited for practitioners in time-series analysis."}, "weaknesses": {"value": "- The reliance on additive decomposition fundamentally oversimplifies real-world temporal dynamics. In most natural and financial processes, the coupling between trend and seasonality is multiplicative, where the magnitude of seasonality scales with the overall trend level.\n\n- The conceptual novelty is limited. The work is primarily architectural and demonstrates a practical engineering workaround rather than introducing new, deep theoretical, generative knowledge about diffusion models.\n\n- There is an ambiguity in the gating/fusion mechanism that needs clarification: the parameter $\\alpha_T(t)$ appears both in the trend reconstruction term, $P_{\\text{trend}}(\\alpha_T(t))$ (Eq. 2), and in the final fusion equation, $\\hat{x}_t = \\alpha_T(t)\\hat{T}_t + \\alpha_S(t)\\hat{S}_t$ (Eq. 8). Sharing a single parameter for both component decoding and component fusion could potentially re-introduce gradient interference between the decoder and the final reconstruction stage; conversely, separating them would invalidate the current notational consistency."}, "questions": {"value": "- In Section 3.1 and the discussion concerning Figure 4, the authors acknowledge that the purely additive STL decomposition may be inadequate for capturing amplitude variation across time, particularly in datasets where the seasonal component’s magnitude is clearly dependent on the overall trend level (i.e., when volatility or energy scales with the level). Given this well-known limitation, have the authors considered a multiplicative or log-domain formulation that better handles coupled dynamics, such as: $\\log x_t = \\log T_t + \\log(1 + S_t)$? \n\n- The current empirical evaluation appears to be limited exclusively to datasets (ETTh, Energy, Stocks) that naturally exhibit clear periodic or trend–seasonal structures. How would DDM-TS perform, or how would the entire STL-based framework behave, on non-seasonal, event-driven, or highly dynamic datasets, e.g., MuJoCo (physical control signals), CMAPSS (engine degradation signals), EEG/fMRI signals (neurological data)? In such domains, the fundamental assumption of a separable trend and seasonality is often ill-defined or irrelevant. Providing results on such benchmarks is crucial to demonstrate the model's generalizability beyond structured seasonal data."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "yFN8hCTeJQ", "forum": "jBNGp43uUd", "replyto": "jBNGp43uUd", "signatures": ["ICLR.cc/2026/Conference/Submission6936/Reviewer_cAYy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6936/Reviewer_cAYy"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission6936/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761795068653, "cdate": 1761795068653, "tmdate": 1762919168418, "mdate": 1762919168418, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces DDM-TS, a decoupled diffusion architecture for unconditional time-series generation, explicitly separating trend and seasonality through STL decomposition. Each component is modeled by an independent diffusion process with specialized encoders and decoders (trend modeling emphasizes smoothness), while seasonality modeling employs FFT-based frequency constraints. A gate-based fusion module adaptively combines both components."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- Good clarity and well-organized writing.\n- Clear motivation: addresses the interference between trend and seasonality in unified diffusion frameworks\n- Well-designed decoupled architecture with STL decomposition and component-specific diffusion & adaptive gating mechanism for dynamic trend–seasonality fusion\n- Strong experimental performance on multiple benchmarks\n- Thorough ablation study and interpretability analysis"}, "weaknesses": {"value": "1. Lack of novelty\n- While the decoupling of diffusion processes is conceptually interesting, similar decomposition principles (e.g., Diffusion-TS, FALDA) already exist. The paper primarily combines these existing ideas rather than introducing a fundamentally new generative mechanism.\n- The STL decomposition and separate DDPMs are straightforward extensions; the innovation lies mostly in integration, not in the generative process itself.\n\n2. Complexity vs. performance trade-off:\n- The architecture introduces two diffusion models, each with encoder-decoder stacks, plus a fusion module. This increases computational cost, but no runtime or efficiency comparison is provided.\n\n3. Ablation results lack deeper analysis\n- The ablation shows degradation when removing either module but does not discuss fusion parameter sensitivity or training stability—key concerns for multi-path diffusion systems. It remains unclear how the model balances learning dynamics between trend and seasonality during joint optimization.\n\n4. Dependent on metrics\n- The performance ranking of DDM-TS varies drastically across different metric categories (e.g., strong in reconstruction but weak in distributional and spectral consistency).\n\n5. Limited dataset diversity\n- The experiments are conducted on only three datasets (Stock, Energy, ETTh), all of which are well-known and relatively small-scale."}, "questions": {"value": "Please refer to the weakness above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "G6OBUIXSbv", "forum": "jBNGp43uUd", "replyto": "jBNGp43uUd", "signatures": ["ICLR.cc/2026/Conference/Submission6936/Reviewer_Xw5Z"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6936/Reviewer_Xw5Z"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission6936/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761972454703, "cdate": 1761972454703, "tmdate": 1762919168004, "mdate": 1762919168004, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes DDM-TS, a “decoupled” diffusion framework for unconditional multivariate time-series generation that separately models trend and seasonality components using STL decomposition and independent diffusion models, followed by an adaptive gating fusion. While the authors claim state-of-the-art performance—highlighting a 33.8% average improvement in RMSE and PSNR—the work suffers from severe conceptual, methodological, and experimental flaws."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. The experimental evaluation is unusually broad, covering multiple datasets, sequence lengths, and over a dozen metrics, which shows commendable effort in empirical coverage, despite flawed interpretation.\n\n2. The qualitative visualizations (e.g., t-SNE, waveform plots) are clearly presented and do reveal some practical utility in capturing macro-level patterns, especially for financial time series."}, "weaknesses": {"value": "1. The core claim that unified diffusion models “suffer from inherent component interference”, is asserted without proof. No formal analysis (e.g., gradient conflict, mutual information leakage) justifies decoupling. STL decomposition is heuristic and non-identifiable; treating its outputs as ground-truth components for diffusion training is statistically unsound.\n\n2. The work is essentially a minor variant of Diffusion-TS (Yuan & Qiao, 2024b), which already uses trend–seasonality decomposition. Claiming “decoupling” as a novelty is misleading. Diffusion-TS also processes components separately. DDM-TS merely adds gating and per-component decoder designs that resemble prior work in seasonal forecasting (e.g., SSDNet, FALDA).\n\n3. While RMSE/PSNR improvements are emphasized, DDM-TS consistently underperforms in autocorrelation (ACD), spectral distance (SD), and diversity metrics (KD), critical for time-series fidelity. These failures are downplayed as “trade-offs,” not weaknesses, which is scientifically dishonest.\n\n4. The trend decoder uses an ad-hoc smoothness filter with learnable thresholds (Eq. 6), but there’s no ablation showing its necessity over standard diffusion backbones. Similarly, the FFT-based seasonality module adds complexity without justification. Why not use standard positional encodings or temporal convolutions?\n\n5. STL decomposition requires the entire time series to estimate trend and seasonality. Yet the method is applied to unconditional generation, implying that clean STL components must be known at training time."}, "questions": {"value": "1. Please address Weakness #1: Provide theoretical or empirical evidence that “component interference” genuinely exists in standard diffusion models for time series.\n\n2. Regarding Weakness #2: Clarify how DDM-TS fundamentally differs from Diffusion-TS (Yuan & Qiao, 2024b) beyond superficial architectural changes.\n\n3. For Weakness #3: Why are poor ACD/SD scores acceptable? How can a method claim “structural integrity” while failing basic autocorrelation tests?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "L2LIVizfa1", "forum": "jBNGp43uUd", "replyto": "jBNGp43uUd", "signatures": ["ICLR.cc/2026/Conference/Submission6936/Reviewer_1Zho"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6936/Reviewer_1Zho"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission6936/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762174721007, "cdate": 1762174721007, "tmdate": 1762919167564, "mdate": 1762919167564, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}