{"id": "JC8xYAADHL", "number": 13546, "cdate": 1758219092908, "mdate": 1763659896234, "content": {"title": "Safe Exploration via Policy Priors", "abstract": "Safe exploration is a key requirement for reinforcement learning agents to learn and adapt online, beyond controlled (e.g. simulated) environments. In this work, we tackle this challenge by utilizing suboptimal yet conservative policies (e.g., obtained from offline data or simulators) as priors. Our approach, SOOPER, uses probabilistic dynamics models to optimistically explore, yet pessimistically fall back to the conservative policy prior if needed. We prove that SOOPER guarantees safety throughout learning, and establish convergence to an optimal policy by bounding its cumulative regret. Extensive experiments on key safe RL benchmarks and real-world hardware demonstrate that SOOPER is scalable, outperforms the state-of-the-art and validate our theoretical guarantees in practice.", "tldr": "We propose a safe and scalable reinforcement learning algorithm that leverages policy priors with probabilistic dynamics models to guarantee safety and convergence to optimal performance.", "keywords": ["Deep Reinforcement Learning", "Safe Exploration", "Safe RL", "Constrained Markov Decision Processes"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/af331fbbf032935bc52425aab264cfe037256d98.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces SOOPER, a model-based reinforcement learning algorithm designed for safe exploration for constrained Markov decision processes. The method leverages conservative policy priors to ensure safety while optimistically exploring to improve performance. Conservative policy priors are derived from offline data or simulations. Theoretical guarantees are established for both safety and sublinear cumulative regret. The experiments demonstrate strong empirical performance on several benchmarks and real-world robotic systems."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper is easy to follow and the motivations behind the proposed algorithm are clearly presented. The paper provides a well-motivated discussion of the need for safe exploration in reinforcement learning, emphasizing the trade-off between conservatism and exploration.\n\n1. The relevant literature has been well-covered and I do not find missing references.\n\n1. The proposed algorithm is technically sound.\n\n1. Theoretical results are rigorous, providing both safety guarantees and a sublinear cumulative regret bound. As far as I know, the theoretical results in this paper is novel.\n\n1. The experimental section is comprehensive, including evaluations on RWRL, SafetyGym, and a real hardware setup. The proposed method consistently outperforms or matches strong baselines such as SAILR, CRPO, and Primal-Dual.\n\n1. The implementation based on MBPO demonstrates that the proposed algorithm can scale to high-dimensional continuous control tasks. MBPO is known as a highly scalable algorithm, which is a good technique for making SOOPER practical."}, "weaknesses": {"value": "1. The theoretical analysis relies on several strong assumptions (e.g., Gaussian noise, Lipschitz continuity, bounded RKHS norms, and the existence of a pessimistic policy prior that satisfies safety for all plausible dynamics). While such assumptions are sometimes seen in other safe RL literature, they may limit the practical applicability of the theoretical results.\n\n1. Although the paper claims that SOOPER can be implemented on top of standard model-based methods, the overall system involves several non-trivial components (uncertainty estimation, pessimistic value computation, termination logic). A short discussion on the computational overhead or design trade-offs would be helpful."}, "questions": {"value": "1. I consider the assumption of treating state transitions in the form of equation (1) and Assumptions 1–3 to be very strong. Could you share the authors' views on the strength of this set of assumptions and any attempts to relax them in future research?\n\n1. To what extent do the assumptions made in the paper hold in the experimental setting? While the paper provides a sound theoretical framework, it is somewhat unclear whether all these assumptions are necessary in the experimental setting. It would strengthen the paper to discuss or empirically examine how SOOPER behaves when some of these assumptions do not hold. Since the implementation builds on MBPO to learn the dynamics model, the method should, in practice, already be capable of handling moderately stochastic transitions. Confirming this empirically would provide valuable evidence for the robustness of the proposed approach, by evaluating SOOPER under relaxed or partially violated assumptions. I do not intend to criticize the fact that some assumptions may not hold; rather, if the proposed method still functions effectively as a kind of meta-algorithm even when certain assumptions are violated, that would further enhance the value of this paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "wCwAnSuTLK", "forum": "JC8xYAADHL", "replyto": "JC8xYAADHL", "signatures": ["ICLR.cc/2026/Conference/Submission13546/Reviewer_XArr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13546/Reviewer_XArr"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13546/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760936223551, "cdate": 1760936223551, "tmdate": 1762996930752, "mdate": 1762996930752, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the use of conservative policy prior to enhance safe exploration in reinforcement learning (RL). The proposed method, SOOPER, performs optimistic exploration when safety can be guaranteed with high probability, and switches to the conservative policy prior when exploration becomes potentially unsafe. The authors provide theoretical guarantees for both high-probability constraint satisfaction and optimality. Extensive experiments demonstrate that SOOPER outperforms state-of-the-art baselines across various benchmark tasks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. While the combination of offline training and online exploration is not entirely new, the paper demonstrates novelty through its theoretical development, particularly in providing safety and optimality guarantees.  \n2. The empirical evaluations are comprehensive and effectively support the theoretical findings, illustrating the method’s applicability to practical scenarios.  \n3. The paper is well written and easy to follow, even in the theoretical sections, which are presented with clarity and coherence."}, "weaknesses": {"value": "1. In the Introduction, the authors state that their theoretical results hold under regularity assumptions, and in the “Optimality” subsection of Related Works, they claim to relax some assumptions from prior studies. However, in Section 3 (Problem Setting), Assumption 1 regarding Gaussian noise appears rather restrictive. Moreover, the assumption that the transition dynamics follow \\( s_{t+1} = f(s_t, a_t) + \\omega_t \\) is quite strong; a more general formulation such as \\( s_{t+1} = f(s_t, a_t, \\omega_t) \\) might be preferable. As far as I understand, these assumptions are stronger than those used in [1].  \n2. The proposed simulated exploration strategy is model-based, which may limit its applicability to environments with large or complex state spaces. It would be valuable for the authors to discuss these limitations and possible extensions to model-free settings.\n\n[1] Akifumi Wachi, and et al, Safe exploration in reinforcement learning: a generalized formulation and algorithms, in NeurIPS 2023."}, "questions": {"value": "1. The proposed method relies heavily on the set of plausible models. In general, as the amount of data increases, the model can be refined and improved. How does such model improvement affect the theoretical guarantees presented in this paper? I did not find a clear discussion on this point.  \n2. Could the authors clarify why CRPO fails in the safe online learning experiment on real hardware?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "r22TRdOxdE", "forum": "JC8xYAADHL", "replyto": "JC8xYAADHL", "signatures": ["ICLR.cc/2026/Conference/Submission13546/Reviewer_zYbx"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13546/Reviewer_zYbx"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13546/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761374172960, "cdate": 1761374172960, "tmdate": 1762924143788, "mdate": 1762924143788, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes SOOPER (Safe Online Optimism for Pessimistic Expansion in RL), a model-based algorithm for safe exploration in continuous CMDPs. It leverages pessimistic policy priors, which are safe but suboptimal policies learned offline or in simulation, to ensure constraint satisfaction, while using probabilistic world models for optimistic exploration.\n\nThe authors prove that SOOPER satisfies safety constraints at all times (Theorem 1) and achieves sublinear cumulative regret (Theorem 2), unlike prior methods that only guarantee asymptotic safety or simple-regret bounds. The analysis couples online cost-tracking with a \"planning MDP with pessimistic termination reward,\" allowing standard RL methods to be used while maintaining guarantees. Empirical validation on SafetyGym, RWRL, and real robots shows consistent safety and performance gains."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "+ Strong analytical results by combining always-safe learning with sublinear cumulative regret.\n+ The pessimistic-termination MDP approach converts a constrained problem into a standard RL one.\n+ Unification of optimism, pessimism, and expansion through a single intrinsic-reward objective.\n+ Empirically validated on diverse continuous-control tasks and real hardware, not only simulators."}, "weaknesses": {"value": "- The proof seems to implicitly assume Lipschitz continuity of the uncertainty estimate $\\sigma_n,$ which is not formally stated.  I think this assumption is required for several bounds.\n- Assumption 4 requires the prior policy to be at least as safe as the optimal one for all states, which seems very strong."}, "questions": {"value": "How sensitive is the safety guarantee to imperfect calibration of $\\sigma_n$\t​\nCould Assumption 4 be relaxed to hold in expectation over $\\rho_0$ \nHow would the analysis change if the policy prior were stochastic or state-dependent only approximately safe?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7pFHqC9jIA", "forum": "JC8xYAADHL", "replyto": "JC8xYAADHL", "signatures": ["ICLR.cc/2026/Conference/Submission13546/Reviewer_vK36"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13546/Reviewer_vK36"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13546/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762234654159, "cdate": 1762234654159, "tmdate": 1762924143335, "mdate": 1762924143335, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}