{"id": "JdL67YDnSy", "number": 14990, "cdate": 1758246564968, "mdate": 1759897337305, "content": {"title": "Scaffold–Substituent Differentiated Diffusion for Hierarchical Molecule Generation", "abstract": "Deep generative models have emerged as powerful tools for efficiently navigating the vast chemical space and generating molecules with desirable properties. However, existing approaches—particularly diffusion-based models—struggle to effectively model the hierarchical structure of drug-like molecules, which typically consist of a core scaffold and attached substituent functional groups. This hierarchical decomposition is central to modern drug design strategies, where scaffold hopping and lead optimization are applied iteratively to refine molecular structure. While traditional methods can optimize each component separately, they often rely on rule-based heuristics and lack the capacity for joint optimization. To address these limitations, we propose the Scaffold–Substituent Hierarchical Diffusion Model (S$^2$-HDM). It unifies the principles of scaffold hopping and lead optimization within a single generative framework by introducing a differentiated noise schedule for scaffold and substituent atoms. % In the reverse process, scaffold atoms are prioritized for early denoising, providing a stable core context that guides the flexible generation of diverse substituents.\nUnlike traditional approaches, S$^2$-HDM implicitly learns the scaffold and substituent hierarchy without pre-defined functional groups, enabling an end-to-end generation pipeline. We validate the effectiveness of our method through extensive experiments, where S$^2$-HDM achieves outstanding performance in multiple generation benchmarks. These results underscore the model’s potential to advance drug design by balancing scaffold integrity with substituent diversity, aligning closely with structure-based design principles. The code can be found at \\href{https://anonymous.4open.science/r/S2-HDM-6F23}{https://anonymous.4open.science/r/S2-HDM-6F23}.", "tldr": "S$^2$-HDM is a hierarchical diffusion model that jointly optimizes scaffolds and substituents with differentiated noise schedules, enabling end-to-end generation of molecules that balance scaffold integrity with substituent diversity.", "keywords": ["Molecule Generation", "Diffusion Model"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e77f37de98a8aa545ec1745e08fd7f1ef35a69e4.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces a hierarchical diffusion model designed to differentiate between scaffold and substituent atoms by employing two distinct noise schedulers and a role-classification module. The model trains a classifier to predict the role of each atom, enabling dynamic role estimation during sampling. The reverse diffusion process is then structured to prioritize scaffold formation in the early stages, followed by a flexible exploration of substituent atoms in later stages."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is well-written and well-structured. \n- The authors motivate the problem of structure-aware diffusion process well, as prior studies work on an atom-level, while discarding the hierarchical structure of molecules. \n- The authors validate the effectiveness of their proposed method, demonstrating improved performance on both unconditional and conditional generation tasks."}, "weaknesses": {"value": "- To further support the claims made in the paper and underscore the relevance of the problem, it is important to evaluate how closely the distribution of generated scaffolds and functional groups aligns with that of the training data, and to compare these results with diffusion baselines that treat all atoms the same.\n- The related work section is missing relevant studies on scaffold and substituent design. For example, DiffSBDD [1] performs inpainting for scaffold or fragment growth, and UniGuide [2] introduces guidance in a training-free manner during sampling.\n- According to Tables 1 and 2, the results of S2-HDM include property refinement guidance, which may make the comparison with autoregressive (AR), flow-based, and diffusion baselines unfair. It would be helpful to include results without property refinement for a fairer comparison. \n- The authors claim that their approach prioritizes scaffold generation followed by flexible substituent exploration. However, they do not report the diversity of the generated samples under either unconditional or conditional generation tasks."}, "questions": {"value": "- Could you apply the trained classifier and the differentiated noise schedulers for scaffolds and functional groups during sampling with a given pretrained model (e.g., EDM) to assess whether this setup independently improves performance? Or does this correspond to the third row in the ablation study (Table 2)?\n- Can you provide more details on the S2-HDM model architecture?\n- Would it be possible to use the model for substructure conditioning tasks, such as scaffold hopping or scaffold elaboration [1,2], by using task-specific noise schedulers?\n\n[1] Schneuing, Arne, et al. \"Structure-based drug design with equivariant diffusion models.\" Nature Computational Science 4.12 (2024): 899-909.\n[2] Ayadi, Sirine, et al. \"Unified guidance for geometry-conditioned molecular generation.\" Advances in Neural Information Processing Systems 37 (2024): 138891-138924."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QknEI22BFK", "forum": "JdL67YDnSy", "replyto": "JdL67YDnSy", "signatures": ["ICLR.cc/2026/Conference/Submission14990/Reviewer_BdJq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14990/Reviewer_BdJq"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14990/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760631308386, "cdate": 1760631308386, "tmdate": 1762925319405, "mdate": 1762925319405, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes S$^2$-HDM (Scaffold-Substituent Hierarchical Diffusion Model), a diffusion-based generative model for 3D molecular generation that applies differentiated noise schedules to scaffold and substituent atoms."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1.  The paper draws clear inspiration from traditional drug design practices (scaffold hopping and lead optimization), which makes the hierarchical treatment of molecules quite intuitive and scientifically grounded.\n2. The model shows consistent improvements across multiple metrics on standard benchmarks."}, "weaknesses": {"value": "1. While the application is interesting, the technical contributions feel somewhat incremental. The main idea is essentially applying different noise schedules to different atom types. This is not particularly novel from a diffusion modeling perspective. The S$^2$ classifier is just a standard binary classifier added to the architecture. The property-guided refinement is borrowed directly from existing classifier guidance methods. Since that,  the claims are not well-supported, and the \"research gap\" framing feels a bit forced: existing methods don't necessarily fail to model hierarchy, they just approach it differently.\n2. A significant limitation is that the model requires RDKit to generate scaffold/substituent labels during training. This means the \"implicit learning\" claim is somewhat overstated since you still rely on rule-based tools to define the hierarchy. \n3. The dataset had to be filtered (100k/6k/10k split differs from baselines), making direct comparison slightly unfair\n4. The paper claims the model learns hierarchy \"implicitly\" but actually uses explicit RDKit labels during training. What happens if these labels are noisy or incorrect?\n5. No analysis on molecules where the scaffold/substituent decomposition is ambiguous or subjective\n6. Some notation is inconsistent, and the proof in A.3 is quite verbose and could be streamlined\n7. Why is the classifier only applied when t < 0.4T? This seems quite restrictive and is justified only by empirical observation rather than principled reasoning. Moreover, the model introduces several hyperparameters (η0, η1, ψt formula, 0.4T threshold). How sensitive is performance to these choices is not discussed."}, "questions": {"value": "See weeknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Ay1tdqwxac", "forum": "JdL67YDnSy", "replyto": "JdL67YDnSy", "signatures": ["ICLR.cc/2026/Conference/Submission14990/Reviewer_sfN9"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14990/Reviewer_sfN9"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14990/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761486693736, "cdate": 1761486693736, "tmdate": 1762925318636, "mdate": 1762925318636, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This model bakes the medicinal-chemistry idea of scaffold first, then decorate into the generative process by using different noise schedules for scaffold vs. substituent atoms—scaffolds are denoised early to set a stable core; substituents are explored later for diversity. During denoising, an EGNN predicts each atom’s role so the sampler can apply the right schedule—no predefined functional groups are required at inference, so the hierarchy is learned implicitly. (Training labels come from RDKit Murcko scaffolds. A frozen property predictor provides classifier-guidance gradients during mid/late timesteps"}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Unlike prior methods requiring: pre-defined functional groups, two-stage separate optimization ,and rule-based scaffold/substituent definitions this model learns the hierarchical structure implicitly through: An S² classifier that dynamically predicts atom roles during denoising and joint optimization of scaffold and substituent in a single framework. Evidence shows improvement over vanilla EDM model."}, "weaknesses": {"value": "1. Hierarchical Noise Scheduling itself does not seem novel. differentiated noise schedules is not a new thing in molecule generation. For instance refer to MolDiff. \n\n2. Some SOTA models available for comparison seem missing"}, "questions": {"value": "1. Can you add comparison with SLDM (Straight-Line Diffusion Model, 2025) and Geometry-Complete Diffusion for 3D Molecule\nGeneration and Optimization and MolDiff: Addressing the Atom-Bond Inconsistency Problem in 3D Molecule Diffusion Generation) ? Recent SOTA models seem to be missing. Especially the geom tasks and efficiency wise results.\n\n2. Property-guided Refinement improves performance according to ablation. can this be used to other models for fair comparison?\n\n3. Can the authors explain/compare with extra experiments related to geometric qualities (refer to MolDiff: Addressing the Atom-Bond Inconsistency Problem in 3D Molecule Diffusion Generation)"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "PjGb2rVASj", "forum": "JdL67YDnSy", "replyto": "JdL67YDnSy", "signatures": ["ICLR.cc/2026/Conference/Submission14990/Reviewer_F5Ju"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14990/Reviewer_F5Ju"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14990/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761644338658, "cdate": 1761644338658, "tmdate": 1762925317855, "mdate": 1762925317855, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Through this paper, the authors propose Scaffold–Substituent Hierarchical Diffusion Model (S $^2$-HDM) to tackle the scaffold hopping and lead optimization problems with a single generative framework. Specifically, S$^2$-HDM introduces a differentiated noise schedule for scaffold and substituent atoms, enabling learning the scaffold and substituent hierarchy without pre-defined functional groups."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The authors provided the codebase.\n- The concept figure aids in understanding the work.\n- The writing is easy to follow."}, "weaknesses": {"value": "I will combine the *Weaknesses* section and the *Questions* section. My concerns are as follows:\n- The framework relies on computational chemistry tools such as RDKit to identify the scaffold–substituent structure during training, which can be a critical error source. Moreover, during denoising, an auxiliary classifier (S$^2$ classifier) is used to identify the role of each atom given the noisy input, but there is no analysis on the prediction performance of the classifier.\n- The main weakness of this paper is that the experimental design is insufficient. For example, quantitative estimate of druglikeness (QED), retrosynthetic accessibility (RA), medicinal chemistry filter (MCF), and synthetic accessibility (SA) are important metrics that evaluate chemical quality of generated molecules. I highly recommend to report these values following the HierDiff paper [1]. The coverage and matching metrics for molecular conformation quality evaluation also need to be reported, following the HierDiff paper [1].\n\n---\n\n**References:**\n\n[1] Qiang et al., Coarse-to-fine: a hierarchical diffusion model for molecule generation in 3d, ICML, 2023."}, "questions": {"value": "Please see the *Weaknesses* section for my main concerns."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "r8K8xbJx75", "forum": "JdL67YDnSy", "replyto": "JdL67YDnSy", "signatures": ["ICLR.cc/2026/Conference/Submission14990/Reviewer_Ukvb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14990/Reviewer_Ukvb"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14990/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761784561174, "cdate": 1761784561174, "tmdate": 1762925317389, "mdate": 1762925317389, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}