{"id": "JEYWpFGzvn", "number": 4593, "cdate": 1757719977209, "mdate": 1763330212037, "content": {"title": "InfoTok: Adaptive Discrete Video Tokenizer via Information-Theoretic Compression", "abstract": "Accurate and efficient discrete video tokenization is essential for long video sequences processing. Yet, the inherent complexity and variable information density of videos present a significant bottleneck for current tokenizers, which rigidly compress all content at a fixed rate, leading to redundancy or information loss. Drawing inspiration from Shannon's information theory, this paper introduces \\alg, a principled framework for adaptive video tokenization. We rigorously prove that existing data-agnostic training methods are suboptimal in representation length, and present a novel evidence lower bound (ELBO)-based algorithm that approaches theoretical optimality. Leveraging this framework, we develop a transformer-based adaptive compressor that enables adaptive tokenization. Empirical results demonstrate state-of-the-art compression performance, saving $20\\%$ tokens without influence on performance, and achieving $2.3\\times$ compression rates while still outperforming prior heuristic adaptive approaches. By allocating tokens according to informational richness, \\alg enables a more compressed yet accurate tokenization for video representation, offering valuable insights for future research.", "tldr": "This paper introduces InfoTok, an adaptive video tokenizer guided by information theory, which significantly boosts video compression efficiency and reduces computational overhead without degrading visual quality.", "keywords": ["discrete tokenization", "video representation", "eficiency", "information theory"], "primary_area": "learning theory", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a4c659376ad59d4d241317f611277199471e958f.pdf", "supplementary_material": "/attachment/e079000d69a3bf86720011a2f6b539acbc1a5679.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes an adaptive visual tokenizer that allocates a more optimal compressed sequence length than existing methods based on information theoretic principles. This paper demonstrates that prior works’ training methods are often suboptimal, imputing bias that makes the adaptive compressions lower-quality despite their adaptability. It further claims that the optimal design for the compressed token length should be proportional to the negative log likelihood of the input, and thus uses the learned ELBO to modulate the input compression factor. The proposed router uses this principle to more optimally allocate tokens for compression, and the top K tokens are selected based on their log likelihood. The results demonstrate that InfoTok achieves better performance at the same compression rates as comparable methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1) This paper provides some much-needed theoretical grounding to the adaptive tokenizer space, and attempts to pin down what `optimal’ adaptive compression should look like.\n\n2) Experiments are very comprehensive and clearly demonstrate that InfoTok achieves better reconstruction at the same compression rate compared to other adaptive tokenizers.\n\n3) While the results are incremental on their own, the entire paper is well structured and motivated, and properly places all the contributions in context, making the result valuable for the community.\n\n4) While the claims in the theorems are initially hard to parse, they are empirically supported by experiments that make the intuition clearer."}, "weaknesses": {"value": "1) Key definitions are not well highlighted in the text, and the mathematical sections are poorly written and hard to follow. Since definitions are missing from the theorems, the explanation is rather hard to follow. For example, the entropy H is not clearly defined, \\mathbb{D} not defined. Similarly r(N | x) not defined in Alg 1 input. While I may have missed these definitions, I would suggest not burying them in the text and making key components clear and easier for readers to refer to.\n\n2) It would be helpful if there were some visual results demonstrating the differences in InfoTok's reconstruction at different token lengths for the same image, so we could see what inputs are determined to need lower ones and which are determined to need higher ones. The reconstructions shown in Figure 2 are not particularly compelling - the compression results are considerably worse than Cosmos-DV.\n\n3) There are no video samples provided in the supplementary material or project page which makes qualitative analysis of the results challenging."}, "questions": {"value": "I don't have any strong suggestions, but would appreciate responses to my above critiques and would like to see them addressed in the next version of the paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WRDYl8rp2k", "forum": "JEYWpFGzvn", "replyto": "JEYWpFGzvn", "signatures": ["ICLR.cc/2026/Conference/Submission4593/Reviewer_66nG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4593/Reviewer_66nG"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission4593/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761947831906, "cdate": 1761947831906, "tmdate": 1762917460251, "mdate": 1762917460251, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes InfoTok, an adaptive discrete tokenizer that leverages an information-theoretic formulation to allocate token budgets based on the data's compressibility. The method introduces a principled way to determine token lengths using a normalized ELBO-based router and achieves strong empirical performance with a conceptually simple approach."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* The paper is well structured, and the mathematical formulation is precise.\n* It achieves competitive or superior performance using a lightweight and interpretable mechanism.\n* The authors provide rigorous justifications connecting ELBO with optimal token length, and the derivation is insightful.\n* The ELBO-based routing and token selection reuse existing encoder-decoder structures and introduce minimal inference cost, which is appealing in practical deployments."}, "weaknesses": {"value": "* Is the per-token ELBO computed purely based on the encoder-decoder’s end-to-end reconstruction path? Must this be explicitly introduced during training, or can the method be plugged into any VAE-style model without changes? Specifically, can non-VAE tokenizers be adapted to this framework?\n* If N_max is small or the compression ratio is extremely low (e.g., β< 0.1), what are the observed effects on stability and convergence? Would the KL term dominate or explode in such settings, and does it impact model converging or generalization?\n* The method is designed for videos. Would it generalize to other structured data types such as audio and 3D point clouds? Do different modalities affect the ELBO-based router's assumptions or effectiveness?"}, "questions": {"value": "Please refer to the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "uncZU69V3l", "forum": "JEYWpFGzvn", "replyto": "JEYWpFGzvn", "signatures": ["ICLR.cc/2026/Conference/Submission4593/Reviewer_t2hE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4593/Reviewer_t2hE"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission4593/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761982522140, "cdate": 1761982522140, "tmdate": 1762917459885, "mdate": 1762917459885, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this paper, an algorithm called InfoTok is proposed for adaptive video tokenization. The proposed algorithm determines the token length based on ELBO for near optimal compression. For compression, InfoTok utilizes the ELBO based token selection. Thus, it can be integrated on the top of existing tokenizer architectures. Also, the proofs for the mathematical theorems are provided. The experimental results show that the proposed algorithm outperforms the existing methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This paper clearly describes the proposed algorithm and is easy to follow.\n- This paper provides the proofs for the theorems.\n- The proposed algorithm achieves good performance on various benchmark tests."}, "weaknesses": {"value": "- It would be helpful if the paper included a discussion of the limitations of the proposed approach. \n- Since the method seems general enough to be applied to images, it would be helpful to explain the rationale for limiting the experiments to videos.\n- typo\n  - L184: an more accurate -> a more accurate"}, "questions": {"value": "Though I have carefully reviewed the paper including the appendix, I did not observe any major drawbacks and I believe the proposed algorithm makes a meaningful contribution to adaptive video tokenization. Please see my minor concerns in the weakness section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dznJ07O7v2", "forum": "JEYWpFGzvn", "replyto": "JEYWpFGzvn", "signatures": ["ICLR.cc/2026/Conference/Submission4593/Reviewer_5w2J"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4593/Reviewer_5w2J"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission4593/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761992394644, "cdate": 1761992394644, "tmdate": 1762917459591, "mdate": 1762917459591, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}