{"id": "jhV81HJ06h", "number": 10445, "cdate": 1758171751788, "mdate": 1762924730196, "content": {"title": "Optical Diffraction-based Convolution for Semiconductor Mask Optimization", "abstract": "In recent years, the increasing demand for smaller and more powerful semiconductors highlighted the critical role of lithography—a key stage in semiconductor manufacturing responsible for precise mask design and wafer patterning. To meet these demands, the semiconductor industry has increasingly adopted computational lithography, employing machine learning and deep learning techniques to accelerate advancements in lithographic technology. Despite the various research efforts and successes in computational lithography, there remains a lack of explicit incorporation of physical principles. This gap limits the ability of existing methods to fully capture the complex physical phenomena inherent in lithography behaviors. To bridge this gap, we propose OptiCo, a novel convolutional neural network that seamlessly integrates optical diffraction principles into its architecture. At its core, OptiCo employs an optical phase kernel to model phase variations resulting from light propagation, effectively capturing the physical interactions among light, masks, and wafers. We evaluate OptiCo on semiconductor lithography benchmarks, demonstrating its superior performance in mask optimization tasks, with its remarkable generalization capabilities in OOD datasets.", "tldr": "An optical physics-driven neural network for semiconductor mask optimization", "keywords": ["AI4Science", "Semiconductor", "Mask Optimization", "Optical Diffraction"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/8ae75180b8c0407aa71cf1be7cee8ebff3eff534.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposed a genAI-based framework for ILT tasks. The major contribution is the embedded diffraction kernel that reflects light propagation. Experiments on lithobench show superior performance over existing genAI-based solutions. The proposed kernel can also serve as a plug-in to boost the performance of existing models."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This paper comes with a good presentation and reasonably sound methodology supported by complete experiments. In detail:\n1. Introduce the optical diffraction kernel to introduce physics bias in the model pipeline.\n2. Good performance over SOTA AI-based solutions with a large margin. \n3. Complete ablation study shows the effectiveness of each technique's contributions in the architecture development.\n4. The overall paper is clearly written with only a few things that need to be addressed."}, "weaknesses": {"value": "1. AI-based ILT has long been studied; however, in practical foundries never trust a pure-AI-based approach due to non-deterministic results and its statistical nature. I wonder how the proposed model behaves compared to numerical solvers. There are many ILT solvers come out recently. e.g. Multi-ILT [Sun+, DAC'23], CurvyILT [Yang+, ISPD'25].\n2. I would assume the EPE numbers are based on a 15nm threshold rule. However, this number is way too high for practical usage. I wonder if it is possible to show the EPE values. \n3. How does the model scale to a larger layout?\n4. The optical diffraction kernel is based on the forward lithography imaging. Introducing the kernel benefits the inverse application is somehow against the common intuition. It's better to provide some explanation."}, "questions": {"value": "refer to the weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "1Cl4Eh1YUo", "forum": "jhV81HJ06h", "replyto": "jhV81HJ06h", "signatures": ["ICLR.cc/2026/Conference/Submission10445/Reviewer_Gw2z"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10445/Reviewer_Gw2z"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10445/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761706667933, "cdate": 1761706667933, "tmdate": 1762921746904, "mdate": 1762921746904, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "Thank you for your reviews."}}, "id": "bhv5Md8nxC", "forum": "jhV81HJ06h", "replyto": "jhV81HJ06h", "signatures": ["ICLR.cc/2026/Conference/Submission10445/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10445/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762924729295, "cdate": 1762924729295, "tmdate": 1762924729295, "mdate": 1762924729295, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose a new neural network structure that integrates optical diffraction for mask optimization in semiconductor design. The core layer of the neural network is a complex-valued convolution modulated by an analytic diffraction kernel, which combines with a MetaNeXt backbone and eventually maps a target resist pattern to a mask design. The proposed network outperforms other methods and generalizes better to unseen data."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The authors did a reasonable comparison against existing methods and presented a bunch of ablation studies."}, "weaknesses": {"value": "The neural network structure design doesn’t really follow the physics and optical diffraction, which makes the intuition confusing and the contribution claim misleading."}, "questions": {"value": "1. How is the lithography simulation being performed? The input and output in this case are exactly opposite of the mask optimization; are they using the same model?\n2. While I appreciate the physics intuition of using the propagation kernel in the convolution, the way that it is used in the model is confusing. The propagation here is from the mask plane to the wafer plane, but the kernel here maps from a target wafer image to a mask design. There should be more explanation on how the model design corresponds with the optical propagation, rather than listing the well-known derivation of convolution in optical diffraction.\n3. It is also not clear why the output is the addition of a ‘physics module’ and a backbone model. There seems to be no underlying physics to this operation.\n4. If the author makes the OP kernel learnable with rotational symmetric constraint, will it converge to the original OP? And what are the differences between the four OP kernels shown in Figure 4?\n5. Why would a more accurate physical expression (e.g., a larger kernel size, Helmholtz-based kernel) lead to a worse result if the model is explicitly modeling the physical process? This echos with my second question that the underlying physics is not clear."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "5Fg11jmU9a", "forum": "jhV81HJ06h", "replyto": "jhV81HJ06h", "signatures": ["ICLR.cc/2026/Conference/Submission10445/Reviewer_ZUad"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10445/Reviewer_ZUad"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10445/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761711326068, "cdate": 1761711326068, "tmdate": 1762921746452, "mdate": 1762921746452, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes OptiCo, a novel CNN architecture for computational lithography that aims to incorporate physical principles of optical diffraction directly into the network. The authors identify a relevant gap in current deep learning approaches for lithography, namely the lack of explicit physical modeling. The paper is well-written, and the experimental results appear strong, demonstrating promising performance and generalization."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "(1) Well-motivated problem statement highlighting a genuine shortcoming in existing literature.\n\n(2) The proposed OptiCo model is novel in its attempt to hard-code physical knowledge.\n\n(3) Comprehensive experiments showing superior performance on benchmarks and OOD datasets.\n\n(4) Clear and professional presentation."}, "weaknesses": {"value": "The most significant concern with this work is a potential fundamental confusion regarding the forward and inverse problems in computational lithography.\n\nThe paper correctly states that optical diffraction is the physical process that transforms a mask pattern into an aerial image (the forward model). However, the task of mask optimization is inherently an inverse problem: finding a mask that produces a desired aerial image or wafer pattern.\n\nThe authors propose using a convolutional kernel to model optical diffraction (a forward process) within a network designed for the inverse problem. This creates a conceptual mismatch. For inverse design, the network must learn to invert or compensate for the physics of diffraction, not merely simulate it. Embedding a forward model kernel directly into an inverse problem solver without a clear architectural or loss-based mechanism to handle the inversion is conceptually misleading and may limit the model's effectiveness. The authors need to clarify how the inclusion of a forward physical model directly aids in solving the inverse problem, as this is the core of their contribution."}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dGVvPJX4Yn", "forum": "jhV81HJ06h", "replyto": "jhV81HJ06h", "signatures": ["ICLR.cc/2026/Conference/Submission10445/Reviewer_coaE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10445/Reviewer_coaE"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10445/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761811104193, "cdate": 1761811104193, "tmdate": 1762921745728, "mdate": 1762921745728, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes OptiCo, another new physics-guided CNN that embeds an optical phase (OP) kernel with complex convolutions for lithography mask optimization and simulation, showing lower MSE/EPE and some OOD gains on LithoBench with a TV prior for manufacturability."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- Computational lithography is impactful for future computation and accelerating accurate simulation and optimization matters.\n\n- Encodes diffraction via an OP kernel shows empirical gains with reported improvements on benchmark tables."}, "weaknesses": {"value": "Overall, I do not find this paper is interesting as the architectural change is domain-specific and incremental in the long line of physics-informed models and there isn’t a broadly useful for ML community. For a top ML venue, the ML contribution is weak the work seems better aligned with EDA venues where domain impact is the primary metric. If considering its contribution to AI for science and engineering, the real-world experiments would be required to justify its impact. \nMoreover, the evaluation cannot rule out cherry-picking with unclear splits/model selection, single-seed reporting, limited robustness and results may be benchmark and simulator-locked.\n\n- Limited ML novelty & generality. OP-kernel + complex convs is an incremental tweak as in previous lines of computational lithography papers they already have considered similar ideas. It is also task-specific and lacks a general learning insight likely to interest the broader ML community.\n- The experiment has unclear train/val/test protocol with no precise split definitions,  ambiguous use of validation for early stopping/hyper-params and appropriate usage of test-set is not guaranteed.\n- They almost use single-seed results; there are no mean±std or significance tests which cannot rule out cherry-picking risk.\n- OOD protocol is under-specified. Construction and difficulty balance of OOD sets are unclear. The stability across different split draws not shown.\n- The method is quite empirical. There is no theoretical insight on why the proposed architectural changes can be effective for lithographic modeling. This problem is non-negligible especially when demonstrating only on benchmarks. \n- The method is tied with specific simulator and process. No sensitivity to source/resist/NA changes or alternate simulators; gains could reflect over-tuning to one stack.\n- The ablations need to be cleaner. Right now it’s hard to tell what’s driving the gains. Please keep the training budget and seeds the same across variants, and pick checkpoints by validation, not by best test score. Also separate the effects such as show what changes when you switch to complex convs, when you change kernel size, and when you add TV.\n- The authors need to make baseline comparisons fairer. Tell us the exact hyperparams and training time you used for each baseline, and try to match hardware and budgets. If one model gets more epochs or a faster GPU, efficiency and accuracy claims won’t be comparable."}, "questions": {"value": "Same as weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "OytPEC53GY", "forum": "jhV81HJ06h", "replyto": "jhV81HJ06h", "signatures": ["ICLR.cc/2026/Conference/Submission10445/Reviewer_E2pw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10445/Reviewer_E2pw"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10445/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989060105, "cdate": 1761989060105, "tmdate": 1762921744918, "mdate": 1762921744918, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}