{"id": "jiPrwmMb2e", "number": 12663, "cdate": 1758209365767, "mdate": 1763772419180, "content": {"title": "Control Reinforcement Learning: Interpretable Token-Level Steering of LLMs via Sparse Autoencoder Features", "abstract": "Large language models exhibit emergent misalignment behaviors during test-time generation, necessitating dynamic control mechanisms for safe deployment. Inspired by sparse interpretable representations, sparse autoencoders (SAEs) can disentangle monosemantic features from superpositioned dense activations, offering a natural interface for controlling language model behavior through interpretable feature manipulation. This work introduces Control Reinforcement Learning (CRL), a framework to unify reinforcement learning with SAE features for interpretable token-level language model control. CRL enables interpretable performance tracking by isolating feature contributions at each generation step, revealing which features drive improvements across diverse benchmarks including question answering, bias mitigation, and reasoning tasks. To balance exploration and exploitation, the framework employs Adaptive Feature Masking (AFM) to encourage diverse yet effective feature discovery while maintaining interpretability. Through token-wise feature analysis, CRL provides mechanistic insights into model behavior, revealing task-specific feature contributions while achieving performance improvements over base models across diverse benchmarks. Results demonstrate that interpretable steering can serve as both a performance enhancement and analysis tool, establishing a practical pathway for controllable AI systems.", "tldr": "", "keywords": ["Mechanistic Interpretability", "AI Steering", "Reinforcement Learning", "RL", "AI Control", "PPO", "Representation Learning", "Sparse Autoencoder"], "primary_area": "interpretability and explainable AI", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/516b1ce6de4844f7ec5872945cfdefd53c69b98b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces Control Reinforcement Learning, a framework for dynamically steering LLMs through SAE features. Instead of static activation edits, CRL learns a policy to select which SAE features to activate at each generation step, guided by reinforcement learning rewards. The authors claim this allows interpretable, token-level control while modestly improving performance across tasks such as MMLU, GSM8K, and HarmBench. The approach also provides diagnostic insights into critic bottlenecks, layer-specific effects, and semantic coherence of SAE features."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. **Novelty of the proposed method**: I think the main strength lies in framing reinforcement learning over SAE features, which differs itself from other activation-based or gradient-based method.\n2. **Breadth of evaluation**: The authors conduct extensive experiments across reasoning, factual, and safety benchmarks, showing the generality of their approach.\n3. **Clarity of methodology**: The paper is well-structured and technically sound, with a clear explanation of the training process and design choices."}, "weaknesses": {"value": "1. **Limited comparison with existing feature control methods**: A key weakness is the lack of comparison to established feature control approaches such as activation-based or gradient-based interventions. I find this omission makes it hard to understand what specific advantages CRL provides beyond existing techniques. A more direct experimental or conceptual comparison would help clarify novelty.\n2. **Computational complexity and scalability**:Training a PPO agent over sparse feature activations introduces nontrivial computational cost. I think it would help to include runtime analysis or efficiency comparisons to justify the added complexity relative to simpler steering methods.\n3. **Under-analyzed reward design**: The reward function is central to the method but not well justified or analyzed. Its stability and sensitivity to tuning are unclear, which weakens confidence in reproducibility.\n4. **Limited interpretability validation and generalization evidence**: Interpretability results are qualitative and narrow in scope. The authors should demonstrate that the learned feature control generalizes across different tasks or datasets."}, "questions": {"value": "Please refer to weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jQqPDxQJVk", "forum": "jiPrwmMb2e", "replyto": "jiPrwmMb2e", "signatures": ["ICLR.cc/2026/Conference/Submission12663/Reviewer_b6zw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12663/Reviewer_b6zw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12663/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761269825398, "cdate": 1761269825398, "tmdate": 1762923502109, "mdate": 1762923502109, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes to learn by reinforcement learning a policy to steer LLMs by intervening on the activations of sparse features, as identified by SAEs trained on the residual stream activations. Experiments show modest improvements. The use of SAE features enable a degree of interpretability."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "[S1] The idea of learning a policy to control feature strength is interesting and, to my knowledge, novel.\n\n[S2] Some of the proposed analysis yield interesting insight, e.g. the different effects of controlling features across layers.\n\n[S3] Results are presented in a measured way, without overstating them."}, "weaknesses": {"value": "[W1] The paper suffers from a general lack of clarity. Crucial terms, like 'coefficients', are used without introduction or being obvious from the context (e.g. there are no coefficients in Eq. 3, which defines the activation interventions). Many sections in the body are not understandable without going back and forth with the appendix, as if content was moved there without checking the impact of doing so on the narrative flow. See below a detailed list of issues.\n\n[W2] There are reproducibility issues: an Algorithm 1 is mentioned in the reproducibility section, but it does not seem to be anywhere. There is no description of the policy and value network implementations besides them being MLPs. Task-specific rewards are announced in 3.4, but are not in Appendix A as promised.\n\n[W3] There is no experimental baseline. How well would CRL work if using random features instead of SAE features?\n\n[W4] It is unclear whether reported results in Table 1 are obtained directly on the test set, or if the intervention layer is determined based on held-out data.\n\nAdditional points:\n\nL22-24: Adaptive Feature Masking (AFM) is mentioned in the abstract and in the contributions, but never again in the paper?\n\nL132-133: Why is the full problem a POMDP? Does this have to do with the fact that the influence of the KV cache of previous tokens through attention is not taken into account? This should be clarified, and an attempt to quantify the impact of this approximation should be made.\n\nL159-161: This part is unclear. What are the coefficients being referred to? Should there be additional coefficients in Eq (3)?\n\nL240-241: Coefficient averaging has not been introduced at this point.\n\nFigure 2: what is in the left pane, and what in the right?\n\nL263-265: Constrained and unconstrained decoding patterns have not been introduced. What is the connection between constrained/unconstrained decoding on one hand and factual question answering on the other?\n\nL 268 and elsewhere: disambiguous --> unambiguous\n\nL268-269: Can this norm increase be visualized?\n\nL270: what is the 'coefficient 18 analysis'?\n\nL285-286: Correct, incorrect, corrected and misguided are not introduced/defined.\n\nIn Figure 3 \"generation step\" means token position, in appendix it means layer.\n\nFigure 4 caption: blue <--> green.\n\nL480: \"SAE-learned directions operate in non-linear interaction spaces rather than simple superposition\": what is the evidence supporting this?\n\nL481: \"steering effects do not transfer well to models after supervised fine-tuning\": was this shown anywhere?\n\nL863-864: Fig. 9 right and Fig. 10 right do not seem to show this.\n\nAppendix A.5 is empty\n\nFig. 14 caption: what does coefficient 18 mean?"}, "questions": {"value": "See above.\n\nAlso: why PPO rather than DPO or GRPO?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "g4r7q5jjgh", "forum": "jiPrwmMb2e", "replyto": "jiPrwmMb2e", "signatures": ["ICLR.cc/2026/Conference/Submission12663/Reviewer_8AZS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12663/Reviewer_8AZS"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12663/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761690423130, "cdate": 1761690423130, "tmdate": 1762923501833, "mdate": 1762923501833, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a framework called \"Control Reinforcement Learning\" (CRL) , aimed at interpretable, token-level dynamic steering of LLMs . The core of this method is to use \"monosemantic features\" extracted from LLM activations by Sparse Autoencoders (SAEs) as a control interface. The CRL framework trains a RL policy network that, at each generation step, observes the current token's residual stream activation and dynamically selects an SAE feature. Then, the decoded vector of this selected feature is added back into the model's residual stream to \"steer\" the model towards a better output. The method aims to solve the \"emergent misalignment\" problem that occurs during LLM inference and has achieved modest performance improvements on various benchmarks (such as MMLU, GSM8K, BBQ bias, and HarmBench safety) , while providing interpretability by tracking feature contributions."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper addresses a very forward-looking and critical problem in the field of LLM alignment: how to achieve dynamic, interpretable, token-level control over model behavior.\n\n2. Using monosemantic features extracted by SAEs as the action space for RL is an innovative idea \n\n3. The paper provides qualitative evidence to support its claim of \"interpretable steering\""}, "weaknesses": {"value": "I am not an expert in the RL area. Therefore, the following comments are based on my current understanding, and I welcome any corrections to potential misunderstandings on my part.\n\n1. The abstract mentions the use of \"Adaptive Feature Masking\" (AFM) to balance exploration and exploitation, but this key component is never mentioned or defined again in the paper's main body, experiment, or appendix.\n\n2. Section 3.2 defines the intervention as $\\tilde{x}_{t}=x_{t}+a_{t}W_{dec}$ which implies a steering coefficient of 1. However, Experiment Section 4.2 dedicates significant analysis to \"steering coefficients\" ranging from 10 to 100. This coefficient c, which is critical in the experiments, is not defined in the methodology.\n\n3. The paper only compares CRL's results against the \"Before\" model (i.e., the original, non-intervened model). It completely lacks a comparison against standard fine-tuning methods (like SFT or DPO) on the same task data. \n\n4. The paper admits in its conclusion that these steering effects \"do not transfer well\" to models after supervised fine-tuning (SFT). This severely limits the method's practical application value in real-world systems that require continuous updates and iteration."}, "questions": {"value": "No"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "F8HdtdxJpa", "forum": "jiPrwmMb2e", "replyto": "jiPrwmMb2e", "signatures": ["ICLR.cc/2026/Conference/Submission12663/Reviewer_bfnm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12663/Reviewer_bfnm"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12663/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761735236837, "cdate": 1761735236837, "tmdate": 1762923501546, "mdate": 1762923501546, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Control Reinforcement Learning (CRL): a PPO-trained policy that, at each generation step, selects SAE feature(s) at a chosen layer and adds the corresponding decoder vector to the residual stream, thereby \"steering\" the model token-by-token. The state is the current residual activation; the action is a binary selection over the SAE dictionary; rewards are task-specific. Reported gains on Gemma-2 2B are modest but non-trivial on some tasks (e.g., HarmBench +5.61-pt, BBQ-Ambig +3.55-pt; others are small). The paper also analyzes (i) layer/coefficients (\"sweet spots\" in later layers), and (ii) critic behavior (bottlenecks for single-token tasks vs gradual divergence in long-horizon reasoning)."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "1. Clear control interface over interpretable features. Formulating steering as an MDP over SAE features with per-token actions is neat and practically implementable. The action/state definitions and the steering equation are explicit.\n\n2. The paper gives useful empirical guidance: later layers tolerate larger coefficients; early-layer large coefficients tend to break behavior (\"sweet-spot\" effect), aligning with residual-norm growth across depth.\n\n3. Feature \"impact\" and diversity metrics provide some transparency into which SAE features are used when steering helps or hurts."}, "weaknesses": {"value": "1. It is dissatisfying to see that most headline improvements are small. Also, there are no confidence intervals, multiple-seed runs, or bootstrap tests. I couldn't be confident about the stability of the gains.\n\n2. The paper itself notes that on single-token QA without constrained decoding, a substantial portion of MMLU gains comes from eliminating invalid outputs (e.g., \"*\", whitespace) rather than improving knowledge. That weakens the claim that CRL improves reasoning/knowledge rather than format adherence.\n\n3. Since CRL's core novelty is adaptive selection of interpretable features, it needs stronger ablations vs. simple static/greedy heuristics (e.g., always add the top-k SAE features by activation, or by a supervised classifier over features), and vs. logit-space steering matched for compute. The paper doesn’t convincingly isolate the benefit of PPO-based selection over such cheap alternatives.\n\n4. The authors report critic \"bottlenecks\" (corrected vs. misguided nearly indistinguishable on MMLU), suggesting value estimation struggles when rewards are sparse and binary. That weakens the paper's promise that CRL delivers reliable token-wise interpretability. If the critic can't separate outcomes, the per-token attributions are noisy."}, "questions": {"value": "1. First, can you provide CIs / multiple seeds and report per-task variance; which gains survive across seeds?\n\n2. If resource permits, could you add non-RL baselines (e.g., pick top-k SAE features by current activation so that total intervention norm equals CRL's)? Also, could you add a format-sanitizer that only enforces valid answer formats to quantify the fraction of gains due to formatting?\n\nConditional on satisfactorily addressing the above points, I am open to increasing my rating."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "nNtvHR2RR7", "forum": "jiPrwmMb2e", "replyto": "jiPrwmMb2e", "signatures": ["ICLR.cc/2026/Conference/Submission12663/Reviewer_bFHy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12663/Reviewer_bFHy"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12663/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761751829347, "cdate": 1761751829347, "tmdate": 1762923501289, "mdate": 1762923501289, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}