{"id": "Jk8g1OxyZY", "number": 12707, "cdate": 1758209621717, "mdate": 1759897492837, "content": {"title": "Fed-Duet: Dual Expert-Orchestrated Framework for Continual Federated Vision-Language Learning", "abstract": "Pretrained vision-language models (VLMs), such as CLIP, have shown promise in federated learning (FL) by bringing strong multimodal representations to edge devices. However, continual adaptation remains a core challenge in practical federated settings, where task distributions evolve over time and data remain non-IID across clients. In this emerging area, recent works adopt parameter-efficient fine-tuning (PEFT) as a lightweight way to reduce communication overhead, yet they fail to preserve satisfactory performance under continual learning conditions. Meanwhile, traditional federated continual learning (FCL) methods lack the capacity to maintain cross-modal alignment crucial to VLM performance. We introduce Fed-Duet, a novel Dual-channel Expert-orchestrated framework for efficient federated continual learning in vision-language models. Fed-Duet features a dual-channel adaptation mechanism, combining server-coordinated semantic prompts with client-personalized modular adapters. These channels are dynamically fused via a cross-attention mechanism, enabling effective knowledge transfer while preserving multimodal alignment and mitigating forgetting. We evaluate Fed-Duet across multiple challenging continual learning tasks in federated vision-language settings and demonstrate that it achieves superior performance and stability compared to existing approaches. Our work highlights the importance of coordinated expert composition in enabling scalable and robust multimodal continual learning. The code is available at https://anonymous.4open.science/r/FedDuet-0426/.", "tldr": "", "keywords": ["Federated Learning", "Federated Continual Learning", "Prompt learning", "Vision-Language model"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ab3ef834ca9eab2546abfdff56e0eeadd2748813.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces Fed-Duet, a framework to address continual federated learning for CLIP models. The key idea is a dual-channel expert system: The paper adopts (1) semantic experts: server-coordinated prompts for high-level multimodal alignment and (2) parametric experts, i.e., client-specific adapters. A cross-attention fusion mechanism integrates these two channels, while auxiliary objectives preserve cross-modal consistency and mitigate catastrophic forgetting. Extensive experiments on multiple benchmarks demonstrate the promising performance of the method in both accuracy and efficiency."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The proposed method achieves promising results on multiple benchmarks.\n2. The experiments are thorough and comprehensive."}, "weaknesses": {"value": "1. The proposed method is complex, I would recommend refine/extend a bit on the details of the method design and different components. Also, I personally don't think \"Semantic Experts\" is a good naming for textual prompt. \n2. There are too much information included in Figure 1, maybe considering separate it into multiple figures.\n3. The authors mentioned about \"privacy-preserving feature\" of the client images will be uploaded to the server. However, there lacks details about how the strength of the noise and whether it is still possible to reproduce the images at server-side. The author should discuss this more.\n4. How would the attention gating influence the model performance? There seems to be no ablation about this specific component."}, "questions": {"value": "Please refer to the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "zifyScmCJp", "forum": "Jk8g1OxyZY", "replyto": "Jk8g1OxyZY", "signatures": ["ICLR.cc/2026/Conference/Submission12707/Reviewer_9Jgs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12707/Reviewer_9Jgs"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12707/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760523277678, "cdate": 1760523277678, "tmdate": 1762923536563, "mdate": 1762923536563, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a dual expert-orchestrated framework for continual federated VLM. Various experiments confirms the effectiveness of proposed method."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The author conducts various experiments and ablation to confirm the effectiveness of proposed method."}, "weaknesses": {"value": "This paper has several weakness.\n\n\n1. The author utilizes the confused keyword expression.  As mentioned in the title, \"DUAL EXPERT\", But in the abstract, the author utilizes the dual channel. As far as i know, channel is widely utilized in feature dimension, such as Barlow Twins or other dimension-wise operation. \n\n2. Turn to your two experts, prompt and adapter, it is hard to understand why prompts refer to high-level and adapters refer to low-level. Because the prompt and adapter are both suitable to inject into each transformer layer. Authors should pay more attention to conducting the observation experiments rather than drawing a complicated framework without meaningful information.\n\n3. Suspicious experiment results: Line 335 shows identical CIFAR-100 accuracy for T=10 across different beta values, with no explanation, harming the result's credibility. （84.20 75.97）Besides, the anonymous code does not release the compared methods. I do not trust your results."}, "questions": {"value": "Refer to weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "b0XVQoMdYl", "forum": "Jk8g1OxyZY", "replyto": "Jk8g1OxyZY", "signatures": ["ICLR.cc/2026/Conference/Submission12707/Reviewer_JyH1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12707/Reviewer_JyH1"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12707/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760751599036, "cdate": 1760751599036, "tmdate": 1762923536233, "mdate": 1762923536233, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Fed-Duet proposes a novel framework for federated continual learning with vision-language models, aiming to address two key limitations in existing approaches, i.e., adaptation imbalance and cross-modal misalignment. The method introduces a dual-channel expert-orchestrated architecture, where the semantic experts channel uses learnable prompts to achieve high-level semantic alignment and the parametric experts channel employs adapters for fine-grained task adaptation. Experiments across multiple datasets demonstrate that Fed-Duet achieves strong performance in terms of accuracy, knowledge retention and continual utility."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper clearly identifies a critical gap by noting that traditional federated continual learning ignores the multimodal nature of vision-language models, and existing PEFT-based federated learning methods often disrupt cross-modal alignment under continual learning.\n\n2. The semantic channel uses a cross-attention gating mechanism to fuse prompt-based experts, while the parametric channel adapts adapter-based experts. The two channels are trained in a progressive manner that enables effective synergy.\n\n3. The experimental evaluation is comprehensive, covering class-incremental, domain-incremental, and multi-domain task-incremental scenarios under various Non-IID settings and client scales. The results consistently show superior performance compared to strong baselines."}, "weaknesses": {"value": "1. The method involves a large number of hyperparameters, including $\\alpha$, $\\beta$, and $\\gamma$ in the loss function, as well as $\\lambda$ and $\\tau$ in the Eq (2) and Eq. (4). The paper provides neither justification for their chosen values nor sensitivity analysis, which limits reproducibility and practical deployment.\n\n2. The choice to freeze parametric experts after round $r = R/2$ appears arbitrary. No theoretical reasoning or empirical ablation is provided to support this scheduling decision.\n\n3. Several presentation issues reduce clarity.\n\n    3.1. Notation is inconsistent. For example, $S_r$ in Eq. (1) is undefined, and the symbol $\\beta$ is reused for both the Dirichlet parameter in data partitioning and a loss weight.\n\n    3.2. Figure 1 is visually confusing, as the semantic experts are incorrectly shown as inputs to the image encoder, and the overall layout does not clearly reflect the workflow of Fed-Duet.\n\n    3.3. Baseline names in Figure 3(a)(b) use excessively small font sizes, impairing readability.\n\n4. The global prompt pool is initialized via K-means clustering on class embeddings, but the paper does not compare this strategy against random initialization or other alternatives, making it difficult to assess its actual contribution."}, "questions": {"value": "1. In Stage 2, the parametric experts are frozen and only the semantic prompts are updated using cross-entropy loss. However, the image features have already been adapted by the parametric channel, while the text prompts are tuned independently. Could this decoupled update reintroduce cross-modal misalignment?\n\n2. What is the rationale behind the specific timing for switching from parametric expert training to semantic expert training at $r = R/2$? Was this threshold tuned, or is it fixed across all settings?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Rl7yxq3fm4", "forum": "Jk8g1OxyZY", "replyto": "Jk8g1OxyZY", "signatures": ["ICLR.cc/2026/Conference/Submission12707/Reviewer_kMS8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12707/Reviewer_kMS8"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12707/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761571008324, "cdate": 1761571008324, "tmdate": 1762923535950, "mdate": 1762923535950, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper explores the challenging problem of continual federated vision-language learning. The authors propose a framework named Fed-Duet, which introduces a dual-channel design that integrates server-coordinated prompts and client-adapted experts to address challenges in cross-modal alignment, adaptation imbalance, and catastrophic forgetting. Extensive experiments demonstrate the framework’s effectiveness and efficiency."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The topic is emerging and important. It represents a key challenge for deploying next-generation AI on edge devices, combining FL, CL, and VLM.\n- The idea of dual-channel orchestration, unifying prompt-based semantic alignment and adapter-based parametric specialization, is conceptually clear and inspiring.\n- Fed-Duet delivers a significant performance boost in continual learning while maintaining PEFT's communication efficiency, vital for resource-constrained FL."}, "weaknesses": {"value": "- The authors introduce noise for privacy preservation, but the description of this part is limited and lacks sufficient details.\n- RELATED WORK does not discuss a related work, CLIP2FL.\n- Statistical reporting is incomplete. Providing statistics such as the mean and standard deviation would better support the robustness claim."}, "questions": {"value": "- How does it identify and activate the correct experts to mitigate forgetting under the FL constraint of not explicitly storing old task data?\n\n- The paper proposes that Fed-Duet can maintain critical cross-modal alignment performance in Vision-Language Models (VLMs). However, the experiments are only confined to vision-text classification tasks (CIFAR-100, Tiny-ImageNet, DomainNet), with classification accuracy serving as the core evaluation metric. How can the preservation of cross-modal alignment capability be directly demonstrated?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "0u5ZT9oBB5", "forum": "Jk8g1OxyZY", "replyto": "Jk8g1OxyZY", "signatures": ["ICLR.cc/2026/Conference/Submission12707/Reviewer_RknU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12707/Reviewer_RknU"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12707/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761973022263, "cdate": 1761973022263, "tmdate": 1762923535508, "mdate": 1762923535508, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}