{"id": "JQW9J9Q2gp", "number": 23855, "cdate": 1758349375195, "mdate": 1759896793843, "content": {"title": "Adversarial Attacks on Downstream Weather Forecasting Models: Application to Tropical Cyclone Trajectory Prediction", "abstract": "Deep learning–based weather forecasting (DLWF) models leverage past weather observations to generate future forecasts, supporting a wide range of downstream tasks, including tropical cyclone (TC) trajectory prediction. In this paper, we investigate their vulnerability to adversarial attacks, where subtle perturbations to the upstream weather forecasts can alter the downstream TC trajectory predictions. Although research on adversarial attacks in DLWF models has grown recently, generating perturbed upstream forecasts that reliably steer downstream output toward attacker-specified trajectories remains a challenge. First, conventional TC detection systems are opaque, non-differentiable black boxes, making standard gradient-based attacks infeasible. Second, the extreme rarity of TC events leads to severe class imbalance problem, making it difficult to develop efficient attack methods that will produce the attacker's target trajectories. Furthermore, maintaining physical consistency in adversarially generated forecasts presents another significant challenge. To overcome these limitations, we propose Cyc-Attack, a novel method that perturbs the upstream forecasts of DLWF models to generate adversarial trajectories. First, we pre-train a differentiable surrogate model to approximate the TC detector's output, enabling the construction of gradient-based attacks. Cyc-Attack also employs skewness-aware loss function with kernel dilation strategy to address the imbalance problem. Finally, a distance-based gradient weighting scheme and regularization are used to constrain the perturbations and eliminate spurious trajectories to ensure the adversarial forecasts are realistic and not easily detectable. Our experimental results show that Cyc-Attack achieves higher targeted TC trajectory detection rates, lower false alarm rates, and stealthier perturbations than conventional gradient-based attack methods.", "tldr": "Our work highlights potential vulnerabilities and motivate the development of more robust DLWF models as well as security-aware practices across the forecasting pipeline.", "keywords": ["Deep Learning–Based Weather Forecasting; Adversarial Attacks; Tropical Cyclone Trajectory Prediction; Black-Box Models; Surrogate Model; Class Imbalance"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/17f9647e46100cd2b2903b42469e62c73e47881c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces Cyc-Attack, an adversarial attack method that manipulates deep learning-based weather forecasts to alter downstream tropical cyclone trajectory predictions. The paper focuses on addressing the black-box nature of cyclone detectors and the extreme class imbalance issue by employing a differentiable surrogate model, a skewness-aware loss with kernel dilation, and distance-based gradient weighting to generate stealthy and effective perturbations."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. It is the first work to demonstrate how to attack a downstream weather application (cyclone tracking) by perturbing upstream forecasts.\n\n2.  The method outperforms several baselines in terms of both attack success rate (higher trajectory detection rate) and stealth (lower false alarm rate and smaller perturbations)."}, "weaknesses": {"value": "1.  The attack's effectiveness may highly rely on the accuracy of the pre-trained surrogate model in approximating the black-box detector; inaccuracies here could degrade performance.\n\n2. The process involves pre-training a surrogate model and running an iterative, gradient-based attack, which can be computationally expensive\n\n3. The technical contribution of the paper is a little limited as adversarial attack on time series problems has been well studied. \n\n4. The real-world impact of the proposed method is not very clear since how an attacker can add the perturbation in practice is not very clear."}, "questions": {"value": "Please refer to the weakness part."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "BT2lKtazWy", "forum": "JQW9J9Q2gp", "replyto": "JQW9J9Q2gp", "signatures": ["ICLR.cc/2026/Conference/Submission23855/Reviewer_cu9v"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23855/Reviewer_cu9v"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission23855/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761450131188, "cdate": 1761450131188, "tmdate": 1762942831768, "mdate": 1762942831768, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Cyc-Attack, a novel adversarial attack method that perturbs the outputs of upstream weather forecasting models to manipulate downstream tropical cyclone trajectory predictions. The method effectively addresses challenges such as data sparsity and extreme class imbalance through the use of a differentiable surrogate model, skewness-aware loss, kernel dilation, and distance-based gradient weighting, enabling successful attacks in black-box settings while generating realistic and stealthy adversarial trajectories."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1、The focus on tropical cyclone trajectory prediction provides a highly relevant and impactful setting for studying the vulnerabilities of deep learning weather forecasting models in downstream applications, offering valuable insights for improving real-world robustness.\n\n2、The paper systematically addresses several critical challenges, including the non-differentiability of black-box TC detectors, severe class imbalance, premature attack termination due to surrogate model errors, and the generation of unrealistic zigzag trajectories, demonstrating technical depth and completeness."}, "weaknesses": {"value": "1、Several critical choices, especially in experimental design and parameter selection, lack in-depth justification, which affects the clarity and persuasiveness of the paper. Specific issues are listed below under \"Questions.\""}, "questions": {"value": "1、In Section 5.2, when R=0, FPR is 0.0067 and TPR is 0.9896; when R=2, FPR drops to 0.0002, but TPR decreases significantly to 0.8131. Why is the reduction in FPR from 0.0067 to 0.0002 considered more important than the drop in TPR from 0.9896 to 0.8131? Has the risk trade-off between false alarms and missed detections been evaluated in the context of meteorological early warning systems? Is this choice supported by domain expertise or operational requirements?\n2、In the first row of Figure 4, the adversarial trajectories generated by baseline methods (e.g., ALA, TAAOWPF, AOWF) are not shown. Is this because these methods failed to produce complete and coherent trajectories, making visualization impossible? If so, does this indicate that these methods are ineffective at the trajectory level? The authors should clarify this in the text and, if possible, include their outputs in the appendix for a more comprehensive comparison."}, "flag_for_ethics_review": {"value": ["Yes, Potentially harmful insights, methodologies and applications"]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Boe40olbH6", "forum": "JQW9J9Q2gp", "replyto": "JQW9J9Q2gp", "signatures": ["ICLR.cc/2026/Conference/Submission23855/Reviewer_QRZv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23855/Reviewer_QRZv"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission23855/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761494668363, "cdate": 1761494668363, "tmdate": 1762942831529, "mdate": 1762942831529, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies the vulnerability of deep learning–based weather forecasting systems to adversarial attacks, focusing on the downstream task of tropical cyclone trajectory prediction. Overall it is a timely and well-executed study on adversarial vulnerabilities in downstream weather forecasting pipelines. The method is well-motivated and empirically validated. While the evaluation scope and realism analysis could be expanded, the work is technically sound, clearly written, and potentially impactful for both the adversarial ML and climate science communities."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. Overall the paper is well-written and easy to follow. The algorithm design is also technically sound.\n2. The paper extends adversarial robustness analysis from general DLWF models to downstream applications like TC trajectory prediction, which is societally relevant and technically distinct from prior pixel-level attacks.\n3. The study uses real-world datasets (ERA5, IBTrACS) and provides thorough quantitative comparisons, ablations, and visualization (e.g., Hurricane Delta, Typhoon Haiyan). Metrics at both location and trajectory levels are carefully defined."}, "weaknesses": {"value": "1. While the authors constrain perturbations via distance weighting, physical realism is not formally validated. The “stealthiness” metric is purely statistical (ℓ1 distance).\n2. It seems that the defenses discussed in the paper are more of detections rather than technques that can make the forecasting models more robust to attacks. Would appreciate more discussions on the defense side."}, "questions": {"value": "Please see weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "HbUxIJ47qa", "forum": "JQW9J9Q2gp", "replyto": "JQW9J9Q2gp", "signatures": ["ICLR.cc/2026/Conference/Submission23855/Reviewer_FURh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23855/Reviewer_FURh"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission23855/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761936987196, "cdate": 1761936987196, "tmdate": 1762942831206, "mdate": 1762942831206, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This submission focuses on adversarial attacks against weather forecasting models. It identifies three key research challenges: the black-box constraints of tropical cyclone (TC) detection systems, the sparsity of TC events, and the need to maintain physical consistency in the generated perturbations. To address these challenges, the paper proposes Cyc-Attack, a surrogate model–based black-box adversarial attack framework designed to effectively evaluate and exploit the vulnerabilities of TC forecasting systems."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "**i.** The research topic is interesting and important. While adversarial attacks have been extensively studied in static domains such as image and text classification, their impact on dynamic applications like time series forecasting remains underexplored. \n\n**ii.** The paper is easy-to-follow. \n\n**iii.** The setting that integrates time series forecasting with a downstream tropical cyclone (TC) detection system is interesting and well-motivated, as it reflects a more realistic and application-driven scenario."}, "weaknesses": {"value": "**i.** The research gaps are not accurately identified. Specifically, the third and fourth “challenges” mentioned in the paper should not be considered unsolved research problems. For example, ensuring that adversarial perturbations are imperceptible and realistic is a fundamental property of adversarial examples, not a unique challenge. Similarly, developing a precise surrogate model is an inherent prerequisite for any surrogate model–based black-box attack, rather than a novel research gap. The paper should better clarify which aspects of these challenges are truly new or unexplored in the context of adversarial studies on weather forecasting models.\n\n**ii.** The motivation for adopting a surrogate model–based transfer attack is not sufficiently supported. Prior studies, such as [1] (multi-query) and [2] (one-query), have already proposed zero-order optimization–based black-box attacks for time series forecasting models. Although the manuscript claims that such methods require queries to the black-box system, it does not clearly explain why constructing a surrogate model is preferable to directly querying the true system. This justification is particularly important because the sparsity of tropical cyclone events can significantly degrade the similarity between the surrogate and the target systems, potentially limiting the transferability and practical effectiveness of the proposed approach.\n\n**iii.** The attack pipeline is conceptually unclear. More importantly, the pipeline shown in Figure 2 does not align with the formulation described in Section 4. In this setup, the weather forecast serves as an intermediate output between the deep-learning-based forecasting model and the downstream tropical cyclone (TC) detection system. However, the paper defines the attack as manipulating the prediction \\(Y\\) rather than the input \\(X\\), which is inconsistent. If the attack manipulates the forecast output \\(Y\\) as described in Section 4, then the forecasting model becomes unnecessary, since one could directly perturb \\(Y\\) before passing it to the TC detector. Conversely, if the attack perturbs the input \\(X\\) as shown in Figure 2, then the optimization should compute and update \\(X'\\) instead of \\(Y'\\) in Section 4. This inconsistency makes the attack pipeline difficult to interpret and weakens the overall clarity of the experimental design.\n\n**iv.** The technical contribution is relatively marginal. The submission trains a surrogate model to perform a transfer-based black-box attack, with the primary challenge attributed to data imbalance. However, neither the use of surrogate model–based attacks nor the approach to address imbalance represents a novel contribution. Both have been well-studied in prior literature, and the manuscript does not provide sufficient methodological innovation or theoretical advancement beyond existing work.\n\n**v.** The experimental evaluation involves only one tropical cyclone (TC) detection system, which limits the assessment of the proposed method’s generalization capability. Without testing on multiple detection systems or model architectures, it remains unclear whether the surrogate model trained in this study can generalize effectively to other TC detection frameworks or forecasting setups.\n\n\n\n\n\n\n\n\n\n\n\n\n**References**\n\n[1] Zhu, Lyuyi, et al. \"Adversarial diffusion attacks on graph-based traffic prediction models.\" IEEE Internet of Things Journal 11.1 (2023): 1481-1495.\n\n[2] Liu, Fuqiang, et al. \"Adversarial Vulnerabilities in Large Language Models for Time Series Forecasting.\" International Conference on Artificial Intelligence and Statistics. PMLR, 2025."}, "questions": {"value": "The most interesting aspect of this submission lies in its attempt to integrate time series forecasting models with downstream decision-making systems within an adversarial framework. However, the current implementation appears to manipulate intermediate prediction values rather than the raw inputs to the forecasting models, which weakens the conceptual alignment between the attack formulation and the intended end-to-end adversarial setting.\n\n**Which to attack (three options)**  \n\nI can identify how to compute Y' as in Equation 5, but I cannot find how to compute X', even though it is mentioned in Figure 2. You must choose and state one threat model clearly in the paper:\n\n- **(1) Raw-input attack (recommended):** attacker perturbs the raw observations \\(X\\) that are fed into the forecasting model. This is the most realistic end-to-end setting (sensor spoofing, data-assimilation tampering).  \n- **(2) Output/forecast attack:** attacker perturbs the published forecast \\(Y\\) directly (e.g., intercept/modify forecast products). This is a valid but different threat model and must be justified operationally.  \n- **(3) Joint attack:** attacker can perturb both \\(X\\) and \\(Y\\). If used, consistency between \\(X'\\) and \\(Y'\\) must be enforced."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "rYYhBtBkX6", "forum": "JQW9J9Q2gp", "replyto": "JQW9J9Q2gp", "signatures": ["ICLR.cc/2026/Conference/Submission23855/Reviewer_XQBN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23855/Reviewer_XQBN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission23855/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762006328830, "cdate": 1762006328830, "tmdate": 1762942830899, "mdate": 1762942830899, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}