{"id": "jRP5nlqhnW", "number": 2404, "cdate": 1757073981406, "mdate": 1763675485756, "content": {"title": "Multi‑view Adaptive Partitioning with Global Association for Graph Anomaly Detection", "abstract": "Graph anomaly detection has emerged as a fundamental technique for detecting anomalies in complex relational data across diverse domains.\nA key challenge in graph anomaly detection is the difficulty deep models face in representing tabular node attributes. Unlike image and text data, whose samples usually reside on a single, smooth, and differentiable manifold, tabular samples scatter across fragmented manifolds lacking manifold connectedness. This fragmentation violates the local-smoothness assumption that most deep networks rely on, leading to degraded performance. \nTo address the above challenge, a Multi-view Adaptive Partition Encoder (MAPE) is proposed. Multiple complementary adaptive partition operators are introduced in MAPE to discretize the feature space and assign learnable embeddings to the resulting subspaces, thereby reducing manifold connectedness.\nFurthermore, sharing a sub-space is treated as evidence of high-order affinity between nodes, forming the basis of the proposed Multi-Pattern Global Association (MPGA) module for capturing global dependencies.\nExtensive experiments across 10 benchmarks demonstrate that the proposed method consistently outperforms 27 competitive baselines, including recent state‑of‑the‑art models.", "tldr": "", "keywords": ["Graph Anomaly Detection; Representation Learning; Graph Global Association"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/decefcf916eb2c8983f6bbcbe83e2bed1d5bca0f.pdf", "supplementary_material": "/attachment/dca737b1574752877904ad5ea928eebfa2e77f76.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes the Multi-view Adaptive Partition Encoder to address the challenge of modeling fragmented tabular node attributes in graph anomaly detection by discretizing the feature space into learnable subspaces, thereby enhancing manifold connectedness. Then, a Multi-Pattern Global Association (MPGA) module is designed to capture the high-order global dependencies."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed method achieves good performance compared with 27 baseline methods.\n2. The paper is well-organized and the presentation of this paper is good."}, "weaknesses": {"value": "1. My major concern of this paper is that the motivation of this paper is not sufficiently convincing. The authors claim that the main challenge in graph anomaly detection lies in representing tabular node attributes. However, this issue has already been discussed and addressed in GAAP [1]. Although GAAP does not explicitly use the term tabular node attributes, Figure 1 in that paper conveys a similar concept. Therefore, the authors should clarify why this problem remains a key challenge and how their work differs fundamentally from GAAP in addressing it. Furthermore, the second challenge this paper tries to address is the long-range dependency, which has also been addressed by many existing methods, such as GADAM [2] and UniGAD [3], as mentioned by authors in the related work. \n2. The novelty of this paper is limited. The Multi-Pattern Global Association is a simple combination of local node similarity and global node similarity, a similar idea presented in many existing work, such as GAAP [1], GADAM [2] and UniGAD [3]. \n3. In the related work (line 196), Why does single-relation mechanism, representation-agnostic formulation limits the capability? Is there any existing work supporting this statement?\n4. There are many typos in the paper.\n- In line 377, \"GAAPA\" should be \"GAAP\". In addition, \"GAP\" in the table 1 should be \"GAAP\".\n- In line 239 \"Eq. equation 1-equation 2\" -> \"Eq. 1-2\".\n- In line 248 \"Eq. equation 1\" -> \"Eq. 1\".\n- In line 250 \"Eq. equation 2\" -> \"Eq. 2\".\n- In table 1, the performance of GAP and MAPGA are both 99.69 on the T-soc dataset, while GAP is underlined as the second best method.\n5. In Figure 2, the authors should visualize the t-SNE embedding of other stronger baseline methods, such as GAAP, DGA-GNN, XGBGraph. MLP and XGBoost are weak baseline methods based on the experimental results shown in table 1 and they are not even designed for GAD task.\n6. As shown in Table 3, the node feature type of some datasets (e.g., Reddit, Weibo, and Questions) is text embedding. The proposed method is designed for tabular features. How does the proposed method deal with text embedding feature?\n7. In the experiment evaluation, the authors should report the standard deviation as well.\n8. The experimental setup lacks sufficient clarity. For example, the paper does not specify how the training and test data are split, making it difficult to assess the validity and reproducibility of the reported results.\n\n[1] Mingjiang Duan, Da He, Tongya Zheng, Lingxiang Jia, Mingli Song, XinyuWang, and Zunlei Feng. Global attribute-association pattern aggregation for graph fraud detection. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 39, pp. 11616–11624, 2025.\n\n[2] Jingyan Chen, Guanghui Zhu, Chunfeng Yuan, and Yihua Huang. Boosting graph anomaly detection with adaptive message passing. In The Twelfth International Conference on Learning Representations, 2024a.\n\n[3] Yiqing Lin, Jianheng Tang, Chenyi Zi, H Vicky Zhao, Yuan Yao, and Jia Li. Unigad: Unifying multi-level graph anomaly detection. Advances in neural information processing systems, 37: 136120–136148, 2024."}, "questions": {"value": "1. In equation 6, I assume both $N_{out(m)}$ and $N_{in(m)}$ refer to the set of neighbors, but what are exactly $N_{out(m)}$ and $N_{in(m)}$?\n2.  As shown in Table 3, the node feature type of some datasets (e.g., Reddit, Weibo, and Questions) is text embedding. The proposed method is designed for tabular features. How does the proposed method deal with text embedding feature? Since these datasets are not tabular attributes graph, why does the proposed method outperforms other baseline methods on these datasets?\n3. In section 2.1, the authors mention that without manifold connectedness, the local smoothness prior yields ill-conditioned optimization dynamics and results in slow or unstable convergence. Then, what is the training time or time complexity of the proposed method?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "y33R9JXiZM", "forum": "jRP5nlqhnW", "replyto": "jRP5nlqhnW", "signatures": ["ICLR.cc/2026/Conference/Submission2404/Reviewer_kTJk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2404/Reviewer_kTJk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2404/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761357737264, "cdate": 1761357737264, "tmdate": 1762916223316, "mdate": 1762916223316, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the challenges in GAD, specifically the manifold fragmentation of tabular node attributes and the difficulty in modeling global dependencies in graph topology. The authors propose MAPGA, a framework comprising a Multi-view Adaptive Partition Encoder (MAPE) to discretize the feature space and restore manifold connectedness, and a Multi-Pattern Global Association (MPGA) module to capture long-range dependencies via representation-based and behavior-pattern graphs."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1.The multi-view discretization mechanism is technically novel and directly addresses manifold disjointedness.\n\n2.This paper offers a novel perspective on why GNNs struggle with tabular attributes, enhancing the paper's conceptual contribution.\n\n3.Extensive experimental results demonstrate the effectiveness of the method."}, "weaknesses": {"value": "1. The writing needs further improvement. For example, the introduction introduces the challenges of modeling tabular data, but does not adequately discuss its relationship to GNNs. Why use GNNs to model tabular data? How is tabular data constructed as a graph? Where do the edges of the original graph come from?\n\n2. The description of the method is not detailed and clear enough. For example, how does MAPE instantiate K independent views? Why is this design used?\n\n3.A large number of views and partitions are generated, which may result in large computing resource requirements and affect the deployment of large-scale datasets."}, "questions": {"value": "Please refer to Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "UqlWC632YB", "forum": "jRP5nlqhnW", "replyto": "jRP5nlqhnW", "signatures": ["ICLR.cc/2026/Conference/Submission2404/Reviewer_NNqF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2404/Reviewer_NNqF"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2404/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761573744520, "cdate": 1761573744520, "tmdate": 1762916222948, "mdate": 1762916222948, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses graph anomaly detection by tackling two key challenges: (1) the difficulty of modeling tabular node attributes due to manifold fragmentation, and (2) capturing global dependencies in graph structures. The authors propose MAPGA, which consists of two main components: a Multi-view Adaptive Partition Encoder (MAPE) that discretizes the feature space through learnable partitions to establish manifold connectedness, and a Multi-Pattern Global Association (MPGA) module that captures global dependencies through representation-based and behavior-based association graphs. Extensive experiments on 10 benchmarks against 27 baselines demonstrate consistent improvements, with an average AUROC of 90.63% (+2.02pp over the best baseline) and particularly strong gains in AUPRC (average 19.6% improvement)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Clear Problem Motivation The paper provides a novel theoretical perspective by explaining the fundamental difficulty in modeling tabular node attributes through the lens of manifold connectedness. The visualization in Figures 1-2 effectively demonstrates how tabular data exhibits fragmented manifolds compared to perceptual data (audio, image, text), which violates the local-smoothness assumption required by deep networks.\n\n2. Well-Designed Methodology\n* MAPE employs learnable adaptive partitions to restore manifold connectivity through discrete-semantic embeddings\n* MPGA captures global dependencies from complementary sources: representation-based co-assignment and behavior-based neighborhood patterns\n* The two modules exhibit strong complementarity, as evidenced by ablation results\n\n3. Comprehensive Experimental Evaluation\n* 10 public benchmark datasets covering diverse application scenarios (social networks, financial fraud, cryptocurrency, crowdsourcing)\n* 27 competitive baselines including recent SOTA methods (GAP, DGA-GNN, ConsisGAD, GGAD)\n* Three evaluation metrics (AUROC, AUPRC, Rec@K) addressing different aspects of anomaly detection performance\n* Thorough ablation studies examining both architectural components and hyperparameters\n\n4. Consistent and Significant Results MAPGA achieves best or second-best performance across all datasets, with particularly impressive results: 99.20% AUROC on Elliptic (+5.58pp over best baseline), 99.54% on Weibo, and 99.96% on T-Social. The average improvements (+2.02pp AUROC, +1.93pp AUPRC, +2.98pp Rec@K) demonstrate robust superiority.\n\n5. Effective Visualization The t-SNE projections in Figures 1, 2, and 5 provide intuitive evidence for the manifold fragmentation problem and demonstrate how MAPE successfully bridges disconnected clusters to form a connected manifold."}, "weaknesses": {"value": "* The paper lacks a formal theoretical justification for why adaptive partitioning restores manifold connectedness. What mathematical properties guarantee this restoration?\n* While the conclusion acknowledges computational overhead from multiple parallel partition operators, detailed time/space complexity analysis is missing\n* The impact of decision tree initialization on final performance is not thoroughly analyzed"}, "questions": {"value": "* Can you provide a theoretical analysis or at least an intuitive explanation for why adaptive partitioning restores manifold connectedness? How do you formally define and quantitatively measure manifold connectedness? Are there any theoretical guarantees on the quality of the learned partitions?\n* How is the decision tree depth determined during initialization? Does it significantly affect final performance?\n* In Eq. 1, what specific smooth surrogate is used for the Heaviside function during backpropagation? How is α chosen?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2Go3vAaike", "forum": "jRP5nlqhnW", "replyto": "jRP5nlqhnW", "signatures": ["ICLR.cc/2026/Conference/Submission2404/Reviewer_fT35"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2404/Reviewer_fT35"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2404/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761888118787, "cdate": 1761888118787, "tmdate": 1762916221778, "mdate": 1762916221778, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}