{"id": "jusJTKlFav", "number": 13885, "cdate": 1758224413597, "mdate": 1759897406748, "content": {"title": "FractalFold: Towards Fractal Structure Modeling for Hierarchical Inverse Protein Folding", "abstract": "Inverse protein folding aims to design amino acid sequences that fold into desired backbone structures, representing a long-standing challenge in computational protein design. While recent deep learning approaches have achieved significant progress, existing methods predominantly treat protein structures as flattened sequences, overlooking their inherent hierarchical and fractal organization. To address this limitation, we propose FractalFold, a novel transformer-based model that performs structure-informed inverse folding by recursively invoking multi-level atomic fractal transformers. FractalFold employs a coarse-to-fine sequence refinement paradigm that mirrors the intrinsic hierarchical nature of protein structures. To generalize our approach to quasi-fractal proteins with variable-length structural segments, we introduce the Hierarchical Fractal Segmentation Module (HFSM), which leverages attention patterns from pre-trained protein language models to recursively partition protein structures into tree-organized patches. Extensive experiments on the CATH benchmarks demonstrate that FractalFold achieves state-of-the-art performance in sequence recovery rate and perplexity while generating sequences with enhanced foldability, establishing a new paradigm for structure-informed protein design.", "tldr": "FractalFold leverages protein fractal properties for hierarchical inverse folding, achieving state-of-the-art sequence recovery rate, perplexity, and foldability.", "keywords": ["protein inverse folding", "fractal structure modeling", "protein design", "protein language models"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/79ddef06af7bd25b1d5ffabb5fb64943f0bf2c36.pdf", "supplementary_material": "/attachment/c38bdeedc6685028cb20733f0ed9c5c11467440d.zip"}, "replies": [{"content": {"summary": {"value": "This paper addresses the inverse protein folding problem by proposing FractalFold, a novel transformer-based model. The authors argue that existing methods overlook the inherent hierarchical and fractal organization of protein structures, treating them as flattened sequences. FractalFold's architecture is designed to align with this fractal geometry, employing a coarse-to-fine sequence refinement paradigm. A key component is the Hierarchical Fractal Segmentation Module (HFSM), which uses attention patterns from pre-trained protein language models to recursively partition the structure into tree-organized patches. This enables a multi-scale, one-shot decoding process that aims to reduce error accumulation and computational complexity. The authors report state-of-the-art performance on CATH benchmarks for sequence recovery, perplexity, and refoldability."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The central idea of explicitly modeling the hierarchical and fractal nature of protein structures is novel and provides a strong, physically-motivated inductive bias. This is a clear departure from methods that treat structures as simple graphs or flat sequences.\n\nThe ablation studies in Table 3 effectively validate the contributions of the key design choices: the pre-trained GVP encoder, the one-shot decoding strategy (vs. autoregressive), and the HFSM module ."}, "weaknesses": {"value": "The latest baselines in the paper were published in 2023. There has been many new inverse folding methods in the 2 years, which were reported to have better performance than FractalFold. I noticed some of them are discussed in the related work section in the appendix, could the authors explain why they are not compared? Besides, some SOTA inverse folding methods are neither mentioned in the related work section nor compared, which also needs further explanation.\n\nEvent though baselines in 2024 and 2025 are not compared, FractalFold’s improvement seems insignificant, with respect to both structural and sequence recovery.\n\nConsidering FractalFold uses a hierarchical design, a possible advantage would be better understanding of proteins’ functional properties and developability like thermostability, if the mechanism really learns some useful features. I suggest the authors to explore them to comprehensively evaluate the potential benefit of the architecture.\n\nThe paper claims the architecture \"captures essential sequence-structure relationships\" and \"opens promising avenues\" for tasks requiring \"multi-scale understanding\", but does not provide direct evidence of this beyond folding.\n\nThere is a clear contradiction in the definition of the HFSM's link probability, $a_i$. In Figure 2, the diagram specifies $a_i = A_{i, j+1} + A_{i+1, j}$. However, the core methodology in Section 3.2 and Algorithm 1 relies on a different definition, $a_i = \\sqrt{A_{i,i+1} \\times A_{i+1,i}}$ (Equation 4). This inconsistency creates confusion about the exact mechanism used for segmentation.\n\nThe case study presented in Figure 3 and its caption contains conflicting information. The caption identifies the protein as \"Irtu.A (114 residues)\" with an average pLDDT of 92.2 , but the figure itself is clearly labeled \"4owz.A\" with \"Length: 134\" and different metrics (Average pLDDT 96.2, pTM Score 0.880). This same \"4owz.A\" figure is duplicated as Figure 5. This discrepancy makes the case study impossible to interpret correctly.\n\nThe HFSM (Algorithm 1) requires the segment counts for each fractal scale, $\\{L_k\\}_{k=1}^K$, as an input parameter. The paper does not explain how these crucial hyperparameters are selected. The algorithm only determines where to place breakpoints based on $L_k$, not the value of $L_k$ itself, which seems fundamental to the fractal decomposition.\n\nThe paper claims the HFSM generalizes FractalFold to \"quasi-fractal proteins\". This term is not clearly defined. There is no empirical validation (e.g., analysis across different CATH topologies) to demonstrate that the model's performance is particularly strong or improved on proteins that are less 'classically' fractal, which would be needed to substantiate this generalization claim."}, "questions": {"value": "In table 2, could the the metrics of wild-type sequences be reported as a baseline, considering the inaccuracy of the folding models?\n\nCould the authors clarify the confusions mentioned in the weaknesses section?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "kgJWjiFb2I", "forum": "jusJTKlFav", "replyto": "jusJTKlFav", "signatures": ["ICLR.cc/2026/Conference/Submission13885/Reviewer_cyTE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13885/Reviewer_cyTE"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13885/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761552087404, "cdate": 1761552087404, "tmdate": 1762924396633, "mdate": 1762924396633, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies the important inverse folding problem in protein design. The authors propose FractalFold, a novel transformer-based model that performs structure-informed inverse folding by recursively invoking multi-level atomic fractal transformers. FractalFold achieves state-of-the-art performance in several benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- This paper is well-written and easy to follow.\n- FractalFold first introduced the concept of fractals in the problem of inverse folding.\n- The authors conduct ablation studies to analyze the design choice."}, "weaknesses": {"value": "- Without parentheses, the citation format is unclear.\n- Several recent related works are missing. For example, LM-Design [1] and Bridge-IF [2]. \n- HFSM uses pretrained ESM2 to extract features. However, in Table 1, all baselines do not use any pre-trained knowledge. The performance comparison may be unfair, and can not verify the effectiveness of the fractal decoding framework.\n- ProteinMPNN is widely used in de novo protein design when combined with RfDiffusion and AF3. It is interesting to evaluate whether the proposed method can be used in such an important case [3].\n\n[1] Structure-informed Language Models Are Protein Designers\n\n[2] Learning Inverse Protein Folding with Markov Bridges\n\n[3] A Holistic Evaluation of Protein Foundation Models"}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "9YaP4Uj49c", "forum": "jusJTKlFav", "replyto": "jusJTKlFav", "signatures": ["ICLR.cc/2026/Conference/Submission13885/Reviewer_Y8k8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13885/Reviewer_Y8k8"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13885/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761638401671, "cdate": 1761638401671, "tmdate": 1762924396210, "mdate": 1762924396210, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces FractalFold, a transformer-based framework that models protein inverse folding by aligning architectural design with the fractal and hierarchical nature of protein structures."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The idea of introducing a fractal inductive bias for protein inverse folding is original and aligns well with the hierarchical organization of real proteins. The recursive, coarse-to-fine architecture provides a biologically meaningful modeling perspective rarely seen in this area."}, "weaknesses": {"value": "- Baseline selection is relatively old (only up to 2023). The authors should compare with more recent methods such as SPDesign (https://academic.oup.com/bib/article/25/3/bbae146/7642672), SurfPro (https://arxiv.org/abs/2405.06693), or BC-Design (https://www.biorxiv.org/content/10.1101/2024.10.28.620755v2). They also mentioned many recent works for inverse folding in their related work sections, but they are not compared with.\n- The architecture is biologically-inspired, but the experimental results are purely quantitative. The authors should provide some biological insights into the model's predictions. For instance, an example of how this FractalFold model works well on a specific protein structure, while baseline methods fail, is not provided. This could potentially be used to show the superiority of the proposed method. Other questions are listed in the questions section."}, "questions": {"value": "- Does fractal hierarchy generalize to multi-chain or quaternary complexes (e.g., antibodies, enzymes)?\n- How does the model behave on intrinsically disordered or low-structure regions where fractal segmentation may be ill-defined?\n- Figure 3 is inconsistent with its caption."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ntzvjiP36j", "forum": "jusJTKlFav", "replyto": "jusJTKlFav", "signatures": ["ICLR.cc/2026/Conference/Submission13885/Reviewer_YktH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13885/Reviewer_YktH"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13885/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762069934688, "cdate": 1762069934688, "tmdate": 1762924395720, "mdate": 1762924395720, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}