{"id": "Kiv8QasrX4", "number": 9524, "cdate": 1758126082005, "mdate": 1763048465084, "content": {"title": "Geo-Refine: Geometry–Appearance Synergy for Robust Single-Image 3D Scene Generation", "abstract": "We introduce Geo-Refine, a single-image 3D scene generator that couples geometry–appearance preprocessing with a two-stage voxel–mesh localization pipeline to produce physically valid, visually complete multi-object scenes. Unlike prior methods that either overfit to image priors or rely on sequential post-hoc segmentation, Geo-Refine follows a unified, end-to-end formulation. Conditioned on one RGB image, it first extracts clean object regions through high-precision masking, directional color-spill suppression, and multi-view appearance consistency, then jointly optimizes object placement and fine mesh alignment. The global layout is cast as an energy-guided voxel reasoning problem that enforces projection evidence, ground support, and semantic co-location, while a subsequent mesh-level refinement stage guarantees collision-free, contact-accurate geometry. Experiments on diverse indoor and outdoor benchmarks show consistent gains in CLIP, VQ, and GPT-4 metrics, along with sharper geometry, stable object interactions, and improved multi-view fidelity over state-of-the-art image-to-3D baselines. These results highlight the value of Geo-refine for reliable single-image 3D scene synthesis and understanding.", "tldr": "", "keywords": ["3D Scene Generation", "Object Layout Optimization", "Multi-View Consistency"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/601ada02f6e30f87741ad897b0f3535b510354c9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "An image -> 3D paper that works with a novel part based architecture and multi-stage generation that helps with feasibility of the generations to ensure a lack of collisions and good geometry that fits together nicely with good contact points and everything."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "I like the concept and direction of the work overall, with good qualitative results that give me some idea of the quality of the method, I think the problem and method are well motivated which I enjoy."}, "weaknesses": {"value": "My main concern is the data used and comparisons to existing works are lacking and hindering the clarity and significance of the work. It's not clear to me what this dataset looks like or how the size of it compares to object level datasets that are common like objaverse. I'd also like more comparisons with existing works in 3D generation. Lots of object level 3D generation techniques exist, and I know that most of those like TRELLIS for instance aren't particularly \"part aware\" and don't really explicitly account for feasibility, but I still feel like I need to understand how this fits into the existing landscape of object level generative 3D. The metrics don't lend themselves to me understanding this work in the broader landscape of existing work."}, "questions": {"value": "Can you help me understand 1) the dataset in question 2) the situation with baselines or how this work can be compared to other existing works to inform me of why I would use this method compared to existing object level 3D generative methods that don't take into account feasibility, or some more quantitative results that might be able to demonstrate to me that this line of work if continued may yield better results than what we have in existence right now."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "0twjd7c34a", "forum": "Kiv8QasrX4", "replyto": "Kiv8QasrX4", "signatures": ["ICLR.cc/2026/Conference/Submission9524/Reviewer_M2Vk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9524/Reviewer_M2Vk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9524/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761880106829, "cdate": 1761880106829, "tmdate": 1762921091891, "mdate": 1762921091891, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "EaDaNNtMoQ", "forum": "Kiv8QasrX4", "replyto": "Kiv8QasrX4", "signatures": ["ICLR.cc/2026/Conference/Submission9524/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9524/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763048463778, "cdate": 1763048463778, "tmdate": 1763048463778, "mdate": 1763048463778, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Geo-Refine, an end-to-end single-image to 3D scene generation framework that couples a geometry–appearance preprocessing module with a two-stage voxel–mesh localization pipeline."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Well-motivated pipeline: The paper clearly identifies two real pain points in single-image to 3D scene generation: (i) reliance on external segmentation priors, and (ii) sequential per-mesh processing is inefficient, with inference cost scaling linearly with the number of meshes. Geo-Refine attacks exactly these two.\n2. Experiments: Runtime is a tangible practical benefit, especially if this needs to be used in interactive or dataset-scale generation. Ablation experiments supports the authors' claim well.\n3. The paper is well-written and easy to follow."}, "weaknesses": {"value": "1. Evaluation scale is small and a bit private: the benchmark is 60 images, “diverse indoor and outdoor” but not clearly tied to a public, reproducible dataset. This makes it hard to judge how robust the method is, or to compare future work to it. This is the biggest concern.\n2. The qualitative result is not plausible: In the 3rd case of Fig.4, it seems that all of the methods including the proposed method fail to generate reasonable geometry.\n3. Engineering-heavy contribution: a lot of the gain seems to come from carefully designed, non-learned steps (mask optimization with priors, directional color-spill model, etc.). That’s fine for a system paper, but for ICLR the central learning idea is a bit weak."}, "questions": {"value": "My concerns are listed in weaknesses part."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Gyh65hLQ88", "forum": "Kiv8QasrX4", "replyto": "Kiv8QasrX4", "signatures": ["ICLR.cc/2026/Conference/Submission9524/Reviewer_88ws"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9524/Reviewer_88ws"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9524/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761892031464, "cdate": 1761892031464, "tmdate": 1762921091634, "mdate": 1762921091634, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Geo-Refine proposes an end-to-end framework for generating 3D scenes from a single RGB image with compositional, multi-object outputs. The method couples geometry–appearance preprocessing with a dual-stream transformer and a two-stage voxel–mesh localization scheme. The model is evaluated on a benchmark of 60 single-view examples, showing improved visual quality and semantic consistency compared to recent single-image 3D generation baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper addresses an important and timely task in single-image 3D scene reconstruction. The proposed model demonstrates visually promising results and shows clear qualitative improvements over existing baselines."}, "weaknesses": {"value": "I found the the paper a bit hard to follow:\n\n- The training setup is not described at all. It is unclear which datasets were used, what supervision signals are available, and how the flow and placement modules are optimized.\n\n- The 3D decoder is only mentioned but never explained — there is no description of its representation (e.g., occupancy, implicit field, voxel, or mesh) or how the final meshes are generated from latent features.\n\t\n- The paper claims to produce collision-free and physically plausible results, but these claims are not supported by quantitative or visual evaluation.\n\n- The evaluation section is very limited, with many proposed contribution not ablate properly, hard to understand their contribution."}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "VRIYR77jMe", "forum": "Kiv8QasrX4", "replyto": "Kiv8QasrX4", "signatures": ["ICLR.cc/2026/Conference/Submission9524/Reviewer_6yPD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9524/Reviewer_6yPD"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9524/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761991001107, "cdate": 1761991001107, "tmdate": 1762921091268, "mdate": 1762921091268, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Geo-Refine, a framework for generating multi-object 3D scenes from a single RGB image through a geometry–appearance synergy pipeline. It introduces three components: a geometry–appearance preprocessing stage; a dual-stream latent encoder based on DINOv2 and a transformer that produces geometry and relation tokens; and a two-stage voxel–mesh localization. Evaluated with CLIP, VQ, and GPT-4 metrics, Geo-Refine is reported to improve visual realism, semantic consistency, and efficiency over previous single-image 3D scene generation methods."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The problem scope and proposed direction are significant. The paper tackles an important and timely problem—multi-object 3D scene generation from a single RGB image—and presents an ambitious attempt to integrate geometric reasoning, appearance consistency, and physical plausibility within a unified framework. Its originality lies in formulating a geometry–appearance synergy and introducing a two-stage voxel–mesh refinement process that explicitly targets structural and physical consistency, which is rarely emphasized in prior single-view 3D reconstruction work. The idea of combining high-level visual features (via DINOv2) with energy-based spatial optimization is conceptually appealing and has potential to inspire future research bridging 2D visual understanding and 3D physical reasoning."}, "weaknesses": {"value": "The paper is conceptually ambitious but its presentation severely lacks methodological clarity. Every stage is described in abstract, high-level terms without clear input–output definitions or concrete data flow, making the method extremely difficult to understand or reproduce.\nThe paper never clearly defines what data are passed between stages. It is impossible to trace how an RGB image becomes 3D meshes. For example, the inputs and outputs of each stage (preprocessing, DINOv2 encoding, transformer, voxel–mesh localization, decoder) are not explicitly described or shown in a figure. There is no clear description of what intermediate representations look like — e.g., features, object–ground contact, occlusion hierarchy, etc. The geometry–appearance preprocessing module supposedly feeds into DINOv2, but the interface between them (image crops, binary masks, or feature tensors) is undefined. The mesh decoder’s input and output formats (e.g., SDF, occupancy, vertex list, or mesh templates) are not stated.\n\n\nThe evaluation section is non-standard and under-specified. There is no quantitative measure of geometry accuracy (e.g., Chamfer, IoU, or collision metrics), even though geometry quality is the paper’s main claim. The metrics (CLIP, VQ, and GPT-4) are borrowed from image-based works but not adapted to 3D: the paper has not explained how scenes are rendered, which views are sampled, or how text prompts are formed for CLIP/GPT-4. VQ seems to be a subjective user study from the referenced paper, but the protocol is unspecified. The dataset details are also unclear — whether they are real or synthetic, how they were collected or rendered, whether there is ground truth 3D information, etc. The ablation study is highly sparse, with a mixture of quantitative and qualitative comparison, instead of unified quantitative metrics across all studies. What datasets are used for training also seem to be missing."}, "questions": {"value": "Please refer to weaknesses for questions raised due to unclarity of the paper's original presentation"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "9wzkdWMPAA", "forum": "Kiv8QasrX4", "replyto": "Kiv8QasrX4", "signatures": ["ICLR.cc/2026/Conference/Submission9524/Reviewer_BoGC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9524/Reviewer_BoGC"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9524/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762054215981, "cdate": 1762054215981, "tmdate": 1762921090873, "mdate": 1762921090873, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}