{"id": "kkvqVRu2Zy", "number": 12985, "cdate": 1758212452641, "mdate": 1759897472434, "content": {"title": "Constrained Diffusion for Protein Design with Hard Structural Constraints", "abstract": "Diffusion models offer a powerful means of capturing the manifold of realistic protein structures, enabling rapid design for protein engineering tasks. However, existing approaches observe critical failure modes when precise constraints are necessary for functional design. To this end, we present a constrained diffusion framework for structure-guided protein design, ensuring strict adherence to functional requirements while maintaining precise stereochemical and geometric feasibility. The approach integrates proximal feasibility updates with ADMM decomposition into the generative process, scaling effectively to the complex constraint sets of this domain. We evaluate on challenging protein design tasks, including motif scaffolding and vacancy-constrained pocket design, while introducing a novel curated benchmark dataset for motif scaffolding in the PDZ domain. Our approach achieves state-of-the-art, providing perfect satisfaction of bonding and geometric constraints with no degradation in structural diversity.", "tldr": "This paper introduces a constrained diffusion framework for protein design that enforces functional, stereochemical, and geometric constraints via proximal updates, achieving state-of-the-art results on tasks like motif scaffolding and pocket design.", "keywords": ["Constrained Diffusion", "Generative Models", "Protein Design", "Proximal Optimization", "Motif Scaffolding"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/4123ff66fbc213dc955cb4b7c4a47d2778efb10e.pdf", "supplementary_material": "/attachment/e7168dad750b6b97cd7ec8a984e6dc637cf08a2e.zip"}, "replies": [{"content": {"summary": {"value": "This author proposed a method to solve a gap in protein backbone generation: enforcing hard functional and stereochemical constraints during diffusion-based design. The authors rproposed emthod use reverse diffusion with a predict–prox–renoise procedure: (i) predict a clean structure, (ii) apply a proximal feasibility update (with a Moreau–envelope penalty that tightens over time), and (iii) re-noise to stay on the data manifold. They further decouple local stereochemistry from global topology via a consensus ADMM split, enabling separate proximal updates that are warm-started across steps. Theoretical results bound constraint violations and motivate schedules for the penalty and trust parameters. Empirically, the method is evaluated on (1) a new PDZ motif-scaffolding benchmark and (2) vacancy-constrained pocket design with box/void geometry. Results claim perfect constraint satisfaction and strong usable rates vs. RFdiffusion baselines and constraint-guided SMC, while maintaining structural diversity and reasonable compactness."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The predict–prox–renoise design is simple, modular, and theoretically grounded; the scheduling guidance (λ↑ as σ↓; η tied to diffusion variance) is clear and actionable. ADMM splitting of local vs. global constraints is well-motivated for proteins (stereochemistry vs. long-range couplings) and yields a practical proximal scheme with consensus guarantees under mild conditions. Theorems quantify contraction of constraint violations and give scheduling rules that drive terminal feasibility, aligning with the method’s design. On the PDZ benchmark, baselines produce no usable designs whereas the proposed method yields 21% usable (up to 83% for well-posed ligands) with perfect constraint satisfaction and better diversity/compactness; similarly strong wins appear in the vacancy-constraint task."}, "weaknesses": {"value": "Feasibility guarantees rely on prox-regularity; highly nonconvex sets common in protein design may violate this, limiting formal guarantees. Proximal/ADMM steps add overhead and may require careful tuning of λ/η/ρ schedules; guidance on sensitivity and robustness across architectures and tasks could be expanded. Results are strong on PDZ and a geometric vacancy constraint, but broader functional constraints (e.g., catalytic geometry, interface polarity, multi-chain assemblies) and end-to-end sequence design with wet-lab validation remain future work."}, "questions": {"value": "1. Beyond PDZ scaffolding and geometric vacancy control, which biologically grounded constraints (e.g., catalytic triad geometry, specific H-bond networks) most motivate hard-constraint enforcement, and how will the framework extend to them?\n2. Can you quantify how often unconstrained RFdiffusion fails due to global vs. local constraint violations in real pipelines, to better motivate where hard constraints matter most?\n3. How does enforcing exact feasibility impact downstream functional success (e.g., binding affinity predictions) compared with soft guidance—any surrogate metrics supporting the motivation? \n4. The Moreau-envelope penalty transitions toward hard constraints as λ→∞. How sensitive are outcomes to the λt and ηt schedules, and do you provide heuristics or automatic tuning beyond the variance-linked choice?\n5. In the ADMM split, how do you select which residues belong to the “local” vs. “global” blocks in more complex topologies, and what is the computational cost per sweep as structure size grows?\n6. On the PDZ benchmark, your method attains 21% usable overall (up to 83% for favorable cases). What characteristics define “well-posed” ligands, and how general is that 83% across targets?\n7. In the vacancy-constraint experiment, could you provide additional quality metrics (e.g., secondary-structure preservation per segment, clash scores) to complement constraint satisfaction and radius of gyration?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "onnwgXu9Yk", "forum": "kkvqVRu2Zy", "replyto": "kkvqVRu2Zy", "signatures": ["ICLR.cc/2026/Conference/Submission12985/Reviewer_dnLp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12985/Reviewer_dnLp"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12985/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761964086999, "cdate": 1761964086999, "tmdate": 1762923738043, "mdate": 1762923738043, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a constrained diffusion framework for protein design, aiming to enforce hard structural and functional constraints.1 The core method is a \"predict-prox-renoise\" stochastic proximal method, which applies feasibility corrections to the predicted clean state $\\hat{x}_{0}^{t}$ rather than the noisy state $x_t$.1 The authors also propose an ADMM decomposition to decouple local and global constraints.1 The method is evaluated on two tasks: motif scaffolding (using a newly introduced PDZ benchmark) and vacancy-constrained pocket design, claiming 100% constraint satisfaction rates where baselines achieve 0%."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Novel and well-motivated \"predict-prox-renoise\" method for hard constraints.   \n\n(Superficially) perfect 100% constraint satisfaction on complex tasks.   \n\nContributes a new, curated benchmark dataset for PDZ motif scaffolding."}, "weaknesses": {"value": "Fails to cite or compare against any true SOTA competitors in motif scaffolding (e.g., Genie 2 , OriginFlow ), invalidating its SOTA claim.   \n\nThe \"Ours\" method in Exp 2 is a combination of the new method and the baselines , making results impossible to attribute.   \n\nThe ADMM method  is not general , and the theory  does not apply to the problem.   \n\n 0% success for all baselines is not credible."}, "questions": {"value": "see weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "X5E8Bavmkt", "forum": "kkvqVRu2Zy", "replyto": "kkvqVRu2Zy", "signatures": ["ICLR.cc/2026/Conference/Submission12985/Reviewer_TyWr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12985/Reviewer_TyWr"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12985/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966841918, "cdate": 1761966841918, "tmdate": 1762923737387, "mdate": 1762923737387, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a constrained diffusion framework for precision engineering of detailed molecular features in proteins. Authors validate their approach in silico on a contributed tasks and novel curated benchmark datasets."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- This is definitely an interesting and strong contribution focusing on a slightly neglected aspect that is however of very high practical & theoretical relevance in precision engineering of protein architectures & binding sites.\n- The proposed solution is benchmarked against convincing baselines and authors report significant improvements.\n- Code & benchmark data is released."}, "weaknesses": {"value": "- I feel a benchmark is scarce, it’s a relevant problem but I would welcome an effort to introduce more interesting cases. There are many problems requiring precision engineering that could show that the method is robust to different cases. E.g. one widely recognised problem used to study precision protein engineering for long time is parametric protein design with coiled coil bundles.\n- While the technical / implementation aspects of the method are properly described I think the formulation and description of the proposed benchmark dataset is less understandable (I suppose even for struct/bio readearship, not mentioning purely ML audience). I suggest to rewrite this section so it reads more clear (also minor thing - the PBM is never defined in the paper).\n- Finally, I believe being able to come up with backbones that satisfy the complex geometric criteria is an important contribution I have one follow up q to the authors - are these backbones designable? I miss the experiment that would prove (in silico would naturally be enough given the venue) that indeed we can design compatible sequences that will fold into structures that are predicted by the authors e.g. with the ProteinMPNN / AF2 pipeline that authors already set up."}, "questions": {"value": "See weaknesses for potential discussion points."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2cjdTQIqZP", "forum": "kkvqVRu2Zy", "replyto": "kkvqVRu2Zy", "signatures": ["ICLR.cc/2026/Conference/Submission12985/Reviewer_ausW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12985/Reviewer_ausW"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12985/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762092892142, "cdate": 1762092892142, "tmdate": 1762923737061, "mdate": 1762923737061, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a framework for incorporating hard structural constraints into diffusion-based protein design. The authors identify that existing guidance methods often fail to satisfy precise, non-convex constraints required for functional design. They propose viewing the reverse diffusion process through the lens of proximal optimization. Their empirical results on PDZ scaffolding and molecule encapsulation show state-of-the-art constraint satisfaction (near 100% vs. about 0% for the baselines)."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The overall idea of the proposed method is creative and explores a new direction for diffusion models. I see the main strengths of the paper as follows:\n- strong results: the 100% satisfaction on PDZ vs 0% for strong baselines appears meaningful\n- method: framing the reverse step as proximal optimization is a neat idea, and applying the correction to the estimated $\\hat{x}_0$ instead of the noisy $x_t$ is well-motivated\n- benchmark: the PDZ benchmark designed for the evaluation seems like a meaningful contribution in its own right"}, "weaknesses": {"value": "I believe there are a few minor weaknesses:\n- baselines: while RFDiffusion is a good baseline, the authors should compare to the method in Christopher et al. (2024) [1] given the similarity between the proposed methods.\n- the paper does not present any sensitivity studies for hyperparameters. How sensitive is the proposed approach to the schedule $\\lambda$, the number of ADMM iterations, etc.?\n\n[1]  Christopher et al., Constrained Synthesis with Projected Diffusion Models, 2024."}, "questions": {"value": "- How sensitive is the proposed approach to the schedule $\\lambda$, the number of iterations, etc.?\n- How does the proposed method perform compared to the method in Christopher et al. (2024)?\n- Did you try a baseline projecting $x_t$ directly? Did it fail as expected?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "3Mk5MAGsvl", "forum": "kkvqVRu2Zy", "replyto": "kkvqVRu2Zy", "signatures": ["ICLR.cc/2026/Conference/Submission12985/Reviewer_muax"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12985/Reviewer_muax"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12985/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762753235396, "cdate": 1762753235396, "tmdate": 1762923736651, "mdate": 1762923736651, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}