{"id": "KMzaR3M8SY", "number": 4382, "cdate": 1757669987828, "mdate": 1763218389110, "content": {"title": "Similarity-Constrained Reweighting for Complex Query Answering on Knowledge Graphs", "abstract": "Machine learning models for answering complex queries on knowledge graphs estimate the likelihood of answers that are not reachable via direct traversal. Prior work in this area has focused on structured queries whose constraints are expressed in first-order logic. Recent work has proposed to extend such logical constraints with *soft entity constraints*, which require the answer to a query (also known as the *target variable*) to be similar or dissimilar to specified sets of entities.\n\nA natural but unexplored generalization of this extension is to allow specifying similarity constraints not only on the answer to a query, but also on the values assigned to *intermediate variables*, which frequently occur in complex queries. In this work, we study this more general formulation and introduce SCORE: a computationally efficient and interpretable method for incorporating similarity constraints at arbitrary positions of a query. Unlike approaches that rely on deep neural networks, SCORE is based on a lightweight and interpretable score adjustment function that only requires tuning two parameters on a validation set.\n\nOur experiments on a challenging benchmark over three different knowledge graphs demonstrate that on the special case of constraints on the target variable, SCORE is able to incorporate preferences without degrading overall query answering performance, with significantly increased ranking performance over a learned neural baseline. Moreover, SCORE maintains its performance in the more general setting with constraints on intermediate variables.", "tldr": "", "keywords": ["knowledge graphs", "query answering", "similarity"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/273c5487aab743e04fa99c99ac688f0bd066a9f3.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes the new CQA tasks considering the soft constraints over any variables, which extends the constraints for the free variable in previous works. To address this new setting, this paper proposes a new re-weighting method to interfere with the symbolic search based on the new constraints, where this new method is light and has linear complexity involving two parameters. Then the experiments showed that this new method has advantages over the previous method considering the free variable and the naive baseline."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Propose a new setting for CQA: consider the additional soft constraints over intermediate variables. \n2. Propose a light and effective method to rerank the answer sets based on the new soft constraints and the results are good."}, "weaknesses": {"value": "1. In my opinion, for the paper proposing new tasks, it’s key to introduce the motivation and application of this new setting. After reading this manuscript, I know the soft constraints over intermediate variables are new compared with existing methods.  However, I don’t know why to extend this new setting. In real situation, it's hard to prepare such preference set for re-weighting.\n2. The presentation of method is not clear. Though this manuscript provide the details of the re-weighting operations, it's lacking for how this operation integrated with the  symbolic search process.  Is the re-weighting  operation applied over each updating for fuzzy vectors?  \n3. The compared baselines are limited and all symbolic search methods. It’s important to include more baselines for new task. Query embeddings methods are mainstreams lines for complex query answering, thus I suggest authors can include some classic methods in query embedding methods."}, "questions": {"value": "Typos:\nI found some potential typos in this manuscript and listed them in the following:\n1.Equation 1 in Line 147, this formula lacks the existential qualifier \\exists based on the semantics of the natural language question. \n2.Equation 3 in Line 161: the symbolic \\exist v_{\\lneg i} \\in \\mathcal{E} only is right for two variables. Please consider the general formula for any variables.\n3.Line 69: e as a symptom,” a user"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "x3AC3oxSo5", "forum": "KMzaR3M8SY", "replyto": "KMzaR3M8SY", "signatures": ["ICLR.cc/2026/Conference/Submission4382/Reviewer_htvZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4382/Reviewer_htvZ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission4382/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761621897266, "cdate": 1761621897266, "tmdate": 1762917329617, "mdate": 1762917329617, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new method for complex query answering. Unlike traditional settings, it focuses on scenarios where similarity constraints are applied to either intermediate nodes or answer nodes within complex queries. The key idea is to represent the potential answers of each variable as fuzzy sets, and then perform Similarity-Constrained Reweighting to adjust these fuzzy vectors accordingly. Overall, the method is conceptually simple yet addresses an important and underexplored problem."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper is clearly written and easy to follow. The writing quality is excellent, and the authors address a novel and meaningful problem—introducing similarity constraints on both intermediate variable nodes and answer nodes in complex query answering.\n\nThe inclusion of theoretical analysis enhances the soundness and credibility of the proposed algorithm, while the experimental results convincingly demonstrate its effectiveness across different datasets and settings."}, "weaknesses": {"value": "The core idea of the paper is simple and intuitive, with the primary contribution being the introduction of the Similarity-Constrained Reweighting mechanism. However, this contribution appears somewhat limited in scope.\n\nThe experimental section requires significant improvement for better clarity and completeness. First, although the paper introduces a new problem setting, it does not provide sufficient details on how existing methods (such as SCORE, NQR, and other baselines) were adapted to this new domain. This information is essential and should be described explicitly.\n\nSecond, the presentation of experiments is not very clear. Both the experimental setup and the performance analysis are difficult to follow. The section would benefit from a thorough revision to improve organization, explanation, and readability."}, "questions": {"value": "no"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WF77BMa3Mu", "forum": "KMzaR3M8SY", "replyto": "KMzaR3M8SY", "signatures": ["ICLR.cc/2026/Conference/Submission4382/Reviewer_MS4r"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4382/Reviewer_MS4r"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission4382/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761874813533, "cdate": 1761874813533, "tmdate": 1762917329347, "mdate": 1762917329347, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new extension to complex query answering (CQA) over knowledge graphs (KGs), the paper names it similarity-based constraints CQA. The similarity constraint can be applied to any variable within this query. To address this new question, the paper proposes SCORE (Similarity-COnstrained REweighting). It achieves this via a logit-space reweighting mechanism that only contains two new hyperparameters."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tIt is praiseworthy to introduce the novel generalization of similarity constraints. \nNotably, the extension of SimCQA allows for similarity constraints of intermediate variables. Overall, the paper addresses a realistic but previously unstudied case in CQA.\n2.\tSCORE has good interpretability. Unlike black-box neural methods, SCORE’s update mechanism is transparent and traceable to individual preference contributions.\n3.\tThe methodology of SCORE is generally easy to comprehend and follows, like its logit-space reweighting mechanism, the paper also proposes some theoretical results to show its soundness.\n4.\tThe code, datasets are provided."}, "weaknesses": {"value": "1.\tThe setting of similarity function is far too simple. The paper just uses binary classification of True/False to determine whether one entity is similar to another one in the problem setting. This is quite simple but another problem is bigger: the paper does not explain very clearly how it decides the ground truth of similarity. To my understanding, the paper uses other answers from same query as ground truth which can be very problematic.\n\n2.\tThe performance is highly dependent on the backbone model as it only introduces two new hyperparameters. I also found that the experimental performance falls behind NQR in pairwise accuracy and also only outperforms very simple baselines like MeanCosine slightly. Therefore, I suspect the effectiveness of SCORE."}, "questions": {"value": "Perhaps using numerical attribute (which is provided in NELL and other dataset) instead of Boolean similar/not similar is a better alternative. Have you considered that?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dHLl7NG2OF", "forum": "KMzaR3M8SY", "replyto": "KMzaR3M8SY", "signatures": ["ICLR.cc/2026/Conference/Submission4382/Reviewer_3aWr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4382/Reviewer_3aWr"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission4382/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761922499666, "cdate": 1761922499666, "tmdate": 1762917329006, "mdate": 1762917329006, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a method for complex query answering (CQA) on knowledge graphs, where entity similarity constraints are exploited to guide the solver towards solutions that are consistent with such constraints. In particular, the method extends a previous one in order to exploit an entity similarity constraint defined on arbitrary variables, rather than on only the answer entity (also called target). While the method is rather simple, it turns out that it can achieve a better CQA accuracy with little computational overhead."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "I have found the writing and the plots to be extremely clear. The writing slowly introduces concepts when they are needed with many examples and a sufficiently detailed notation. Overall, I have also appreciated the simplicity of the proposed method, as well as the execution of the experiments. From a quick look, it looks like the code can help reproducing all the presented results."}, "weaknesses": {"value": "Although the CQA benchmarks used in the paper are particularly established in the community, some queries can suffer from link leakage from the training set. For instance, most of 2p complex queries can actually be decomposed into the simplest task--link prediction (1p queries)--if one considers also the training triples at test time. This means that ranking metrics for certain query types are actually inflated. Recently, [A] showed this problem and proposed a new set of much more challenging CQA benchmarks, where all triples in a query are missing in the observed knowledge graph and therefore must be predicted. Evaluating the baselines and the proposed method on these other recent benchmarks could strengthen the value of the obtained empirical results. Although I do not expect a huge difference w.r.t. the presented results, I suggest the authors to evaluate their method on these other datasets as well.\n\n[A] C. Gregucci, B. Xiong, D. Hernández, L. Loconte, P. Minervini, S. Staab, A. Vergari. Is Complex Query Answering Really Complex? ICML 2025."}, "questions": {"value": "- The definition of similarity-constrained complex queries assumes that there exists a single similarity constraint for one of free variables (e.g., see Eq. 6). Do you think this framework can be further extended to a setting where several of the free variables take part in a similarity constraint?\n\n- What is the \"unconstrained\" baseline reported in Figure 2? Is it evaluated on the same dataset for SimCQA? I do not understand why the unconstrained baseline performs better than the baseline NQR, which instead takes into account similarity constraints. Could you please clarify this aspect?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "qNkIYtwGii", "forum": "KMzaR3M8SY", "replyto": "KMzaR3M8SY", "signatures": ["ICLR.cc/2026/Conference/Submission4382/Reviewer_HSJ3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4382/Reviewer_HSJ3"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission4382/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762001334306, "cdate": 1762001334306, "tmdate": 1762917328635, "mdate": 1762917328635, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}