{"id": "kyvW6S0u3z", "number": 10728, "cdate": 1758180537373, "mdate": 1759897633054, "content": {"title": "FMIP: Joint Continuous-Integer Flow For Mixed-Integer Linear Programming", "abstract": "Mixed-Integer Linear Programming (MILP) is a foundational tool for complex decision-making problems. \nHowever, the NP-hard nature of MILP presents a significant computational challenge, motivating the development of machine learning-based heuristic solutions to accelerate downstream solvers. \nWhile recent generative models have shown promise in learning powerful heuristics, they suffer from a critical limitation.\nThat is, they model the distribution of only the integer variables and fail to capture the intricate coupling between integer and continuous variables, creating an information bottleneck and ultimately leading to suboptimal solutions.\nTo this end, we propose Joint Continuous-Integer Flow for Mixed-Integer Linear Programming (FMIP), which is the first generative framework that models the joint distribution of both integer and continuous variables for MILP solutions.\nBuilt upon the joint modeling paradigm, a holistic guidance mechanism is designed to steer the generative trajectory, actively refining solutions toward optimality and feasibility during the inference process. \nExtensive experiments on eight standard MILP benchmarks demonstrate the superior performance of FMIP against existing baselines, reducing the primal gap by 41.34% on average. \nMoreover, we show that FMIP is fully compatible with arbitrary backbone networks and various downstream solvers, making it well-suited for a broad range of real-world MILP applications.", "tldr": "FMIP is a generative framework that jointly models integer and continuous variables in MILP, achieving a 41.34% reduction in primal gap and demonstrating compatibility with various solvers and applications.", "keywords": ["Mixed Integer-Linear Programming", "Learning to Optimize", "Flow Matching"], "primary_area": "optimization", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/8694a50166f867ea2ff5d41c4f5c46cee4b0ef87.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The authors study mixed-integer optimization problems (MILPS) which are computationally hard to solve to optimality in general. Solvers for MILPs benefit from good heuristic start solutions, which can be generated by using state-of-the-art learning methods. The authors propose a generative model which is able to generate good feasible solutions by predicting (compared to previous models) both, integer and continuous variables. The performance of the model is tested on a wide variety of instances and compared to several benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The paper is very clearly written and all concepts are presented in a detailed but concise way. The methodology is very sophisticated and the idea of incorporating the continuous variables into the generative model is interesting and hence the whole paper provides an important contribution to the knowledge of the field. The experiments are extensive, although there are some subtle issues which should be improved."}, "weaknesses": {"value": "1. The goal of the paper is to provide (exact) solvers with good feasible solutions. Hence I don't understand why there is no state-of-the-art exact MILP solver used as downstream solver (e.g. Gurobi, SCIP or HiGHS)? It would be important to see on very hard instances, how much the predicted solutions improve the performance of the exact solver (e.g. in terms of optimality gap after 1 hour). Solvers as Gurobi have sophisticated methods implemented to search for good feasible solutions. If your extremely complex model (which has to be trained etc.) cannot provide better solutions then it is useless for exact solvers.\n\n2. In the experiments Gurobi is able to provide the same objective values as your model for nearly all instances (except LB and IP, although on LB it nearly achieves the same value). This indicates that the instances which are solved here are quite easy for exact solvers as Gurobi and at the same time Gurobi provides you with an optimality gap (which you should report). So looking at the results as a user I would prefer using Gurobi, which maybe has to run for 3600 seconds but on the other hand it is extremely simple to use: there is no training involved and it provides an optimality gap. As mentioned above, it would be interesting to see how good your predicted solutions are for harder instances.\n\n3. It is not clear from the main paper, what data the model is trained on. Since you have to provide good solutions for the training instances these can only be instances which are easy to solve by the MILP solvers. Your model should be evaluated on instances which are of larger dimension/harder than the training set.\n\nMinor comments:\n- The paragraph \"Metrics\" is not clear enough. What exactly do you mean hear by OBJ and what is BKS? Is BKS the best known solution after running the downstream solver? Why do you compare it to OBJ which I understand is the objective value of the solution predicted by the generative models?\n- The statement in abstract and conclusion that the primal gap is reduced by 41.34% is misleading. Gurobi is able to provide primal solutions nearly as good as your model in one hour."}, "questions": {"value": "- Why don't you use any exact downstream solvers as Gurobi, SCIP etc.?\n- Looking at the experiments, why should I use your (very complex) model involving data collection and training instead of just running Gurobi?\n- How good is your model for hard instances which are harder than the instances in the training set?\n- How much does your model improve the Gurobi process compared to the standard heuristics implemented in Gurobi?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "RcGRF8QoD4", "forum": "kyvW6S0u3z", "replyto": "kyvW6S0u3z", "signatures": ["ICLR.cc/2026/Conference/Submission10728/Reviewer_rMCB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10728/Reviewer_rMCB"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10728/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760715145473, "cdate": 1760715145473, "tmdate": 1762921958653, "mdate": 1762921958653, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "FMIP uses a multimodal flow matching generative model to learn the distribution of high-quality MILP solutions in a combined continuous–discrete space. The author proposes a **“holistic” guidance mechanism** that steers the generation process using the MILP’s objective function and constraint satisfaction feedback, refining candidate solutions toward feasibility and optimality during sampling. This approach is expected to addresses the limitation of previous graph neural network (GNN) predictors that predicted only integer variables and left continuous ones to a solver, thereby missing the intricate coupling between them ."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The joint modeling of integer variables and continuous variables is a notable contribution, where previous works usually only focus on discrete value predictions, which ignores some global relationships.\n2. The author proposed the holistic guidance mechanism integrated into FMIP’s sampling. During inference, FMIP uses the MILP’s objective and constraint violations to guide the generative trajectory, which is expected to produce better predictions."}, "weaknesses": {"value": "1. Given the context where integer–continuous coupling is important, the motivation for a generative approach is under-developed. Why is a generative model preferable to discriminative predictors under identical solver budgets? Why is the Flow Matching used in the proposed framework?\n2. In Tables 1–2 the downstream solver time limits should be standardized (e.g., a flat 1000 s for all methods) to ensure fairness; the mixed 400/600 s budgets are short for some instances and confound comparisons. A unified budget would make the FMIP gains more persuasive."}, "questions": {"value": "1. The guidance combines the objective with squared constraint violations via a hyperparameter $\\gamma$. Please clarify how it balances objective vs. violation terms, its sensitivity, and the tuning/selection procedure used.\n2. The reweighting step appears to require evaluating continuous variables, which is extra computational efforts. If many continuous variables are functionally dependent or cheaply recoverable, why is explicit prediction necessary? Could a GNN/GAT that aggregates global information suffice without predicting continuous components? Is it necessary because of the generative model? Please clarify the additional computational cost or justify the benefit of jointly predicting discrete and continuous variables (e.g., tighter guidance, reduced repair time, better warm starts)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "xOvGmmJ1or", "forum": "kyvW6S0u3z", "replyto": "kyvW6S0u3z", "signatures": ["ICLR.cc/2026/Conference/Submission10728/Reviewer_t9Xo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10728/Reviewer_t9Xo"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10728/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761733609483, "cdate": 1761733609483, "tmdate": 1762921958014, "mdate": 1762921958014, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces FMIP a flow model for MILP solving, cast at sampling from a generative model, that defines a method to sample from joint distributions over discrete and continuous variable assignments. This can help capturing interactions between these two sets of variables, which is often missing in previous works on generative models for MILPs.\nThe model is based on a 'tripartite-graph'  a variation of the standard bipartite graph where integer and continuous variables are mapped to two disjoint set of nodes.\n\nHowever, while the distribution is joint, it is assumed to be factorized and amounts to one independent prediction per variable (discrete or continuous). Only the conditioning is from a complete, and noisy, assignment.\n\nAdditionally, authors introduce guidance mechanisms for the two types of\nvariables helping steer the model's trajectories towards feasible assignments.\nFor the continuous variables the guidance is based on projected gradient descent to enforce box constraints (the other constraints are taken into account via the violation penalty)\nFor integer variables, authors use a sample-and-reweight method where the denoiser is used to generate several candidates which are evaluated. The rates are updated to promote (ie, increase the probability) of candidates which combine good objective value and low constraint violation. The final samples are also projected to enforce box constraints.\n\n\n\nEventually, FMIP returns an assignment for the continuous relaxation of the\ninput MILP, and must be processed further by a solver. In that sense, FMIP\nremains a tool to warm-start a solver.\n\n\nTypos:\n- The two first references to Gasse et al. are the same\n- The two first references to Taoan Huang et al. are the same\n- l. 712 missing space before Edges\n- l. 728 why $> 0$ and not $\\neq 0$ ?\n- l. 753 $t$ and $t$ ??"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "This paper identifies and  highlights one of the blind posts from previous generative models for MILPs: the lack of a proper treatment  of continuous variables. I believe this is the main contribution of the paper"}, "weaknesses": {"value": "- The model is straightforward and amounts to the concatenation of a continuous flow and a discrete flows that can both be conditioned on predicted assignments.\n- The tri-partite representation is surprising and questionable (see question below)"}, "questions": {"value": "1. Where is the 41.34% improvement mentioned in the abstract and the conclusion found in the experiments? Maybe it's lost \n2. In Table 4, how is the system \"w/o Continuous\" implemented? How does it handle continuous variables? This is important since, as mentioned by authors, this performance gap gives a direct evidence that modelling joint distributions as advocated in FMIP is important.\n3. Why do you call your graph a tripartite graph instead of a bipartite graph with continuous/discrete binary features for variable nodes? It overcomplicates the model and makes the reader thinks edges between discrete and continuous nodes are allowed.\n   Besides, line 726 mentions a bipartite graph\n4.The discussion lines 468-474 is interesting. Could an additional reason to explain why the number of sampling steps may have a detrimental effect is that the coefficient $\\gamma$ given to the violation (and possibly the measure of the violation itself based on the max operator) may lead to a situation where the function $f$ favors constraints over objective?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "S2wzsX0TAT", "forum": "kyvW6S0u3z", "replyto": "kyvW6S0u3z", "signatures": ["ICLR.cc/2026/Conference/Submission10728/Reviewer_n8PZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10728/Reviewer_n8PZ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10728/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761906519092, "cdate": 1761906519092, "tmdate": 1762921957448, "mdate": 1762921957448, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This manuscript is an incremental extension of [1], with the following core enhancements: i) an extention from integer linear programs (ILP) to mixed-integer linear programs (MILP), and ii) replacing diffusion models with flow matching models. The authors conduct extensive experiments, demonstrating improvements over existing methods.\n\n\n[1] Zeng, Hao, et al. \"Effective generation of feasible solutions for integer programming via guided diffusion.\" ACM SIGKDD 2024."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper is well-organized with a clear logical flow.\n2. Extending the application of generative methods from ILP to MILP is a natural progression.\n3. Empirical experiments are comprehensive, and the results show improvements over the selected baselines."}, "weaknesses": {"value": "I have reviewed this paper at NeurIPS 2025, and I am satisfied with the revisions made by the authors. I do not have any major concerns, but I have a minor suggestion:\n\nThe paper states that \"existing generative methods for MILP suffer from a critical limitation: they model the distribution of only the integer variables.\" However, the transition from ILP to MILP seems relatively straightforward, and this limitation may not constitute a major challenge. I recommend that the authors emphasize the more difficult aspects and make the challenges clearer to the reader."}, "questions": {"value": "1. Does the inference time in Table 3 include the time cost of the guidance process?\n2. In Table 4, how does the \"w/o Continuous\" variant perform the guidance? Without continuous variables, how are constraint violations and objective value calculated?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "0YNTHvJbOj", "forum": "kyvW6S0u3z", "replyto": "kyvW6S0u3z", "signatures": ["ICLR.cc/2026/Conference/Submission10728/Reviewer_1do2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10728/Reviewer_1do2"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10728/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761936655081, "cdate": 1761936655081, "tmdate": 1762921956198, "mdate": 1762921956198, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces FMIP (Joint Continuous-Integer Flow for Mixed-Integer Linear Programming), a generative framework that addresses limitations in existing MILP heuristics by modeling the joint distribution of both integer and continuous variables using conditional flow matching. This approach captures the interdependencies between variable types, enabling a holistic guidance mechanism during inference that steers solutions toward optimality and feasibility via objective function and constraint feedback. FMIP, integrated with various graph neural network backbones and downstream solvers, is evaluated on some benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The claimed empirical performance is good, achieving decent relative improvement in primal gap over state-of-the-art baselines on some benchmarks. The framework's compatibility with multiple GNN architectures and solvers, as shown in ablation studies and compatibility analyses, highlights its flexibility and generalizability. Additionally, the holistic guidance, supported by gradient-based updates for continuous variables and sampling-reweighting for integers, effectively leverages complete solution candidates at each step, leading to higher-quality heuristics."}, "weaknesses": {"value": "FMIP's focus on bounded integer variables limits its applicability to general MILP problems with unbounded or non-binary integers. The reliance on flow matching introduces higher inference times compared to discriminative baselines like supervised learning. While ablations confirm the value of joint modeling and guidance, the paper could benefit from deeper analysis on failure cases or scalability to very large-scale instances beyond the tested benchmarks."}, "questions": {"value": "None"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "COoRqFlZkX", "forum": "kyvW6S0u3z", "replyto": "kyvW6S0u3z", "signatures": ["ICLR.cc/2026/Conference/Submission10728/Reviewer_3TSm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10728/Reviewer_3TSm"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission10728/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761978248970, "cdate": 1761978248970, "tmdate": 1762921955816, "mdate": 1762921955816, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}