{"id": "kZI7eGnPbC", "number": 23155, "cdate": 1758340291362, "mdate": 1758838583310, "content": {"title": "A Unified SVD Perspective: Deconstructing, Evaluating, and Improving Model Merging with Ortho-Merge", "abstract": "Model merging is a powerful training-free technique for integrating the capabilities of multiple fine-tuned models, yet prevailing approaches—parameter-statistical (e.g., Average, TIES, DARE) and spectral/SVD-based (e.g., iso_c, KnOTS)—arise from disparate philosophies without a unifying account. We present a unified SVD-centric framework grounded in four principles—energy preservation, cross-task interference, spectral entropy, and information loss—that provides a consistent lens for analyzing merging algorithms. Guided by this framework, we introduce ORTHO-MERGE, a sign-aware deconflict-then-harmonize method. For each layer and task vector, we perform SVD and use signed similarities between leading singular directions to detect both redundant (> τ) and oppositional (< −τ) interference across tasks. The weaker singular component in each interfering pair is removed from its source task vector; the deconflicted vectors are then aggregated and harmonized via iso_c-style spectral averaging (SVD with mean-singular-value equalization). This training- and data-free pipeline resolves geometric conflicts before aggregation and controls the merged spectrum, preserving informative mid-rank structure while avoiding over-flattening. Across three CLIP backbones (ViT-B/32, ViT-B/16, ViT-L/14) and task suites of size 8/14/20, ORTHO-MERGE achieves state-of-the-art or competitive results on both average absolute and normalized accuracy. Spectrum diagnostics further show reduced spectral entropy and lower information loss, aligning the observed gains with our framework.", "tldr": "", "keywords": ["Model Merging", "Singular Value Decomposition (SVD)", "Orthogonalization", "Cross-task Interference", "Training-free"], "primary_area": "transfer learning, meta learning, and lifelong learning", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/d07831c6d54dcef098089f6368f09417b83ce71e.pdf", "supplementary_material": ""}, "replies": [], "withdrawn": true}