{"id": "l4m4HK6gJN", "number": 7765, "cdate": 1758035305902, "mdate": 1759897833872, "content": {"title": "FS-KAN: Permutation Equivariant Kolmogorov-Arnold Networks via Function Sharing", "abstract": "Permutation equivariant neural networks employing parameter-sharing schemes have emerged as powerful models for leveraging a wide range of data symmetries, significantly enhancing the generalization and computational efficiency of the resulting models. Recently, Kolmogorov-Arnold Networks (KANs) have demonstrated promise through their improved interpretability and expressivity compared to traditional architectures based on MLPs. While equivariant KANs have been explored in recent literature for a few specific data types, a principled framework for applying them to data with permutation symmetries in a general context remains absent. This paper introduces Function Sharing KAN (FS-KAN), a principled approach to constructing equivariant and invariant KA layers for arbitrary permutation symmetry groups, unifying and significantly extending previous work in this domain. We derive the basic construction of these FS-KAN layers by generalizing parameter-sharing schemes to the Kolmogorov-Arnold setup and provide a theoretical analysis demonstrating that FS-KANs have the same expressive power as networks that use standard parameter-sharing layers, allowing us to transfer well-known and important expressivity results from parameter-sharing networks to FS-KANs. \nEmpirical evaluations on multiple data types and symmetry groups show that FS-KANs exhibit superior data efficiency compared to standard parameter-sharing layers, by a wide margin in certain cases, while preserving the interpretability and adaptability of KANs, making them an excellent architecture choice in low-data regimes.", "tldr": "", "keywords": ["Kolmogorov-Arnold Networks", "Geometric Deep Learning", "Group invariant neural network", "Weight sharing", "Parameter sharing", "Symmetries"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/976becc342bc0dbaf09f86049c1fa0b64b7e4755.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes FS-KAN, a framework that enforces permutation equivariance and invariance in Kolmogorov–Arnold Networks by sharing functions rather than weights. The authors establish an expressivity equivalence with parameter-sharing ReLU MLPs, showing that FS-KANs match their expressivity and thus inherit known universality guarantees for symmetry aware models. Empirically, across multiple symmetry tasks, FS-KANs outperform other baselines in low-data regimes, delivering better data efficiency while retaining KANs interpretability."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper proves that FS-KAN captures all G-equivariant/invariant KA layers via function sharing. The proof is easy to follow with standard techniques in equivariant/invariant layer design.\n- Emperical evident suggests that their FS-KAN is better comparing to other baselines in low data regime."}, "weaknesses": {"value": "- In the point-cloud task (e.g., at ~1k training samples), other baseline match or surpass FS-KAN, suggesting its benefit diminishes as training size grows. This reduces the practical appeal of FS-KAN beyond low data settings.\n- The computational runtime/memory analysis from Appendix C shows that FS-KAN incurs substantially higher runtime and memory usage than the other baselines."}, "questions": {"value": "- Does function sharing over-constrain FS-KAN? With many spline functions tied across positions (Appendix Fig. 7), could the sharing pattern overly limit capacity and hinder learning in practice?\n- The appendix indicates substantially higher runtime and memory than other baselines. Can runtime/memory for FS-KAN be improved?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "IkuQgcSKvC", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_G8oo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_G8oo"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761945787709, "cdate": 1761945787709, "tmdate": 1762919808399, "mdate": 1762919808399, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes FS-KAN and function sharing, enabling Kolmogorov–Arnold Networks (KAN) to implement group equivariance. This design unifies parameter sharing and functions sharing enabling transfer of known results (e.g., universality). Experiments show competitive performance, especially in low-data regimes."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- Well written and clearly structured with working examples.\n- Proposition 2 is a rigorous result which requires new and different proofs from the ones known in the weight sharing literature for equivariant neural networks. \n- The authors propose a perspective that unifies neural networks and KANs. Function sharing for KANs cleanly recovers common equivariant designs for permutation representations of groups."}, "weaknesses": {"value": "- **Insufficient novelty.** The introduction of the concept of function sharing is a simple adaptation of the regular concept of weight sharing for equivariant neural networks, as presented in [1]. The majority of main theoretical statements except for Proposition 2 largely transfer as it is from the weight sharing literature for equivariant deep learning.\n- **Missing analysis of low-frequency learning and spectral bias.** This topic is currently central to KAN research [2]. In particular, KANs are known to avoid the low-frequency bias of standard neural networks, enabling them to perform better on high-frequency targets (e.g., certain PDE solutions). These properties make KANs especially relevant for AI-for-Science; yet the manuscript does not investigate this direction, even though enforcing equivariance to the symmetries of specific PDEs could potentially improve performance.\n\n[1] S. Ravanbakhsh, *Equivariance Through Parameter-Sharing*, 2017 \\\n[2] Y. Wang et al., *On the expressiveness and spectral bias of KANs*, 2024"}, "questions": {"value": "**Interpretability claim.**  \nOne of KANs’ most advertised features is improved interpretability, and FS-KANs build on this. However, this claim is contested: learnable activations are not identifiable up to scale and permutations, which makes post-hoc interpretation fragile at the local scale. At larger scales, even the KAN authors acknowledge that “a KAN may only remain interpretable when the network scale is relatively small” (p. 21 of [3]). \nTo what extent does enforcing equivariance mitigate this fragility?\n\n[3] Z. Liu, \"KAN 2.0: Kolmogorov-Arnold Networks Meet Science\", 2025"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "s1SV8kPCEF", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_DxdS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_DxdS"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761958521726, "cdate": 1761958521726, "tmdate": 1762919807949, "mdate": 1762919807949, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces FS-KAN, a principled framework for building permutation-equivariant and invariant neural networks by extending parameter-sharing schemes to function sharing. The approach unifies and generalizes prior work on equivariant KANs, providing a theoretical proof that FS-KANs have equivalent expressive power to traditional parameter-sharing MLPs. Empirically, FS-KANs achieve strong performance and data efficiency across diverse symmetry-aware tasks, including signal classification, point cloud recognition, and matrix completion, particularly in low-data regimes. The architecture retains the interpretability and adaptability of KANs while significantly improving generalization for data with built-in symmetries"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper presents a theoretically sound and general framework for permutation-equivariant KANs, extending the idea of parameter sharing to function-level sharing. It also provides clear mathematical proofs showing expressivity equivalence with parameter-sharing MLPs.\n- The proposed architecture maintains the interpretability of KANs, as demonstrated in visual examples where symmetric function structures emerge naturally.\n- The efficient FS-KAN variant reduces computational and memory costs while preserving equivariance, making the method more practical."}, "weaknesses": {"value": "- Despite the good performance, computational cost remains high, particularly compared to standard MLP-based models in high-data regimes.\n- The empirical analysis, while broad, relies mostly on synthetic or small-scale datasets, leaving scalability to large real-world systems untested.\n- The practical interpretability claims are qualitative; the paper lacks systematic metrics quantifying how function sharing aids transparency."}, "questions": {"value": "- How does FS-KAN training scale computationally and memory-wise with input dimension and group size, compared to DeepSets or GNN baselines?\n- Can FS-KANs be adapted for continuous or mixed-group symmetries (e.g., rotations, reflections) beyond discrete permutations?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "lO64NhLIPp", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_mRDw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_mRDw"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761969261606, "cdate": 1761969261606, "tmdate": 1762919807445, "mdate": 1762919807445, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a new approach to realize equivariant (or invariant) KANs. The underlying mechanism is a direct generalization of the weight-sharing used for MLPs, where now it becomes a function sharing of the learnable KAN functional components.\nThe work claims that the approach generalizes existing equivariant KAN architectures, and that the function-sharing approach is general, since any equivariant KA layer can be exactly represented by a FS-KA layer.\nThe authors then introduce an efficient version of the layer, provide examples intended to demonstrate how FS-KAN can be designed and how they generalize existing architectures, and prove that MLPs and FS-KANs can approximate each other to arbitrary accuracy. This fact is then used to derive universality properties of FS-KANs.\nThe experimental section convincingly demonstrate the potential of the new architecture."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The related work clearly highlights the motivation of the work (simplification of existing approaches, variable size inputs, general permutation groups).\n- The topic of combining KANs with equivariant modelling is of current interest, and the results cover both efficient implementation and analytical properties.\n- The experimental section is clearly structured and it addresses a clearly defined set of questions."}, "weaknesses": {"value": "- Efficient FS-KA layers: This seems to be a central novelty of the paper, as it enables applications and scaling to realistic problems. However, their definition is mainly textual and hard to process. I suggest to revise the paragraph \"Efficient FS-KA layers\" and make their definition more explicit.\n\n- Generalization of the existing literature: There is an emphasis in Sections 1-2 on the fact that FS-KANs generalize and unify existing approaches. This fact is however not sufficiently demonstrated in the paper. Section 3.3 in particular has a \"FS-KANs generalize previous equivariant KANs\" paragraph, which only mentions some similarity with the existing literature. \n\n- Theoretical analysis: Proposition 7 is formulated in an imprecise manner, as there is no dependency on the target accuracy $\\varepsilon$, while clearly the MLP $f$ is in fact $f(\\varepsilon)$. This becomes evident by inspecting the proof, but it should made clear upfront. \nEspecially, the width $d_{\\max}$ of the MLP $f$ seems to be unboundedly growing in $\\varepsilon$, since the construction is based on the 1989 Hornik et al. result. \nApart from updating the statement of Proposition 7, I also recommend to update the following sentences:  (I) \"Both proofs provide constructive methods for building the corresponding networks\",  following Proposition 7, which is not correct as it stands; (ii) \"we show that for a specific permutation group G, both model families have the same expressive power in the uniform approximation sense\", should rather state the the two families are dense in the same set of functions.\n\n- The experimental results compare FS-KANs only with MLPs with shared parameters. Comparisons with other equivariant architectures should be considered."}, "questions": {"value": "Apart from the points discussed above, there are the following minor points: \n \n- The $\\star$ notation in (1) is standard in KANs, but should be briefly introduced.\n\n- Paragraph \"Invariance, equivariance, and standard parameter-sharing\": The problem is formulated for $V=V'=R^n$, instead of general $V=R^n$, $V'=R^{n'}$. It is unclear at this stage if this is a necessary assumption for the definition of FS-KA layers, or if the assumption is just for the sake of simplifying the presentation. Please clarify this.\n\n- Equation (3) gives the wrong impression that only constant, zero-sum offsets are allowed. While this is clear from the context, I suggest modifying the example in (3) by using a functional offset.\n\n- Proof of Proposition 6: The notions of grid size and $B$-splines (\"grid size $G = 2$ with degree $k$ B-splines\") are nowhere defined before."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "iM1zoZYGlh", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_9HVo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_9HVo"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761986507008, "cdate": 1761986507008, "tmdate": 1762919806986, "mdate": 1762919806986, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces FS-KAN, a principled framework for building permutation-equivariant and invariant KAN layers by sharing functions (rather than weights) across positions. The authors prove that FS-KANs have expressive power equivalent (on bounded domains) to parameter-sharing MLPs; this lets known universality and expressivity results for equivariant networks (e.g., DeepSets/GNN variants) transfer directly. Empirically, across point-cloud classification (ModelNet40, including a continual-learning protocol) and recommender datasets with $S_n \\times S_m$ symmetry, FS-KANs show clear gains in low-data regimes and reduced forgetting, while preserving KAN interpretability. The paper also presents an “efficient” FS-KAN variant that reduces (but does not eliminate) runtime/memory overheads. Overall, the work unifies scattered equivariant-KAN designs and offers a clean blueprint to apply KA layers under arbitrary permutation groups."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This paper presents an elegant generalization of parameter sharing to function sharing in KANs; the framework subsumes prior set/image KANs and handles arbitrary permutation groups and multi-channel tensors.\n\n- The authors proves interesting bidirectional results: on the one hand, FS-KAN can be used to represent ant parameter-sharing MLPs; on the other hand, parameter-sharing MLPs can be used to approximate any FS-KANs. These results clarify exact expressivity and transfer known universality/limits from parameter-sharing MLPs to to FS-KANs.\n\n- On low-data point-cloud and recommendation settings, FS-KANs deliver consistent improvements in accuracy/RMSE and lower forgetting in continual learning."}, "weaknesses": {"value": "My main concern with this paper lies in the weaknesses of the experimental evaluation.\n\n- Regarding compute/latency, even the efficient variant is ~1.5× faster than vanilla FS-KAN yet still slower than DeepSets, and its memory usage remains higher.\n\n- Figure 5 and Table 1 show that FS-KAN’s improvements over the baselines are marginal; if anything, they suggest parity with older baselines such as Point Transformer.\n\n- No large-scale benchmarks are discussed. Given the high computational overhead and only marginal gains over DeepSets, it is plausible that DeepSets may slightly surpass FS-KAN at larger training sizes.\n\nHowever, because the theoretical results constitute the paper’s main contribution, and are both interesting and valuable to the ML community, I assign a positive score at this time."}, "questions": {"value": "- What is the impact of the number/order of knots, the function parameterization (splines vs. alternatives), and the degree of sharing (full vs. partial) on performance and computational cost?\n\n- How would the theoretical results change if the permutation group were replaced by a continuous group (e.g., rotations)?\n\n- Is there an intuitive explanation for why FS-KANs can exactly represent any parameter-sharing MLP, whereas parameter-sharing MLPs can only approximate, but not exactly represent, arbitrary FS-KANs?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FdtOoukG91", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_4Zk8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_4Zk8"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762083914868, "cdate": 1762083914868, "tmdate": 1762919806302, "mdate": 1762919806302, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a permutation-equivariant neural network based on the Kolmogorov–Arnold framework."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is well written and self-contained. Even for readers who are not deeply familiar with KANs, the main ideas are clear and accessible.\n\n- The construction of the proposed permutation-equivariant and permutation-invariant KANs is clearly presented. It is supported by solid theoretical guarantees, including expressivity results (Propositions 2 and 4) and expressive power analysis (Section 4). The accompanying visualizations effectively illustrate the concepts, and to the best of my knowledge, this formulation is novel within the context of permutation-equivariant networks.\n\n- The experimental section covers a diverse set of symmetry-structured tasks, such as signal classification, point-cloud classification, and semi-supervised rating prediction, demonstrating the versatility of the proposed framework."}, "weaknesses": {"value": "- While the theoretical results are clearly presented and technically sound, they are somewhat expected and incremental. Propositions 2 and 4 follow naturally from basic algebraic reasoning, and the expressive power result largely derives from existing results on standard KANs.\n\n\n- I find the motivation from the KAN literature somewhat confusing. KANs are often considered computationally heavy and inefficient compared to mainstream architectures such as MLPs, CNNs, or Transformers. Although spline-based parameterizations can alleviate some of these issues, KAN-based models are still known for their slower training and higher memory consumption. While the paper provides several theoretical guarantees on expressivity, I believe the empirical performance and efficiency aspects are more crucial in this context. **The trade-off between accuracy and computational cost remains too large**. This makes the practical necessity of applying KANs to permutation-equivariant networks questionable. Although the authors introduce an efficient variant of FS-KAN to mitigate these issues, the improvement is modest, and in some cases, the efficient version performs comparably or even worse than the full FS-KAN model."}, "questions": {"value": "Could the authors provide additional evidence or comparisons regarding runtime and memory efficiency with other baselines? Currently, the analysis only includes DeepSets, making it difficult to assess how FS-KAN performs relative to a broader range of architectures."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QLtIomx0yd", "forum": "l4m4HK6gJN", "replyto": "l4m4HK6gJN", "signatures": ["ICLR.cc/2026/Conference/Submission7765/Reviewer_5F3P"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7765/Reviewer_5F3P"], "number": 6, "invitations": ["ICLR.cc/2026/Conference/Submission7765/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762092169945, "cdate": 1762092169945, "tmdate": 1762919804715, "mdate": 1762919804715, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}