{"id": "L646x51jF8", "number": 9872, "cdate": 1758145298062, "mdate": 1759897690329, "content": {"title": "Talk, Judge, Cooperate: Gossip-Driven Indirect Reciprocity in Self-Interested LLM Agents", "abstract": "Decentralized self-interested LLM agents often struggle to sustain cooperation when they are placed in mixed-motive tasks. Incentivizing cooperation is challenging while many previous studies have focused on compromised settings. We address this challenge by introducing public gossip as a decentralized reputation mechanism in agents' interactions. Our analysis provides both theoretical guarantees and empirical evidence that gossip can promote cooperation in indirect reciprocity games. Building on this insight, we propose the Agentic LInguistic Gossip Network (ALIGN), an automated agentic framework where agents share open-ended gossip to evaluate one another's trustworthiness and establish reciprocity with cooperative partners. Experiments show that ALIGN not only improves cooperation and social welfare but also resists malicious entrants, as defectors are reliably identified and excluded.", "tldr": "", "keywords": ["Indirect Reciprocity", "LLM Agent", "Game Theory", "Gossip", "Reputation", "Cooperation", "Multi-agent System"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/f0bd6eae2aee3aec3957ce7aee4a48b62ec57640.pdf", "supplementary_material": "/attachment/d1cb408e760d03432f17007677f32cc0ab5c60ea.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces ALIGN (Agentic Linguistic Gossip Network), a decentralized framework designed to promote cooperation among self‑interested large language model (LLM) agents by leveraging public gossip as a reputation‑based communication mechanism. From a game‑theoretic perspective, the authors model the interaction as a repeated social dilemma and prove that, under public imperfect monitoring via gossip, cooperation can be sustained as a subgame‑perfect equilibrium when the common discount factor exceeds a given threshold. Both theoretical analysis and empirical experiments demonstrate that gossip functions as a decentralized information channel through which agents update their beliefs based on linguistic evaluations of others’ behavior, thereby enhancing cooperation and overall social welfare compared to non‑gossiping baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1. The paper is well-written and easy to follow.\n2. The introduction of public gossip as a mechanism is both conceptually sound and practically effective for addressing repeated social dilemmas. This idea is insightful and thought-provoking.\n3. The theoretical analysis is thorough. The experimental section includes a diverse set of comparison models, encompassing both reasoning and chat-oriented LLMs. Moreover, the evaluation of resilience against exploitative agents and the ablation of equilibrium knowledge further substantiates the validity and robustness of ALIGN."}, "weaknesses": {"value": "1. The application scope of the proposed method appears to be relatively limited. In the social dilemma settings discussed in the paper, enabling agents to share information through gossip naturally facilitates the development of trust among agents, thereby promoting cooperation and resolving the dilemma. As a result, the potential contribution and broader impact of the work may be somewhat limited.\n2. The experiments are conducted only within the relatively simple setting of the donation game, which raises concerns about the generalizability and broader applicability of the proposed approach."}, "questions": {"value": "1. I would like to understand how each agent decides which tone of gossip to adopt. Moreover, I believe that the form and content of gossip are likely to influence the effectiveness of cooperation. If a recipient receives a donation but either refuses to provide gossip or fails to truthfully report the donor’s behavior, could this introduce potential issues or inconsistencies in the system?\n2. Can the mechanism of public gossip be extended to more complex social dilemma settings? For instance, how would it generalize to simultaneous-decision scenarios such as Prisoner’s Dilemma–type games, or to heterogeneous-agent environments where agents differ in roles or reward functions?\n3. According to the ICLR submission requirements, the authors may include an Ethics Statement, Reproducibility Statement, and LLM Usage Statement following the main text."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "7MHy4HLn86", "forum": "L646x51jF8", "replyto": "L646x51jF8", "signatures": ["ICLR.cc/2026/Conference/Submission9872/Reviewer_wLkm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9872/Reviewer_wLkm"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9872/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761585784211, "cdate": 1761585784211, "tmdate": 1762921342482, "mdate": 1762921342482, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work presents ALIGN, a framework that leverages public gossip as a decentralized reputation mechanism to foster cooperation among self-interested LLM agents. The authors provide a game-theoretic analysis, proving that gossip can sustain cooperation as an equilibrium in infinite-horizon donation games, and empirically validate this using a diverse set of LLMs. Their results demonstrate that the gossip mechanism consistently improves cooperation rates and social welfare."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThis paper integrates established theories of indirect reciprocity into LLM-based multi-agent systems, proposing ALIGN—a practical and decentralized framework designed for self-interested agents.\n2.\tThe experimental results convincingly demonstrate the effectiveness of ALIGN. A particularly interesting finding, as shown in Table 3, is that some Chat Models achieve positive rewards despite defection being the unique SPE. This divergence from the theoretical equilibrium could serve as a potential metric for assessing a model's strategic rationality."}, "weaknesses": {"value": "1. The prompts used for the LLM agents are not specified. It is unclear how environmental context and gossip messages are structured and presented to the agents in both finite and infinite horizon settings, which hinders reproducibility.\n2. The importance of the gossip protocol (Section 4.2) is not sufficiently demonstrated. Although it incorporates five levels of judgment, what ultimately matters remains the binary signal(cooperate/defect).\n3. There is no ablation study on the reasoning method Reflexion."}, "questions": {"value": "1.\tWhat is included in the prompts for the agents in the finite and infinite horizon benchmarks? Do they differ only by the words 'finite' and 'infinite,' and can such a difference alone cause the cooperation ratio to rise from 0 to 1?\n2.\tSince the gossip always aligns with the actual events without any misunderstanding, how does this form of public imperfect monitoring fundamentally differ from public perfect monitoring? In real-world scenarios, gossip often deviates from the truth during propagation. Can ALIGN handle such cases where gossip may not reflect the actual results?\n3.\tWhat would the experimental results be if the gossip protocol were replaced with binary signals? \n4.\tBefore taking an action, how do the LLMs conclude the action they should take? How does Reflexion work and help the agent to get the right action?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "MmbmGTOTFh", "forum": "L646x51jF8", "replyto": "L646x51jF8", "signatures": ["ICLR.cc/2026/Conference/Submission9872/Reviewer_hjc3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9872/Reviewer_hjc3"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9872/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761811206958, "cdate": 1761811206958, "tmdate": 1762921342222, "mdate": 1762921342222, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper explores how self-interested LLM agents can maintain cooperation without central control. The authors propose ALIGN , where agents share public linguistic gossip that are evaluative messages about others’ behavior to enable indirect reciprocity. Through game-theoretic analysis, they prove that cooperation can be stable under gossip-based imperfect public monitoring when the discount factor meets $\\gamma \\geq c/b$. Experiments in repeated donation and indirect reciprocity games show that gossip-driven agents achieve higher cooperation and fairness than non-gossip baselines. Reasoning models, in particular, use stronger negative tones to punish defectors, aligning behavior with social norms. The work demonstrates that language-based gossip can naturally foster cooperation among decentralized LLM agents."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "This paper extends the reputation mechanisms used in previous social dilemma studies and adapts them to LLM agents. The writing is clear and well organized."}, "weaknesses": {"value": "1. Although the paper extends existing methods, the evaluation settings remain limited to classic matrix games. This makes the conclusions rather narrow. The capabilities of LLM agents would allow the proposed mechanism to be tested in more realistic and complex environments.\n2. The experimental results themselves are not particularly novel and do not clearly demonstrate what is unique about gossip as a mechanism.\n3. The theoretical model cannot quantitatively capture the decision-making process of LLM agents. In particular, the role of the discount factor remains unclear for LLM agents, which is an important parameter affecting the behavior of rational players in theoretical model."}, "questions": {"value": "How is the discount factor represented for LLM agents? How can we set different discount factors for LLM agents (e.g., what would be the behavioral difference between 0.5, 0.6, and 0.8)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BPTOvVeT8Z", "forum": "L646x51jF8", "replyto": "L646x51jF8", "signatures": ["ICLR.cc/2026/Conference/Submission9872/Reviewer_ZAtE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9872/Reviewer_ZAtE"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9872/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762216299403, "cdate": 1762216299403, "tmdate": 1762921341948, "mdate": 1762921341948, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this paper, the authors argue that \"gossip\" or public reflection over pair-wise agentic interactions can enable cooperation in indirect reciprocity games. The authors define three different monitoring structures for reciprocity games and theoretical justifications for how without public monitoring, the equilibrium is to defect. However, with gossip, they claim that there exists an equilibrium where cooperation is sustained. Their experiments compare chat and reasoning models in their ALIGN framework, which enables gossip. Reasoning models without gossip will usually never tend to cooperate while chat models still do. Their analysis shows how ALIGN agents achieve higher average discounted returns to non-gossiping agents."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper is well-written. The propositions are easy to follow, the setup of the method/experiments is extremely clear, and the figures are very well done. I think figure 6 could be made larger, but it clearly shows that across models, ALIGN tends to achieve higher discounted returns.\n\n2. The experiments are rigorous in their testing of multiple different open/close source models and chat vs reasoning variants.\n\n3. The paper is well-motivated in that communication between agents as necessary in multi-agent natural language settings is still a big question. Previous works from the last decade, like CommNet, TarMac, InfoPG, others have shown that communication is crucial in mixed-competitive-cooperative settings; this work extends to a setting where agents are communicating/acting with natural language."}, "weaknesses": {"value": "Limited Domain - While I find indirect reciprocity games to be an interesting testbed for granularly testing the authors' ideas about gossip, it seems limited given the vast amount of work on mixed competitive-cooperative games. There exist more challenging games, such as Starcraft or Sequential Social Dilemmas (https://arxiv.org/abs/1810.08647), that test cooperation strategies amongst agents in much more complex environments. I am curious as to how the authors would compare and contrast their work to existing literature about multi-agent cooperation. Can their work be extended to more complex settings?"}, "questions": {"value": "1. With a centralized message board, is the setting still fully decentralized? - In Dec POMDP settings, generally agents are only allowed to communicate with neighbors, not the entire population. Is argument for decentralization that the agents are *acting* independently, and that the message board is from a limited set of pair-wise interactions?\n\n2. How does your work compare to the work on Diplomacy?\n- https://www.nature.com/articles/s41467-022-34473-5\n\n3. How would ALIGN extend to settings where donors are allowed to lie about what they did? In realistic settings there may be no source-of-truth as to what an agent's true actions are, especially in situations where there are mixed competitive and cooperative objectives."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "TQUfsJlw8Z", "forum": "L646x51jF8", "replyto": "L646x51jF8", "signatures": ["ICLR.cc/2026/Conference/Submission9872/Reviewer_UCuy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9872/Reviewer_UCuy"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission9872/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762365804501, "cdate": 1762365804501, "tmdate": 1762921341694, "mdate": 1762921341694, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}