{"id": "LH7tyc5HgI", "number": 8870, "cdate": 1758100504751, "mdate": 1759897757984, "content": {"title": "GT-MSMW: A Graph Transformer Framework for Multi-step Prediction of Time-domain Maxwell’s Equations", "abstract": "Spatiotemporal modeling of electromagnetic fields governed by time-domain Maxwell's equations is essential for simulating and understanding wave propagation and scattering phenomena. However, accurate long-term predictions remains challenging due to the stringent numerical stability requirements and high computational costs inherent in traditional numerical algorithms. We propose **GT-MSMW**, a specialized framework built upon the finite-difference time-domain (FDTD) method, which integrates graph neural networks (GNNs) with a residual Transformer to enable efficient and accurate multi-step forecasting of time-domain Maxwell’s equation solutions for the first time. Unlike previous neural methods that rely on step-by-step autoregressive propagation, **GT-MSMW** directly maps the initial field distribution to the desired state, thus mitigating cumulative errors. To ensure both accuracy and flexibility, the proposed model uses unstructured mesh discretization, GNNs to capture dominant spatial interactions, and the Transformer to model remaining long-range dependencies. Extensive experiments across various 2D and 3D electromagnetic scattering scenarios demonstrate that **GT-MSMW** achieves superior accuracy and generalization, offering a powerful data-driven solver for Maxwell-based simulations.", "tldr": "", "keywords": ["Graph Transformer; Time-domain Maxwell’s Equations; Multi-step Prediction; EGAT"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/f4666a4f408bb04c7d7b161e4d8e393e9e4e7f3c.pdf", "supplementary_material": "/attachment/62256775ce4d5d6760420431dada93df8db1b98f.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes GT-MSMW, a hybrid Graph Transformer framework for multi-step prediction of time-domain Maxwell’s equations. Built upon the FDTD scheme, it uses an Edge-featured Graph Attention Network (EGAT) to model local interactions and a residual Transformer to capture long-range dependencies. The authors test the method on 2D TM polarization and 3D electromagnetic scattering problems, all within rectangular domains generated by Meep. Results show improved MSE and relative error compared with several baselines such as GCN, GAT, MeshGraphNet, GEO-FNO, and DeepONet."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is clearly written and technically consistent with standard FDTD formulations.\n\n- It provides a reasonably complete description of the model architecture, dataset generation, and training setup.\n\n- Combining GNNs with Transformers for spatiotemporal PDE modeling is a relevant and timely topic."}, "weaknesses": {"value": "- Lack of motivation for GNN usage: All experiments are conducted on rectangular domains with regular grids. The claimed benefit of GNNs—flexible representation of irregular or unstructured meshes—is not demonstrated. Under the current setup, the model would behave equivalently to a CNN or Transformer, raising doubts about the necessity of GNN components. The authors should include experiments on irregular or complex geometries (e.g., curved or multi-domain interfaces) to justify why a GNN-based formulation is actually needed.\n\n\n\n- Unclear advantage over numerical solvers: The paper does not provide any analysis or comparison against standard FDTD or other numerical solvers. There are no results regarding accuracy and computational cost, leaving it unclear why one should use this method instead of conventional solvers.\n\n- Limited and weak experimental scope: The experiments are restricted to very simple cases. More challenging setups involving high-frequency waves, multi-interface media, or nonlinear systems (e.g., Kerr-type materials) should be included to demonstrate the method’s robustness.\n\n- Outdated and inappropriate baselines: The baselines (GCN, GAT, vanilla PINN, GEO-FNO) are mostly outdated or not directly comparable. In particular, GEO-FNO targets operator learning on general geometries, not direct time-domain evolution. In particular, PINN has evolved substantially in recent years, with numerous improved variants addressing convergence, robustness, and accuracy. Comparing only against the plain PINN version is therefore not appropriate and fails to reflect the current state of the field. Moreover, GEO-FNO targets operator learning on general geometries, not direct time-domain evolution. Comparisons with modern PINNs and operator networks are missing.\n\n- Lack of generalization and broader applicability: It is unclear whether the proposed method can handle nonlinear PDEs such as Navier–Stokes equations or Euler equations. The framework seems tightly coupled with the FDTD discretization, limiting its extensibility beyond Maxwell’s equations."}, "questions": {"value": "Please refer to the detailed points listed in the Weaknesses section above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "U5UEa4qBX3", "forum": "LH7tyc5HgI", "replyto": "LH7tyc5HgI", "signatures": ["ICLR.cc/2026/Conference/Submission8870/Reviewer_9mJW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8870/Reviewer_9mJW"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761828354806, "cdate": 1761828354806, "tmdate": 1762920632103, "mdate": 1762920632103, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors apply graph transformer architecture to design a surrogate electromagnetic solver in 2D and 3D. They check its performance for different initial values and heterogeneous materials."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "-\tFairly large-scale modelling examples considered.\n-\tThe paper is easy to follow yet technical enough, good text structuring.\n-\tMany baselines tested."}, "weaknesses": {"value": "-\tThe authors use data from FD modelling on a square grid and then interpolate it onto a triangular grid. How exactly E- and H-fields are interpolated? Anyways, this evidently ruins the conservation properties, which are div (\\eps dE/dt + \\sigma E) = 0 and div (\\mu dH/dt + \\sigma_m H) = 0.   Consider adding illustrations on how well those properties hold for predicted fields.\n-\t“Magnetic conductivity” is not a standard term of general physics. Consider adding a reference to help the reader. \n-\tFig. 4 shows that the absolute error reaches 5-8%. Many readers may not be happy with this accuracy. What could be done to receive more accurate predictions with the proposed architecture? Speaking more broadly, the paper misses a discussion on how prediction accuracy is controlled.  \n-\tFig 6. Consider plotting losses in the log scale\n-\tTable 2. Consider adding inference time and memory demands (at least for the 3D test case) to the table. Compare them with the respective parameters of standard FDTD modelling.\n-\t“The corresponding comparison results and temporal evolution behavior are presented in Appendix C.4.”. There is no such an appendix."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "RlrpkB26AS", "forum": "LH7tyc5HgI", "replyto": "LH7tyc5HgI", "signatures": ["ICLR.cc/2026/Conference/Submission8870/Reviewer_LVs1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8870/Reviewer_LVs1"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761948552064, "cdate": 1761948552064, "tmdate": 1762920631671, "mdate": 1762920631671, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces GT-MSMW, a hybrid Graph Transformer framework for multi-step prediction of time dependent Maxwell’s equations solution. The proposed framework integrates Edge-Featured Graph Attention Networks (EGATs) with Transformer blocks, enabling direct prediction of the electromagnetic field at an arbitrary time step which can be better than step-by-step autoregressive propagation.\nThe method uses the finite-difference time-domain (FDTD) inspired triangular (2D) and tetrahedral (3D) meshes. Experiments on multiple electromagnetic scattering scenarios demonstrate better accuracy compared to some alternatives.\n\nHowever the paper has serious flaws and main of them is its impractical formulation. In the proposed setup in every dataset all the samples have their evolution divided to 8:1:1 train, validation and test intervals. So the solution probably won't be generalisable to unseen samples and the prediction time is only 10-20% in addition to calculated train interval, so, considering the training time, it won't be an improvement at all"}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "* probably novel architecture combining local and global interactions\n* interesting domain of study\n* grids inspired by FDTD\n* ablation studies\n* 3D extension"}, "weaknesses": {"value": "* the impractical problem setup (no generalisation on new samples)\n* competing models may be trained not optimally\n* much space dedicated to all the formulas for FDTD method, however I don't feel it appropriate (it was not used in the designed model)\n* the literature sometimes is cited too unselectively (too many papers in a row without differentiation between them, lines 046 or 161-162 \n* no stds of obtained metrics calculated"}, "questions": {"value": "* What is practical scenario of using your model? Which improvements over using FDTD scheme it will provide?\n* Did you use PDE loss for training PINNs? I didn't see it in Table 3.\n* What are computational expenses to train and run your model compared to numerical simulation?\n* How did you use your validation dataset?\n* Do you control overfitting?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "D3MuuGEWxF", "forum": "LH7tyc5HgI", "replyto": "LH7tyc5HgI", "signatures": ["ICLR.cc/2026/Conference/Submission8870/Reviewer_2Qcp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8870/Reviewer_2Qcp"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761954030085, "cdate": 1761954030085, "tmdate": 1762920631314, "mdate": 1762920631314, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents a framework that combines GNNs with transformer and FDTD for multi-step prediction of Time-domain Maxwell's Equations."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "Unlike many recent works, the paper attempts to solve 3D problem."}, "weaknesses": {"value": "Despite the fact that the paper attempts to illustrate a 3D problem, the paper is incremental. It combines FDTD with GNN and Transformer. FDTD, within Deep learning, is not new (as also cited by the author(s)).\n\nThe paper do have a strong case study and this reviewer feels it better fits as a journal article (Where the application will take the front seat) as opposed to ICLR where learning is supposed to be of primary interest.\n\nThe benchmarking should have included GraphFormer. Also, there are other graph based neural operators such as GNO, GINO, Sp2GNO. These were ignored in the paper and in the comparison section."}, "questions": {"value": "How was the computational time during inference? I missed any mention of this. I presume inference will be expensive because of the presence of FDTD."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "of7wJvC98p", "forum": "LH7tyc5HgI", "replyto": "LH7tyc5HgI", "signatures": ["ICLR.cc/2026/Conference/Submission8870/Reviewer_ySz5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8870/Reviewer_ySz5"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761967357241, "cdate": 1761967357241, "tmdate": 1762920630957, "mdate": 1762920630957, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}