{"id": "LHOLT4Kruf", "number": 20205, "cdate": 1758303664017, "mdate": 1763054026920, "content": {"title": "Structurally-aware Genetic Algorithm for Vaccine Development", "abstract": "While vaccines are a staple of modern medicine, the development of new vaccines may require decades and billions of dollars. AI-powered protein design has led to a number of promising tools to accelerate this process. Among those, genetic algorithms (GA) specialized for antigen engineering have been used to triage a large number of designs in early steps of the vaccine development process. However, existing approaches typically treat the design process as a simple string optimization problem (representing amino acid sequences), without considering the three-dimensional structure which influences protein function and interactions in real biological systems. A family of structure-aware GAs is proposed that explicitly incorporate protein structural information into evolutionary operators. Rather than exchanging arbitrary sequence segments, amino acids are partitioned into functionally meaningful groups based on structural relationships. The methods are evaluated in silico with a real SARS-CoV-2 spike protein optimization problem, and significant improvements over the traditional GA approach are shown both in performance of found designs and diversity. The results demonstrate that incorporating structural knowledge into evolutionary search can provide solid gains in exploring the design space in early steps of computational vaccine design.", "tldr": "", "keywords": ["Structurally-inspired genetic algorithms", "Vaccines development"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/55d0f5aeaa5d035c8a4993002752a65bc1886559.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces a genetic-algorithm (GA) based framework for protein optimisation utilising additional structural information to guide the evolutionary search."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- Application of GA with structural constraints is interesting, ablation results demonstrating usefulness of structural information is certainly valid, however not very surprising taking into the account the sequence-structure-function relationships resulting from each other in a cascaded fashion."}, "weaknesses": {"value": "- The paper focuses lots of technicalities around GA and proposed variations of GAs that are rather simple and could be shortened / moved to appendix.\n- In exchange, I believe readers would endorse much more the more thorough benchmarking which now is vrey scarce (one test case). See below for some suggestions."}, "questions": {"value": "- Why only variants of GA algorithm are discussed? There are several design methods that are capable of solving this task (a whole panel of sequence / protein language model and structure-based design methods).\n- Why only 1 test case?\n- ProteinMPNN is used as fitness estimator, this is OK (although it’s worth noting that it’s a noisy and rather weak proxy) but I’d expect a orthogonal validation of generated designs - I’d recommend using folding models as a proxy for verification whether the introduced changes did not affect structural integrity."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "U4WQ36jqSd", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Reviewer_11nG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20205/Reviewer_11nG"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761764506361, "cdate": 1761764506361, "tmdate": 1762933706183, "mdate": 1762933706183, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We would like to clarify that we did NOT made use of LLMs to generate text for the paper.\n\nGiven all reviewers set negative grades there is no reason to continue in the discussion period for this paper, we thank the reviewers for the time invested in the paper and will work in the improvements suggested."}}, "id": "uidDuCEad4", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763054025990, "cdate": 1763054025990, "tmdate": 1763054025990, "mdate": 1763054025990, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In the paper \"STRUCTURALLY-AWARE GENETIC ALGORITHM FOR VACCINE DEVELOPMENT\", the authors proposed three methods for partition protein 3d structures into groups, and operate based on structural groups with genetic algorithms to design the best antigen that might work as antigen, and showing that adding structural-aware tokens significantly improves generated antigen property via in silico docking experiments."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The paper logic is clear and well written."}, "weaknesses": {"value": "1.The paper is an undergraduate course project level project, and revised by language models  -- or even directly generated by LLMs. \n\n2. The experiments is limited, and the results is not convincing. Only using proteinMPNN as fitness proxy is far from enough. One can easily hack proteinMPNN and generate targets that are far more better than that of the so-called \"Structure-aware\" tokens. The main results are fundamentally flawed.\n\n3. Lack of discussion and citations for latest progress for vaccine design."}, "questions": {"value": "See weakness above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "JMdFwanUTk", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Reviewer_jdmJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20205/Reviewer_jdmJ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761791800843, "cdate": 1761791800843, "tmdate": 1762933705719, "mdate": 1762933705719, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"comment": {"value": "We would like to clarify that we did NOT made use of LLMs to generate text for the paper.\n\nGiven all reviewers set negative grades there is no reason to continue in the discussion period for this paper, we thank the reviewers for the time invested in the paper and will work in the improvements suggested."}}, "id": "D64UTVbfoa", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20205/Authors"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763054006836, "cdate": 1763054006836, "tmdate": 1763054006836, "mdate": 1763054006836, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This manuscript proposes a set of structure-aware crossover operators for genetic algorithms applied to protein antigen design. Standard genetic algorithms treat proteins as 1-D amino-acid sequences and exchange contiguous sequence segments during crossover, which often disrupts structural motifs that are only meaningful in three-dimensional space. The authors introduce three alternative grouping strategies that cluster residues based on their 3D coordinates: (1) planar separation via principal component axes, (2) K-means spatial clustering, and (3) density-based grouping using DBSCAN. These groups replace naive sequence segmentation for crossover and are periodically recomputed during evolution. Experiments using ProteinMPNN scoring demonstrate that structure-aware crossover improves best-of-population fitness, average fitness of top-ranked candidates, convergence stability, and diversity relative to baseline sequence-based GA. The observed improvements suggest that respecting spatial neighborhoods preserves relevant functional residue interactions and accelerates search for promising antigen variants."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "A key strength of the work is the intuitive and biologically motivated insight that proteins operate in three dimensions, and genetic search operators should reflect that reality. The authors present simple yet effective grouping heuristics that require no manual annotation and can be computed efficiently from coordinates such as AlphaFold structures. The improvements are consistent across metrics indicating that the benefit is not due to stochastic noise. The ablation studies, which explore update frequency, number of partitions, and clustering sensitivity, add credibility and demonstrate thoughtful analysis. Visualization of sequence logos provides useful qualitative evidence that structure-aware crossover preserves region-specific selection pressure. Overall, the method is easy to implement, computationally lightweight, and compatible with existing protein design pipelines, making it appealing to practitioners."}, "weaknesses": {"value": "One limitation of the study is that evaluation focuses on a single antibody–antigen system, leaving open questions about generalizability across different folds, affinities, or surface chemistries. The paper does not benchmark against more advanced evolutionary operators from computational protein design (e.g., structure-based mutation neighborhoods, fragment libraries, or Rosetta-guided recombination), making it unclear how large the gain is relative to those baselines. Structural grouping changes are driven only by residue coordinates; incorporation of energetic contacts, solvent accessibility, or epitope constraints may further improve realism but are not examined. Although the method improves sequence fitness under ProteinMPNN, no external validation (e.g., molecular dynamics stability, binding energy prediction, or experimental plausibility filters) is included. Finally, the manuscript does not quantify the diversity–fitness trade-off in depth, which is critical in exploratory vaccine design."}, "questions": {"value": "1. Have the authors evaluated this crossover strategy on proteins with very different architectures (e.g., β-barrels, membrane proteins)? Do improvements persist?\n2. Would incorporating contact maps, hydrogen bonding networks, or solvent exposure into grouping further increase performance?\n3. Can the method optimize designs simultaneously for several neutralizing antibodies, and if so, how do grouping strategies behave when epitope requirements conflict?\n4. How does structure-aware crossover affect population diversity over long runs? Is there increased risk of premature convergence?\n5. What is the computational overhead associated with periodic regrouping and clustering in large proteins (e.g., >800 residues)?\n6. Does grouping implicitly bias crossover toward swapping entire domains rather than interdomain interfaces, and is this desirable?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "os2L8jju1a", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Reviewer_k6vQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20205/Reviewer_k6vQ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761906473285, "cdate": 1761906473285, "tmdate": 1762933705223, "mdate": 1762933705223, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes structurally-aware genetic algorithms (GAs) for sequence optimization in protein design tasks. Instead of performing crossover operations directly on amino acid sequences, the authors introduce grouping mechanisms based on the 3D folded structure of the target protein. Three variants are described: Planar GA that uses PCA-based planar cuts to define residue groups, Spatial GA that employs K-means clustering in 3D space, and Density GA that utilizes DBSCAN to identify residue clusters of arbitrary shapes."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The idea of integrating protein structural information into genetic operators is conceptually appealing and addresses a known limitation of sequence-only search spaces.\n2. The experiment simulates a realistic early-phase in silico vaccine design workflow. \n3. The formulations for PCA-, K-means-, and DBSCAN-based grouping are clearly described. The stepwise integration into GA operations is clear."}, "weaknesses": {"value": "1. The approach largely combines off-the-shelf clustering methods with standard GA operators. The “structurally-aware” adaptation does not introduce fundamentally new mechanisms or theoretical insights into evolutionary computation.\n2. Only a single protein system (SARS-CoV-2 RBD) is tested. No cross-domain or multi-target evaluation is provided to assess generalizability. \n3. There is no comparison with state-of-the-art protein design algorithms.\n4. The paper employs ProteinMPNN scores as a proxy for in silico affinity estimation, computing the negative log-likelihood of designed mutations conditioned on the wild-type structure. However, this assumption is neither theoretically justified nor empirically supported by the literature in this paper.\n5. The work claims structural coherence and functional grouping, but provides no visualization (e.g., residue maps, cluster overlays) or biological interpretation."}, "questions": {"value": "1. How does ProteinMPNN score correlate with experimentally measured binding affinity?\n2. Have you tested the algorithms on other antigen-antibody complexes or different protein classes?\n3. Can the authors visualize or quantify whether identified residue groups correspond to known functional domains or interface regions?\n4. How much improvement comes from group-based crossover versus random grouping or increased mutation rates?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8NZeTOld3t", "forum": "LHOLT4Kruf", "replyto": "LHOLT4Kruf", "signatures": ["ICLR.cc/2026/Conference/Submission20205/Reviewer_D8ta"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20205/Reviewer_D8ta"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762099723992, "cdate": 1762099723992, "tmdate": 1762933704315, "mdate": 1762933704315, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}