{"id": "liDUSnwUVP", "number": 14697, "cdate": 1758241949045, "mdate": 1759897354458, "content": {"title": "HG-DCM: History Guided Deep Compartmental Model for Early Stage Pandemic Forecasting", "abstract": "We introduce the History-Guided Deep Compartmental Model (HG-DCM), a novel framework for early-stage pandemic forecasting that synergizes deep learning with compartmental modeling to harness the strengths of both interpretability and predictive capacity. HG-DCM employs a Residual Convolutional Neural Network (CNN) to learn temporal patterns from historical and current pandemic data while incorporating epidemiological and demographic metadata to infer interpretable parameters for a compartmental model to forecast future pandemic growth. Experimental results on early-stage COVID-19 forecasting tasks demonstrate that HG-DCM outperforms both standard compartmental models (e.g., DELPHI) and standalone deep neural networks (e.g., CNN) in predictive accuracy and stability, particularly with limited data. By effectively integrating historical pandemic insights, HG-DCM offers a scalable approach for interpretable and accurate forecasting, laying the groundwork for future real-time pandemic modeling applications.", "tldr": "We introduce HG-DCM, a history-guided deep compartmental model that integrates neural networks with epidemiological modeling to deliver interpretable and more accurate early-stage pandemic forecasts.", "keywords": ["Pandemic Forecasting", "Time-Series Forecasting", "Deep Compartmental Modeling", "Explainable AI", "Epidemiological Modeling"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/9bbe36a1f84c25caa99b85a67e6c657eb8a81cf9.pdf", "supplementary_material": "/attachment/7a86c33b0539b51cce324ab6437a9167cf530a7c.pdf"}, "replies": [{"content": {"summary": {"value": "The paper proposes a technique for forecasting the early stages of pandemics. The approach is based on residual CNNs. The paper claim that the proposed approach outperforms both traditional compartmental models and CNNs in the accuracy of predictions with limited data."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "* Improving the prediction of pandemics is a worthy goal."}, "weaknesses": {"value": "* The literature review section of the paper is very limited. The scale and impact of the COVID pandemic was so large that many thousands of papers were published, effectively trying every single technology available. Resnet being a very popular model, it was used in many papers. The combination of deep learning with compartmental models was also one of the most popular (and natural) techniques for prediction.\n* As a result of the previous weakness, the paper does not clarify what is the novel contribution in this extensively explored subject.\n* The paper does not explain the choice of the residual CNNs, versus other CNN techniques, or newer techniques such as attention models, diffusion models, LLMs etc."}, "questions": {"value": "* Please see weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "No ethics concerns."}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "9VCWz7rb0T", "forum": "liDUSnwUVP", "replyto": "liDUSnwUVP", "signatures": ["ICLR.cc/2026/Conference/Submission14697/Reviewer_jSKX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14697/Reviewer_jSKX"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14697/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761959305491, "cdate": 1761959305491, "tmdate": 1762925063072, "mdate": 1762925063072, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a framework where the neural network predicts parameters of a compartmental epidemiological model. The neural network learns from historical data on epidemics, and the authors test the trained neural network during the early stages of the COVID-19 pandemic."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "Early-stage pandemic forecasting is a critical and under-explored challenge where data scarcity is the norm.\n\nThe method is sound, and the results show it is promising."}, "weaknesses": {"value": "The central idea of using neural networks to predict the parameters of a compartmental model is promising, but it is not novel. The authors appear to be unaware of a substantial body of prior work in this area, as the main methodological contribution of the paper has already been proposed in earlier studies, particularly in [1] and [2], and in a slightly different form in [3]. Related extensions have even been explored in the context of agent-based modeling (e.g., [4]). The paper’s contribution largely centers on this existing technical idea, with the additional element that the neural network learns from data across multiple diseases. While this cross-disease transfer concept is interesting, it does not constitute a technical innovation. I would recommend that the authors consider submitting this work to an epidemiological or applied modeling venue, where the empirical findings and early-pandemic insights would be more appreciated. To strengthen the experimental analysis, the paper should also compare its approach with alternative methods for calibrating compartmental models, such as approximate Bayesian calibration. Additionally, I suggest exploring other compartmental models to showcase the generalizability of the approach. Overall, I do not find the current level of technical contribution sufficient for publication at a leading AI/ML venue such as ICLR.\n\n[1] Arik, S., Li, C.L., Yoon, J., Sinha, R., Epshteyn, A., Le, L., Menon, V., Singh, S., Zhang, L., Nikoltchev, M. and Sonthalia, Y., 2020. Interpretable sequence learning for COVID-19 forecasting. Advances in neural information processing systems, 33, pp.18807-18818.\n\n[2] Arık, S.Ö., Shor, J., Sinha, R., Yoon, J., Ledsam, J.R., Le, L.T., Dusenberry, M.W., Yoder, N.C., Popendorf, K., Epshteyn, A. and Euphrosine, J., 2021. A prospective evaluation of AI-augmented epidemiology to forecast COVID-19 in the USA and Japan. NPJ digital medicine, 4(1), p.146.\n\n[3] Qian, Z., Alaa, A.M. and van der Schaar, M., 2020. When and how to lift the lockdown? global covid-19 scenario analysis and policy assessment using compartmental gaussian processes. Advances in neural information processing systems, 33, pp.10729-10740.\n\n[4] Chopra, A., Rodríguez, A., Subramanian, J., Quera-Bofarull, A., Krishnamurthy, B., Prakash, B.A. and Raskar, R., 2023, May. Differentiable Agent-based Epidemiology. In Proceedings of the 2023 International Conference on Autonomous Agents and Multiagent Systems (pp. 1848-1857)."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ZYUKaYGnDy", "forum": "liDUSnwUVP", "replyto": "liDUSnwUVP", "signatures": ["ICLR.cc/2026/Conference/Submission14697/Reviewer_dwys"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14697/Reviewer_dwys"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14697/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762028187615, "cdate": 1762028187615, "tmdate": 1762925062418, "mdate": 1762925062418, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose a model that combines a CNN with a deep compartmental model for early-stage pandemic forecasting. The CNN outputs interpretable parameters (e.g., transmission rates) that drive the compartmental ODEs. They use historical pandemic data with metadata to guide parameter inference and claim superior early-stage forecasting."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "· The T-DCM ablation (HG-DCM without historical data/metadata) clearly shows performance degradation, providing strong empirical evidence that integrating historical pandemic signals improves early-stage forecasting stability and accuracy.\n\n· The authors compiled a novel dataset spanning six major outbreaks since 1990 (COVID-19, Ebola, SARS, Dengue, Monkeypox, seasonal influenza) across 258 global locations, including country-level development indicators and epidemiological metadata (e.g., transmission pathways). This is a valuable community resource."}, "weaknesses": {"value": "· This work lacks any rigorous theory or mathematical notations for the explanation of the overall model and simply seems to be an incremental work that simply fuses a CNN with DELPHI. The authors need to distinguish between the contributions they make here. Table 1 seems to just be an ablation study.\n\n· The authors claim that the COVID-19 Forecasting hub models “lack publicly available, reproducible codebase, and the shared forecasting outputs do not include early-stage results”. This is false as all the forecasting has been made publicly available since the early stage of the pandemic. Please see https://github.com/epiforecasts/covid-us-forecasts . Unfortunately the authors use none of these models as baselines. Talking about early stage forecasting, there are also works[1,2,3] that are deep-learning based and also incorporate physics. \n\n\n· The motivation that prior pandemics are equally important to make predictions in a new pandemic is a bizarre assumption by any means. I am not sure why the Dengue Fever outbreak dynamics will be useful for predicting the COVID pandemic.\n\n· Coming to the details of the methods, there are some critical issues that drew my concern:\n\no You define \"Last Day of Augmentation (LDoA)\" using the peak of the first wave → future knowledge, which seems to be data leakage.\n\no ResNet-50 on 1D time series ignores temporal dynamics and risks over-fitting.\n\n· There are no SOTA comparisons like EpiFNP [4], DeepGLEAM [5], or NeuralODE [6].\n\n· Predictions do not have uncertainty estimates. Are multiple runs not done for Table 1?\n\n· No code provided, so I have reproducibility concerns. \n\n[1] Rodriguez, Alexander, et al. \"Deepcovid: An operational deep learning-driven framework for explainable real-time covid-19 forecasting.\" Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 35. No. 17. 2021.\n\n[2] Rodríguez, Alexander, et al. \"Einns: epidemiologically-informed neural networks.\" Proceedings of the AAAI conference on artificial intelligence. Vol. 37. No. 12. 2023.\n\n[3] Motavali, Amirhossein, et al. \"DSA-BEATS: dual self-attention N-BEATS Model for forecasting COVID-19 hospitalization.\" IEEE Access 11 (2023): 137352-137365.\n\n[4] Kamarthi, Harshavardhan, et al. \"When in doubt: Neural non-parametric uncertainty quantification for epidemic forecasting.\" Advances in Neural Information Processing Systems 34 (2021): 19796-19807.\n\n[5] Wu, Dongxia, et al. \"DeepGLEAM: a hybrid mechanistic and deep learning model for COVID-19 forecasting.\" arXiv preprint arXiv:2102.06684 (2021).\n\n[6] Kosma, Chrysoula, et al. \"Neural ordinary differential equations for modeling epidemic spreading.\" Transactions on Machine Learning Research (2023)."}, "questions": {"value": "Please address the weaknesses listed above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "qWvK96Fgzt", "forum": "liDUSnwUVP", "replyto": "liDUSnwUVP", "signatures": ["ICLR.cc/2026/Conference/Submission14697/Reviewer_i73x"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14697/Reviewer_i73x"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14697/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762040281416, "cdate": 1762040281416, "tmdate": 1762925061864, "mdate": 1762925061864, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}