{"id": "liVX9If9k2", "number": 23961, "cdate": 1758350896883, "mdate": 1759896788979, "content": {"title": "Multimodal Datasets with Controllable Mutual Information", "abstract": "We introduce a framework for generating highly multimodal datasets with explicitly calculable mutual information between modalities. This enables the construction of benchmark datasets that provide a novel testbed for systematic studies of mutual information estimators and multimodal self-supervised learning techniques. Our framework constructs realistic datasets with known mutual information using a flow-based generative model and a structured causal framework for generating correlated latent variables.", "tldr": "We introduce a framework for generating highly multimodal datasets with explicitly calculable mutual information between modalities.", "keywords": ["Flow Matching", "Mutual Information", "Directed Acyclic Graphs", "Synthetic Data"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/9694544767887ccc2e17b1c8a25792aef75f5723.pdf", "supplementary_material": "/attachment/6cf5c3403fd88cbcd17224b7be3a6e35433c0690.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces a framework for generating multimodal datasets where the mutual information between modalities is measurable and controllable. This is useful for lots of works which study the mutual information between modalities and labels in multimodal training dynamics."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The framework for generating controllable mutual information seems correct and insightful.\n- There are a lot of important use cases for this: so many multimodal works look at training based on mutual information. Having it controlled synthetically would be a powerful and useful testbed for that research, and could lead to an important breakthrough in that field."}, "weaknesses": {"value": "Unfortunately, I don't think this paper did quite enough to justify that this framework could be used for the strengths I outlined above. A few key points:\n- What is the practical utility of this work? You could for example show that your dataset provides training transfer to realistic environments with mutual information-dependent training methods. But without that, how do we know the value of the data you generate with your method? \n- If there isn't transfer of performance or key insights from training, what insights can you get by studying models on this dataset, and will those insights transfer to models' behavior on real world datasets? If so, this could be a useful prototyping tool that allows people to run and understand experiments theoretically before doing computationally expensive and confusing training runs on messy real world data. For example, can you show that some findings from prior work are mirrored in your setting, and can be ascertained quickly and reliably, whereas training on a full real world dataset would be costly and noisy?"}, "questions": {"value": "- How would you simulate handle modality imbalances? Where some data have missing modalities or you have large amounts of unimodal data.\n- I didn't understand the black hole example. Could you clarify the motivation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "olHvB2LLRg", "forum": "liVX9If9k2", "replyto": "liVX9If9k2", "signatures": ["ICLR.cc/2026/Conference/Submission23961/Reviewer_RwuG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23961/Reviewer_RwuG"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission23961/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761340945738, "cdate": 1761340945738, "tmdate": 1762942871482, "mdate": 1762942871482, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a framework for generating synthetic data with controlled mutual information using flow-based generative models and a structured casual framework. The illustration of the data generation pipeline is followed by two brief discussions of the example usage in generating synthetic data for different underlying causal structures and scales of modalities."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is well-motivated, as there has been an emerging interests in multimodal learning from an information-theoretic approach, and this paper provides a well-suited, controlled testbed for such types of research;\n- The proposed data generation pipeline is novel, well-documented and clearly explained;"}, "weaknesses": {"value": "- One major limitation of this work is the lack of empirical evaluation, neither qualitative evaluation (e.g. Figure 2, which the paper also acknowledges that \"there is no clear visual connection between these pairs of images\") nor quantitative evaluation. This makes it **very hard to verify the correctness** of the proposed framework. In particular, the reviewer does not agree with the claim that \"our framework allows us to state unequivocally that these high-dimensional, complex datasets have a specific amount of mutual information\" due to this lack of empirical evidence. The paper also does not give any empirical evaluation using the synthetic data generated from the proposed pipeline, so **the claims about the practical utility is also not testified**."}, "questions": {"value": "- The reviewer strongly recommends adding more empirical evaluation of the proposed pipeline to show (1) the correctness (e.g. either qualitatively or quantitatively verify the generated data are indeed correlated by the given mutual information) and (2) the utility via a minimal set of evaluations of existing information-theoretic multimodal learning approaches on the generated data, followed by analysis on the results and potential insights that can be meaningful towards multimodal learning research from an information-theoretic perspective"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "az8kW6oXEN", "forum": "liVX9If9k2", "replyto": "liVX9If9k2", "signatures": ["ICLR.cc/2026/Conference/Submission23961/Reviewer_Yb4Z"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23961/Reviewer_Yb4Z"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission23961/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761545764008, "cdate": 1761545764008, "tmdate": 1762942871170, "mdate": 1762942871170, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a novel framework for generating high-dimensional multimodal datasets with controllable mutual information. By using flow-based generative models, the method ensures that mutual information between latent variables is preserved, providing a theoretical foundation. The paper also designs a structured causal framework to generate correlated latent variables, derive closed-form analytical formulas for mutual information, and provide examples of synthetic multimodal datasets illustrating different causal and correlation patterns."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper proposes a framework for generating high-dimensional multimodal data with controllable mutual information, which is rarely achieved in existing public datasets or prior methods.\n\n2. By leveraging flow-based generative models, the approach ensures that the generated data preserves mutual information between latent variables, providing a theoretical foundation."}, "weaknesses": {"value": "1. All experiments are conducted solely on CIFAR-10 image data, without demonstrating results on real multimodal datasets (e.g., CMU-MOSI, CMU-MOSEI, or video-text-audio combinations).\n\n2. The paper does not evaluate the generated data on downstream tasks (e.g., regression or classification), making it difficult to quantitatively assess its contribution. It also lacks direct comparison with existing mutual information estimators or multimodal SSL approaches.\n\n3. Some concepts (e.g., the template and flow matching) are not intuitive to non-expert readers, and overall readability could be improved. Moreover, the paper is limited to 8 pages, whereas the ICLR 2026 initial submission allows up to 9 pages."}, "questions": {"value": "1. How does the generated data impact performance on downstream tasks, such as regression or classification?\n\n2. Could the authors provide a comparison of their approach with existing mutual information estimators or multimodal SSL methods to better contextualize the contributions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "CGCR7rz2O5", "forum": "liVX9If9k2", "replyto": "liVX9If9k2", "signatures": ["ICLR.cc/2026/Conference/Submission23961/Reviewer_LU2w"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23961/Reviewer_LU2w"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission23961/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761587975586, "cdate": 1761587975586, "tmdate": 1762942870825, "mdate": 1762942870825, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a framework for generating synthetic multimodal datasets with explicitly controllable MI between modalities. The method combines causal latent-variable construction with flow-based generative models that preserve MI under bijective mappings. The authors claim this provides a testbed for studying multimodal SSL and benchmarking mutual information estimators."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "Although data generation is not my primary area of expertise, this work appears to address a genuinely underexplored and important problem: constructing realistic high-dimensional multimodal datasets with analytically tractable and controllable mutual information, which could enable systematic evaluation of self-supervised learning methods and mutual information estimators. The theoretical development is simple and clear. The use of flow-based generative models to maintain information structure across high-dimensional modalities is conceptually elegant and technically well-motivated."}, "weaknesses": {"value": "The main limitation of this paper lies in the absence of empirical validation. While the framework is theoretically elegant, the paper does not demonstrate that the generated datasets are practically useful for their intended purposes, such as evaluating self-supervised learning methods or mutual information estimators. The examples provided are purely illustrative and rely on analytic expressions rather than experiments that confirm controllability or MI preservation in practice. Moreover, the claim of producing “realistic multimodal data” is overstated: using CIFAR-10 class-conditioned flows as a proxy for distinct modalities is a weak approximation of genuine multimodality (e.g., image–text, video–audio, etc.), and it remains unclear whether the generated samples exhibit meaningful cross-modal relationships. The reliance on linear-Gaussian causal structures, while analytically convenient, limits the generality of the approach for more complex, nonlinear dependencies in real-world multimodal settings. The paper would also benefit from quantitative experiments comparing analytical MI values with empirical estimates obtained via neural MI estimators to substantiate its proposed utility."}, "questions": {"value": "1. Can you provide empirical evidence that the generated datasets preserve the specified mutual information after flow transformations?\n2. Have you tested any self-supervised learning methods to demonstrate that controllable MI affects downstream performance as intended?\n3. Does your linear-Gaussian setup generalize to nonlinear or non-Gaussian latent dependencies?\n4. How scalable is the framework to higher-dimensional data (e.g. video or time series) or more modalities?\n5. Have you evaluated how well existing mutual information estimators recover the known MI values on your generated datasets?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ST9nK8W0pZ", "forum": "liVX9If9k2", "replyto": "liVX9If9k2", "signatures": ["ICLR.cc/2026/Conference/Submission23961/Reviewer_grni"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23961/Reviewer_grni"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission23961/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761821121144, "cdate": 1761821121144, "tmdate": 1762942870568, "mdate": 1762942870568, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}