{"id": "LxvL6iKzt6", "number": 16870, "cdate": 1758269712312, "mdate": 1763106974239, "content": {"title": "Aligning Reasoning LLMs for Materials Discovery with Physics-aware Rejection Sampling", "abstract": "Closing the experimental loop in materials discovery requires process-aware recipe to property predictors that are accurate, calibrated, and physically admissible. We approach this as a reasoning problem with large reasoning models (LRMs). To instill reasoning capability into language models, we curate reasoning traces from a teacher model to train a student model. However, most training pipelines select reasoning traces using binary correctness or learned preference signals that poorly reflect physical admissibility. We introduce Physics-aware Rejection Sampling (PaRS), a training-time trace selection scheme that favors traces consistent with fundamental physics and numerically close to targets, with lightweight halting to control compute. We instantiate our framework with a large student model fine-tuned on traces synthesized by a larger teacher model, and evaluate under matched token budgets against various rejection sampling baselines. Our method improves accuracy and calibration, reduces physics-violation rates, and lowers sampling cost relative to baselines. These results indicate that modest, domain-aware constraints combined with trace-level selection provide a practical path toward reliable, efficient LRMs for process-aware property prediction and closed-loop materials design.", "tldr": "", "keywords": ["Materials design", "LLM", "Property prediction", "Reasoning model"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/d58f79b4c7f40637d8e6c2eeafaa8f327864a819.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper trains a small reasoning model for materials discovery by using a larger model to generate reasoning traces and then perform physics-aware filtering (PaRS) to select “valid” traces for distillation. Experiments on QD-LED device property prediction show improved MAE and lower violation rates relative to simple rejection sampling baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper is clearly written and the problem of physics-admissible reasoning for materials tasks is practically relevant.\n\nThe evaluation protocol is relatively thorough within the chosen domain (teacher-side + student-side metrics).\n\nPhysics-based rejection constraints are reasonable and give some domain grounding compared with correctness-only filtering."}, "weaknesses": {"value": "Core idea is conceptually straightforward and incremental\nThe pipeline is essentially:\n(big LRM → generate → filter → distill to small LRM).\nThis paradigm already appears widely in reasoning LLM alignment (e.g., rejection sampling + SFT/RFT/RL), and the physics-aware gating here amounts to domain-specific heuristics rather than a new training principle.\n\nTechnical novelty is limited\nThe PaRS mechanism is a direct instantiation of rejection sampling with thresholding; there is no new modeling component, no new learning objective, and no new algorithmic insight beyond domain-informed gating."}, "questions": {"value": "see weakness.\n\nDue to my limited familiarity with materials discovery, I cannot fully assess the domain significance of the claimed contribution beyond the methodology itself."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "OZ7DswnnvF", "forum": "LxvL6iKzt6", "replyto": "LxvL6iKzt6", "signatures": ["ICLR.cc/2026/Conference/Submission16870/Reviewer_oa7n"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16870/Reviewer_oa7n"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761378219494, "cdate": 1761378219494, "tmdate": 1762926896706, "mdate": 1762926896706, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "w87oCSwfwu", "forum": "LxvL6iKzt6", "replyto": "LxvL6iKzt6", "signatures": ["ICLR.cc/2026/Conference/Submission16870/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16870/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763106973509, "cdate": 1763106973509, "tmdate": 1763106973509, "mdate": 1763106973509, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles recipe-to-property prediction for materials discovery by training Large Reasoning Models on QD-LED external quantum efficiency data. The key observation is that existing rejection sampling methods (binary correctness, learned rewards) poorly suit regression tasks with physical constraints. The main contribution is Physics-aware Rejection Sampling (PaRS), which filters teacher-generated reasoning traces using three gates: range validity, continuous error tolerance , and a PLQY-derived physical upper bound. Adaptive halting reduces sampling cost via variance and improvement checks."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Originality: \n Adapting rejection sampling to continuous regression with physics constraints is reasonable. The continuous error tolerance + PLQY bounds combination is novel for LRM training. Adaptive halting based on variance/improvement is a practical addition.\n\n2. Quality:\nSolid experimental design—six baselines with matched token budgets. External LLM-as-judge adds independent evaluation. Ablations across three teacher models show robustness. Analysis of correctness ratio and halting provides practical insights.\n\n3. Clarity:\nWell-written with clear motivation. Problem setup is concrete (Figure 1 recipe example)."}, "weaknesses": {"value": "1. Limited methodological novelty: The workflow is standard teacher-student distillation with hand-crafted filtering rules. The only modification is replacing binary correctness with three domain-specific gates (range + tolerance + PLQY bound).  \n\n2. Missing hyperparameter analysis: Section 4.1 states \"We set εMAE=1, εvar=1 and δimp=1 by analyzing the data distribution\" but provides no sensitivity analysis. These three parameters directly control the gating and halting mechanisms—how robust are results to different choices?  \n\n3. Single-task evaluation: All experiments are on QD-LED EQE prediction. No evidence the approach generalizes to other properties, materials systems, or even other device metrics."}, "questions": {"value": "Can you provide the ablation isolating whether gains come from adaptive sampling versus simply adding physics constraints?\nFor additional questions, please refer to the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "yMCXHynEWp", "forum": "LxvL6iKzt6", "replyto": "LxvL6iKzt6", "signatures": ["ICLR.cc/2026/Conference/Submission16870/Reviewer_9TLb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16870/Reviewer_9TLb"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761674884541, "cdate": 1761674884541, "tmdate": 1762926892333, "mdate": 1762926892333, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces reject sampling fine-tuning (RFT) to material discovery field, which aims to obtain high-quality CoT data. To meet the unique requirements in material discovery process, this paper proposes Physics-aware Gating and Adaptive Halting mechanism to filter low-quality and noisy data, thus finally resulting high-quality training data for material discovery SFT. Experimental results prove the effectiveness of the proposed data collection pipeline."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. This paper successfully adopts RFT method to the material discovery domain.\n2. The introduction of adaptive halting reduces the redundant computation as shown in Table 1.\n3. The writing and structure of this paper are clear and easy to understand."}, "weaknesses": {"value": "1. The novelty of this paper is limited. Essentially the work of this paper is simply adjusting the criteria of RFT from final answer correctness in math domain to EQE prediction in material discovery domain.\n2. The evaluation of PaRS is also limited, which essentially only conduct ablation studies. It will be better to compare PaRS to existing SOTA methods of using LLMs for material discovery."}, "questions": {"value": "See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dAjJqktYAw", "forum": "LxvL6iKzt6", "replyto": "LxvL6iKzt6", "signatures": ["ICLR.cc/2026/Conference/Submission16870/Reviewer_Thre"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16870/Reviewer_Thre"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16870/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761790274088, "cdate": 1761790274088, "tmdate": 1762926891079, "mdate": 1762926891079, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}