{"id": "LyaDw1t74Y", "number": 9844, "cdate": 1758143546351, "mdate": 1759897692326, "content": {"title": "GFLAN: Generative Functional Layouts", "abstract": "Automated floor plan generation lies at the intersection of combinatorial search, geometric constraint satisfaction, and functional design requirements—a confluence that has historically resisted a unified computational treatment. While recent deep learning approaches have improved the state of the art, they often struggle to capture architectural reasoning: the precedence of topological relationships over geometric instantiation, the propagation of functional constraints through adjacency networks, and the emergence of circulation patterns from local connectivity decisions. To address these fundamental challenges, this paper introduces GFLAN, a generative framework that restructures floor plan synthesis through explicit factorization into topological planning and geometric realization. Given a single exterior boundary and a front-door location, our approach departs from direct pixel-to-pixel or wall-tracing generation in favor of a principled two-stage decomposition. Stage A employs a specialized convolutional architecture with dual encoders—separating invariant spatial context from evolving layout state—to sequentially allocate room centroids within the building envelope via discrete probability maps over feasible placements. Stage B constructs a heterogeneous graph linking room nodes to boundary vertices, then applies a Transformer-augmented graph neural network (GNN) that jointly regresses room boundaries.", "tldr": "GFLAN is a robust and efficient two stage generative pipeline that allows the creation of functional designs from minimalistic architectural sketches.", "keywords": ["floor plan generation", "generative modeling", "graph neural networks", "architecture"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/7e49dc5d114bd327f22ca0d0142a6706b5dc507c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces GFLAN, a generative model for automated floor plan synthesis. Its primary contribution is a two-stage decomposition that separates topological planning (Stage A) from geometric realization (Stage B), a process designed to better align with architectural reasoning.\nGiven an envelope, entrance, and room counts, Stage A uses a dual-encoder convolutional architecture to sequentially place room centroids by predicting probability heatmaps. Stage B then constructs a heterogeneous graph linking these centroids to the building boundary and employs a Transformer-augmented Graph Neural Network (GNN) to regress the final rectangular room boundaries. When evaluated against baselines like Graph2Plan and WallPlan, GFLAN is shown to produce functionally superior layouts with fewer adjacency violations and higher rates of usability and connectivity. The framework also demonstrates the ability to generate diverse, valid layout options.\n\nMain Contributions:\n1)\tA topology-then-geometry factorization for floor-plan generation.\n2)\tA dual-encoder CNN for sequential centroid placement plus a Transformer-augmented GNN on a room–boundary graph for rectangle regression.\n3)\tA functional evaluation showing improved connectivity, adjacency satisfaction, and size balance, with analyses of efficiency and diversity."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1) A clean topology-then-geometry factorization: sequential room-center heatmaps with a dual-encoder CNN, followed by a TransformerConv GNN on a hybrid room–boundary graph that regresses rectangles with footprint-aware clipping. This design targets adjacency/circulation intent before geometry, reducing failure modes of prior pipelines.\n2) The staged interface is easy to follow and editable: users can adjust/add centers after Stage A and let Stage B realize geometry, which make the model more flexible and practical.\n3) Works from minimal inputs, runs efficiently, and remains robust via bounded graph refinement; supports diversity by sampling multi-peak center heatmaps. These traits make it practical for early-stage design exploration."}, "weaknesses": {"value": "1) The method targets single-story, single-envelope, axis-aligned residential layouts and omits structural/HVAC constraints—reducing external validity for multi-story or non-orthogonal plans and non-residential programs, while mentioned as limitation by authors, but it hinders the practicality of real application.\n2) The model is trained on the ResPlan dataset but evaluated on the RPLAN test set. While the authors frame this as a test of generalization, this cross-dataset evaluation could introduce a domain shift. The magnitude of dataset shift is not quantified, which might affect the reported metrics. A within-dataset evaluation on ResPlan would strengthen the results by providing a clearer baseline.\n3) The claim of producing ‘functional’ layouts lacks validation from architects or end-users. Prior work (e.g., HouseGAN++) included human evaluations; a similar study here would strengthen the claim.\n4) Is it possible to provide sensitivity analysis on parameter values such as temperature?"}, "questions": {"value": "1) Could you discuss how the proposed methods might be extended to more complex, practical settings and what flexibility they offer?\n2) Can you provide sensitivity analysis on parameters such as temperature?\n3) If possible, it would be helpful to include end-user validation of the results, or at least an analysis discussing this dimension and its implications for practical deployment.\n4) Please conduct a within-dataset evaluation to better substantiate the generalization claim and specify the degree to which it holds. In addition, discuss the scope of potential limitations observed in this setting."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "5D778l3aAP", "forum": "LyaDw1t74Y", "replyto": "LyaDw1t74Y", "signatures": ["ICLR.cc/2026/Conference/Submission9844/Reviewer_3AiH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9844/Reviewer_3AiH"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission9844/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761797828322, "cdate": 1761797828322, "tmdate": 1762921319572, "mdate": 1762921319572, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces GFLAN, a two-stage floor-plan generator. It utilizes topology-first placement via dual-encoder CNN, then geometry via Transformer-GNN on a hybrid room–boundary graph. It claims contributions in this structure-first decomposition, and this design improves functional quality and speed over other baselines."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper propose a new factorization considering both topology and geometry, based on hybrid room–boundary graph and boundary-aware clipping. It contributes to the performance of the method.\n\n2. It provides clear and detailed method introduction including detailed architectural description (dual-encoder CNN; TransformerConv GNN) and training schedule\n\n3. The paper improves human-aligned functional criteria and circulation characteristics over SOTA baselines."}, "weaknesses": {"value": "1. The proposed method only compared on very limited metrics (only functionality metrics) to very limited amount of baselines (2 baselines from 2020 and 2022).\n\n2. The sequential generation of the centriod may suffer from the lack of randomness. How do you evaluate it?\n\n3. Why the two stage structure better than the end-to-end other methods (either DM or transformer based). There is lack of discussions. For example, how sensitive is performance to errors in the program-count predictor?"}, "questions": {"value": "1. In general, this paper may not fit the appetite of ICLR but more in favor of SIGGRAPH.\n\n2. The presentation of the figure on comparisons between baselines on page-9 can be significantly improved. For example, you may introduces some simple statistic metrics and summarize all you showed in Fig 5-7 in a small table.\n\n3.  We are looking for more profound comparisons with other baselines regarding quality of the generated floor plans. For example, how does GFLAN compare with recent diffusion-based or transform-based floor-plan generators on the same functional metrics?\n\n4. What are the failure modes (e.g., irregular envelopes, many small rooms), and how often do hard constraints need post-hoc fixes?\n\n5. I would suggest to replace Fig.3. Seems the figure occupies a lot space but does not explain too much compared to the corresponding text part."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "8TrOav7Ky1", "forum": "LyaDw1t74Y", "replyto": "LyaDw1t74Y", "signatures": ["ICLR.cc/2026/Conference/Submission9844/Reviewer_JABu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9844/Reviewer_JABu"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission9844/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761970109985, "cdate": 1761970109985, "tmdate": 1762921319297, "mdate": 1762921319297, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces GFLAN, a two-stage generative framework for floor plan synthesis that explicitly factorizes the design process into topological planning and geometric realization. Stage A predicts room centroids and connectivity, and Stage B uses a Graph Neural Network (GNN) to regress precise, structurally feasible room rectangles. The method is designed to capture architectural reasoning and functional constraints, which are often missed by end-to-end or pixel-based approaches. GFLAN demonstrates improved performance metrics (e.g., connectivity, area matching, and geometric feasibility) on the provided benchmark dataset, showcasing a promising step toward generating functionally valid and diverse floor plans."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. **Principled Two-Stage Decomposition:** The explicit factorization of the problem into topological planning (room centers and adjacency) and geometric realization (precise rectangles) is a significant strength. This approach mirrors human architectural thought and allows for the separate handling of combinatorial complexity (topology) and geometric constraint satisfaction.\n\n2. **Structurally and Functionally Aware Output:** The GNN-based geometric realization stage is designed to ensure structural feasibility and functional constraints (e.g., avoiding trapped rooms). This is a crucial advancement over generative models that often produce geometrically or functionally flawed layouts.\n\n3. **Editable Intermediate Representation:** The model generates room centers (Stage A) as an intermediate step, which can be edited or supplied externally before being fed into the GNN for geometry refinement (Stage B). This provides a flexible and powerful interface for user interaction or integration with other design systems."}, "weaknesses": {"value": "1. **Limited Empirical Validation Scope:** The paper's empirical evaluation is constrained to a single benchmark dataset and comparison against only two key baselines (one being a prior work from the same lab). While the results on this benchmark are strong, the efficiency and generalizability of GFLAN would be more robustly proven by including a broader set of established generative floor plan benchmarks and comparing against a wider array of modern architectural generation techniques.\n\n2. **Organization and Clarity of Evaluation Details:** A significant amount of crucial detail regarding the evaluation metrics, dataset statistics, and potentially comparative results is relegated to the Appendix. To properly assess the performance claims—especially concerning metrics like connectivity, area compliance, and geometric error—the detailed methodology and full results tables for evaluation should be moved to the main paper for immediate and transparent review.\n\n3. **Missing Discussion of Sequence-to-Sequence (Seq2Seq) Methods:** The related works section omits discussion of methods that model floor plan generation as a Seq2Seq task, where rooms or wall segments are generated sequentially as tokens.\n\n4. **Errors in References:** There are a number of apparent reference errors (e.g., correct paper title with wrong author names) which raise concerns about the diligence of citation checking and the potential use of tools that introduce hallucinated references. Could the authors meticulously review and correct all entries in the bibliography to ensure academic rigor?"}, "questions": {"value": "1. Given the successful two-stage decomposition, what are the failure modes of the model? Specifically, under what conditions does Stage A produce room centers that Stage B is unable to resolve into a geometrically feasible, non-overlapping layout, and what is the typical measure of geometric distortion in such cases?\n\nI am willing to raise the final rating if all concerns are addressed."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "F0ZQKGAPvj", "forum": "LyaDw1t74Y", "replyto": "LyaDw1t74Y", "signatures": ["ICLR.cc/2026/Conference/Submission9844/Reviewer_yBDX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission9844/Reviewer_yBDX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission9844/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762163809348, "cdate": 1762163809348, "tmdate": 1762921318976, "mdate": 1762921318976, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}