{"id": "lYp3tNTgpE", "number": 11570, "cdate": 1758201885393, "mdate": 1759897567200, "content": {"title": "RAPTORGraph: Graph-Based Pathway Modeling for Causal Discovery in Single-Cell Perturbations", "abstract": "Experiments involving the perturbation of individual cells are central to understanding cellular mechanisms and can accelerate drug discovery.\nCausal representation learning (CRL) allows us to uncover the latent factors that regulate biological systems and predict the impact of novel perturbations.\nUnfortunately, existing methods fail to address intervention spillover in a closed-world setting where intervention targets are known a priori, such as in Perturb-seq experiments, due to their reliance on dense encoders.\nFurthermore, incorporating curated biological pathways into the model imposes a confirmatory bias, forcing it to explain the data through preexisting pathways and reducing the set of hypotheses the model can explore, while discarding novel signals that lie outside the annotated pathways.\nIn this work, we introduce RAPTORGraph, a $\\beta$-VAE with a GraphPathway encoder that explicitly models complex gene-to-gene interactions within learned pathways.\nMoreover, our model's preconditioning isolates the influence of perturbed genes, yielding clean, single-node latent interventions required for identifiable causal discovery and eliminating spillover.\nFinally, we train the model on data preprocessed with optimal-transport alignment, which guarantees a well-defined mapping between control and perturbed samples and further stabilizes the learned latent representations.\nWe demonstrate that RAPTORGraph improves state-of-the-art performance on downstream analyses of unseen perturbations, such as non-additive interactions, while outperforming other approaches on objective metrics, such as MSE and MK-MMD.\nThe code will be made publicly available upon publication of this paper.", "tldr": "", "keywords": ["Causal Representation Learning", "scRNA-seq", "VAE", "Generative Model", "Perturb-seq", "Interpretability"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/70847106fa95ba7130d0809f8dde2618b97c9f18.pdf", "supplementary_material": "/attachment/51cca715af824008b640fa80dfa3f2358917e886.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces **RAPTORGraph**, a causal and interpretable framework for predicting cellular responses to genetic perturbations in single-cell data (e.g., Perturb-seq). The model combines a *preconditioned GraphPathway encoder* that enforces one-to-one mappings between perturbed genes and latent “meta-pathways,” a **DAGMA-based causal graph layer** to infer pathway interactions, and **optimal transport preprocessing** to mitigate the mean-collapse problem arising from unpaired single-cell measurements. The authors claim that this architectural design addresses two key issues in causal representation learning for perturbation data: (i) *intervention spillover* caused by dense encoders and (ii) *mean collapse* due to random pairing. Experiments on the Norman et al. (2019) Perturb-seq dataset show a strong overall balance between reconstruction quality, distributional fidelity (MK-MMD), and prediction of non-additive gene interactions compared to several recent baselines (dVAE, SENA, scGPT). The model also includes a reverse-perturbation analysis, identifying the genetic perturbations responsible for a given cellular gene expression profile. The paper further provides theoretical justification of identifiability and includes ablation analyses for its core components."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **Clear motivation and well-defined problems.** The paper identifies two concrete issues (intervention spillover and mean collapse) and ties them to theoretical limitations of current causal representation learning frameworks.\n- **Architectural novelty.** The preconditioned block-diagonal GraphPathway encoder is an elegant way to enforce sparse, single-node latent interventions, bringing the implementation closer to the identifiability assumptions in CRL theory. Similar ideas of sparse Jacobian or disentangled representations exist, but their adaptation to pathway-based causal inference appears new and well-motivated.\n- **End-to-end causal discovery.** The encoder and DAGMA layers are trained jointly in an end-to-end fashion, which is a good design choice as it reduces human bias in predefined causal structures and enables the model to learn causal relations directly from data.\n- **Solid empirical evaluation.** The paper benchmarks against strong baselines on a widely used dataset with multiple complementary metrics (MSE, MK-MMD, Precision@10, Hit Rate@K), showing balanced performance across tasks.\n- **Biological relevance.** The framework aligns well with real-world perturbation experiments and is potentially valuable for hypothesis generation in drug discovery."}, "weaknesses": {"value": "- **Limited dataset diversity.** All evaluations are performed on a single dataset (Norman-CPA). Although justified for compatibility, this limits claims of generalization across cell types or experimental protocols.\n- **Potential rigidity of preconditioning.** The fixed block-diagonal structure may restrict the model’s flexibility in cases where gene–pathway relationships are overlapping, context-dependent, or nonlinear. Literature on over-constrained causal structures suggests that such rigidity can sometimes bias downstream inference in systems with pleiotropy or shared regulators.\n- **DAGMA interpretability.** While DAGMA ensures an acyclic causal graph, it does not guarantee biological validity. The paper provides no examples linking learned edges to known gene interactions, so it remains unclear whether the resulting DAG corresponds to meaningful pathways. Moreover, even a DAG satisfying acyclicity may not represent true causality if hidden confounders or feedback loops exist.\n- **Ablations and sensitivity.** The contribution of each component (OT preprocessing, DAGMA, preconditioning) could be evaluated more systematically. For example, how much does OT pairing alone improve results relative to random pairing?"}, "questions": {"value": "1. Since the authors state that the encoder and DAGMA modules are trained end-to-end, could they elaborate on how they manage the trade-off between enforcing acyclicity and maintaining reconstruction fidelity? For example, how sensitive is performance to the weighting of the DAGMA loss term?\n2. How robust is the preconditioning approach when gene–pathway mappings are not clearly one-to-one? Could the method handle partial overlaps or shared pathway membership?\n3. Have the authors verified whether the learned causal edges correspond to known gene–gene or pathway–pathway interactions? If not, how should readers interpret the learned DAG biologically?\n5. Would the OT pairing approach generalize to other datasets where the control–perturbation relationship is less structured or contains additional confounders?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "x8kyesKHHv", "forum": "lYp3tNTgpE", "replyto": "lYp3tNTgpE", "signatures": ["ICLR.cc/2026/Conference/Submission11570/Reviewer_8rUJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11570/Reviewer_8rUJ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission11570/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761699824477, "cdate": 1761699824477, "tmdate": 1762922656276, "mdate": 1762922656276, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Global Response"}, "comment": {"value": "We would like to thank the reviewers for their comments and suggestions. We believe they have accurately identified the strengths of our work, as well as areas for improvement. The reviewers were generally positive regarding the methodological contributions of RAPTORGraph. For example, reviewers gVst and 8rUJ commended the model’s ability to **“mitigate intervention spillover”**, a limitation that current encoders fail to address. The reviewers also praised RAPTORGraph’s ability to **“perform reverse perturbation analysis”**, predicting causal genes from observed phenotypes, and the **“clear interpretability benefits over the baseline models”** that were demonstrated by the Hit Rate@K results. The reviewers also appreciated the **“solid empirical evaluation”**. Overall, we believe the reviewers agreed that the proposed model has a significant practical impact and **“superior performance”** compared to baseline models, as well as **“architectural novelty”**.\n\nThe reviewers raised some weaknesses in the work, such that the **“experimental validation is limited to one dataset”**, raising concerns about its generalizability across different cell types or biological contexts. We also agree with the reviewers that there is a need for **“further biological validation”**, a clearer **“explanation of the model architecture”**, and **“additional ablations”**, specifically to demonstrate the contribution of Optimal Transport (OT).\n\nWe believe these concerns can be addressed in the current review process. Due to time constraints and to facilitate discussion with the reviewers, we have compiled a list of improvements and contributions that the reviewers have proposed and that we have already implemented. We plan to address the remaining questions and concerns, and upload an updated manuscript in the coming days.\n\n1. The captions of Tables 1–3 have been updated to clearly state that the values represent the mean and variance across three experimental runs (using different random seeds).\n2. We have clarified the calculation of the MK-MMD metric in Section 4.2, explaining that it is computed per-condition and subsequently averaged.\n3. We have added a clarifying sentence to the discussion on intervention spillover, distinguishing between the architectural spillover that our model prevents and the real biological correlations that it is designed to model.\n4. A discussion regarding the theoretical robustness of OT, particularly in handling less structured datasets, has been added to Appendix E.4.\n5. We have significantly updated Section 3.1 and Figure 2 to provide a clearer explanation of our preconditioning method and its architectural components.\n\nAs mentioned above, we plan to upload the updated version of the manuscript, which incorporates the remaining concerns raised by the reviewers and requires extra working hours: \n\n1. We are incorporating a second dataset (Replogle et al., 2020, Nature Biotechnology) to strengthen the generalizability of our findings.\n2. We are running ablations that use random pairing rather than OT alignment to quantify the impact of OT. \n3. We will benchmark the computational overhead introduced by the OT alignment step to provide a complete picture of its cost-benefit trade-off.\n4. We are incorporating additional assessments for biological discovery (e.g., based on Gene Set Enrichment Analysis, among others) to further validate the biological interpretability of our model’s causal latent factors, and how they are linked to known biological processes."}}, "id": "1VPIlXkrPd", "forum": "lYp3tNTgpE", "replyto": "lYp3tNTgpE", "signatures": ["ICLR.cc/2026/Conference/Submission11570/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11570/Authors"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission11570/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763630614853, "cdate": 1763630614853, "tmdate": 1763630614853, "mdate": 1763630614853, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents RAPTORGraph, a β-VAE–based causal representation learning framework designed for interpretable modeling of single-cell perturbation responses. The authors identify two fundamental issues in current causal generative models:\nIntervention spillover, where dense encoders cause perturbations to affect all latent variables, breaking causal identifiability assumptions.\nMean collapse, where random pairing of control and perturbed cells during training erodes biological heterogeneity.\nTo address these, RAPTORGraph introduces:\nA GraphPathway encoder with block-sparse preconditioning that enforces one-to-one mappings between perturbed genes and latent “meta-pathways,” enabling clean single-node interventions\nA DAGMA-based causal discovery layer that learns directed acyclic dependencies between latent pathways\nAn optimal transport alignment step between control and perturbed cells to mitigate mean collapse\nThe framework achieves state-of-the-art performance on the Norman et al. (2019) Perturb-seq dataset across multiple evaluation metrics (MSE, MK-MMD, and Precision@10 for non-additive interactions)"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Solid Empirical Validation\nComprehensive evaluations on the Norman-CPA dataset demonstrate strong reconstruction fidelity and distributional accuracy. RAPTORGraph outperforms state-of-the-art methods like scGPT, dVAE, and SENA on both MSE and MK-MMD metrics\n\nCausal Interpretability\nThe model’s ability to perform reverse perturbation analysis—predicting causal genes from observed phenotypes—is impressive. The Hit Rate@K results show clear interpretability benefits over baseline VAEs and transformers\n\nMethodological Rigor\nThe integration of OT-based alignment and DAGMA acyclicity constraints reflects careful methodological design rather than ad hoc architectural engineering."}, "weaknesses": {"value": "1 Single-Dataset Evaluation\nWhile the paper justifies using the Norman-CPA dataset for fairness, relying on one dataset limits generalization claims. It’s unclear how the approach performs on multi-modal or cross-species data.\n2 Ablation Scope\nThe results show aggregate performance but lack fine-grained ablations—e.g., what is the quantitative contribution of OT alignment versus DAGMA or encoder preconditioning?\n3 Biological Validation\nWhile statistical metrics are strong, the paper doesn’t showcase concrete biological discoveries. Were any inferred causal relationships validated against known regulatory pathways or experimental literature?\n4 Computational Overhead\nThe DAGMA layer and OT alignment are computationally heavy. The paper doesn’t discuss scaling behavior for larger perturbation graphs or real-time inference feasibility."}, "questions": {"value": "1. Identifiability Assumptions\nThe paper claims that block-sparse encoder preconditioning enforces atomic interventions, improving causal identifiability.\nWhat theoretical conditions guarantee that this structure yields unique causal factors rather than simply disentangled ones?\nIs there any formal justification (e.g., through identifiable β-VAE or SCM identifiability theorems)?\nCan intervention spillover still happen if correlations between genes violate the one-to-one encoder mapping?\n\n2. β-VAE Regularization\nThe method uses a β-VAE style latent prior.\nHow sensitive are results to β?\nIs there an empirical tradeoff between disentanglement and reconstruction accuracy?\nHow does β interact with DAGMA constraints (since both promote sparsity/independence)?\n\n3. Dataset Diversity\nThe model is only evaluated on the Norman-CPA dataset. Have you tried other single-cell perturbation datasets (e.g., Replogle, Dixit, or sci-Plex)?\nCan RAPTORGraph generalize across cell types or perturbation modalities (knockdown → overexpression)?\n\n4. Statistical Significance\nAre reported performance gains statistically significant (e.g., over multiple random seeds)?\nWhat is the variance in MK-MMD or Precision@10 across runs?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FoBvQhh1wo", "forum": "lYp3tNTgpE", "replyto": "lYp3tNTgpE", "signatures": ["ICLR.cc/2026/Conference/Submission11570/Reviewer_6bPr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11570/Reviewer_6bPr"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission11570/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761797202393, "cdate": 1761797202393, "tmdate": 1762922655802, "mdate": 1762922655802, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper continues a line of work on causal representation learning where a causal model is induced over latent factors (pathways) with the help of an encoder that maps observables (genes) to these latent factors. One key issue is identifiability as many latent causal models can result in the same distribution over the observables, necessitating interventions and also mapping them appropriately to represent interventions in the underlying factors. The authors introduce a sparse (pre-conditioned) encoder to mitigate ``causal spillover'' effect, requiring that each gene that involves perturbations is associated with a separate (single) latent factor. \nThe model is learned with multiple losses, including encoder-decoder reconstruction loss, interventional prediction, and a causal graph loss. The authors also introduce a pre-processing step where control cells are paired with perturbed cells via optimal transport with the idea that this reduces the extent to which cell to cell variation would confuse perturbation effects. The primary contribution in the paper is formulation / architectural since significant theoretical results are borrowed from prior work."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The paper is quite well-written and includes a good discussion on challenges with causal representation learning, including intervention spillover and ``mean collapse'' resulting from random pairing of control cells with perturbed ones. The proposed approach seems clear, well-motivated albeit straightforward without significant technical innovations."}, "weaknesses": {"value": "The verbose discussion of effects takes away from technical clarify (steps missing). E.g., the decoder itself or how the effects of perturbations are predicted are not explicated. The underlying causal graph appears to be linear, resolved with the help of DAGMA loss during training. Each intervention in the data has to be associated with a different latent factor. If factors are pathways, this does not hold in practice. Is there a way to mitigate?"}, "questions": {"value": "Since the encoder maps observables x to exogenous variables z, how are x reconstructions carried out? By mapping x to z, then z to u via the causal graph, and finally from u back to x? \n\nDo interventions follow the same above steps, starting from a (paired) control cell x, mapped to z, causal graph modified due to intervention on the particular u_i, then resolving the remaining u from the graph, followed by a mapping back to x? \n\nHow many samples are there per condition? Is MMD calculated across conditions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QIVx8KWObN", "forum": "lYp3tNTgpE", "replyto": "lYp3tNTgpE", "signatures": ["ICLR.cc/2026/Conference/Submission11570/Reviewer_gVst"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11570/Reviewer_gVst"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission11570/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761847220290, "cdate": 1761847220290, "tmdate": 1762922655386, "mdate": 1762922655386, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}