{"id": "M4eNOuMUUy", "number": 15334, "cdate": 1758250361862, "mdate": 1759897313025, "content": {"title": "Design of Ligand-Binding Proteins with Atomic Flow Matching", "abstract": "Designing novel proteins that bind to small molecules is a long-standing challenge in computational biology, with applications in developing catalysts, biosensors, and more. Current computational methods rely on the assumption that the binding pose of the target molecule is known, which is not always feasible, as conformations of novel targets are often unknown and tend to change upon binding. In this work, we formulate proteins and molecules as unified biotokens, and present AtomFlow, a novel deep generative model under the flow-matching framework for the design of ligand-binding proteins from the 2D target molecular graph alone. Operating on the positions of biotokens, AtomFlow captures the flexibility of ligands and generates ligand conformations and protein backbone structures iteratively. We consider the multi-scale nature of biotokens and demonstrate that AtomFlow can be effectively trained on a subset of structures from the Protein Data Bank, by matching the flow vector field using an SE(3) equivariant structure prediction network. Experimental results demonstrate that our method generates high-fidelity ligand-binding proteins, matching or surpassing the performance of RFDiffusionAA across multiple metrics—without requiring bound ligand structures. As a general framework, AtomFlow can be readily extended to diverse biomolecule design tasks in the future.", "tldr": "a protein design model for small molecule binders", "keywords": ["protein design", "binder design"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/6fff927ab217b3a92febe06f9205c215c4301468.pdf", "supplementary_material": "/attachment/3c93e0f48b40aa05d8113272ef8538e486cc4e53.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces AtomFlow, a flow-matching framework for protein-ligand complex generation condition on molecular ligand graphs. design. Protein and ligand representations are unified via \"biotokens\". The papers claims that the proposed model can perform de novo protein binder design without requiring a predefined ligand conformer, achieving comparable or superior binding affinity to RFDiffusionAA and faster inference speed."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- Biotoken representation: a unified feature framework for ligand atoms and protein residues within an SE(3)-equivariant space is elegant and facilitates joint modeling of multiple biomolecular types.\n\n- Speedup: AtomFlow achieves over 5x inference speed compared to RFDiffusionAA."}, "weaknesses": {"value": "1. The model predicts only C$-\\alpha$ coordinates for proteins. Therefore, it is unclear to me how it can achieve high binding affinity when full protein information is not generated directly by the model but instead depends on downstream pipelines. It is also unclear whether, when using AutoDock Vina, the generated complexes were redocked or if the Vina score was simply computed on the generated structures. If the former is true, such discrepancies would weaken the claims regarding physical binding accuracy. Finally, some of the reported metrics, such as PoseBuster and PoseCheck, are mentioned as being performed but are not actually presented in the paper (see Appendix A.6, page 18). These metrics are essential for assessing the quality of the generated structures.\n\n2. Equation 5 bins continuous distance values before applying flow matching, introducing a discontinuity that may conflict with the continuous-space assumptions of the flow ODE formulation.\n\n3. The handling of categorical variables (e.g., residue types) is not discussed, even though flow matching operates in a continuous space.\n\n4. The Vina score distributions for AtomFlow, reported in Equation 5, are quite similar to those of the competing method, RFDiffusionAA. These results, combined with the absence of key metrics such as PoseBuster and PoseCheck, weaken the overall contributions of the paper. However, I acknowledge that the reported speed-up remains a valid and valuable contribution.\n\n5. The relationship of $(r_i, t_i)$ with respect to $a_i$  in the set  {$T_i = (r_i, t_i) \\ | \\ a_i \\in \\mathcal{P}$}  on page 3 line 135, is not specified. Also $t$ is used for both time and $t_{i,j}$ in Eq. 5."}, "questions": {"value": "1. How are the categorical residue or atom types incorporated into the continuous flow-matching framework?\n\n2. Can you provide explicit mathematical expressions for how $f^{pair}$ and $f^{token}$ are computed and used by the structure prediction network?\n\n3. When using AutoDock Vina, are the generated complexes redocked or if is Vina simply computed on the generated structures?\n\n4. Why is the PoseBusters/PoseCheck evaluation missing?\n\n5. Could you discuss why continuous variables are discretized in Eq. (5), while still using a flow matching that handles continuos variables and whether this affects training stability?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ierOotGjVz", "forum": "M4eNOuMUUy", "replyto": "M4eNOuMUUy", "signatures": ["ICLR.cc/2026/Conference/Submission15334/Reviewer_21E6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15334/Reviewer_21E6"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15334/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761141808067, "cdate": 1761141808067, "tmdate": 1762925628082, "mdate": 1762925628082, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses an important challenge in molecular AI: designing protein binders for small-molecule ligands. The proposed method, **ATOMFLOW**, generates binding coordinates for protein-ligand complexes using only the 2D molecular graph of the target ligand. This is achieved through biotokenization of ligand atoms and protein residues, pairwise relationship embedding, and a flow-matching framework. The method is supported by thorough experiments across diverse ligands.\n\nHowever, the novelty of the work is limited. The problem formulation and methodological components—such as flow matching and SE(3)-equivariant modeling—are largely adapted from prior literature. While the results are competitive, they do not demonstrate significant improvements over existing models such as RFDiffusionAA or Chai-1."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- Clear problem formulation and modular architecture.\n- Robust evaluation across ligands.\n- Faster inference compared to RFDiffusionAA.\n- Unified representation of protein and ligand tokens."}, "weaknesses": {"value": "- Limited methodological novelty.\n- Benchmarking setup may introduce bias due to self-generated reference structures."}, "questions": {"value": "1. **Terminology clarity**: Please expand acronyms such as ODE and SAM. Given the diversity of the AI4Science community, not all readers share the same technical background.\n\n2. **Line 205**: What does the symbol \\( Q \\) represent? Clarifying this would improve readability.\n\n3. **One-hot binned distance map**: What motivated this design choice? How does it compare to alternatives such as continuous embeddings or radial basis functions?\n\n4. **Choice of LigandMPNN and ESMFold**: Why were these models selected for sequence recovery and structure validation? A brief overview of their accuracy and relevant references would be helpful.\n\n5. **Benchmark fairness (Table 2)**: The reference structures are derived from your own pipeline using LigandMPNN and ESMFold. Does this introduce bias when comparing against other models? Please clarify.\n\n6. **Feature redundancy**: Figure 2 shows that the distance map is passed to the Feature Embedder. If pairwise features already encode distance, is there redundancy between `pair feat` and the distance map? Clarifying their distinct roles would strengthen the architectural rationale."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "MVNr72d8bg", "forum": "M4eNOuMUUy", "replyto": "M4eNOuMUUy", "signatures": ["ICLR.cc/2026/Conference/Submission15334/Reviewer_JiYA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15334/Reviewer_JiYA"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15334/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761890836610, "cdate": 1761890836610, "tmdate": 1762925627614, "mdate": 1762925627614, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents AtomFlow, a flow matching model for designing a protein structure to bind a small molecule ligand. The model jointly denoises the structure of the protein and ligand and thus does not require knowledge of the ligand pose, unlike RFDiffusionAA. The architecture is based on AlphaFold and predicts denoised structures from a distance map input of the input structure. The method is evaluated on (1) the set of 4 ligands studied in RFDiff-AA, and (2) an expanded set of ligands curated by the authors. AtomFlow is shown to have comparable or better designability than RFAA as well as similar Vina score."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* The work is solidly executed, with sensible architectural choices, strong initial evaluations, and clear and concise writing.\n* The task tackled is significant and the competitive results signify well-executed model engineering and training practices.\n* The authors re-derive the quotient-space flow matching fromework from AlphaFlow with more solid theoretical justification.\n* The paper is quite clearly written. The figures are well made, visually appealing, and informative."}, "weaknesses": {"value": "**Originality**\n* The methodology can be described as a flow-matching version of RFDiff-AA and does not score high on originality / novelty from a ML perspective. Further, the flow model architecture and noising process are based on AlphaFlow, with different justification but no difference in practice as far as I can tell. To improve on this axis, while it's not clear that more methodological novelty is needed for its own sake, the authors could focus on novel evaluations or applications of the proposed method.\n\n**Quality** \n* The computational evaluations are well executed, but limited in scope. Most of the analysis focuses on only 4 ligands, raising concerns about sample size and statistical significance.\n* The diversity and novelty evaluations are nice, but only AtomFlow is evaluated, not RFDiff-AA or the other baselines.\n\n**Significance**\n\n* The overall significance of the contribution is unclear as it represents an incremental methodological advance over RFDiff-AA with more or less the same model capabilities. The authors argue that not needing to specify the ligand pose is a big plus, but no meaningful evidence or use case is provided for this distinction. After all, RFDiff-AA has been experimentally validated, whereas AtomFlow-generated poses have not. It is of course not expected for a ML submission to experimentally validate the proteins, but it should be made a bit clearer why the main point of difference with RFDiff-AA is important to tackle as a ML problem."}, "questions": {"value": "No specific questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "TY4liCprC8", "forum": "M4eNOuMUUy", "replyto": "M4eNOuMUUy", "signatures": ["ICLR.cc/2026/Conference/Submission15334/Reviewer_nHfv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15334/Reviewer_nHfv"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15334/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762054525941, "cdate": 1762054525941, "tmdate": 1762925627243, "mdate": 1762925627243, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes ATOMFLOW, which uses a unified biotoken representation to jointly generate protein and ligand structures\nby learning the distribution of token positions conditioned on a ligand chemical graph. It uses flow matching to learn the structure prediction model based on both token features and pair features. The proposed method is evaluated on the PDBBind dataset, with a focus on four ligands (FAD, SAM, IAI, OQO)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper targets at an important and valuable task and achieves comparable performance to RFDiffusionAA."}, "weaknesses": {"value": "The weaknesses of this paper are listed as follows:\n\n1. The evaluation of the method just focuses on several ligands, making the generalization of the method unknown. Basically, most of the experiments are conducted on four specific ligands. I'm not sure if the designed methods can be well adapted to broader applications, like enzyme-substrate complex structure prediction, which is even harder as the transition state of the enzyme is generally hard to capture.\n\n2. It seems the proposed method is limited to generate shorter proteins. All the designed proteins are limited to a length shorter than 300.\n\n3. The performance of the original ATOMFlOW-N is worse than RFdiffusionAA, and the variant ATOMFlOW-H is comparable to RFDiffusionAA. \n\n4. There are some newer models like RFDiffusion2, which the proposed method should be compared with.\n\n5. In Figure 8, when showing the novelty and diversity of the proposed method, the paper doesn't provide the performance of baseline methods like RFDiffusionAA, which makes it hard to capture the comparison with previous SOTA methods."}, "questions": {"value": "The ATOMFLOW-N performs worse than RFDiffusionAA, while ATOMFLOW-H which uses an auxiliary hint input of the pairwise distance matrix of the bound structure achieves better performance. Can the authors explain in detail how they implemented ATOMFLOW-H and why it helped?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "5ZiVHd4EGV", "forum": "M4eNOuMUUy", "replyto": "M4eNOuMUUy", "signatures": ["ICLR.cc/2026/Conference/Submission15334/Reviewer_3bnS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15334/Reviewer_3bnS"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15334/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762202764867, "cdate": 1762202764867, "tmdate": 1762925626702, "mdate": 1762925626702, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a method for protein binder design. Both protein residues and ligand are modeled in a joint representation (\"biotokens\"), which enables to jointly generate protein-ligand complexes in an SE(3)-equivariant flow matching framework."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "The paper is well written and the presentation is clear. The approach of representing both ligand and residues in a joint feature representation is elegant and enables to use the same flow matching generative process for both, leading to a generative model for protein-ligand complexes. The method is on par and sometimes outperforms RFDiffusionAA in binder design quality, and (through flow matching) offers faster inference."}, "weaknesses": {"value": "No major weaknesses. Great paper!\n\nTechnical remarks:\n\nTypo in Fig2: Piror Distribution"}, "questions": {"value": "'"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Ez7csKxiKX", "forum": "M4eNOuMUUy", "replyto": "M4eNOuMUUy", "signatures": ["ICLR.cc/2026/Conference/Submission15334/Reviewer_5EfC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15334/Reviewer_5EfC"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission15334/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762903340082, "cdate": 1762903340082, "tmdate": 1762925626395, "mdate": 1762925626395, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}