{"id": "mee8jLEiwd", "number": 2035, "cdate": 1756979465932, "mdate": 1763095349282, "content": {"title": "Proxy-GS: Efficient 3D Gaussian Splatting via Proxy Mesh", "abstract": "3D Gaussian Splatting (3DGS) has emerged as an efficient approach for achieving photorealistic rendering. Recent MLP-based variants further improve visual fidelity but introduce substantial decoding overhead during rendering. To alleviate computation cost, several pruning strategies and level-of-detail (LOD) techniques have been introduced, aiming to effectively reduce the number of Gaussian primitives in large-scale scenes. However, our analysis reveals that significant redundancy still remains due to the lack of occlusion awareness. In this work, we propose Proxy-GS, a novel pipeline that exploits a proxy to introduce Gaussian occlusion awareness from any view.\nAt the core of our approach is a fast proxy system capable of producing precise occlusion depth maps at resolution 1000$\\times$1000 under \\SI{1}{ms}. This proxy serves two roles: first, it guides the culling of anchors and Gaussians to accelerate rendering speed. Second, it guides the densification towards surfaces during training, avoiding inconsistencies in occluded regions, and improving the rendering quality. \nIn heavily occluded scenarios, such as the MatrixCity Streets dataset, Proxy-GS not only equips MLP-based Gaussian splatting with stronger rendering capability but also achieves faster rendering speed. Specifically, it achieves more than $2.5\\times$ speedup over Octree-GS, and consistently delivers substantially higher rendering quality. Code will be public upon acceptance.", "tldr": "", "keywords": ["Neural rendering", "3dgs", "proxy"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/2a909c12a4872c4c55bde329d7f8de972ee489b8.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes Proxy-GS, an occlusion-aware framework for MLP-based 3D Gaussian Splatting that uses a lightweight proxy mesh to (i) cull occluded anchors at test time via a fast hardware-rasterized depth map (~1k×1k under ~1 ms) and (ii) guide densification toward visible surfaces during training. The proxy-guided filter is fused with frustum culling in a single CUDA pass; proxy-guided densification projects errorful patches back to the proxy surface to grow anchors structurally. On occlusion-rich scenes (e.g., MatrixCity Streets), Proxy-GS improves quality and boosts FPS, with ablations showing best trade-offs at modest safety margins and confirming benefits from training-time consistency."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces a proxy-guided Gaussian representation, which effectively leverages proxy geometry to guide Gaussian splatting for improved rendering quality and efficiency. This design elegantly integrates geometry awareness into the learning process, leading to better scene reconstruction and occlusion handling.\n2. The paper is well written and clearly organized."}, "weaknesses": {"value": "**Major**\n1. The main idea of removing occluded Gaussians to accelerate rendering speed has already been proposed in OccluGaussian. The authors should cite, discuss, and compare their approach with this strong baseline.\n2. The use of preprocessed proxy meshes seems quite tricky. First, I believe PGSR may not work well in very large scenes, such as the *MatrixCity small-city* dataset (which includes entire aerial or street-level environments). This is a significant limitation. Second, please provide details on the training time and storage requirements, including the time required to preprocess the proxy mesh, since users applying proxy-GS must start from scratch.\n3. No demo has been submitted, so the performance of the proposed method cannot be effectively demonstrated.\n4. The authors conducted experiments on only a few scenes (six in total), and the rendering metrics improve over the baselines by only 0.1 PSNR. I believe these results could easily be surpassed by tuning hyperparameters.\n\n**Minor**\n1. The paper lacks references to important related work on Level of Detail (LOD) and large-scale rendering. The authors should consider citing the following works:\n    - *OccluGaussian: Occlusion-Aware Gaussian Splatting for Large Scene Reconstruction and Rendering*\n    - *LODGE: Level-of-Detail Large-Scale Gaussian Splatting with Efficient Rendering*\n    - *Horizon-GS: Unified 3D Gaussian Splatting for Large-Scale Aerial-to-Ground Scenes*\n    - *Virtualized 3D Gaussians: Flexible Cluster-based Level-of-Detail System for Real-Time Rendering of Composed Scenes*\n    - *Vast 3D Gaussians for Large Scene Reconstruction*"}, "questions": {"value": "please see the weakness above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "OaSfApiPHF", "forum": "mee8jLEiwd", "replyto": "mee8jLEiwd", "signatures": ["ICLR.cc/2026/Conference/Submission2035/Reviewer_aPkE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2035/Reviewer_aPkE"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760948445965, "cdate": 1760948445965, "tmdate": 1762916001211, "mdate": 1762916001211, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We feel that this submission may not be fully aligned with the reviewers’ primary areas of expertise, which has resulted in several misunderstandings about our work. In light of this, we have decided to withdraw the paper."}}, "id": "mxmJu1o5QU", "forum": "mee8jLEiwd", "replyto": "mee8jLEiwd", "signatures": ["ICLR.cc/2026/Conference/Submission2035/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2035/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763095348143, "cdate": 1763095348143, "tmdate": 1763095348143, "mdate": 1763095348143, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Proxy-GS, a framework for accelerating MLP-based 3D Gaussian Splatting (3DGS) by introducing a proxy-mesh–guided occlusion filter and densification mechanism. The core idea is to pre-compute a lightweight proxy mesh to perform depth-based occlusion culling via hardware rasterization (<1 ms) and use these depth maps both during training (to guide anchor densification) and inference (to cull occluded anchors). The authors claim that this approach improves efficiency and rendering quality simultaneously, reporting up to a 3× FPS increase and slight PSNR gains over Octree-GS and other baselines on datasets such as MatrixCity, Small City, and CUHK-LOWER."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper addresses a relevant efficiency problem in MLP-based 3DGS rendering, which is indeed computationally heavy.\n\n2. The proposed integration of proxy meshes into training/inference is intuitive and could be useful for applied rendering systems."}, "weaknesses": {"value": "1. No theoretical grounding: The proxy-guided densification lacks a clear optimization objective or loss formulation beyond heuristics; equations (2–9) only restate camera transformations.\n\n2. Weak improvement over Octree-GS: The reported gains compared with Octree-GS are modest and often within the margin of experimental noise. Moreover, since the entire codebase and training pipeline are directly built upon Octree-GS, it is difficult to disentangle whether the improvements truly originate from the proposed proxy mechanism or from tuning and implementation differences. This raises doubts about the actual effectiveness and generality of the method."}, "questions": {"value": "1. How robust is Proxy-GS to inaccurate or incomplete proxy meshes? Quantitative sensitivity analysis is missing.\n\n2. Why is “occlusion-guided densification” superior to simply pruning via hierarchical Z-buffering or view-space LOD strategies?\n\n3. Were all methods trained with identical data augmentations, learning rates, and iteration counts?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Aiqm9sJEVi", "forum": "mee8jLEiwd", "replyto": "mee8jLEiwd", "signatures": ["ICLR.cc/2026/Conference/Submission2035/Reviewer_b4Nz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2035/Reviewer_b4Nz"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761214508322, "cdate": 1761214508322, "tmdate": 1762916000874, "mdate": 1762916000874, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Proxy-GS, an occlusion-aware and proxy-guided training and rendering framework for 3D Gaussian Splatting (3DGS). The central idea is to introduce a lightweight proxy mesh derived from SfM/MVS pipelines, and to use it as a structural scaffold to: 1) Guide densification toward geometrically meaningful regions. 2) Enable occlusion-aware pruning and rendering. 3) Reduce redundancy while maintaining reconstruction quality."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Introducing proxy-guided Gaussian growth is conceptually elegant and practically useful.\n\nResults are good, particularly in occlusion-heavy environments.\n\nVisualizations effectively reveal how proxies shape spatial distribution."}, "weaknesses": {"value": "1. Dependence on Proxy Quality:\n\nIf the proxy mesh is coarse / noisy, how robust is Gaussian distribution?\n\nAblations on proxy resolution and noise are missing.\n\n2. Fairness of Experimental Comparison:\n\nSome baselines are not clearly described regarding training iterations, learning rate tuning, and hardware.\n\nInclude a wall-clock cost per iteration comparison.\n\n3. Scalability Beyond Desktop-Scale Scenes:\n\nClaims target “ultra-large VR walkthroughs” but datasets are still mid-scale.\n\nEvaluate on a truly large-scale multi-block urban dataset (e.g., Tanks&Temples extended / UrbanScene3D).\n\n4. LOD vs. Occlusion Interactions:\n\nThe method implicitly resembles geometric LOD.\n\nDiscuss when proxy-GS degenerates to simple LOD behavior."}, "questions": {"value": "1. What failure behaviors emerge when the proxy mesh is inaccurate or incomplete? \n\n2. How sensitive is the densification policy to mesh vertex density and normal consistency?\n\n3. Is the occlusion culling performed per-ray or per-fragment? Clarify computational impact.\n\n4. Could proxy features replace Gaussians in distant regions entirely, forming a hybrid representation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "U0bwkJBlaP", "forum": "mee8jLEiwd", "replyto": "mee8jLEiwd", "signatures": ["ICLR.cc/2026/Conference/Submission2035/Reviewer_P1v1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2035/Reviewer_P1v1"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761651967857, "cdate": 1761651967857, "tmdate": 1762916000553, "mdate": 1762916000553, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work introduces Proxy-GS, a large-scale 3D Gaussian Splatting (3DGS) framework designed for both rendering and training. The proposed method utilizes a proxy mesh for occlusion culling, which facilitates both proxy-guided rendering and densification. Experimental results on multiple datasets demonstrate the effectiveness of the approach."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "This work on large-scale real-time scene rendering and training represents a timely and practical direction for 3D Gaussian Splatting."}, "weaknesses": {"value": "Introduction  \n1. Line 096. One of the main contributions 'We leverage engineering optimizations ...' seems to describe an implementation rather than a methodological contribution.\n\n\n\nMETHOD  \n1. The framework is not clearly illustrated, and Figure 2 is not referenced anywhere in the manuscript.\n2. The proposed method heavily relies on a pre-generated mesh as a proxy, which limits its practicality. Moreover, the use of such a proxy may result in an unfair comparison with mesh-free approaches.\n3. The motivation for the proxy-guided filter is unclear. It is feasible to extract visibility or depth for occlusion estimation directly from 3DGS models. Why is an additional mesh necessary?\n4. Equations (2) to (8) appear to replicate the culling implementation of the original 3DGS method, but the manuscript does not provide appropriate citations.\n\n\nEXPERIMENT\n1. It would be helpful to provide the computational or time budget required for obtaining the mesh.\n2. It would be useful to include failure cases resulting from unsuccessful mesh reconstruction. For example, surface reconstruction may fail to recover fine details in large-scale scans.\n\nTypo:\n\nline 230: interpretability -> interpretability."}, "questions": {"value": "1. This manuscript is not well-written, and it is recommended to restructure the manuscript.\n2. It would be better clarify the necessity of proxy mesh."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "al7VMDkSbG", "forum": "mee8jLEiwd", "replyto": "mee8jLEiwd", "signatures": ["ICLR.cc/2026/Conference/Submission2035/Reviewer_1Spc"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2035/Reviewer_1Spc"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2035/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761829991329, "cdate": 1761829991329, "tmdate": 1762916000011, "mdate": 1762916000011, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}