{"id": "MvlBFwAwK8", "number": 1883, "cdate": 1756957275111, "mdate": 1762923609811, "content": {"title": "A Survey of LLM-based Multi-agent Systems in Medicine", "abstract": "Large Language Model (LLM)-based multi-agent systems have shown great potential in supporting complex tasks in the medical domain, such as improving diagnostic accuracy and facilitating multidisciplinary collaboration. However, despite the advancement, there is a lack of structured frameworks to guide the design of these systems in medical problem-solving. In this paper, we conduct a comprehensive survey of existing medical multi-agent systems, and propose a medical-specific taxonomy along three key dimensions: team composition, medical knowledge augmentation, and agent interaction. We further outline several future research directions, such as incorporating human–AI collaboration to ensure that human expertise and multi-agent reasoning jointly address complex clinical tasks, designing and evaluating agent profiles, and developing self-evolving systems that adapt to evolving medical knowledge and rapidly changing clinical environments. In summary, our work provides a structured overview of medical multi-agent systems and highlights key opportunities to advance their research and practical deployment.", "tldr": "", "keywords": ["Survey", "LLM-based Multi-agent Systems", "Medical domain"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/581835ab401a4874b9630f35319efc517d9c4368.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper surveys 50 recent works on LLM-based multi-agent systems in medicine. The authors propose a medical-specific taxonomy structured around three key design dimensions: team composition, medical knowledge augmentation, and agent interaction."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper's primary strength is its development of a structured, medical-specific taxonomy that addresses the shortcomings of existing domain-agnostic surveys."}, "weaknesses": {"value": "My major comments are:\n\n1. The criteria for excluding papers are not fully justified. For instance, the authors excluded works on \"purely biological or genomic research\". This is a questionable omission, as LLM-based agents are increasingly used in areas like drug discovery and genetic analysis, which are highly relevant to medical problem-solving.\n2. The survey explicitly excludes multi-agent systems for hospital simulation, noting that other surveys focus on this topic. However, these systems, which model hospital operations or clinical workflows, represent a significant application of agend-based framework in medicine. The survey should at least briefly summarized this area or provided a stronger justification for its complete exclusion.\n3. The survey largely avoids a critical or comparative evaluation of the approaches it identifies. The paper does not systematically discuss which design patterns (e.g., which team composition or interaction style) are more effective, reliable, or safe for specific medical tasks. The discussion is very superficial. It critiques current MDT models as unconstrained dialogue but only offers general recommendations like designing structured discussion protocols without a deeper analysis of how existing systems fail or what specific mechanisms could resolve this."}, "questions": {"value": "Please refer to my comments above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "NsCWhT42Dz", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Reviewer_oeyv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1883/Reviewer_oeyv"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761875021305, "cdate": 1761875021305, "tmdate": 1762915929568, "mdate": 1762915929568, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "PibJj3zNbT", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762923607981, "cdate": 1762923607981, "tmdate": 1762923607981, "mdate": 1762923607981, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper surveys the burgeoning literature on Large Language Model (LLM)-based multi-agent systems for medical problem-solving. It introduces a design-oriented taxonomy spanning three dimensions: team composition, medical knowledge augmentation, and agent interaction, using a corpus of 50 curated and coded papers. The survey offers an analytic framework, discusses prominent paradigms, and exposes open challenges."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. The discussion sections identify key open questions unique to medical applications, such as agent profile fidelity, self-evolution, multimodal integration, and the subtleties of human-AI collaboration.\n2. Figure 1 is a useful one-glance visual of the surveyed papers' coverage across taxonomy axes."}, "weaknesses": {"value": "1. While the taxonomy is systematic, sections could do more analytical heavy lifting to distinguish why certain paradigms (e.g., specialization vs. process-based agent allocation) are preferable or inferior in specific medical contexts. The discussion remains too high-level in places and often defers to representative examples.\n\n2. Although the paper states that two reviewers independently coded and then reached consensus, the criteria and process for merging or splitting taxonomy categories (e.g., how team composition subtypes were defined and unified) are not rigorous. \n\n3. While the discussion touches on hallucination, error propagation, and trust, the paper overlooks a deeper, focused analysis of empirical and technical failure modes emerging in practice. \n\n4. Despite the extensive bibliography, several highly relevant recent surveys and foundational works on LLM-based multi-agent systems remain unreferenced, such as:\n- A Survey of LLM-based Agents in Medicine: How far are we from Baymax?\n- LLM-Based Human-Agent Collaboration and Interaction Systems: A Survey\n - A Survey on Large Language Model Based Autonomous Agents \n\n5. The survey's treatment of algorithmic and methodological patterns is superficial. It lacks systematic analysis of mathematical formulations, such as agent-interaction protocols, convergence or generalization theorems, and standardized loss functions. Beyond empirical categorizations, the paper should also classify prevailing theoretical design choices and discuss their implications (e.g., objective functions, guarantees). Without this, readers cannot effectively compare methods at a technical level.\n\n6. Overall, the work falls considerably short of the rigor and depth typically expected at the ICLR level."}, "questions": {"value": "see Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "wv9oHwxgU4", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Reviewer_95aj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1883/Reviewer_95aj"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762052817447, "cdate": 1762052817447, "tmdate": 1762915928749, "mdate": 1762915928749, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a survey of LLM-driven multi-agent systems in medicine. Its central contribution is a proposed three-dimensional, medical-specific taxonomy intended to organize design patterns in this domain. The authors posit that existing, domain-agnostic taxonomies are insufficient to capture the unique characteristics of medical applications.\n\nWhile the paper is clearly structured and follows a transparent literature search methodology, its core contribution unfortunately lacks the necessary novelty and insight required for ICLR. The proposed taxonomy fails to substantiate its medical-specific claim, and the paper as a whole reads more as a well-organized literature collection than a critical synthesis. This fundamental weakness, compounded by significant presentation issues, renders the paper's contribution insufficient."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. Timely Literature Collection: The paper gathers a comprehensive set of recent works (50 papers) in the emerging and important field of medical LLM multi-agent systems. The literature search methodology is clearly articulated.\n\n2. Identifies Future Directions: The discussion section (Section 3) clearly outlines several relevant and important future research challenges (e.g., human-AI collaboration, self-evolution, multimodal integration), which serves as a useful reference for researchers.\n\n3. Structural Attempt: The paper attempts to provide a classification framework, offering a basic structure for organizing the reviewed literature."}, "weaknesses": {"value": "The paper suffers from several major weaknesses, the most significant being the lack of a novel.\n\n## The Core Contribution is Not Medical-Specific and Lacks Novelty.\n\nThe paper's primary claim is that existing domain-agnostic taxonomies are insufficient. However, the proposed three-dimensional taxonomy fails to substantiate this claim. Instead, it appears to be a direct recapitulation of standard, domain-agnostic concepts from Multi-Agent Systems (MAS) and general LLM engineering, which are then populated with medical examples. This renders the framework a tool for summarization, not the critical synthesis expected of a top-tier survey.\n\n- **Team Composition (Sec 2.1)**: The categories (e.g., Clinical task allocation, Specialization-oriented assignment, Process-oriented allocation) are standard organizational and workflow patterns in MAS design, equally applicable to any domain (e.g., finance, logistics, gaming).\n\n- **Medical Knowledge Augmentation (Sec 2.2)**: The Agent-Intrinsic vs. Externally-Assisted split is a generic classification for all RAG/LLM augmentation methods. The paper fails to synthesize why these methods are fundamentally different or present unique challenges in medicine (e.g., specific demands for evidence traceability, real-time constraints, or unique data modalities) compared to their use in other fields.\n\n- **Agent Interaction (Sec 2.3)**: Hierarchical Coordination and Peer Collaboration are foundational, classic concepts in MAS. The paper simply slots medical examples (like MDT discussions) into these pre-existing buckets without offering a new perspective or identifying emergent, medicine-specific interaction patterns.\n\nUltimately, the reader gains no new insight into the unique design patterns or challenges specific to medical MAS. The paper fails to answer the very question it poses: *why are general taxonomies insufficient?*\n\n## Poor Presentation and Lack of Synthesis.\n\nThe presentation style severely hinders the paper's readability and underscores the lack of synthesis.\n\n- **Repetitive Listing**: The core taxonomy sections (2.1-2.3) are written in a highly repetitive, list-like style (e.g., A did X, B did Y, C did Z) that merely restates paper abstracts. There is almost no critical commentary, comparison, or synthesis connecting these individual works.\n\n- **Lack of Visual Aids**: The main body of the paper lacks any summary figures or tables. The only two visualizations are relegated to the appendix. For a survey paper, which aims to clarify and structure a field, this is a major omission. A visual representation of the taxonomy or a comparative table mapping the 50 papers to the framework's dimensions is essential for providing information gain."}, "questions": {"value": "1. The central claim of the paper is that this taxonomy is medical-specific and that existing general taxonomies are insufficient. Could you please provide a clear justification for this? Specifically, how do the proposed categories fundamentally differ from standard, domain-agnostic MAS taxonomies? What specific aspects of medical MAS do existing frameworks fail to capture that this one successfully does?\n\n2. Given that this is a survey paper, the complete lack of figures or tables in the main body is a critical flaw for readability. Could you elaborate on the decision to place all visualizations in the appendix? A comparative table or diagram is essential for a reader to understand the relationships between the 50 surveyed papers and the proposed framework."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "34HqX02XoO", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Reviewer_Wg4K"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1883/Reviewer_Wg4K"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762351273286, "cdate": 1762351273286, "tmdate": 1762915928581, "mdate": 1762915928581, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a survey of LLM-based multi-agent systems in the medical domain. It analyzes 50 recent papers to propose a novel, medical-specific taxonomy organized along three dimensions: team composition, medical knowledge augmentation, and agent interaction. Based on this taxonomy, the paper discusses existing challenges and identifies several promising future research directions, including human-AI collaboration, self-evolving systems, and multimodal integration, aiming to provide a structured overview to guide future work in this rapidly developing field."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The survey addresses a timely and highly significant topic at the intersection of large language models, multi-agent systems, and medicine.\n- It provides a useful snapshot of a rapidly evolving field by synthesizing a considerable number of very recent publications.\n- The high-level dimensions of the taxonomy—team composition, knowledge augmentation, and interaction—offer a logical starting point for structuring the domain.\n- The discussion section successfully identifies several important and relevant challenges that are critical for the future development of medical multi-agent systems."}, "weaknesses": {"value": "- The proposed taxonomy for \"Team Composition\" contains categories that are not mutually exclusive and operate at different levels of abstraction.\n- The subcategories within \"Agent Interaction\" incorrectly mix interaction patterns with workflow descriptions, creating a confusing and structurally unsound classification.\n- The paper selection process appears limited, relying on a single search engine and snowballing, which may introduce selection bias and miss relevant literature.\n- A substantial portion of the surveyed works are non-peer-reviewed preprints, which undermines the scholarly foundation and authority expected from a survey paper.\n- The analysis lacks a deep critical perspective, functioning more as a descriptive catalog of recent work rather than an evaluation of their comparative strengths and weaknesses.\n- The discussion of future challenges feels disconnected from the survey's taxonomic findings, presenting generic AI research topics without linking them back to the specific patterns identified.\n- There are apparent misclassifications in the examples provided, such as describing systems with clear hierarchical roles like a triage doctor under the umbrella of peer collaboration."}, "questions": {"value": "- Could you clarify the principle for categorization within the \"Team Composition\" dimension when a single system exhibits multiple characteristics, such as using automatic assignment to select agents based on both their specialization and expertise level?\n- Your \"Agent Interaction\" taxonomy places \"Clinical task-driven flow\" under \"Peer Collaboration,\" but real-world clinical workflows often involve hierarchical steps like triage and referral. Can you elaborate on the justification for this classification?\n- How did you address the potential for unverified claims and methodological weaknesses in the large number of non-peer-reviewed preprints included in your analysis, and how might this affect the validity of your proposed taxonomy?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2LKCGxC1uK", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Reviewer_T2sE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1883/Reviewer_T2sE"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762379299979, "cdate": 1762379299979, "tmdate": 1762915927996, "mdate": 1762915927996, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This survey reviews 50 papers on LLM-based multi-agent systems for medical problem-solving. It proposes a taxonomy across three dimensions: team composition, medical knowledge augmentation, and agent interaction. This taxonomy complements the current use of more general multi-agent taxonomies, which does not adequately capture medical-specific patterns such as multidisciplinary team collaboration and clinical workflows. The paper provides a good framework for characterizing design patterns in medical multi-agent systems, as well as proposes future directions including human-AI collaboration, self-evolving systems, and multimodal integration."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper specifically focuses on multi-agent systems and interactions in medicine, which complements existing survey papers in the field and provides additional insights on the design of multi-agent systems. It clearly compares and contradicts its contributions with existing papers.  \n- The paper provides design-focused takeaways, such as \"how to compose teams\" and \"how to enable interaction\". This could be useful for system builders."}, "weaknesses": {"value": "1. Lack of visualization in the paper. \n- The main paper does not have any figures or tables, which I think makes the paper a bit hard to read. It would be very helpful to have a flow diagram explaining your methodology of selecting and categorizing papers, as well as a figure showing the three dimensions and the subcategories that fall underneath each. \n- Is there a way to have a condensed version of Table 1 or Figure 1 in the main paper? \n\n2. Limited analytical depth. \n- The paper mainly *describes* existing work and explain why they fall under the proposed taxonomy, but there is little critical assessment of the papers and meta-level discussions on the limitations of these works. There is also little comparative analysis of the papers, such as showing which design combinations are effective. \n\n3. The methodology of designing the taxonomy is unclear. \n- The paper treats the proposed taxonomy as a given, without explaining how they came up with the three dimensions and the criteria used."}, "questions": {"value": "1. How does \"clinical task-driven flow\" differ from \"problem-solving cycles\"? \n\n2. How did you come up with the three dimensions (team composition, medical knowledge enhancement, agent interaction)? (related to weakness 2)"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eBJyceHJoS", "forum": "MvlBFwAwK8", "replyto": "MvlBFwAwK8", "signatures": ["ICLR.cc/2026/Conference/Submission1883/Reviewer_jDVj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1883/Reviewer_jDVj"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission1883/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762894190241, "cdate": 1762894190241, "tmdate": 1762915927232, "mdate": 1762915927232, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}