{"id": "MW9fbt9q1g", "number": 14667, "cdate": 1758241253635, "mdate": 1759897356185, "content": {"title": "Tracking Temporal Dynamics of Vector Sets with Gaussian Process", "abstract": "Understanding the temporal evolution of sets of vectors is a fundamental challenge across various domains, including ecology, crime analysis, and linguistics. \nFor instance, ecosystem structures evolve due to interactions among plants, herbivores, and carnivores; the spatial distribution of crimes shifts in response to societal changes; \nand word embedding vectors reflect cultural and semantic trends over time. \nHowever, analyzing such time-varying sets of vectors is challenging due to their complicated structures, which also evolve over time. \nIn this work, we propose a novel method for modeling the distribution underlying each set of vectors using infinite-dimensional Gaussian processes. \nBy approximating the latent function in the Gaussian process with Random Fourier Features, we obtain compact and comparable vector representations over time. \nThis enables us to track and visualize temporal transitions of vector sets in a low-dimensional space.\nWe apply our method to both sociological data (crime distributions) and linguistic data (word embeddings), demonstrating its effectiveness in capturing temporal dynamics. \nOur results show that the proposed approach provides interpretable and robust representations, offering a powerful framework for analyzing structural changes in temporally indexed vector sets across diverse domains.", "tldr": "We propose a method that models vector sets as distributions via Gaussian processes, enabling interpretable low-dimensional tracking of temporal dynamics in data like crime patterns and word embeddings.", "keywords": ["Spatial Statistics", "Gaussian Process", "Interpretable Representation Learning"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/6b45c69f520eb0ea0c22903c87e613069421684d.pdf", "supplementary_material": "/attachment/758ba669b4a096a7babfd3eca9547d00dda862b6.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces a novel approach to modeling and visualizing the temporal dynamics of sets of vectors. The central idea is to represent each time-dependent vector set as probability distributions using Gaussian Processes approximated via Random Fourier Features (RFF). This produces compact K-dimensional representations that can be tracked and visualized over time using PCA.\nExperiments have been conducted on synthetic and real data."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Coupling the Gaussian Process modeling with a finite dimensional representation using Random Fourier Features is promissing.\nThe initial results suggest potential benefits."}, "weaknesses": {"value": "The overall method sounds interesting but lacks clarity.\n\n•\tSome estimated densities show high values in empty regions. The heat maps do not reflect completely the behaviours.\n•\tPCA interpretation is not always straightforward (PC1/PC2 excluded for crimes). How much variance is explained? And why choosing PCA3 and 5 sometimes and how much variance do they explain?\n•\tPart of the method is unclear: it uses Metropolis-Hastings for optimization although these methods are samplers. How do you use this for optimization?\n•\tThe crime data lacks connection to external factors (e.g., policy changes etc.. ) for interpretation\n\nIn summary, it is an interesting idea to represent evolving vector sets as trajectories in RFF weight space, but execution and validation need strengthening."}, "questions": {"value": "See weakness and related questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "6bIFisXeI3", "forum": "MW9fbt9q1g", "replyto": "MW9fbt9q1g", "signatures": ["ICLR.cc/2026/Conference/Submission14667/Reviewer_fwX8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14667/Reviewer_fwX8"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14667/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761322167309, "cdate": 1761322167309, "tmdate": 1762925038806, "mdate": 1762925038806, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a framework for modeling how sets of vectors evolve over time using Gaussian Processes (GPs) approximated via Random Fourier Features (RFF). By representing each vector set as a K-dimensional embedding derived from a GP-based density model, the method captures global distributional structures at each time step. Temporal changes are then visualized through PCA projections of these embeddings, enabling interpretable analysis of dynamics in a low-dimensional space. Experiments on synthetic data, Chicago crime distributions, and semantic shifts in English words demonstrate that the approach effectively captures both spatial and semantic transitions."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The problem of tracking the temporal dynamics of vector sets is important.\n- The authors conducted experiments using multiple synthetic and real datasets with the proposed method and examined the analysis results."}, "weaknesses": {"value": "- The proposed method using RFF-based GP and PCA is merely a combination of existing methods and lacks novelty.\n- Approaches considering the temporal evolution of weights for basis functions, such as spectral methods, have been widely used for a long time.\n- The advantage of using Gaussian processes is not clear."}, "questions": {"value": "- What does the label z in equation (2) refer to?\n- It might be interesting to consider the time evolution of weight coefficients in continuous time, as in spectral methods for numerical simulation."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "zeIQZsMwRG", "forum": "MW9fbt9q1g", "replyto": "MW9fbt9q1g", "signatures": ["ICLR.cc/2026/Conference/Submission14667/Reviewer_5xRr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14667/Reviewer_5xRr"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14667/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761713514422, "cdate": 1761713514422, "tmdate": 1762925038317, "mdate": 1762925038317, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposed to model the temporal evolution of a set of vectors via Gaussian processes (GPs). GPs are hard to compute due to its use of kernel method in the covariant matrix, so random Fourier features (RFFs) are used to approximate the inference of GPs."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The proposed method is a simple yet elegant way of dealing with vector sets."}, "weaknesses": {"value": "- The novelty of this paper is somewhat limited. The main technical contribution here is applying GPs to vector sets, and the idea of using RFFs to work with the inference of GPs are not novel.\n- The authors used a 2-dim PCA to visualize the multi-dimensional data. Why don't use a better method such as t-SNE?\n- There is no comparison with other related methods that models evolution of vector sets."}, "questions": {"value": "- L230: I think it should be $b_k \\sim \\mathrm{Unif}[0, 2\\pi] $, not $[0, 1]$."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "egepG1S19R", "forum": "MW9fbt9q1g", "replyto": "MW9fbt9q1g", "signatures": ["ICLR.cc/2026/Conference/Submission14667/Reviewer_kraX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14667/Reviewer_kraX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14667/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762030339815, "cdate": 1762030339815, "tmdate": 1762925037793, "mdate": 1762925037793, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel framework for modeling and visualizing how sets of vectors evolve over time, a problem relevant to diverse domains such as ecology, crime analysis, and linguistics. The core idea is to represent each time-indexed vector set as a distribution modeled using Gaussian Processes, and then to obtain a compact, comparable vector representation through Random Fourier Features.\n\nBy sampling cosine basis functions and estimating their weights, the authors express each vector set as a K-dimensional weight vector. Applying Principal Component Analysis to these weight vectors across time enables interpretable low-dimensional trajectories that capture the temporal transitions of distributions."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces an innovative approach to representing and tracking the evolution of vector sets over time by combining Gaussian Processes with Random Fourier Features. \n2. The paper leverage PCA method to provide intuitive understanding of temporal dynamics.\n3. The paper is well-structured, with clear methodological exposition, illustrative figures, and detailed experimental setups."}, "weaknesses": {"value": "1. It seems like the experiments, while diverse (synthetic, crime, and linguistic datasets), remain primarily qualitative.\n2. The paper applies a single set of hyperparameters (e.g., RFF dimension K=30, Gaussian kernel bandwidth) across all experiments, without justification or sensitivity analysis."}, "questions": {"value": "1. The model estimates RFF weights via a Metropolis–Hastings sampler, which can be computationally intensive. What is the runtime and scalability behavior with respect to the number of samples, time steps, and feature dimensions?\n2. Have you considered how these temporal trajectories could be used in downstream tasks?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "ooI89p4Vxb", "forum": "MW9fbt9q1g", "replyto": "MW9fbt9q1g", "signatures": ["ICLR.cc/2026/Conference/Submission14667/Reviewer_m4nT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14667/Reviewer_m4nT"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14667/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762224189253, "cdate": 1762224189253, "tmdate": 1762925037341, "mdate": 1762925037341, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}