{"id": "mytIKuRsSE", "number": 12148, "cdate": 1758205975069, "mdate": 1763344327688, "content": {"title": "Learning with Dual-level Noisy Correspondence for Multi-modal Entity Alignment", "abstract": "Multi-modal entity alignment (MMEA) aims to identify equivalent entities across heterogeneous multi-modal knowledge graphs (MMKGs), where each entity is described by attributes from various modalities. Existing methods typically assume that both intra-entity and inter-graph correspondences are faultless, which is often violated in real-world MMKGs due to the reliance on expert annotations.\nIn this paper, we reveal and study a highly practical yet under-explored problem in MMEA, termed Dual-level Noisy Correspondence (DNC).\nDNC refers to misalignments in both intra-entity (entity-attribute) and inter-graph (entity-entity and attribute-attribute) correspondences.\nTo address the DNC problem, we propose a robust MMEA framework termed RULE. RULE first estimates the reliability of both intra-entity and inter-graph correspondences via a dedicated two-fold principle. Leveraging the estimated reliabilities, RULE mitigates the negative impact of intra-entity noise during attribute fusion and prevents overfitting to noisy inter-graph correspondences during inter-graph discrepancy elimination. Beyond the training-time designs, RULE further incorporates a correspondence reasoning module that uncovers the underlying attribute-attribute connection across graphs, guaranteeing more accurate equivalent entity identification.\nExtensive experiments on five benchmarks verify the effectiveness of our method against the DNC compared with seven state-of-the-art methods. \nThe code will be released upon acceptance.", "tldr": "", "keywords": ["Noisy correspondence; Multi-modal entity alignment."], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/79cd7bfaf1600d33234004f7990cb09a1d6372c0.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "In this paper, the authors study a new and practical problem in MMEA called dual-level noisy correspondence (DNC), where both intra-entity and inter-graph correspondences might be noisy. To address this, the authors propose a robust framework (RULE) that estimates correspondence reliability based on a two-fold principle. With the estimated reliabilities, RULE performs noise-aware attribute fusion and discrepancy elimination, and further introduces a correspondence reasoning module to enhance test-time robustness. The authors conduct thoughtful experiment designs and the results show that RULE achieves significant improvements over existing methods. Overall evaluation, this is a good paper with interesting motivation and solid results."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "This paper reveals a highly practical yet underexplored challenge (DNC) in MMEA. I appreciate the motivation of this work and believe that tackling DNC is valuable, as intra-entity and inter-graph noisy correspondences are often inevitable in real-world datasets. Particularly, the authors further provide statistical analysis of the noise distribution in real-world datasets in the Appendix, which is convincing and further highlights the necessity of addressing DNC. To address the DNC problem, the paper proposes a unified principle to estimate the reliability of correspondences across different levels. Based on the estimated reliability, RULE enhances robustness against DNC in both the training and inference phases, pioneering a full-process robust learning paradigm for MMEA. Overall, the paper tackles a meaningful and practical problem with a technically sound solution."}, "weaknesses": {"value": "Although the paper is well-motivated and presents a technical-sound solution, I have several questions and suggestions for further improvement as follows:\n- There are some prior efforts on learning with noisy correspondence (NC) in cross-modal retrieval. Since DNC could be viewed as a special case of NC in MMEA, I wonder whether existing NC-oriented methods are adequate for addressing the DNC challenge. I encourage the authors to clarify the distinctions and advantages of RULE over prior NC-oriented studies. Moreover, I notice that the paper ``Tackling Uncertain Correspondences for Multi-Modal Entity Alignment [A]” share some similar motivation with this submission, could the authors give some discussions?\n- I am curious about how the DNC ratios (0%, 20%, and 50%) used in the experimental settings are determined. Are these noise ratios chosen based on empirical observations or following prior studies? It would be helpful if the authors could clarify the reasons behind these choices.\n- As far as I know, uncertainty has been widely used as a principle for identifying noise input in classification tasks. However, I’m not clear about why uncertainty is insufficient to measure the reliabilities of the correspondences in MMEA. In other words, what motivates the introduction of the consensus principle?\n- I am particularly curious about how the TTR module rectifies correspondences during test time. It is recommended that the authors include visualization examples to illustrate this process."}, "questions": {"value": "- Provide more discussion on the differences between the proposed method and existing NC-oriented approaches and the related work [A].\n- Explain the choice of noise ratios (0%, 20%, 50%) in the experiments.\n- Justify the necessity of the consensus principle.\n- Visualize the test-time reasoning process to offer more intuitive insights into how the TTR module rectifies correspondences."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "BcfJIS3c0t", "forum": "mytIKuRsSE", "replyto": "mytIKuRsSE", "signatures": ["ICLR.cc/2026/Conference/Submission12148/Reviewer_1ndq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12148/Reviewer_1ndq"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12148/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761749294986, "cdate": 1761749294986, "tmdate": 1762923105230, "mdate": 1762923105230, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper makes the first attempt to explore dual-level noisy correspondences (DNC) in the field of multi-modal entity alignment (MMEA). To address this issue, the proposed RULE could not only achieve robust cross-graph learning and multi-modal fusion during training, but also incorporates a correspondence reasoning module to enhance test-time robustness and thus achieves more accurate entity alignment across heterogeneous multi-modal knowledge graphs. Extensive experiments demonstrate that RULE outperforms state-of-the-art MMEA methods, while showing significantly slower performance degradation as noise levels increase."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "1. This paper is well-motivated and is clearly organized.\n2. The intuitive illustrations in Figure 1 make the DNC phenomenon and its negative impacts clear.\n3. The experiments are convincing, e.g., the visualizations (Figure 3b) of the reliability estimation, pair division process (Figure 4) further prove the effectiveness of the proposed RULE.\n4. Most impressively, Appendix B not only analyzes the noise statistics in real-world datasets but also discusses the underlying causes of DNC. Correspondingly, the framework demonstrates strong performance under both noise-injected and inherent DNC settings, further validating the presence of DNC in real-world datasets."}, "weaknesses": {"value": "1. Since both uncertainty and consensus are estimated through cross-graph relationships, I don’t understand why such relationships could be employed to estimate reliability of intra-graph attributes. A more intuitive and detailed explanation of this design would be very helpful for understanding.\n2. In my understanding, the MLLM-based reasoning module aims to uncover underlying associations between attributes. I am interested in what kinds of associations can be further mined by the MLLM, for example, beyond the cases illustrated in Figure 1(c). Furthermore, I wonder whether the proposed MLLM-based reasoning module could be extended to other tasks, such as image-text retrieval.\n3. Since the proposed RULE is a model-agnostic framework, which means RULE could be applied on various backbones. It would further strengthen the contribution if the authors could demonstrate the generalizability of RULE across more diverse backbones.\n4. I want to see more details about the computational complexity of the proposed RULE. In particular, the MLLM-based reasoning module may introduce considerable time and memory. It would be valuable for the authors to provide a detailed analysis of the reasoning time, GPU requirements."}, "questions": {"value": "Please see the Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "D1EiEtmVEU", "forum": "mytIKuRsSE", "replyto": "mytIKuRsSE", "signatures": ["ICLR.cc/2026/Conference/Submission12148/Reviewer_ny9k"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12148/Reviewer_ny9k"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12148/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761749399927, "cdate": 1761749399927, "tmdate": 1762923104464, "mdate": 1762923104464, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses a critical issue in MMEA, namely Dual-level Noisy Correspondence (DNC), which refers to the misalignments at both the intra-entity, entity-attribute, and inter-graph, entity-entity, attribute-attribute, levels. This noise can severely degrade performance in multi-modal knowledge graph alignment tasks, which is a common problem in real-world benchmarks. To tackle this issue, the authors propose a framework called RULE, which robustly estimates the reliability of these correspondences using a two-fold principle, uncertainty and consensus. RULE mitigates the impact of noisy correspondences during training and incorporates a test-time correspondence reasoning module to enhance the robustness during inference. Experiment demonstrates that RULE outperforms existing state-of-the-art methods across several datasets and noise settings."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The identification and study of dual-level noisy correspondence is a novel and significant contribution to the MMEA task. It acknowledges that real-world knowledge graphs often contain significant noise both within entities and across graphs, which previous methods have largely ignored.\n\n2. The proposed RULE framework leverages reliability estimation using uncertainty and consensus to combat noisy correspondences. The test-time correspondence reasoning module is a key innovation that improves entity identification at inference time, ensuring better alignment even when certain correspondences are noisy or unreliable."}, "weaknesses": {"value": "1. This paper includes some parameter analysis like trade-off parameter λ, threshold β, and temperature τ, but there is no comprehensive discussion of how these hyperparameters affect the model’s robustness under various noise settings. For instance, how does RULE perform with different datasets or in cases where the noise level is very high, e.g., >50%?\n\n2. RULE relies heavily on pre-trained CLIP models for image and text embeddings. While this is a reasonable approach, it could limit the flexibility of the model in scenarios where domain-specific or fine-grained embeddings are needed.\n\n3. It seems lack of how the framework handles extreme cases, such as when the noise level exceeds 50%, or when the correspondence noise is extremely high in one modality (e.g., image attributes).\n\n4. While the TTR module improves the robustness during inference, it may introduce additional computational overhead. The reasoning process involves complex reasoning steps and large language model queries, which could be slow and computationally expensive, especially for large-scale graphs."}, "questions": {"value": "1. Could you provide a more detailed analysis of how the hyperparameters (λ, β, τ) affect the performance of RULE under different noise levels? Are there specific configurations where the model is more or less sensitive? It would be useful to explore whether hyperparameter tuning plays a significant role in noise resilience.\n\n2. How do you think RULE compares to methods like graph matching or other representation learning-based approaches that also handle noisy correspondences? Some methods like [1] also addresses noise in multi-modal entity alignment, which names semantic consistency. It would be better if you can compare and analyze them.\n\n3. I`m wondering how does RULE perform in extreme noise scenarios like >50% noise or heavily corrupted attributes in one modality? Would the model still perform robustly, or would it need additional modifications?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ejuN30H7pq", "forum": "mytIKuRsSE", "replyto": "mytIKuRsSE", "signatures": ["ICLR.cc/2026/Conference/Submission12148/Reviewer_Xav9"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12148/Reviewer_Xav9"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12148/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761756436369, "cdate": 1761756436369, "tmdate": 1762923104099, "mdate": 1762923104099, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}