{"id": "mzlScdrryB", "number": 18774, "cdate": 1758290769450, "mdate": 1759897081918, "content": {"title": "Permutation-Invariant Spectral Learning via Dyson Diffusion", "abstract": "Diffusion models are central to generative modeling and have been adapted to graphs by diffusing adjacency matrix representations. The challenge of having up to $n!$ such representations for graphs with $n$ nodes is currently partially mitigated by using permutation-equivariant learning architectures. However, despite their computational efficiency, existing graph diffusion models struggle to distinguish certain graph families, unless graph data are augmented with ad hoc features.\nThis shortcoming stems from enforcing the inductive bias within the learning architecture.\nIn this work, we leverage random matrix theory to analytically extract the spectral properties of the diffusion process, allowing us to push the inductive bias from the architecture into the dynamics. Building on this, we introduce the Dyson Diffusion Model, which employs Dyson's Brownian Motion to capture the spectral dynamics of an Ornstein–Uhlenbeck process on the adjacency matrix while retaining all non-spectral information.\nWe demonstrate that the Dyson Diffusion Model can accurately learn the spectrum, outperforming existing graph diffusion models.", "tldr": "We design a diffusion model focused on Dyson's Brownian motion to learn spectra without the need for permutation-equivariant learning architectures, while preserving all remaining information.", "keywords": ["Denoising Diffusion Model", "Graph Generation", "Dyson Brownian Motion", "Random Matrices"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/27a71c9e15dec4f0746876c8b7b0a9f69c45c0f5.pdf", "supplementary_material": "/attachment/80dba99ee3f5faa44940e8171f659639927ccee3.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a new way to do graph diffusion by moving permutation invariance from the neural architecture to the diffusion dynamics. Instead of diffusing adjacency matrices with GNN-based architectures, the authors use random matrix theory and Dyson Brownian Motion to directly model and generate the eigenvalue trajectories of graphs."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "**1. Novel problem formulation**\n\nThe paper introduces a new perspective on graph diffusion by shifting permutation invariance from neural architecture to stochastic dynamics. Leveraging Dyson Brownian Motion to model spectral evolution is grounded in random matrix theory, offering a principled alternative to the WL-limited message-passing paradigm.\n\n**2. Addresses a fundamental limitation in graph generative models**\n\nThe work directly tackles the expressivity constraints of GNN-based diffusion models and clearly demonstrates how current architectures fail on WL-equivalent graphs. The proposed DyDM avoids these blind spots and captures spectral distributions that traditional models struggle with."}, "weaknesses": {"value": "**1. Limited scope: generates spectra, not full graphs**\n\nExperiments merely demonstrates spectral generation. No adjacency-level reconstruction or topology sampling is shown, so the model currently functions as a spectral generator, not a full graph generator. This may limit perceived practical impact unless downstream graph construction is demonstrated.\n\n**2. Scalability and efficiency unclear**\n\nThe Dyson SDE requires adaptive step control and an equilibrium shooting rescue mechanism. The paper lacks of computational complexity analysis, training/inference time comparison and memory usage reports.\n\n**3. Evaluation narrowly focused on spectrum fidelity**\n\nEvaluaition mainly focus on spectral statistics (i.e., mean and marginal Wasserstein distance). More broader evaluation could be better. e.g., dowmstream task performance (i.e., graph generation), visual or qualitative graph samples.\n\n**4. Limited benchmarks**\n\nExperiments emphasize synthetic WL-equivalent cases and small community/brain datasets (i.e., for Brain datasets of size 5 to 10 vertices). No results on widely used graph-gen benchmarks (e.g., ZINC, Planetoid citation graphs, Proteins). This makes generalization claims harder to assess."}, "questions": {"value": "1. Is full graph reconstruction via the eigenvector SDE currently feasible, or is DyDM’s scope limited to spectral generation at this stage?\n\n2. Dyson dynamics have singular drift near eigenvalue collisions. While adaptive control handles this, how robust is the proposed solver under near-degenerate spectra, such as graphs with high symmetry or repeated eigenvalues?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "BipCXYs3Vo", "forum": "mzlScdrryB", "replyto": "mzlScdrryB", "signatures": ["ICLR.cc/2026/Conference/Submission18774/Reviewer_zqUH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18774/Reviewer_zqUH"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761878667235, "cdate": 1761878667235, "tmdate": 1762999983691, "mdate": 1762999983691, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes the Dyson Diffusion Model (DyDM), which analytically decomposes an Ornstein–Uhlenbeck diffusion on graph adjacency matrices into eigenvalue (spectrum) and eigenvector dynamics via random matrix theory: eigenvalues follow Dyson Brownian Motion (permutation-invariant), so the score can be learned with any architecture while preserving non-spectral information through an eigenvector SDE—yielding more accurate spectrum learning than GNN/transformer graph diffusion and mitigating GI/WL expressivity blind spots."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Principled permutation invariance via dynamics: Shifts the inductive bias from architecture to the SDE itself (DBM), enabling architecture-agnostic spectral learning and avoiding GI/WL limitations.\n\n2. Information-preserving and effective: Retains non-spectral content (theorem-backed) and empirically outperforms GNN/transformer baselines on spectrum predict"}, "weaknesses": {"value": "1. Scope limited to spectral generation: The current experiments focus on generating graph spectra, without demonstrating adjacency-level reconstruction or topology sampling. As a result, the method operates primarily as a spectral generator rather than a full graph generative model. Demonstrating downstream graph construction would strengthen the practical impact.\n\n2. Scalability and computational efficiency not established The proposed approach involves adaptive step-size control and a shooting mechanism for stability, yet the paper does not report computational complexity, runtime comparisons, or memory usage. Without such analysis, it remains unclear how well the method scales to larger graphs or real-world workloads."}, "questions": {"value": "See the weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ok2U09U7TZ", "forum": "mzlScdrryB", "replyto": "mzlScdrryB", "signatures": ["ICLR.cc/2026/Conference/Submission18774/Reviewer_STxX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18774/Reviewer_STxX"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761924116735, "cdate": 1761924116735, "tmdate": 1762999983474, "mdate": 1762999983474, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new diffusion model for graph generation, called the Dyson Diffusion Model (DyDM), which aims to achieve a permutation-invariant diffusion process.\nThe model is based on the Dyson Brownian Motion, a modified version of the Ornstein–Uhlenbeck (OU) process that includes a repulsive force between eigenvalues, allowing the diffusion to evolve in the spectral domain in a physically coherent manner.\nThe central idea is to shift permutation invariance from the model architecture (as done in GNNs or transformers) to the diffusion dynamics itself, by operating directly on the spectrum of the graph adjacency matrix."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper is well written and clearly organized.\nThe proposed formulation is interesting and promising, as it represents a relevant step toward a better understanding of permutation-invariant graph generation based on spectral properties.\nMoreover, the derivation grounded in the Dyson Brownian Motion provides the model with a solid theoretical foundation (although I did not verify every formula in detail)."}, "weaknesses": {"value": "The work introduces a theoretically elegant idea, but unfortunately, it falls short in terms of experimental validation (expected for this venue).\n- The model operates only on eigenvalues and does not reconstruct graphs. This limits its practical relevance, as it only generates spectral distributions, not concrete graph structures.\n- The experimental evaluation is limited, as it does not include standard benchmarks (e.g., QM9, ZINC, ENZYMES) nor significant competitors in spectral generation (e.g., SPECTRE, GGSD).\n- A brief intuitive explanation of the Ornstein–Uhlenbeck process would improve clarity, since it represents the theoretical basis of the model.\n- The advantage of using Dyson diffusion over other spectral models (e.g., those based on Transformers) should be better motivated.\nIn particular, both types of models are permutation-invariant, but differ only in how they treat the physics of the spectrum: the Dyson Diffusion Model does not introduce a new kind of invariance, but rather a more physically consistent formulation of diffusion. However, it does not demonstrate a clear empirical benefit over existing approaches.\n- The related work section omits important recent studies on spectral reconstruction, such as:\n\n  -Minello, Giorgia, Alessandro Bicciato, Luca Rossi, Andrea Torsello, and Luca Cosmo. Generating Graphs via Spectral Diffusion. Proceedings of the Thirteenth International Conference on Learning Representations (ICLR 2025).\n\n\n  -Martinkus, Karolis, Andreas Loukas, Nathanaël Perraudin, and Roger Wattenhofer. Spectre: Spectral Conditioning Helps to Overcome the Expressivity Limits of One-Shot Graph Generators. ICML 2022."}, "questions": {"value": "The authors mention that the approach could be extended to other matrices beyond the adjacency one (e.g., Laplacian or normalized Laplacian).\nI was wondering whether the authors conducted any preliminary exploration to at least gain some intuition about how the method would behave with these alternative spectral representations.\n\n*Minor* Line 77, page 2: “we show that an OU diffusion on the graph can be dissected into diffusion of the …”\nThe acronym OU, referring to the Ornstein–Uhlenbeck process, should be explicitly defined when first introduced."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jX9IK0FpKG", "forum": "mzlScdrryB", "replyto": "mzlScdrryB", "signatures": ["ICLR.cc/2026/Conference/Submission18774/Reviewer_Lp4a"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18774/Reviewer_Lp4a"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission18774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762589352721, "cdate": 1762589352721, "tmdate": 1762999983516, "mdate": 1762999983516, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work introduces the Dyson Diffusion Model (DyDM), a novel approach that learns graph spectra through an Ornstein–Uhlenbeck-driven diffusion process without relying on GNNs or graph transformers. DyDM preserves full graph information and enables the formulation of an eigenvector SDE. Experiments show that DyDM outperforms existing spectral learning methods and highlights the limitations of GNN-based graph diffusion models."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces a novel diffusion model that enables graph spectrum learning without relying on GNNs or Transformers.\n\n2. The model demonstrates strong empirical performance on distinguishing WL-equivalent but non-isomorphic graphs"}, "weaknesses": {"value": "* As mentioned in paper, \"work on the set of symmetricreal matrices\". The method is limited applicability to general graph types, such as such as directed or attributed graphs.\n\n* Lack of structural recovery evaluation makes it unclear how effectively the model can reconstruct full graph structures.\n\n* The evaluation is limited to statistical fidelity of the spectrum. This limits the understanding of the model’s utility.\n\n* Figure 2 claims that DyDM successfully distinguishes WL-equivalent graphs A and B. However, the paper does not clearly explain how these graphs are constructed. Whether types of A differ in their spectra.\n\n\n* While the Brain dataset is used , most baseline models are not evaluated on it. The paper does not explain why these comparisons are missing. \n\n* The paper overlooks foundational spectral methods in graph theory, such as spectral clustering and Laplacian-based analysis. And does not discuss the computational cost or applicability limitations of eigenvalue decomposition.\n\n[1] Gallagher, Ian, Andrew Jones, Anna Bertiger, Carey E. Priebe, and Patrick Rubin-Delanchy. \"Spectral embedding of weighted graphs.\" Journal of the American Statistical Association 119, no. 547 (2024): 1923-1932.\n[2] Chung, Fan RK. Spectral graph theory. Vol. 92. American Mathematical Soc., 1997."}, "questions": {"value": "* How exactly are graphs A and B constructed? Are the adjacency matrices of different versions of graph A identical or permutation variants of the same matrix?\n\n* Why are baseline models missing on Brain?\n\n* Can the model handle attributed or directed graphs?\n\n* Can the model be used for downstream tasks?\n\n* How does the runtime of the DyDM scale with graph size (n) compared to training a GNN-based model? A runtime/memory comparison would be valuable."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "5yRN3Q0VcL", "forum": "mzlScdrryB", "replyto": "mzlScdrryB", "signatures": ["ICLR.cc/2026/Conference/Submission18774/Reviewer_54zp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18774/Reviewer_54zp"], "number": 6, "invitations": ["ICLR.cc/2026/Conference/Submission18774/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762599912930, "cdate": 1762599912930, "tmdate": 1762999983615, "mdate": 1762999983615, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces the Dyson Diffusion Model (DyDM), a novel approach for permutation-invariant graph generation via spectral learning. The key idea is to leverage Dyson’s Brownian Motion (DBM) to model the evolution of graph spectra during an Ornstein–Uhlenbeck diffusion process on adjacency matrices. By analytically decoupling the eigenvalue dynamics (which are permutation-invariant) from the eigenvector dynamics, DyDM avoids the limitations of prior graph diffusion models that rely solely on permutation-equivariant architectures like GNNs or graph transformers. The authors demonstrate that DyDM outperforms existing methods in learning graph spectra, especially on challenging graph families where traditional models fail due to Weisfeiler–Leman (WL) equivalence."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.The theoretical foundation is strong, building on well-established results from random matrix theory and stochastic differential equations.\n2.Experimental results are comprehensive and compare against multiple state-of-the-art baselines (EDP-GNN, GDSS, ConGress, DiGress) across synthetic and real-world datasets."}, "weaknesses": {"value": "1.The method currently focuses on spectral generation and does not fully address the generation of the entire graph (eigenvectors are not modeled in the generative process, though their dynamics are derived).\n2.The numerical challenges of simulating Dyson-BM (e.g., singularities, adaptive step sizing) may limit scalability or ease of implementation."}, "questions": {"value": "1.How does DyDM scale with graph size n, especially given the need for adaptive step sizing and the conditioning on non-crossing events?\n2.Have the authors considered applying DyDM to other symmetric matrix data (e.g., covariance matrices) beyond graphs?\n3.How sensitive is the model to the choice of hyperparameters α,β and the time schedule?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "HYxfxSO7MQ", "forum": "mzlScdrryB", "replyto": "mzlScdrryB", "signatures": ["ICLR.cc/2026/Conference/Submission18774/Reviewer_uLbz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18774/Reviewer_uLbz"], "number": 7, "invitations": ["ICLR.cc/2026/Conference/Submission18774/-/Official_Review"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763013280285, "cdate": 1763013280285, "tmdate": 1763013280285, "mdate": 1763013280285, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}