{"id": "NbJ7sb8aIR", "number": 20853, "cdate": 1758310965012, "mdate": 1759896955296, "content": {"title": "A Spectral Framework for Evaluating Geodesic Distances Between Graphs", "abstract": "This paper presents a spectral framework for quantifying the differentiation between graph data samples by introducing a novel metric named Graph Geodesic Distance (GGD). For two different graphs with the same number of nodes, our framework leverages a spectral graph matching procedure to find node correspondence so that the geodesic distance between them can be subsequently computed by solving a generalized eigenvalue problem associated with their Laplacian matrices. For graphs of different sizes, a resistance-based spectral graph coarsening scheme is introduced to reduce the size of the larger graph while preserving the original spectral properties. We show that the proposed GGD metric can effectively quantify dissimilarities between two graphs by encapsulating their differences in key structural (spectral) properties, such as effective resistances between nodes, cuts, and the mixing time of random walks. Through extensive experiments comparing with state-of-the-art metrics, such as the latest Tree-Mover's Distance (TMD), the proposed GGD metric demonstrates significantly improved performance for graph classification, particularly when only partial node features are available. Furthermore, we extend the application of GGD beyond graph classification to stability analysis of GNNs and the quantification of distances between datasets, highlighting its versatility in broader machine learning contexts.", "tldr": "We introduce a spectral metric for measuring geodesic distances between graphs, enabling robust assessment across various machine learning applications.", "keywords": ["Graph Theory", "Graph Neural Network", "Graph Laplacian", "Riemannian Manifold", "Geodesic", "Graph Classification"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/6a0d0547bc6ed3d70d2ad3a402f12c9accb6758e.pdf", "supplementary_material": "/attachment/282f7d928f5bc7747992937829b1b660eb4b4a8d.zip"}, "replies": [{"content": {"summary": {"value": "The core of this research is the Graph Geodesic Distance (GGD), a spectral metric that quantifies graph differences. It works by using spectral graph matching to align nodes, followed by calculating the geodesic distance between their Modified Laplacian Matrices. For graphs of unequal size, it employs a resistance-based coarsening scheme. The method require point alignment which is done prior to the metric calculation."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The main strength of this approach is its complexity O(N^3) versus TMD.  On top of that the switch to spectrum comparison provides also superior results on graph classification as it handles structural dissimilarities (spectrum) better."}, "weaknesses": {"value": "The main weakness is the need of point to point matching. This dependance puts limit on the size of the data that is feasible for comparison and puts a shade on the advantages of the spectrum comparison because it relies on point-to-point in pre-calc."}, "questions": {"value": "Regarding Scalability and Approximation:  For large-scale graph comparisons, the paper suggests approximating GGD using a small fraction of extreme eigenvalues to maintain a low runtime. Any results or insights on the limitations and success of sub-graphs?\n\nRegarding Generalized Graph Structures: Since the current framework is limited to simple, undirected graphs, what specific changes would be required in Phase 1 (Spectral Graph Matching) and Phase 2 (GGD Calculation) to successfully extend the GGD metric to handle directed graphs or graphs that incorporate higher-order structural information?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "L3mwM80pDn", "forum": "NbJ7sb8aIR", "replyto": "NbJ7sb8aIR", "signatures": ["ICLR.cc/2026/Conference/Submission20853/Reviewer_Wuft"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20853/Reviewer_Wuft"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20853/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761826486506, "cdate": 1761826486506, "tmdate": 1762999997824, "mdate": 1762999997824, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Graph Geodesic Distance (GGD), a spectral-geometric framework for measuring distances between graphs. Each graph is represented by a modified Laplacian (made SPD by adding a small diagonal value), and the distance between two graphs is defined as the affine-invariant Riemannian geodesic between their Laplacians. For graphs of different sizes, a resistance-based spectral coarsening is introduced to reduce the larger graph while preserving spectral structure. Empirical results show that GGD outperforms Tree Mover’s Distance (TMD), Weisfeiler–Lehman kernels, and several GNN baselines on graph classification, especially when node features are missing. GGD also correlates better with GNN embeddings for stability analysis and runs roughly 6–9× faster than TMD. This is a carefully executed and well-written paper that applies SPD manifold geometry to graph comparison in a principled way. The work is incremental but high-quality and will be of interest to researchers in geometric and spectral graph learning."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "* Strong mathematical grounding: GGD is rigorously defined on the SPD manifold with formal proofs that it satisfies the metric axioms (identity, symmetry, positivity, triangle inequality). The connection between generalized eigenvalues and “cut mismatches” provides a meaningful spectral interpretation.\n* Empirical performance: Demonstrates steady improvements (5–10 pp accuracy gains) over TMD and GNN baselines on benchmark datasets, and robustness under partial or missing node features."}, "weaknesses": {"value": "* Expensive and small-scale: The method still requires multiple cubic-time steps (eigendecomposition, assignment, generalized eigenvalues). Approximate variants are described but not fully benchmarked on large graphs.\n* Limited exploration of SPD metrics: Only AIRM is fully tested; Log-Euclidean (LERM) appears briefly in the appendix and performs similarly. Other SPD metrics or linear approximations could be compared."}, "questions": {"value": "* Have you considered simpler or faster SPD metrics (e.g., Power–Euclidean) to trade some invariance for scalability?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "P3s3NkB1IN", "forum": "NbJ7sb8aIR", "replyto": "NbJ7sb8aIR", "signatures": ["ICLR.cc/2026/Conference/Submission20853/Reviewer_V3iB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20853/Reviewer_V3iB"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20853/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761996972458, "cdate": 1761996972458, "tmdate": 1762999997642, "mdate": 1762999997642, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a graph distance measure: Graph Geodesic Distance (GGD).\n\nTo compute GGD, the paper uses previous work by Fan et al. (2020) to perform spectral graph matching between the two input graphs. It then calculates GGD based on the eigenvalues of the Laplacian matrices of the matched graphs. This approach is not novel, and the authors list previous works that measure the distance between two graphs using the eigenvalues of their Laplacian matrices.\n\nSide note: There is a typo on line 482: \"LLM USEAGE\" should be \"LLM USAGE\"."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "Measuring distances on graphs is an important problem that has been studied for centuries. I suggest the authors review \"netrd: A library for network reconstruction and graph distances\" (https://joss.theoj.org/papers/10.21105/joss.02990) and the paper \"Network comparison and the within-ensemble graph distance\" (https://royalsocietypublishing.org/doi/10.1098/rspa.2019.0744)."}, "weaknesses": {"value": "-The Graph Geodesic Distance (GGD) is not a metric because it does not satisfy both directions of the identity of indiscernibles axiom: the distance between two points is zero if and only if they are the same point. This failure arises from the co-spectrality problem, where two graphs can have the same spectra but be different. Thus, GGD is a pseudo-metric.\n\n-GGD is not scalable to large graphs with millions of nodes because it requires spectral matching and eigenvalue computation.\n\n- Neither phase of GGD is new, as the authors point out in their manuscript."}, "questions": {"value": "- If you disagree with GGD being a pseudo-metric, please provide a proof for both directions of the identity of indiscernibles axiom.\n\n- Please show that the manifold assumptions hold across all graphs (e.g., social networks, biological networks, transportation networks, etc). You may use graph ensembles if you wish, where you know the processes that generated the graphs."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "rFL3nkCrnw", "forum": "NbJ7sb8aIR", "replyto": "NbJ7sb8aIR", "signatures": ["ICLR.cc/2026/Conference/Submission20853/Reviewer_s8m2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20853/Reviewer_s8m2"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20853/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762035986204, "cdate": 1762035986204, "tmdate": 1762999998327, "mdate": 1762999998327, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new spectral distance function to quantify the difference between two graphs of equal order.\nThe core idea is based on spectral graph matching (or alignment) process, drawing from a single previous work, GRAMPA.\nA coarsening method is also proposed to reduce one graph's size and render it identical to that of another input graph.\nAn experimental study compares the proposed method to selected measures, such as the Tree-Mover’s Distance (TMD)."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "S1. Addresses the problem of graph distance measurement in a novel manner.\n\nS2. Creatively exploits previous work in the area.\n\nS3. Conducts experiments vs. a single previous metric."}, "weaknesses": {"value": "W1. It is unclear why the new spectral distance function is necessary, and how it compares to established distance function such as the Frobenius norm between adjacency matrices and related graph alignment methods.\n\nW2. It is unclear how the proposed spectral comparison methodology differs from already existing spectral graph alignment methods such as GRASP [TKDD 17(4)].\n\nW3. It is unclear how the proposes spectral quantification of graph difference related to existing spectral signatures, such as NetLSD [KDD 2018]."}, "questions": {"value": "Address W1-W3."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "v04CGWiBeu", "forum": "NbJ7sb8aIR", "replyto": "NbJ7sb8aIR", "signatures": ["ICLR.cc/2026/Conference/Submission20853/Reviewer_ahNP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20853/Reviewer_ahNP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20853/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762073776581, "cdate": 1762073776581, "tmdate": 1762999998091, "mdate": 1762999998091, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}