{"id": "NFB4QGGS65", "number": 1699, "cdate": 1756908381302, "mdate": 1759898193839, "content": {"title": "The Geometry of LLM Quantization: GPTQ as Babai's Nearest Plane Algorithm", "abstract": "Quantizing the weights of large language models (LLMs) from 16-bit to lower bitwidth is the de facto approach to deploy massive transformers onto more affordable accelerators. While GPTQ emerged as one of the standard methods for one-shot post-training quantization at LLM scale, its inner workings are described as a sequence of ad-hoc algebraic updates that obscure geometric meaning or worst-case guarantees. In this work, we show that, when executed back-to-front (from the last to first dimension) for a linear layer, GPTQ is mathematically identical to Babai's nearest plane algorithm for the classical closest vector problem (CVP) on a lattice defined by the Hessian matrix of the layer's inputs. This equivalence is based on a sophisticated mathematical argument, and has two analytical consequences: first, the GPTQ error propagation step gains an intuitive geometric interpretation; second, GPTQ inherits the error upper bound of Babai's algorithm under the assumption that no weights are clipped. Leveraging this bound, we design post-training quantization methods that avoid clipping, and outperform the original GPTQ. In addition, we provide efficient GPU inference kernels for the resulting representation. Taken together, these results place GPTQ on a firm theoretical footing and open the door to importing decades of progress in lattice algorithms towards the design of future quantization algorithms for billion-parameter models.", "tldr": "The GPTQ algorithm is exactly Babai's nearest plane algorithm for the closest vector problem, giving a geometric view of LLM quantization.", "keywords": ["LLM", "Quantization", "Lattice Algorithm", "Closest Vector Problem"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d0b17575e97925ab0c393953ae2118987c120e2e.pdf", "supplementary_material": "/attachment/2839ada717db71d162dce00111f207ab8fa3ec49.zip"}, "replies": [{"content": {"summary": {"value": "The paper shows how GPTQ, a well-established method for model weight quantization, is mathematically equivalent to Babai's nearest plane algorithm, a technique for tackling the closest vector problem on a lattice. In the case of GPTQ, the lattice is defined by the Hessian matrix of the layer's inputs. By leveraging the connection, the authors are able to apply the error guarantees from Babai's algorithm to the GPTQ algorithm, as well as give a geometric interpretation to its quantization steps."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The paper is well-written and easy to follow. I was familiar with the GPTQ algorithm and its usage in quantization, but not with the nearest vector on a lattice problem; I believe the authors were able to clearly establish the connection, and introduce both techniques in a clear and instructive way. Even if the connection might have limited algorithmic implications (in terms of improvements to GPTQ), I believe it still offers valuable insight into a widely-used quantization technique. I do not think the connection is necessarily obvious to the quantization community, and thus I believe this is a solid contribution and a helpful paper. A few specific comments worth highlighting:\n- The paper is well-structured and the mathematical notation is clear and easy to follow.\n- Figures 1-3 are very helpful in explaining the geometric interpretation of the algorithm.\n- The authors highlight the importance of \"no clipping\" for full equivalence of the two algorithms, and provide solutions using the SpQR method for detecting outliers, and Huffman encoding for lossless compression.\n- The authors helpfully provide an optimised kernel for the SSQR technique as part of their submission."}, "weaknesses": {"value": "I view the paper's main contribution as the establishment of the theoretical connection between the two widely used algorithms. The algorithmic contributions (SSQR and HPTQ) are relatively incremental, as SSQR is a direct application of SpQR to the GPTQ method, and Huffman coding has indeed been applied to quantization problems previously (see e.g., https://arxiv.org/abs/1612.01543). This however is clearly indicated by the authors, and does not diminish the contribution of the paper."}, "questions": {"value": "- Reading Algorithms 1-3 without the corresponding sections is a bit difficult — I wonder if captions detailing the procedures might help readability? (I leave this at authors' discretion) \n- The authors provide an optimised kernel for SSQR. It would be useful to also highlight the implications of the Huffman encoding/decoding in terms of practical efficiency/speed.\n- Minor: On line 158 the authors mention parameter \"delta\", but this is not defined/mentioned elsewhere so it wasn't quite clear to me as I wasn't deeply familiar with the LLL algorithm."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "9KmBRd5kbC", "forum": "NFB4QGGS65", "replyto": "NFB4QGGS65", "signatures": ["ICLR.cc/2026/Conference/Submission1699/Reviewer_PGNw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1699/Reviewer_PGNw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1699/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761906856830, "cdate": 1761906856830, "tmdate": 1762915860093, "mdate": 1762915860093, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors identify the equivalence between GPTQ and Babai's nearest plane algorithm (Section 4.1 and 4.3), and derive a tight error bounds for GPTQ in the no-clipping regime (Section 4.4). Based on this understanding, they design two variants of GPTQ (SSQR and HPTQ; Section 5) with better accuracy than GPTQ and implement it in CUDA with considerable speedup."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Provides a geometric interpretation and theoretical guarantee for GPTQ (not quite due to order and clipping, but close enough!)\n1. This is a bridge paper that connects the modern LLM quantization algorithms with the classical CVP literature\n1. The mathematical proofs (both equivalence and error bound) are non-trivial\n1. The CUDA inference kernels for SSQR and HPTQ have impressive speedup despite GPU-unfriendly designs such as outlier storage in CSR and Huffman coding."}, "weaknesses": {"value": "1. Gap between theory and practice:\n    1. People typically run GPTQ front-to-back, which is not consistent with the back-to-front order studied in the paper\n    1. Clipping is inevitable in practice due to the limited range of quantized types, but the authors focus on the no-clipping scheme\n    1. From my understanding, Babai's algorithm is most attractive when preceded by LLL/BKZ basis reduction, but GPTQ is equivalent to \"Babai’s algorithm without basis reduction\".\n1. SSQR and HPTQ only has modest improvement over GPTQ, and far from SToA weight-only quantizers like [QTIP](https://arxiv.org/abs/2406.11235).\n1. Insufficient experiments: all experiments are ran on Qwen3-8B, but ideally we want to see the performance across different scales and/or model families."}, "questions": {"value": "1. You are claiming your bound (Theorem 5) is \"tight\". Can you construct a \"hard case\" that attains your error bound?\n1. What's the counterpart for GPTQ for running Babai's algorithm with LLL/BKZ basis reduction?\n1. Why did everyone suddenly starts to notice the equivalence between GPTQ and Babai’s algorithm? The authors mentioned a [concurrent work](https://arxiv.org/abs/2508.01077), and I assume that's not a coincidence?\n    - You don't have to answer this if you are feeling uncomfortable; I'm just curious about how you discovered the connection between GPTQ and Babai's algorithm."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "EuhS9fOAXM", "forum": "NFB4QGGS65", "replyto": "NFB4QGGS65", "signatures": ["ICLR.cc/2026/Conference/Submission1699/Reviewer_ej6W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1699/Reviewer_ej6W"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission1699/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761955420027, "cdate": 1761955420027, "tmdate": 1762915859833, "mdate": 1762915859833, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper establishes a formal equivalence between the GPTQ algorithm and Babai's nearest plane algorithm from lattice theory. This connection provides a theoretical foundation for a method that has thus far been understood primarily as a sequence of heuristic, greedy updates. The core theoretical insight is that when GPTQ is executed in a back-to-front order, its process of quantizing a weight and propagating the error is mathematically identical to Babai's algorithm solving the Closest Vector Problem (CVP). Motivated by the new foundation, they propose a new method: Huffman-encoded post-training quantization (HPTQ)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper's primary contribution is establishing a rigorous mathematical equivalence between the GPTQ quantization algorithm and Babai's nearest plane algorithm from lattice theory. \n\n2. The theoretical foundation leads to practicaly improved method, including a formal error bound for GPTQ and the design of new, improved quantization methods like HPTQ. These methods demonstrably outperform the original GPTQ.\n\n3. The presenation is clear and well-written."}, "weaknesses": {"value": "1.  The experimental evaluation primarily benchmarks the proposed methods (HPTQ, SSQR) against GPTQ and Round-to-Nearest (RTN). They didn't compare with strong baseline method like QuaRot, QuIP, SpinQuant, OmniQuant. Although GPTQ is a well known quantization method, without comparing with other recent, strong baselines limits the practical value of this work. \n\n2. The paper derives a worst-case error bound, but its utility is questionable. The bound is only valid in the no-clipping regime, which is not the standard use case. Besides, the proposed \"min-pivot\" ordering is shown to provide only a modest practical improvement over the much cheaper \"act-order\" heuristic.\n\n3. The paper introduces non-trivial computational costs without a thorough analysis. HPTQ requires a binary search over scales to hit a target Huffman bitrate, and SSQR requires a similar search to meet an outlier budget."}, "questions": {"value": "NA"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fdjvg3fblV", "forum": "NFB4QGGS65", "replyto": "NFB4QGGS65", "signatures": ["ICLR.cc/2026/Conference/Submission1699/Reviewer_fgCD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1699/Reviewer_fgCD"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission1699/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761977779529, "cdate": 1761977779529, "tmdate": 1762915859627, "mdate": 1762915859627, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper considers the GPTQ algorithm, and mentioned how running it back-to-front is identical to Babai’s nearest-place algorithm. The author show several theoretical results and also propose practical schemes for algos that utilize these insights."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The intro of the paper is clearly written\n2. Algos 1 and 2 paint a clear picture, although GPTQ is a little more involved than what Algo 1 depicts.\n3. The theoretical results are solid, i went over the theorems and corollaries. The equivalence b/w GPTQ and Babai’s nearest-plane is clean. \n4. The experiments are conducted on the Qwen3 series of models, representing near-state of the art models.\n5. HPTQ seems to be competitive in experiments"}, "weaknesses": {"value": "1. I dont agree with the statement that GPTQ’s inner workings are “adhoc”. GPTQ is inspired from the Optimal Brain Surgeon/Compression literature (OBS). OBS is quite principled and its update can be derived using KKT conditions, making it quite rigorous, Except the optimization bit for GPTQ which is quite sloppy, GPTQ is a pretty grounded method.\n2. The role of clipping is a bit confusing, maybe required in practice. Although the results on Qwen3 are good, would be good to extend to other model families.\n3. I am not sure if the experiment results offer something practical. I am confused about the main contribution of this paper. Are you claiming that this is a theoretical paper? Or are you claiming that there is a better version of GPTQ? Because several papers have already practically bettered GPTQ"}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "VgouQDtwid", "forum": "NFB4QGGS65", "replyto": "NFB4QGGS65", "signatures": ["ICLR.cc/2026/Conference/Submission1699/Reviewer_64UP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1699/Reviewer_64UP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission1699/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761978223422, "cdate": 1761978223422, "tmdate": 1762915859389, "mdate": 1762915859389, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}