{"id": "NfO2Lt2WY7", "number": 21984, "cdate": 1758324353280, "mdate": 1759896892606, "content": {"title": "Are complicated loss functions necessary for teaching LLMs to reason?", "abstract": "Recent advances in large language models (LLMs) highlight the importance of post-training techniques for improving reasoning and mathematical ability. Group Relative Policy Optimization (GRPO) has shown promise in this domain by combining group-relative advantage estimation, PPO-style clipping, and KL regularization. However, its complexity raises the question of whether all components are necessary for fostering reasoning behaviors. We conduct a systematic analysis of GRPO and identify two key findings: (1) incorporating negative feedback is essential—training solely on actions above a baseline limits learning; and (2) PPO-style constraints, such as policy ratio clipping, are not required to improve mathematical reasoning or performance. Building on these insights, we propose REINFORCE with Group Relative Advantage (RGRA), a simplified variant that retains group-relative advantage estimation but removes PPO-style clipping and policy ratio terms. Experiments across standard mathematical benchmarks indicate that RGRA has the potential to achieve stronger performance than GRPO. Our results suggest that simpler REINFORCE-based approaches can effectively enhance reasoning in LLMs, offering a more transparent and efficient alternative to GRPO.", "tldr": "", "keywords": ["LLMs", "Reinforcement Learning", "Reasoning"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1a4cec8baa58e0d0d00c963cc0a49949ac7f7428.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper investigates the necessity of complex loss functions, specifically Group Relative Policy Optimization (GRPO), for enhancing the reasoning capabilities of Large Language Models (LLMs). The authors conduct a systematic analysis of GRPO, an algorithm that combines group-relative advantage estimation, PPO-style clipping, and KL regularization.\nThe paper identifies two key findings:\nNegative feedback is essential. Training solely on actions that outperform a baseline (i.e., positive-only advantages) or using simpler rejection sampling (RAFT) leads to training instability, performance collapse, and a failure to elicit reasoning behaviors.\nPPO-style constraints are unnecessary. The analysis demonstrates that PPO-style components, such as policy ratio clipping, are not required to improve mathematical reasoning performance or maintain training stability.\nExperiments across standard mathematical benchmarks indicate that RGRA achieves stable training dynamics and demonstrates stronger performance than the more complex GRPO, surpassing it in 17 out of 27 task comparisons."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This paper's originality is strong. The authors challenge the assumed necessity of all components within the successful GRPO framework . This \"less is more\" approach, which rigorously questions the utility of established components like PPO-style clipping, represents an original and valuable methodological contribution. The claims are substantiated by a comprehensive and robust body of empirical evidence, including extensive quantitative benchmarks across multiple model families and languages (Tables 1-3) , crucial analysis of training dynamics and stability (Figure 1) , and insightful qualitative analysis of emergent reasoning behaviors (Figure 2). The experimental setup is sound and provides convincing validation for the paper's conclusions."}, "weaknesses": {"value": "The paper's primary weakness lies in its significant overgeneralization of claims from a narrow and limited experimental setup. The central conclusion that PPO-style constraints are \"unnecessary\" for teaching reasoning is drawn exclusively from experiments on small-scale models, ranging from 0.5B to 1.5B parameters. PPO's clipping mechanism was precisely designed to ensure stability during large, high-variance policy updates, which are a far greater concern in the state-of-the-art 70B+ models. The paper provides no evidence that its findings would hold in a large-scale setting, thus failing to adequately support its ambitious and broad claims.\nFurthermore, the dismissal of baseline methods like RAFT and positive-only GRPO as inherently unstable is unconvincing. Their catastrophic collapse (shown in Figure 1) is observed on a minuscule training dataset of only 1,800 instances , which is highly susceptible to reward-hacking. More importantly, the paper fails to provide evidence of rigorous hyperparameter tuning for these baselines. Their collapse could simply be an artifact of a poorly chosen learning rate or insufficient KL regularization, rather than a fundamental flaw in the methods themselves. Without a proper hyperparameter sweep to find the most stable configuration for these baselines, the paper's conclusion is not fully substantiated."}, "questions": {"value": "The paper's central claim that PPO-style constraints are \"unnecessary\" is derived from experiments on relatively small-scale models (0.5B to 1.5B). Given that PPO's clipping mechanism was specifically designed to ensure stability for large scale policies with high variance updates, what justification or evidence can you provide that this finding will generalize to the 70B+ or 100B+ models where such stability constraints are traditionally considered critical?\nThe experiments are confined entirely to mathematical reasoning, a domain characterized by sparse and verifiable binary reward signals (i.e., correct/incorrect). How do you anticipate the stability of RGRA (which lacks clipping) will hold in standard alignment scenarios (e.g., helpfulness, safety) that rely on dense, non stationary, and often noisy rewards from learned preference models? \nThe paper concludes that methods ignoring negative feedback (RAFT, GRPO-pos) are fundamentally unstable, citing their rapid collapse on a small 1,800-instance training set. Could you elaborate on the extent of the hyperparameter search (e.g., learning rate) conducted for these baselines? How can you be certain this collapse is an inherent flaw of the methods, rather than an artifact of sub-optimal tuning or a simple case of reward-hacking on a dataset small enough to be easily exploited?\nThe results suggest RGRA does not just match, but often outperforms GRPO. Since the key difference is the removal of the PPO clipping and policy ratio terms, what is the mechanism for this performance improvement? \nThe paper shows that standard REINFORCE with direct rewards collapses, even on the 1.5B model, which you use to underscore the necessity of advantage estimation. Could you clarify the tuning process for this specific baseline? Does this result definitively prove that any REINFORCE-style method without advantage estimation is doomed to fail in this setting, or could this collapse also be sensitive to hyperparameter choices?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fVRDNPRsmQ", "forum": "NfO2Lt2WY7", "replyto": "NfO2Lt2WY7", "signatures": ["ICLR.cc/2026/Conference/Submission21984/Reviewer_7cYU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21984/Reviewer_7cYU"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission21984/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761708073998, "cdate": 1761708073998, "tmdate": 1762942007920, "mdate": 1762942007920, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper looks into GRPO training for reasoning models. I tests three variants of GRPO 1. positive only reward 2. GRPO without importance sampling 3. naive reinforce"}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "N/A"}, "weaknesses": {"value": "* There is a severe lack of novelty in the paper. The proposed RGRA is essentially GRPO without importance sampling.\n* The paper is poorly composed; the results are not well organized. Figure 1 occupies an entire page without any accompanying analysis in the caption. Tables 1 and 2 are also poorly formatted, lacking proper bolding and explanations for abbreviations. From this standpoint alone, the paper feels far from complete.\n* There is almost no discussion regarding the differences between RGRA and GRPO. Why does removing importance sampling and not using a clipping objective lead to better training?\n* There is no comparison with related works at all (e.g., Dr.GRPO, DAPO, etc.)."}, "questions": {"value": "* Overall, the paper lacks a clear motivation, shows limited novelty, and provides insufficient analysis of the results. Major revisions are needed."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "YbDzP5CUqe", "forum": "NfO2Lt2WY7", "replyto": "NfO2Lt2WY7", "signatures": ["ICLR.cc/2026/Conference/Submission21984/Reviewer_ZvS5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21984/Reviewer_ZvS5"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission21984/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761974312587, "cdate": 1761974312587, "tmdate": 1762942007643, "mdate": 1762942007643, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper does an ablation over the components of the GRPO loss function, namely advantage clipping, negative examples, and KL regularization."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "This paper studies an important question in RL post-training, namely which components are required in the loss function to get the models to perform well. Based on their findings, the authors propose RGRA for LLM post training."}, "weaknesses": {"value": "There are several major weaknesses with this paper. To begin, the framing of the paper is an ablation over the main components of the GRPO loss. However, there are several key components missing from this ablation:\n- as far as I understand, the authors do not sweep over the hyperparameters of any of the baselines they run. Critically, for an ablation over components of GRPO, they do not sweep over the number of rollouts, nor over the amount of steps taken off policy by the algorithm (I am referring to doing multiple gradient steps over a set of rollouts for a given batch)\n- the authors start from pretrained models, which can confound the results. Namely, [1] shows that the KL regularizer can have different effects based on the pretraining data\n- the baselines are quite trivial, especially with respect to the length of the chain of thought required to solve the prompts. In general, the terms in the loss start to be significant for long chains, or the number of offline steps taken by the algorithm\n\nBased on the above comments, I believe proposing RGRA is not currently backed by empirical results.\n\n\n[1] Echo Chamber: RL Post-training Amplifies Behaviors Learned in Pretraining"}, "questions": {"value": "No questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "fhIKVUERXR", "forum": "NfO2Lt2WY7", "replyto": "NfO2Lt2WY7", "signatures": ["ICLR.cc/2026/Conference/Submission21984/Reviewer_nvCs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21984/Reviewer_nvCs"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission21984/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762020454201, "cdate": 1762020454201, "tmdate": 1762942007400, "mdate": 1762942007400, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies different components of the GRPO (Group Relative Policy Optimization) loss in improving reasoning in LLMs. The authors break down the loss into its main components—negative feedback, PPO-style clipping, and advantage estimation—and test simplified versions such as positive-only GRPO, their proposed REINFORCE with Group Relative Advantage (RGRA), and direct REINFORCE. Their experiments on small models (Qwen2.5-0.5B/1.5B and Llama3.2-1B) show that removing negative feedback leads to collapse and reward stagnation and PPO clipping can be dropped without hurting performance."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "* Systematic studies like the one that the paper conducts is generally important for the community, especially for understanding RL post-training for LLMs.\n* Authors test on two different model families and take care in evaluating on a comprehensive set of benchmarks split across Chinese/English and math/other subject domains."}, "weaknesses": {"value": "* The model scale and setting (<=1.5B parameter models with LoRA fine-tuning) is limited and it's unclear if their findings extrapolate to larger model scales and full fine-tuning.\n* In particular, prior work [1] seems to show a different result that positive-only reinforcement can be competitive with GRPO/PPO provided verifiable rewards are used and poor prompts are filtered. The findings from Xiong et al. are from larger models (7B-70B), which supports the potential limitations of the model size and setting studied in this work.\n* The reported results lack confidence intervals and seem necessary to draw strong conclusions like the ones made in this work (in particular, how significant is the performance delta between RGRA and GRPO)? I'm sympathetic to the author's limited compute constraining them to their training setup, but multiple seeds and further performance analysis (eg. pass/majority@k performance) would strengthen their results.\n\nWhile the paper’s goal of simplifying GRPO is well-motivated, the evidence feels too narrow and limited to support its strong claims about the necessity of negative feedback.\n\nMinor: Some areas in the manuscript need `\\citep` (Line 169, 263 to name a few).\n\n[1] Xiong, Wei, et al. \"A minimalist approach to llm reasoning: from rejection sampling to reinforce.\" arXiv preprint arXiv:2504.11343 (2025)."}, "questions": {"value": "* The training dataset appears quite small (around 1.8k examples). Could the authors clarify why this size was chosen, and whether you observed any sensitivity to data scale?\n* In the positive-only advantage setup, do the authors ensure that each batch contains enough positively rewarded samples for stable gradient estimation?\n* In Figure 1(a), both REINFORCE and RAFT collapse only for the Qwen 0.5B model. Do you have an explanation for why this smaller model is unstable compared to the 1.5B and 1B variants? Could this have been mitigated with a cold start stage?\n* Regarding clipping, what $\\epsilon$ value was used for GRPO runs, and roughly what fraction of updates were actually clipped during training?\n* The author's results seem to differ from Xiong et al., who find that positive-only RAFT remains competitive with GRPO. Could you comment on the key differences in setup (e.g., model scale, filtering, or reward structure) or clarify the discrepancy?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "5vFFxgRi7q", "forum": "NfO2Lt2WY7", "replyto": "NfO2Lt2WY7", "signatures": ["ICLR.cc/2026/Conference/Submission21984/Reviewer_TxYV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21984/Reviewer_TxYV"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission21984/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762038426744, "cdate": 1762038426744, "tmdate": 1762942007165, "mdate": 1762942007165, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}