{"id": "Ng6RfkOm6A", "number": 18476, "cdate": 1758288113362, "mdate": 1763426820227, "content": {"title": "Hi-SAFE: Hierarchical Secure Aggregation for Lightweight Federated Learning", "abstract": "Federated learning (FL) faces challenges in ensuring both privacy and communication efficiency, particularly in resource-constrained environments such as Internet of Things (IoT) and edge networks. While sign-based methods, such as sign stochastic gradient descent with majority voting (signSGD-MV), offer substantial bandwidth savings, they remain vulnerable to inference attacks due to exposure of gradient signs. Existing secure aggregation techniques are either incompatible with sign-based methods or incur prohibitive overhead. To address these limitations, we propose *Hi-SAFE*, a lightweight and cryptographically secure aggregation framework for sign-based FL. Our core contribution is the construction of efficient majority vote polynomials for signSGD-MV, derived from Fermat’s Little Theorem. This formulation represents the majority vote as a low-degree polynomial over a finite field, enabling secure evaluation that hides intermediate values and reveals only the final result. We further introduce a hierarchical subgrouping strategy that ensures constant multiplicative depth and bounded per-user complexity, independent of the number of users $n$. Hi-SAFE reduces per-user communication by over 94\\% when $n \\geq 24$, and total cost by up to 52\\% at $n = 24$, while preserving model accuracy. Experiments on benchmark datasets confirm the scalability, robustness, and practicality of Hi-SAFE in bandwidth-constrained FL deployments.", "tldr": "Hi-SAFE introduces a new Majority Vote Polynomial for sign-based federated learning, enabling hierarchical secure aggregation with provable privacy and over 94% communication reduction.", "keywords": ["Hierarchical secure aggregation", "federated learning", "majority vote polynomial", "subgrouping"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/5ffaf03e61cfb20aa1f7eb4d3c853624c1b33e63.pdf", "supplementary_material": "/attachment/cb8fc9bde063e961a562e5caa60a5cd7a2b9aa57.zip"}, "replies": [{"content": {"summary": {"value": "This paper builds upon the foundation of signSGD with majority vote and designs a new hierarchical secure aggregation protocol to ensure security and prevent information leakage. By subgrouping clients, the framework enables communication efficiency and security."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* Distributed machine learning is always concerned with communication efficiency and privacy leakage;\n* The idea of using secure aggregation to enhance the privacy guarantees of signsgd is innovative."}, "weaknesses": {"value": "* The abstract can be polished up. For example, the authors talk about constant multiplicative depth and bounded per-user complexity in lines 22- 24. Yet, neither are these standard, nor the definitions are given.\n* Does $Enc(\\mathbf{x}_i)$ remain to be sign bits after using Eq.(3) in line 223? Since the operation is concluded by a $\\mod p$, it is temptive to think the produced result is a quantized level.\n* Theorem 1 requires clarification. \n  * First, the assumptions are not included in the theorem statement. Upon checking the appendix, it adopts almost the same set of assumptions as (Bernstein et al. 2018a). However, it is an open question whether is possible to attain a mini-batch size as large as $m_k = K$, where $K$ is the number of total rounds.\n  * Second, probability $q$ of a correct majority vote is not stated in Theorem 1 or any auxiliary lemmas.\n* The experiements are quite limited in that only non-subgrouping and subgrouping are compared. \n  * More baselines should be included. Right now, the results are more like ablation studies.\n  * Should also include the probability of a correct majority vote.\n  * Concrete privacy leakage measurements should also be included."}, "questions": {"value": "* Can the authors make another round of proofread to their abstract to improve quality?\n* Can the authors clarify the number of bits used by Eq. (3)?\n* Can the authors double check their proof and clarify their theorem statement? More importantly, they would want to address the scaling of their mini-batch size.\n* Can the authors include the auxiliary results for the probability $q$ of a correct majority vote?\n* Can the authors provide more numerical results?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "D0fjV2jqEg", "forum": "Ng6RfkOm6A", "replyto": "Ng6RfkOm6A", "signatures": ["ICLR.cc/2026/Conference/Submission18476/Reviewer_95uL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18476/Reviewer_95uL"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18476/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761625697421, "cdate": 1761625697421, "tmdate": 1762928167512, "mdate": 1762928167512, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "BcIy4WYrKI", "forum": "Ng6RfkOm6A", "replyto": "Ng6RfkOm6A", "signatures": ["ICLR.cc/2026/Conference/Submission18476/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18476/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763426819296, "cdate": 1763426819296, "tmdate": 1763426819296, "mdate": 1763426819296, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Hi-SAFE, a secure aggregation framework that integrates SignSGD with a polynomial formulation of majority voting based on Fermat’s Little Theorem. To reduce the computation and communication cost, the author consider to divide the clients into small group, that would reduce the prime $p$ and the degree of polynomial fuction $F(x)$.  While the motivation—achieving lightweight secure aggregation for sign-based privacy-preserving federated learning (PPFL)—is relevant, several conceptual and technical aspects require further clarification."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. A novel approach involves constructing polynomial functions based on Fermat's Little Theorem to evaluate the secure aggregation results of SIGNSGD.\n\n2. The formal analysis of the problem and the description of the algorithm are well-structured and clear at a glance.\n\n3. The appendix provides a wealth of examples to help readers better understand the paper."}, "weaknesses": {"value": "1.Limited novelty in applying SignSGD to PPFL. The paper positions the integration of SignSGD and secure aggregation as novel. However, there already exists a substantial body of work that leverages quantization techniques similar to SignSGD for communication-efficient or privacy-preserving federated learning, including but not limited to [1], [2] and [3]. The manuscript does not sufficiently differentiate Hi-SAFE from these prior efforts.\n\n2.Misleading claim of communication efficiency. The proposed protocol operates over a prime field $\\mathbb{F}_{p}$, and all operations (including Beaver triples) depend on the modulus $p$, which directly determines the communication volume per encrypted round. In such cases, the theoretical 1-bit advantage of SignSGD becomes negligible. \n\nMoreover, the polynomial-based method adopted in this work introduces an additional $O(n^{2})$ computational complexity, which leads to significant computational overhead within the finite field and consequently causes high runtime latency. While the proposed subgrouping strategy is conceptually appealing for reducing the computational and communication overhead of secure aggregation, its practical feasibility remains questionable. The theoretical convergence analysis relies on independence assumptions among subgroups, which may not hold in realistic Non-IID federated settings where client gradients are correlated, potentially leading to biased global updates. \n\nFurthermore, the paper lacks empirical runtime or bandwidth measurements and does not compare the subgrouping approach against existing lightweight secure aggregation baselines such as LightSecAgg (So et al., 2022) or FedLSC (Joo et al., 2025). As a result, the claimed efficiency and scalability benefits of the subgrouping mechanism remain largely unsubstantiated.\n\n\n[1] Dong, Ye, et al. \"FLOD: Oblivious defender for private Byzantine-robust federated learning with dishonest-majority.\" European Symposium on Research in Computer Security. Cham: Springer International Publishing, 2021.\n\n[2] Miao, Yinbin, et al. \"Privacy-preserving Byzantine-robust federated learning via blockchain systems.\" IEEE Transactions on Information Forensics and Security 17 (2022): 2848-2861.\n\n[3] So, Jinhyun, Başak Güler, and A. Salman Avestimehr. \"Byzantine-resilient secure federated learning.\" IEEE Journal on Selected Areas in Communications 39.7 (2020): 2168-2181."}, "questions": {"value": "see the above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "yNieYUYFpK", "forum": "Ng6RfkOm6A", "replyto": "Ng6RfkOm6A", "signatures": ["ICLR.cc/2026/Conference/Submission18476/Reviewer_t8hX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18476/Reviewer_t8hX"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18476/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761877828519, "cdate": 1761877828519, "tmdate": 1762928166400, "mdate": 1762928166400, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Hi-SAFE, a cryptographic secure-aggregation framework tailored to SIGNSGD-MV in federated learning."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper targets a timely and important gap: combining 1-bit communication efficiency with end-to-end cryptographic privacy for sign-based FL."}, "weaknesses": {"value": "Key technical claims require clarification or stronger evidence. \n\n(i)  “majority of subgroup majorities” is not generally equivalent to the global majority unless nontrivial conditions hold (balanced subgroup sizes, odd sizes, consistent tie-breaking, no near-ties); \n\n(ii) With (p!>!n), the indicator term (1-(x-m)^{p-1}) implies (\\deg(F)=p-1=\\Theta(n)); it is unclear how the protocol attains constant multiplicative depth and ≤6 secure multiplications per user. The recurrence with (v_k) suggests at best (O(\\log n)) multiplicative depth; \n\n(iii) SIGNSGD-MV is coordinate-wise; evaluating (F(\\cdot)) per parameter dimension (d) multiplies MPC cost and bandwidth by (d). The paper should quantify per-round cost vs. (d) for modern models, include memory for precomputed coefficients, and show that benefits persist beyond small CNNs. \n\n(iv) Revealing only the final majority still leaks information across rounds (e.g., inferring cohort drift or individual influence given known local signs). Provide a concrete leakage analysis or DP accounting, not just semi-honest security prose. \n\n(v) Who generates triples in FL without a trusted dealer? What is the offline bandwidth/latency on constrained devices, and how are dropouts/stragglers handled without breaking triple consistency? Include protocols for client churn, subgroup reconfiguration, and replay/abort safety. \n\n(vi) Sign-based methods can struggle under non-IID and are sensitive to adversarial sign flips; despite a semi-honest model, poisoning and Sybil resilience matter in practice."}, "questions": {"value": "1. Please state and prove precise conditions under which “majority of subgroup majorities” equals the true global majority (e.g., equal subgroup sizes, odd n1, strict ties handled consistently). \n\n2. Algorithm 3 (Step 9) says the server “reconstructs F(xj) for each subgroup,” which appears to reveal subgroup majorities (s_j) to the server—contradicting the claim that only the final (s) is revealed. \n\n3. With (p>n), the indicator (1-(x-m)^{p-1}) implies (\\deg(F)=p-1=\\Theta(n)). How do you attain “constant depth (~2)” and “≤6 secure multiplications per user”? \n\n4. Figure 3 asserts a constant bound (≤6) independent of (n). Please provide a formal derivation tying this bound to (n_1), the chosen (p_1), and the exponentiation schedule, and specify for which ((n,\\ell)) this bound holds.\n\n5. You define latency as (\\lceil \\log(p_1-1)\\rceil) “serial depth for Beaver triple multiplication.” Why does depth scale with (\\log(p_1-1)) rather than with the number of multiplication gates in your concrete circuit for evaluating (F)? \n\n6. SIGNSGD-MV is coordinate-wise. What is the total online communication and triple consumption for a model with (d) parameters? \n\n7. Specify the encoding, how negative values are represented, and why the sign polynomial is correct modulo (p) for all coordinates.\n\n8. Provide ablations showing how 1-bit vs 2-bit tie-breaking affects optimization dynamics (stability, plateaus) across datasets and non-IID regimes. \n\n9. Theorem 1 assumes each subgroup outputs the correct majority with probability (q>0.5), independent across subgroups. In practice, subgroup outcomes can be correlated (due to shared data heterogeneity and client selection). \n\n10. Theorem 1 uses (\\eta=1/(K|\\vec L|_1)) and (m_k=K). This is unusual for practical FL. \n\n11. The bound contains (c',\\ell^{-1/4}\\exp(-\\ell \\alpha_q^2/4)). Define (c') precisely, show how it depends on aggregation perturbations, and correct any typographical ambiguities (is it (\\exp{-\\ell \\alpha_q^2/4})?). \n\n12. Theorem 2 assumes at least one honest user per subgroup. What if a subgroup is fully corrupted (or all but one user drop out)? Also, does your semi-honest adversary include the server colluding with a subset of clients? \n\n13. Give a detailed real/ideal proof sketch: what are the simulator’s views in both stages (subgroup and inter-group), how are messages simulated from only (({x_{i,j}}_{i\\in C}, s)), and where do Beaver triple masks guarantee indistinguishability? \n\n14. Who generates triples (trusted dealer, OT-based COT/VOLE like MASCOT, Silent OT/Ferret, or a pair of non-colluding servers)?\n\n15. Even if privacy is semi-honest, correctness can be attacked by sign-flip or Sybil clients. \n\n16. The statement that leakage arises only when all inputs are identical (prob. (2^{-(n-1)})) is too strong. \n\n17. How does the protocol handle client dropouts mid-round without revealing masked differences or invalidating shares?\n\n18. In realistic FL, the number of active clients varies per round. How do you pick (p_1>n_1) and (p_2>\\ell) when (n_1,\\ell) change? \n\n19. Provide a systematic sweep over (\\ell) showing accuracy/convergence, per-user bytes, triples, and round latency, including non-IID partitions (Dirichlet (\\alpha)) and heterogeneous compute/bandwidth.\n\n20. Several critical statements (“constant depth,” “≤6 multiplications,” “often depth 2,” “server-side intra-subgroup incurs no uplink”) need explicit references to equations/lemmas in Appendices E–I. \n\n21. If subgroup ties occur often (e.g., highly skewed or tiny (n_1)), what is the recommended policy (2-bit ties, random tie-break, or adaptive subgroup resizing)? \n\n22. Current experiments (MNIST/FMNIST/CIFAR-10 on 2×3090) are not representative of edge deployment. \n\n23. Unify scalar vs. vector notation (define (x) per coordinate), define (N_t), and ensure equations (1)–(3), (5)–(8) align with the algorithms."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "DZQWqZ9tvN", "forum": "Ng6RfkOm6A", "replyto": "Ng6RfkOm6A", "signatures": ["ICLR.cc/2026/Conference/Submission18476/Reviewer_pGxy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18476/Reviewer_pGxy"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18476/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761899097776, "cdate": 1761899097776, "tmdate": 1762928165938, "mdate": 1762928165938, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Hi-SAFE, a secure aggregation framework tailored to SIGNSGD-MV. The key idea is to express the coordinate-wise majority vote as a low-degree polynomial over a prime field using Fermat’s Little Theorem (FLT), then evaluate it with additive secret sharing and Beaver triples so that only the final vote is revealed. To keep multiplication depth and per-user cost constant, the system introduces hierarchical subgrouping (intra-group secure vote, then inter-group aggregation). This paper includes theoretical analysis for convergence and security analysis, which is standard.  Experiments on MNIST/FMNIST/CIFAR-10 report large per-user communication reductions with comparable accuracy."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Using FLT-based indicator for secure aggregation of sign-sgd is smart and the construction is well stated. \n- The subgrouping design keeps multiplicative depth constant, independent of the number of users, $n$.\n- Protocol descriptions are concrete and well presented.\n- Theoretical convergence analysis and security proof are included."}, "weaknesses": {"value": "- This paper has no clear experimental or analytical comparison against existing approaches that approximate or compute the sign function using polynomial representations combined with secure computation techniques (e.g., homomorphic encryption, MPC-based sign-SGD). There is no baseline MPC-based sign-SGD in\n- While experiment section provides communication reduction from the sub-group strategy (compared to the original version of the proposed scheme), asymptotic communcation and computation analysis is missing."}, "questions": {"value": "- Several prior MPC and HE studies have explored polynomial approximations to sign and ReLU for privacy-preserving learning. Could the authors clarify how Hi-SAFE’s polynomial design and Beaver-based evaluation differ fundamentally from these works? If possible, could experimental comparison in terms of model accuracy, latency (total running time), and communication overhead be provided?\n- As described in the step 9 of algorithm 3, does the server reconstruct $s_j = F(x_j)$? If yes, please explain why this does not leak the lone honest user’s sign when a subgroup has $n_1 -1$ colluding users whose partial sum could be 0 (then the sign of the honest user reveals). If no, please clarify step 9 in algorithm 3. \n- What is the communication and computation overhead as function of important system parameters (such as $n, l, p_1, ...$)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "z2cCJbEIYE", "forum": "Ng6RfkOm6A", "replyto": "Ng6RfkOm6A", "signatures": ["ICLR.cc/2026/Conference/Submission18476/Reviewer_opuM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18476/Reviewer_opuM"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18476/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762184929754, "cdate": 1762184929754, "tmdate": 1762928165246, "mdate": 1762928165246, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}