{"id": "noWKCE7jNk", "number": 7754, "cdate": 1758034692247, "mdate": 1759897834670, "content": {"title": "PPGFlowECG: Latent Rectified Flow with Cross-Modal Encoding for PPG-Guided ECG Generation and Cardiovascular Disease Detection", "abstract": "In clinical practice, electrocardiography (ECG) remains the gold standard for cardiac monitoring, providing crucial insights for diagnosing a wide range of cardiovascular diseases (CVDs). However, its reliance on specialized equipment and trained personnel limits feasibility for continuous routine monitoring. Photoplethysmography (PPG) offers accessible, continuous monitoring but lacks definitive electrophysiological information, preventing conclusive diagnosis. Generative models present a promising approach to translate PPG into clinically valuable ECG signals, yet current methods face substantial challenges, including the misalignment of physiological semantics in generative models and the complexity of modeling in high-dimensional signals. To this end, we propose PPGFlowECG, a two-stage framework that aligns PPG and ECG in a shared latent space via the CardioAlign Encoder and employs latent rectified flow to generate ECGs with high fidelity and interpretability. To the best of our knowledge, this is the first study to experiment on MCMED, a newly released clinical-grade dataset comprising over 10 million paired PPG–ECG samples from more than 118,000 emergency department visits with expert-labeled cardiovascular disease annotations. Results demonstrate the effectiveness of our method for PPG-to-ECG translation and cardiovascular disease detection. Moreover, cardiologist-led evaluations confirm that the synthesized ECGs achieve high fidelity and improve diagnostic reliability, underscoring our method’s potential for real-world cardiovascular screening.", "tldr": "In this paper, we propose PPGFlowECG, a novel two-stage framework for high-fidelity PPG-to-ECG translation and cardiovascular disease detection.", "keywords": ["Latent Rectified Flow", "Cross-Modal Encoder", "PPG-Guided ECG Generation", "Cardiovascular Disease Detection"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/7699a72f6225e1f7b95b58377bf87a4cf01d7629.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces a framework to synthesize difficult-to-acquire ECG from readily accessible PPG, which is a compelling and practically meaningful direction."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "Proposing a model that is able to generate ECG from easy collecting PPG."}, "weaknesses": {"value": "(1) The stated goal is to generate the ECG corresponding to a given PPG segment. The paper should first discuss whether, in realistic clinical settings, the ECG conditioned on a given PPG is uniquely determined.\n\nIf the mapping is deterministic:\n[1] Using MAE/RMSE to quantify proximity between synthesized and reference ECGs is appropriate. However, within a deterministic framing, introducing stochastic noise at generation time leads to output variability, different noise produce different ECGs (EVEN WITH the same PPG input), which appears conceptually inconsistent. Why not train a direct PPG→ECG mapping without noise? I would expect MAE/RMSE to further improve under such a deterministic setup.\n[2] Another issue is that the baseline generative methods compared in the paper are models that explicitly encourage high sample diversity. In my view, some of the proposed techniques (e.g., beat aligning) are in fact designed to reduce the generator’s “diversity” (which is considered an advantage in other works). Under this setting, the comparison seems not entirely fair. The paper should compare/discuss alternative ECG generation methods with less uncertainty (and even compare against a direct mapping model from PPG to ECG trained on the authors’ own architecture without diffusion). For example:\nprior PPG→ECG works such as: Li Y, Tian X, Zhu Q, et al. Inferring ECG from PPG for Continuous Cardiac Monitoring Using Lightweight Neural Network. arXiv:2012.04949, 2020.\nOr “Beats-align” related work: Biomedically Informed ECG Synthesis: Customizing Cardiac Cycle Phases with Diffusion Model, Y Lin, J Ma, W Wang, Z Wu, S Dong, G Luo, K Wang, 2024 IEEE BIBM.\n\nIf the mapping is non-deterministic:\n[1] Then it is evident that using MAE/RMSE as the primary metrics may be unfair: although your method might produce ECGs closer to the label ECG, it would also indicate your method has poorer diversity compared with other models.\n\n(2) Since the authors propose generating ECG from PPG, to demonstrate the benefit, readers would expect to see:\n[1] Using PPG + generated ECG yields better diagnostic performance than using PPG alone;\n[2] Using PPG + generated ECG achieves diagnostic performance comparable to using PPG + real ECG."}, "questions": {"value": "The stated goal is to generate the ECG corresponding to a given PPG segment. The paper should first discuss whether, in realistic clinical settings, the ECG conditioned on a given PPG is uniquely determined."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "lLFtw52gNW", "forum": "noWKCE7jNk", "replyto": "noWKCE7jNk", "signatures": ["ICLR.cc/2026/Conference/Submission7754/Reviewer_qL1j"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7754/Reviewer_qL1j"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7754/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761029290158, "cdate": 1761029290158, "tmdate": 1762919798987, "mdate": 1762919798987, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents PPGFlowECG, a two-stage generative framework for translating PPG into ECG signals for CVD detection tasks.  It introduces a CardioAlign Encoder and employs latent rectified flow to generate ECGs with high interpretability."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Introduce two-stage framework with shared latent alignment and latent flow generation on PPG-ECG domain."}, "weaknesses": {"value": "The work has weak justification on the given task when it remains physiologically infeasible to use PPG for guiding ECG generation process due to their different nature.  \n\nThe motivation of using clinical data for translation is questionable.\n\nThe framework design as “Align first, Generate later” are not fundamentally novel. Also, the loss functions and ODE process are also introduced in prior works. \n\nExperimental results are not sound."}, "questions": {"value": "1. Please discuss if PPG to ECG translation is theoretically reasonable and how to handle when the generated ECGs don’t contain wrong patterns (that might be serious in clinical setting). \n\n2. Related to the above point, a question raised is that do we really need the proposed translation framework with computationally cost complexity and latency (flow-based)? Please add an comparable experiment on using directly PPG encoder pretrained in Stage 1 (and/or other pretrained PPG encoder [1]) to finetune and evaluate on the downstream tasks, without relying on ECG or the generation process. \n\n3. Add another experiment without stage 1 to compare with current results (With stage 2 only, and unfrozen the Encoder and Decoder.). \n\n4. Related to the above point, in the proposed framework, since the ECG decoder in stage 2 is frozen, what is exactly the input of it in this stage? Is it different from the input of the ECG decoder in stage 1 (from 2 sourses: PPG and ECG)?  \n\n5. Why the work only focus on single lead II generation, given that 12 leads generation is totally possible to conduct (is it because of the MCMED dataset only provide lead II and the authors are required to use this dataset ?) Also, all datasets used in this work are from clinical setting. However, in this setting, ECG is commonly accessible, plus the PPG and ECG here is much more stable (less sensitive about motion artifacts) than daily sensing data. So, the motivation of using clinical data for translation is questionable.\n\n6. Line 459-461: adding more justification would be better why gen is better than real here? Also, why just use 50 signals (25 AF, 25 non-AF) in this experiment (which is too few for showing generalisation)? \n\n7. Please discuss the differences and provide possible comparisons with [2,3,4].  \n\n8. The seen improvements when testing ablation studies are so minor, showing weak contributions of different loss functions (e.g., Table 3, 4).  \n\n9. Provide additional experiments on different modeling approaches (e.g., diffusion-based) in stage 2, besides ODE. \n\n10. Section 4.5 seems to be overclaim. Figure 5 actually doesn’t show expected insights when the attention looks different and the signals also looks different between the original and generated ones. \n\n[1] Pillai, Arvind, et al. \"Papagei: Open foundation models for optical physiological signals.\" The Thirteenth International Conference on Learning Representations (ICLR), 2025. \n\n[2] Li, Yuenan, et al. \"Inferring electrocardiography from optical sensing using lightweight neural network.\" IEEE Transactions on Artificial Intelligence 5.7 (2024): 3535-3550. \n\n[3] Vo, Khuong, Mostafa El-Khamy, and Yoojin Choi. \"PPG-to-ECG Signal Translation for Continuous Atrial Fibrillation Detection via Attention-based Deep State-Space Modeling.\" 2024 46th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 2024. \n\n[4] Nambu, Yuta, Masahiro Kohjima, and Ryuji Yamamoto. \"CardioFlow: Learning to Generate ECG from PPG with Rectified Flow.\" ICASSP 2025-2025 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 2025."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "Aqh7m2ByHK", "forum": "noWKCE7jNk", "replyto": "noWKCE7jNk", "signatures": ["ICLR.cc/2026/Conference/Submission7754/Reviewer_brYy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7754/Reviewer_brYy"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7754/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761489270764, "cdate": 1761489270764, "tmdate": 1762919798518, "mdate": 1762919798518, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes PPGFlowECG: a two-stage framework that first uses a shared CardioAlign encoder to align PPG/ECG to a unified latent space, and then performs conditional Rectified Flow on this latent space to generate ECG. Signal reconstruction and downstream CVD diagnostic evaluation are performed on multiple datasets such as MCMED, including clinical Turing Test and doctor interpretation experiments."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. A clear \"align first, generate later\" design: shared encoder + distribution/instance alignment + cross-modal reconstruction, combined with rectified latent space flow, balances interpretability and sampling efficiency; outperforming GAN/diffusion/data domain flow baselines on multiple reconstruction metrics and downstream diagnostics.\n\n2. Comprehensive evaluation: Four datasets (including clinical-grade MCMED, 10M+ aligned segments), unified preprocessing, providing MAE/RMSE/FD/FID/heart rate error and Macro-AUROC for multiple diseases, and performing ablation and external zero-shot validation.\n\n3. Clinical usability signal: Turing Test is close to random (indistinguishable from real or fake), and replacing the real ECG with synthetic ECG can still improve/maintain the doctor's AF diagnosis F1 (0.94)."}, "weaknesses": {"value": "1. The boundaries of novelty need to be more clearly defined: Compared to the existing approach of \"directly using Flow/diffusion in the data domain\", this article's latent space Flow + multiple alignment is a combined innovation; it is recommended to make a more systematic comparison with \"separate latent space generation or single alignment strategy\" to strengthen the necessity argument.\n\n2. Metric selection and consistency: In the external validation, signal-level metrics showed an \"inconsistent metric criteria\" phenomenon, with FD improving but FID/HR deteriorating. The authors' verbal explanation was reasonable, but they still recommended further analysis (such as correspondence with clinical factors).\n\n3. Data protocol details: Except for MCMED, which uses the official split, other datasets use a subject-level 80/20 random split; it is recommended to disclose the number of subjects/window independence and repeated trial variance for each episode; currently only the main table with a single step size of T=10 is reported. The impact of the number of sampling steps is in the appendix, and a sentence can be added to the main text.\n\n4. Clinical coverage: Only Lead II with a 10-s window is reported; generalization to rhythm-morphology complex lesions in multiple leads/longer time series remains unknown."}, "questions": {"value": "1. Can the key tables be supplemented with multiple seed ± std/significance? Especially Table 1/Table 2 and the doctor reading experiment.\n\n2. Deconstructing the sources of sliders for FD/FID/MAEHR in external validation (data domain differences, basic gradient distribution, noise spectrum)?\n\n3. If I switch to multi-lead ECG or longer clips, what changes are needed in CardioAlign (does the shared encoder still hold true)?\n\n4. If I switch to multi-lead ECG or longer clips, what changes are needed in CardioAlign (does the shared encoder still hold true)?\n\n5. In this article, ECG is generated by PPG, which means it is essentially a process of information addition. Can you further explain why the additional information can improve the accuracy of the diagnostic results?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eLpn9WK1JN", "forum": "noWKCE7jNk", "replyto": "noWKCE7jNk", "signatures": ["ICLR.cc/2026/Conference/Submission7754/Reviewer_UoNC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7754/Reviewer_UoNC"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7754/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761532760228, "cdate": 1761532760228, "tmdate": 1762919798104, "mdate": 1762919798104, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "PPGFlowECG is a two-stage translation framework: it first aligns PPG and ECG in a shared latent space via CardioAlign, then uses a rectified flow in latent space that deterministically transports PPG latents to ECG latents to reconstruct waveforms.\nThe model demonstrates effectiveness on multiple public, clinically oriented datasets using signal-quality metrics and downstream diagnostic tasks.\nClinician evaluations and real diagnostic tasks indicate that generated ECGs provide useful auxiliary value, suggesting utility approaching that of real ECGs."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The architecture and training procedure are staged and clear, making the paper easy to follow.\n\n- Data composition, preprocessing, and evaluation protocols are systematically organized, and implementation details are sufficient for high reproducibility.\n\n- On downstream tasks, the method shows competitive performance for multi-label cardiovascular disease classification and AF detection, and ablation studies disentangle the contributions of each loss and the sampling configuration.\n\n- Clinician assessments confirm perceptual fidelity and clinical support value of the generated ECGs, and Grad-CAM offers qualitative evidence that diagnostic attention regions are similar between real and generated ECGs."}, "weaknesses": {"value": "- The core design couples cross-modal PPG to ECG translation with shared latent alignment and latent rectified flow, reading as a refined integration of existing alignment/generation frameworks. The authors position this as an align-first, generate-later contribution.\n\n- Grad-CAM visualizations show alignment of diagnostic attention, but no dedicated quantitative interpretability metrics are reported.\n\n- Explanations for why the latent flow improves physiological mapping rely more on intuition and empirical results than formal analysis.\n\n- Comparisons against GAN/diffusion/flow baselines and extensive ablations are solid, but adding signal-level registration (e.g., DTW), VAE-based models, and linear latent alignment baselines would strengthen the case."}, "questions": {"value": "It would be helpful if the authors could address this weakness, if possible."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "zAovyZ7l3q", "forum": "noWKCE7jNk", "replyto": "noWKCE7jNk", "signatures": ["ICLR.cc/2026/Conference/Submission7754/Reviewer_5jd3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7754/Reviewer_5jd3"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission7754/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761629081939, "cdate": 1761629081939, "tmdate": 1762919797670, "mdate": 1762919797670, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}