{"id": "NtJM3MeXLh", "number": 14327, "cdate": 1758232876173, "mdate": 1759897376793, "content": {"title": "Online Domain Indexing", "abstract": "Domain adaptation (DA) in real-world applications often unfolds in an online fashion, where data arrives sequentially with limited domain access and imbalanced sampling across domains. For example, in personalized ads prediction, users from different demographic groups (e.g., countries or age cohorts) correspond to distinct domains with highly skewed data availability, and user interests evolve over time. Recent work has explored domain indices to capture latent inter-domain relationships and improve adaptation (Wang et al., 2020, Xu et al., 2023). However, existing methods such as Variational Domain Index (VDI) (Xu et al., 2023) assume full domain observability and balanced mini-batches, limiting their applicability to real-world scenarios with online domain shift and data imbalance. To address these challenges, we propose Online Domain Indexing (ODI), the first continual domain indexing and adaptation framework designed for partial domain access and inter-domain sample imbalance. Starting from a base model pretrained on historical source and target domains, ODI incrementally updates domain indices over time using a smoothed reweighting kernel and a replay buffer to ensure stable adaptation. Experiments on both synthetic and real-world datasets demonstrate that ODI consistently outperforms state-of-the-art baselines in long-term accuracy under dynamic and resource-constrained conditions.", "tldr": "We propose an online domain adaptation method for imbalanced data.", "keywords": ["Domain Adaptation", "Probabilistic methods"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/07b3b99146e3640fddfbba5d546b7394bb4bcba4.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The method tackles the problem of existing DA methods, which assumes that all data can be accessed with balanced distribution. However, in most applications, data are accessed online and in order, where only partial domains’ data are seen and accessible. They proposed the online-domain indexing framework, with the online-imbalanced DA problem, where only a few domains can be accessed with imbalanced data number. The proposed contributions incorporate the temporal prior on domain indices, domain-index-aware-reweighting, and the domain-aware replay buffer."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "-\tThe new problem seems sound and from the real-world application scenarios.\n-\tThe optimization and the lower bound seems correct.\n-\tA toy-example dataset is generated to prove the method and theory."}, "weaknesses": {"value": "-\tThis method seems to integrate the partially observable (continual DA) with the VDI. The complexity of the setup seems unrealistic. \n-\tThe method wise, it seems that the authors missed another line of works, focusing on the ``index-less’’ continuous domain adaptation [r1]. This paper seems to consider the continually coming data but without knowing the domain index. It seems a good solution to the proposed setup and also the simplified setup. \n-\tThe evaluation is only on the small-scale dataset; The comparison methods are very limited. \n-\tReweighting techniques have been utilized and applied in DA for a long time. The overall novelty seems limited by integrating several techniques together.\n\n[r1] Delving into the Continuous Domain Adaptation, MM, 2022"}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "2fbYNh3smU", "forum": "NtJM3MeXLh", "replyto": "NtJM3MeXLh", "signatures": ["ICLR.cc/2026/Conference/Submission14327/Reviewer_21zP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14327/Reviewer_21zP"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14327/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761884618715, "cdate": 1761884618715, "tmdate": 1762924756249, "mdate": 1762924756249, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a realistic online multi-domain adaptation setting where each training round receives only a subset (k ≪ C) of domains with domain imbalance. It extends VDI by (1) introducing a time-varying prior to encourage temporal continuity, and (2) designing Domain-Index-Aware Reweighting to mitigate data imbalance. The method is evaluated on Growing Circle, CompCars, and TPT-48. On all of these datasets, the proposed method beats all baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "* This is a realistic problem for online products: partial access + imbalance + drift.\n* The design is simple and easy to extend VDI.\n* The gains in both in-round and next-round evaluation are consistent."}, "weaknesses": {"value": "* Major: Motivation is online indexing for ads/recs, but no CTR/CVR datasets are used. Circles/cars/temperature don’t guarantee benefits for CTR/CVR datasets.\n\n* No ablation studies about the importance of each component: temporal prior vs. DIAR vs. replay.\n\n* The paper mentions dynamic and resource-constrained conditions in the abstract but doesn’t discuss this in the results.\n\n* Most shifts are smooth; it should be tested on harsher cases such as abrupt shifts, tiny k, and extreme imbalance.\n\n* TPT-48 tables label MSE as “Accuracy.”"}, "questions": {"value": "Please check Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PxEQaiqKGr", "forum": "NtJM3MeXLh", "replyto": "NtJM3MeXLh", "signatures": ["ICLR.cc/2026/Conference/Submission14327/Reviewer_hTEs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14327/Reviewer_hTEs"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14327/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891912558, "cdate": 1761891912558, "tmdate": 1762924755819, "mdate": 1762924755819, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a new setting, online domain adaptation learning with imbalanced labels. They proposed a new framework with (1) temporal priors over domain indices, and (2) domain-index-aware reweighting to tackle the challenge. Abundant experiments are conducted to validate the method's effectiveness. Overall, this paper is interesting and technically sound."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Easy to read, easy to follow, well organized.\n2. The new problem formulation is well defined and close to the real application.\n3. The framework design is technically sound."}, "weaknesses": {"value": "1. Please add more details about the experiment implementation. More specifically, how do you simulate \"online scenarios with distributional shift, partial observability, and data sparsity\"?\n2. How about the method's performance in the traditional DA setting? I think it is fair to compare ODI and VDI in the previous DA setting.\n3. Ablation study is missed. Please analyze the contribution of (1)  temporal priors, (2) domain-index-aware reweighting, and (3) replay buffer?"}, "questions": {"value": "Please answer the question in Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8VDMlW2xEW", "forum": "NtJM3MeXLh", "replyto": "NtJM3MeXLh", "signatures": ["ICLR.cc/2026/Conference/Submission14327/Reviewer_9rYZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14327/Reviewer_9rYZ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14327/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761972608727, "cdate": 1761972608727, "tmdate": 1762924755467, "mdate": 1762924755467, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}