{"id": "nVnPqLtO8r", "number": 2354, "cdate": 1757062358638, "mdate": 1763274979534, "content": {"title": "Toward Protein Docking-oriented De Novo Ligand Design via Gradient Inversion", "abstract": "De novo ligand design is a fundamental task that seeks to generate protein or molecule candidates that can effectively dock with protein receptors and achieve strong binding affinity entirely from scratch. \n    It holds paramount significance for a wide spectrum of biomedical applications.\n    However, most existing studies are constrained by the \\textbf{Pseudo De Novo}, \\textbf{Limited Docking Modeling}, and \\textbf{Inflexible Ligand Type}.\n    To address these issues, we propose MagicDock, a forward-looking framework grounded in the progressive pipeline and differentiable surface modeling.\n    (1) We adopt a well-designed gradient inversion framework.\n    To begin with, general docking knowledge of receptors and ligands is incorporated into the backbone model.\n    Subsequently, the docking knowledge is instantiated as reverse gradient flows by binding prediction, which iteratively guide the de novo generation of ligands.\n    (2) We emphasize differentiable surface modeling in the docking process, leveraging learnable 3D point-cloud representations to precisely capture binding details, thereby ensuring that the generated ligands preserve docking validity through direct and interpretable spatial fingerprints.\n    (3) We introduce customized designs for different ligand types and integrate them into a unified gradient inversion framework with flexible triggers, thereby ensuring broad applicability.\n    Moreover, we provide rigorous theoretical guarantees for each component of MagicDock.\n    Extensive experiments across 9 scenarios demonstrate that MagicDock achieves average improvements of 27.1\\% and 11.7\\% over SOTA baselines specialized for protein or molecule ligand design, respectively.", "tldr": "", "keywords": ["Receptor-Ligand Docking", "De Novo Ligand Design", "Inversion Framework"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/eb7d1aeae81aeaf9d688ad201f9272d2cf490e8b.pdf", "supplementary_material": "/attachment/aecb4b1bf55f1e6547d1806b6ffd83801d632096.zip"}, "replies": [{"content": {"summary": {"value": "The authors propose **MagicDock**, a docking-based method for *de novo* ligand design. The motivation is to address the limitations of existing methods, namely “Pseudo De Novo,” “Limited Docking Modeling,” and “Inflexible Ligand Type.” The proposed four-stage system demonstrates promising results across several evaluations."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The paper is well-motivated and addresses a relevant problem in *de novo* drug design.  \n- The authors appear to have conducted comprehensive experiments and theoretical analyses to validate their approach."}, "weaknesses": {"value": "1. **Novelty of Ligand Generation**  \n   One of the main motivations is to move beyond “Pseudo De Novo” ligand generation. However, the paper does not provide sufficient analysis to demonstrate that MagicDock indeed produces significantly more novel ligands compared to prior methods. For example, a clearer comparison (such as generating antibodies that without given the conserved CDR regions, as mentioned in line 41) would strengthen the claim of novelty.\n\n2. **Details of Inversion-based Generation**  \n   Since the inversion-based ligand generation mechanism is central to the method’s novelty, Section 3.4 should provide more implementation and methodological details. This would allow readers to better understand and reproduce the proposed approach."}, "questions": {"value": "From line 194, it appears that $P_{\\text{lig}} $ has a fixed size  N \\and only the point cloud positions are updated. How is N determined during inference? Does the choice of N affect performance, for instance, if N is set too small or too large?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "oa29G5oN2D", "forum": "nVnPqLtO8r", "replyto": "nVnPqLtO8r", "signatures": ["ICLR.cc/2026/Conference/Submission2354/Reviewer_beRR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2354/Reviewer_beRR"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2354/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761557064952, "cdate": 1761557064952, "tmdate": 1762916204272, "mdate": 1762916204272, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "55eX9Podps", "forum": "nVnPqLtO8r", "replyto": "nVnPqLtO8r", "signatures": ["ICLR.cc/2026/Conference/Submission2354/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2354/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763274978687, "cdate": 1763274978687, "tmdate": 1763274978687, "mdate": 1763274978687, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a ligand design framework based on docking prediction. It utilizes a predictive model capable of performing docking predictions between molecules and proteins, as well as between proteins themselves. By applying the concept of gradient inversion (i.e., optimization), the model is transformed into an approximate generative model that can iteratively update its inputs."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. This paper unified both ligand types of proteins and ligands, enabling flexible ligand design.\n2. The proposed framework unified prediction and generation with one prediction network, which provide broader applicability."}, "weaknesses": {"value": "1. The paper writing needs improvement. This paper is more like a technical report without clear motivation for every component and insight behind the technical design. \n2. The framework is way too more complex than unified generative frameworks, without clear ablations for each component. \n3. Optimization-based framework is slower than generative framework during inference, which is the major concern for users. Also, the theoretical analysis presented for this framework is overly vague and generic, as the same theoretical principles could be applied to any gradient inversion-based framework.\n4. The validation is limited. This paper lacks analysis about the chemical validity and synthesizability, which is usually the major drawbacks for optimization-based method. Meanwhile, the prediction and generation shares the datasets, which may contain biases causing issues like reward hacking.\n5. The entire framework is an integration of many existing methods. The optimization-based framework is used for generation, which is not novel even in the biological domain and is commonly applied to predictive networks with AlphaFold-level accuracy. Therefore, the proposed framework lacks innovative design and does not provide new insights. Moreover, the motivation for choosing an optimization-based framework is unclear. In theory, any optimization method could be incorporated into a classifier-guidance or stochastic optimal control framework, which would also allow one to benefit from the likelihood modeling capabilities and inference acceleration techniques offered by generative models."}, "questions": {"value": "1. In Fig.4, the visualization process is a bit confusing. Why the predicted pocket becomes the Generated Ligand? Also there is no conformational change or ligand type change, thus this is not straightforward for visualization.\n2. Are the downstream tasks chained during both SFT and Inference? That’s, predict the pocket first, then predict the interaction, and predict the energy change. \n3. Will the gradient signal mainly come from the energy prediction head? The signal from a binary interaction prediction is not strong enough for SBDD, it would be interesting to see the contribution ratio for different objectives in the compositional loss.\n4. Why VQ in a gradient-inversion framework? This is not common and convenient."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "LG88N59VN1", "forum": "nVnPqLtO8r", "replyto": "nVnPqLtO8r", "signatures": ["ICLR.cc/2026/Conference/Submission2354/Reviewer_qWQw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2354/Reviewer_qWQw"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2354/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761654449024, "cdate": 1761654449024, "tmdate": 1762916203920, "mdate": 1762916203920, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes MagicDock, a four-stage inversion-based framework for de novo ligand design. The method integrates differentiable surface modeling, SE(3)-equivariant pretraining, supervised fine-tuning on docking-related tasks, and gradient-driven ligand generation. The authors claim that this inversion mechanism allows for end-to-end optimization and generalization across protein and small-molecule ligands. Experiments on datasets such as SKEMPI v2, SAbDab, PDBBind2020, and CrossDocked2020 are reported, showing improved docking metrics over prior approaches."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper presents a comprehensive engineering pipeline, with well-structured stages and clear modularization.\n\nThe formulation of an inversion-based refinement process is technically consistent with recent gradient-based optimization frameworks.\n\nThe inclusion of SE(3)-equivariant modeling and surface point cloud representations shows awareness of current practices in protein structure modeling.\n\nExperimental evaluation spans both protein and small-molecule ligands, demonstrating some breadth of applicability."}, "weaknesses": {"value": "Lack of conceptual novelty.  \nThe central idea—gradient-based inversion on differentiable surface embeddings—is not new and has already appeared in recent works such as Boltz-2 (Nature 2024), Chai-2, and AlphaFold3’s structure-diffusion inversion modules, which perform fine-grained energy and docking optimization using gradient-based updates. The proposed “MagicDock” framework appears to repackage existing paradigms (diffusion, flow matching, SE(3)-equivariant GNNs, and gradient descent in latent space) rather than contributing a new methodological insight.\n\nMarginal empirical improvement.   \nReported performance gains (e.g., +11.7% on molecular benchmarks) are incremental and within the variance seen across modern baselines. Given that the field is rapidly progressing—with large-scale multimodal foundation models like AlphaFold3, Chai-2, and Boltz-2 capable of full protein–ligand co-folding and docking prediction—the incremental performance increase is not scientifically compelling.\n\nOverstated theoretical contribution.  \nThe claimed “rigorous theoretical guarantees” are generic restatements of standard optimization theory (e.g., convergence of projected gradient descent, SE(3)-equivariance proofs, and information-theoretic upper bounds) without being specialized to docking or ligand design. These sections add mathematical verbosity without offering domain-specific insight or new theorems.\n\nLimited biological validation.  \nThe paper lacks experimental or structural validation (e.g., docking energy correlation with experimental binding affinities or AlphaFold-Multimer structures). Without such validation, the biological significance of the generated ligands remains speculative.\n\nOutdated comparative context.  \nThe authors compare mainly against diffusion- and RL-based generative baselines but omit the latest structure-to-ligand co-design models (e.g., Chai-2, EquiDock++, RoseTTAFold All-Atom, and AlphaFold3 Multimer). These models already achieve joint receptor–ligand modeling with differentiable geometry, making MagicDock’s inversion strategy appear redundant.\n\nAmbiguous scientific impact.  \nThe “gradient inversion” narrative largely reframes standard backpropagation through a pretrained model as if it were a distinct generative mechanism. Without novel inductive biases, new architectures, or validated improvements in docking precision, the work fails to advance understanding or methodology in protein–ligand generative modeling."}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "oatAuiGADs", "forum": "nVnPqLtO8r", "replyto": "nVnPqLtO8r", "signatures": ["ICLR.cc/2026/Conference/Submission2354/Reviewer_YSYY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2354/Reviewer_YSYY"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2354/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761874685526, "cdate": 1761874685526, "tmdate": 1762916203715, "mdate": 1762916203715, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose MagicDock, a gradient inversion method for de novo generation of ligands."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "I appreciate the extensiveness of the pseudocode, theorems, and detail in the main text and appendix."}, "weaknesses": {"value": "See questions section.\n\nI’m not sure about the methodological novelty of this method. “Patching”/masked autoencoding has been applied before for proteins and molecules, and SFT/gradient inversion is not a new method.\n\nI would appreciate error bars on tables 1 and 2. While MagicDock is the best in most cases, it appears only marginally better than previous methods such as DiffSBDD and DrugFlow.\n\nThe font on the figures could be made bigger. Right now the figures are too packed with information."}, "questions": {"value": "I’m not sure about the weaknesses you mention in the introduction. Specifically, you claim that prior methods do not explicitly consider “spatial docking information and protein surface information” (intro, 2nd paragraph). Many prior methods do incorporate protein pocket information (DrugFlow, DecompDiff, etc), and information on atom types, charges, hybridization, etc.\n\nWhat are the specific features in eq 5? The manuscript just says a “highly comprehensive feature vectors”. What are the features?\n\nHow are stages 3 and 4 related? Is binding affinity regression SFT done in hopes of improving the ligand generation method?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "sx4RYdQmAf", "forum": "nVnPqLtO8r", "replyto": "nVnPqLtO8r", "signatures": ["ICLR.cc/2026/Conference/Submission2354/Reviewer_C1qQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2354/Reviewer_C1qQ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2354/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761882844926, "cdate": 1761882844926, "tmdate": 1762916203547, "mdate": 1762916203547, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}