{"id": "O7fxz7D6vf", "number": 22564, "cdate": 1758332901986, "mdate": 1763657502949, "content": {"title": "Obscure but Effective: Classical Chinese Jailbreak Prompt Optimization via Bio-Inspired Search", "abstract": "As Large Language Models (LLMs) are increasingly used, their security risks have drawn increasing attention. Existing research reveals that LLMs are highly susceptible to jailbreak attacks, with effectiveness varying across language contexts. This paper investigates the role of classical Chinese in jailbreak attacks. Owing to its conciseness and obscurity, classical Chinese can partially bypass existing safety constraints, exposing notable vulnerabilities in LLMs. Based on this observation, this paper proposes a framework, CC-BOS, for the automatic generation of classical Chinese adversarial prompts based on multi-dimensional fruit fly optimization, facilitating efficient and automated jailbreak attacks in black-box settings. Prompts are encoded into eight policy dimensions—covering role, behavior, mechanism, metaphor, expression, knowledge, trigger pattern and context; and iteratively refined via smell search, visual search, and cauchy mutation. This design enables efficient exploration of the search space, thereby enhancing the effectiveness of black-box jailbreak attacks. To enhance readability and evaluation accuracy, we further design a classical Chinese to English translation module. Extensive experiments demonstrate that effectiveness of the proposed CC-BOS, consistently outperforming state-of-the-art jailbreak attack methods.", "tldr": "", "keywords": ["Jailbreak attack", "LLMs", "Classical Chinese"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/62450c98006050ac13e9745074ca903bb72296b6.pdf", "supplementary_material": "/attachment/97c878189a4333da3a774177a957b0c00feca202.zip"}, "replies": [{"content": {"summary": {"value": "The work proposes CC-BOS, a black-box jailbreak framework for Large Language Models (LLMs) using Classical Chinese. It leverages Classical Chinese’s linguistic traits (conciseness, obscurity, etc.) to bypass safety constraints, structures prompt generation into an eight-dimensional strategy space, and adopts a fruit fly-inspired bio-optimization algorithm for efficient space exploration. Experiments demonstrate the performace of the proposed algorithm."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed jailbreak method achieves the best attack performance on AdvBench Benchmark compared with existing methods.\n2. The proposed jailbreak method can achieve success with a relatively small number of queries, which takes into account the efficiency of the algorithm."}, "weaknesses": {"value": "1. The innovation and contributions of this paper are relatively limited. Jailbreak attack methods based on genetic algorithms have already been proposed (e.g. AutoDAN). Although this paper puts forward some different strategy spaces, their contributions are quite limited.\n2. The adversarial prompt examples provided in Figures 3 and 4 in appendix contain prior information about malicious queries, such as the requirement of potassium nitrate for making bombs. This indicates that additional prior information about queries is incorporated into the attack process, making the comparison less fair.\n3. Since this paper claims that classical Chinese can easily bypass the model's safety safeguards, I am very curious about the possible reasons for this phenomenon, as the safety and alignment of large models do not seem to have a direct connection with classical Chinese. I think this will make the method more interpretable."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "j5z5qo7Pl0", "forum": "O7fxz7D6vf", "replyto": "O7fxz7D6vf", "signatures": ["ICLR.cc/2026/Conference/Submission22564/Reviewer_hZfy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22564/Reviewer_hZfy"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22564/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761418399836, "cdate": 1761418399836, "tmdate": 1762942281827, "mdate": 1762942281827, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose a bio-inspired optimization algorithm, inspired by fruit fly foraging behavior, which enables automated and effective generation of adversarial prompts by balancing global exploration and local\nexploitation. \n\nThey  design a two-stage translation module to ensure a more objective\nand robust evaluation of model responses. By integrating these components, they develop a highperformance and stable jailbreaking method. \n\n\nThey conduct extensive experiments across multiple\nLLMs to validate the effectiveness of our proposed method. The results demonstrate that CC-BOS\nconsistently outperforms existing jailbreak methods in success rate."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "They propose classical Chinese into the study of adversarial prompt generation and jailbreaks for\nthe first time, thereby establishing a new perspective and extending the scope of LLM security.\n\nThey propose a black-box jailbreak framework that formalizes prompt generation within an eightdimensional strategy space and leverages the bio-inspired optimization algorithm to achieve\nsystematic and automated jailbreak prompt generation.\n\nThey construct a two-stage translation module to progressively mitigate the metaphorical and semantically compressed characteristics of classical Chinese, ensuring consistency and reliability\nin the model response evaluation process."}, "weaknesses": {"value": "1. The paper investigates the role of classical Chinese in jailbreak attacks. Can you generalize your paper technique into many other different languages?\n\n2. After reading the paper, I cannot understand how you model the  jailbreak attacks with the feature of classical Chinese?\n\n3. Why the BIO-INSPIRED OPTIMIZATION ALGORITHM is effective for classical Chinese for jailbreak attacks is very unclear to me."}, "questions": {"value": "see the above comments."}, "flag_for_ethics_review": {"value": ["No ethics review needed.", "Yes, Other reasons (please specify below)"]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "s6s4AFl1Pe", "forum": "O7fxz7D6vf", "replyto": "O7fxz7D6vf", "signatures": ["ICLR.cc/2026/Conference/Submission22564/Reviewer_Qb4q"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22564/Reviewer_Qb4q"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22564/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761960251431, "cdate": 1761960251431, "tmdate": 1762942281579, "mdate": 1762942281579, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel jailbreak attack method. It leverages the linguistic characteristics of classical Chinese and introduces a framework, CC-BOS, for automatic generation of jailbreak prompts based on a multi-dimensional Fruit Fly Optimization algorithm."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper identifies a previously underexplored vulnerability of LLMs to jailbreaks that arises from classical Chinese, and proposes an automated method to generate jailbreak prompts.\n2. The attack is evaluated against six baselines; experimental results indicate the proposed method is effective."}, "weaknesses": {"value": "The experimental evaluation of the proposed attack against defenses is insufficient: only a single defense method is assessed. The paper should evaluate additional defense methods (e.g., composite and dynamic defenses) to support its claims."}, "questions": {"value": "1. The paper claims that \"the security vulnerabilities of classical Chinese stem from the unique challenges posed by its linguistic characteristics to alignment mechanisms\". This viewpoint is confusing. The authors should provide more experiments and a deeper analysis to substantiate this claim. Yet the proposed method depends on translating classical Chinese as part of the jailbreak process. If alignment on classical Chinese is challenging, why does the LLM still exhibit strong translation capability?\n2. The attack cost reported in Table 3 is unclear. The table reports an average success at ~1.5 queries, but according to the described framework, generating a single jailbreak prompt requires at least 4 interactions with the LLM in a single round. Please recheck how this metric is computed, clarify the calculation procedure, and update the results."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Wy4ZlphcdI", "forum": "O7fxz7D6vf", "replyto": "O7fxz7D6vf", "signatures": ["ICLR.cc/2026/Conference/Submission22564/Reviewer_kUsg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22564/Reviewer_kUsg"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22564/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761964969769, "cdate": 1761964969769, "tmdate": 1762942281391, "mdate": 1762942281391, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a novel black-box jailbreak attack on LLMs using the linguistic properties of classical Chinese. The proposed framework, CC-BOS, formalizes this attack into an 8-dimensional strategy space that combines jailbreak tactics with classical concepts and uses a bio-inspired algorithm to find optimal prompts. The method achieves a near-100% ASR against six LLMs on three safety benchmarks, demonstrating high efficiency and robustness."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper contributes a structured framework (CC-BOS) by formalizing the attack into a well-defined 8-dimensional strategy space. \n\n2. The empirical evaluation is extensive, with near-perfect success across six SOTA models and three distinct benchmarks. The high query efficiency and robustness against Llama-Guard-3 underscore the potential of the attack."}, "weaknesses": {"value": "1. The success of the proposed method is critically dependent on an “attack LLM” (Deepseek-Chat) to generate the final prompts. It’s unclear if the success comes from the 8D-space or simply this model’s specific generative ability.\n\n2. The paper highlights Fruit Fly Optimization but fails to justify its use over other standard black-box optimizers (e.g., genetic algorithms, random search), rendering the optimizer’s specific contribution is unclear.\n\n3. The defense experiment (Table 4) is limited to Llama-Guard-3-8B. A more compelling test would be using the proposed translation module as a defensive pre-processing step."}, "questions": {"value": "Please address all concerns in the Weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "zHsDFTkP5R", "forum": "O7fxz7D6vf", "replyto": "O7fxz7D6vf", "signatures": ["ICLR.cc/2026/Conference/Submission22564/Reviewer_yuc5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22564/Reviewer_yuc5"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22564/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761992985323, "cdate": 1761992985323, "tmdate": 1762942281209, "mdate": 1762942281209, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}