{"id": "oN7szRflpe", "number": 16100, "cdate": 1758259997196, "mdate": 1762927249674, "content": {"title": "Fairness-Aware EHR Analysis via Structured Missing Pattern Modeling and Adversarial Low-Rank Adaptation", "abstract": "Deep learning has been widely applied to electronic health record (EHR) analysis, offering strong predictive capabilities for clinical outcome prediction. However, due to inherent disparities across demographic groups (e.g., race, gender), fairness concerns have become increasingly critical. Due to severe instability in jointly optimizing fairness and performance objectives, existing fairness-aware approaches often struggle to balance predictive accuracy and fairness. Moreover, the structured missingness in real-world EHR data further worsens the performance and fairness of predictive models, yet they are frequently overlooked in fairness-aware modeling. In this paper, we propose FEMALA, a novel two-stage EHR analysis framework by explicitly modeling the structured missing patterns within EHR and fairness-aware model adaptation. Particularly, we design a dual-encoder architecture to integrate EHR temporal dynamics and structured missing patterns, thus enhancing performance while improving fairness by handling missingness well. Further, we perform adversarial fine-tuning to decorrelate task and sensitive representations via low-rank adaptation, enabling a better trade-off between fairness and accuracy. Experiments on MIMIC-III/IV datasets demonstrate that our framework achieves state-of-the-art performance in both accuracy and fairness, validating the effectiveness of structured missing pattern modeling and fairness adaptation fine-tuning. The code is anonymously available at https://anonymous.4open.science/r/FEMALA/README.md.", "tldr": "We propose  a novel two-stage framework to achieve fairness-aware EHR clinical prediction via adversarial LoRA fine-tuning.", "keywords": ["Fairness", "Electronic Health Records", "Missing values", "LoRA"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/8af896efa9f648a1ed014df548f4cb44b37a4435.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper aims to address the issues of fairness and data missingness in EHR data simultaneously. Overall, the research topic is not novel, and its significance is limited for a top machine learning conference. Both fairness and missingness have been extensively studied in existing works on AI in healthcare, while this paper mainly attempts to combine these two aspects. The novelty of the proposed “ensemble” method is limited. In addition, the baselines used for comparison are not adequate, and the evaluation focuses only on naive empirical studies, without any simulated settings that include different missingness mechanisms or synthetic data where the ground truth is known.\n\nI suggest that the authors revise the article to address the following weaknesses and consider submitting it to a clinical informatics journal as a general benchmark or empirical study.\n\nPlease find my detailed comments below."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The overall writing is clear and easy to follow, and the figures are well presented."}, "weaknesses": {"value": "1.\tLack of novelty and significance.\n\nAs mentioned in the overall summary, the work lacks novelty. I suggest that the authors reconsider the target audience of this study and revise the manuscript for submission to a clinical informatics journal, where it may be of greater interest.\n\n2.\tExperimental design.\n\nThe experimental design requires substantial improvement to meet the standards of a rigorous study.\n\n(1) Baseline models\n\nThe baseline models are not sufficient. More deep learning–based models should be included, following prior works. For example:\n\n(a) Liu, Mingxuan, et al. “Handling missing values in healthcare data: A systematic review of deep learning-based imputation techniques.” Artificial Intelligence in Medicine 142 (2023): 102587.\n\n(b) Penny, Kay I., and Ian Atkinson. “Approaches for dealing with missing data in health care studies.” Journal of Clinical Nursing 21(19–20) (2012): 2722–2729.\n\nState-of-the-art fairness methods for structured EHR data should also be considered:\n\n(a) Berk, Richard, et al. \"A convex framework for fair regression.\" arXiv preprint arXiv:1706.02409 (2017).\n\n(b) Williamson, Robert, and Aditya Menon. \"Fairness risk measures.\" International conference on machine learning. PMLR, 2019.\n\n\n\nIn addition, naive MVI (missing value imputation) strategies such as mean/median imputation and MICE should be compared. The proposed method must be clearly justified as offering unique advantages over these naive baselines. It is possible that standard MVI strategies could yield comparable or even better results for downstream tasks; if so, the proposed method would appear computationally expensive and overly black-box for clinical decision-making requirements.\n\n(2) Simulations\n\nSimulation studies are needed. The authors should first generate three different missingness mechanisms using real data, and ideally include experiments on purely simulated data as well.\n\n(3) Reporting uncertainty\n\nThe paper should report standard errors or confidence intervals, since metrics such as EOR and DPR can fluctuate significantly when data are imbalanced."}, "questions": {"value": "Could the authors provide more details to justify the unique challenges faced by temporal EHR data? This aspect is ambiguous in the current writing. The evaluation currently focuses only on prediction performance, where the outcome is treated as binary. For instance, if the goal is survival analysis, the current binary outcome prediction is insufficient. More experimental designs are needed to demonstrate that the proposed solution has unique advantages for time-series data. The current evaluation appears somewhat irrelevant to time-series data and may be misleading."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Pm1HbZLQg0", "forum": "oN7szRflpe", "replyto": "oN7szRflpe", "signatures": ["ICLR.cc/2026/Conference/Submission16100/Reviewer_ueUL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16100/Reviewer_ueUL"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16100/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760970688008, "cdate": 1760970688008, "tmdate": 1762926278807, "mdate": 1762926278807, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "J7bvmMnzsY", "forum": "oN7szRflpe", "replyto": "oN7szRflpe", "signatures": ["ICLR.cc/2026/Conference/Submission16100/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16100/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762927248509, "cdate": 1762927248509, "tmdate": 1762927248509, "mdate": 1762927248509, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The work proposes FEMALA (Fairness-Aware EHR Analysis via Structured Missing Pattern Modeling and Adversarial Low-Rank Adaptation), a two-stage framework for fair and accurate clinical outcome prediction from Electronic Health Records (EHRs). Recognizing that structured missingness in EHRs, non-random patterns of missing data correlated with demographic attributes, exacerbates algorithmic bias, FEMALA first jointly models observed clinical time-series data and structured missingness using a dual-encoder architecture with a novel adaptive fusion module. This enhances representation robustness and implicitly improves fairness. In the second stage, it applies adversarial fine-tuning via low-rank adaptation (LoRA) to minimize mutual information between task representations and sensitive attributes, effectively decoupling predictions from demographic bias while preserving accuracy. Evaluated on MIMIC-III and MIMIC-IV for in-hospital mortality and readmission prediction, FEMALA achieves state-of-the-art results in both AUROC (+2.3%) and fairness metrics like Equalized Odds (−2.9%), outperforming existing fairness-aware and imputation-based baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. A key strength of FEMALA is its recognition that missing data in Electronic Health Records (EHRs) is not random but systematically linked to demographic disparities, a phenomenon known as structured missingness.\n\n2. FEMALA introduces a principled two-stage pipeline that separates representation learning from fairness enforcement, addressing a major limitation of existing methods that jointly optimize conflicting objectives."}, "weaknesses": {"value": "1. The work restricts itself to binary classification tasks and categorical sensitive attributes, which narrows its applicability in real-world clinical settings where outcomes can be multi-class (e.g., disease severity levels) or continuous (e.g., length of stay), and where sensitive attributes may include continuous or high-cardinality variables such as socioeconomic status or zip code. This constraint limits the generalizability of FEMALA to more complex prediction scenarios commonly encountered in healthcare analytics and may require non-trivial architectural or methodological extensions to accommodate such cases.\n\n2. Another weakness is the exclusive focus on multivariate time-series EHR data, excluding other rich modalities like clinical notes, imaging, or genomic data. Modern clinical decision support systems increasingly rely on multimodal inputs, and missingness patterns in these additional modalities could further compound fairness issues. By not addressing multimodal missingness or cross-modal bias propagation, the framework may overlook critical sources of disparity that arise when integrating heterogeneous data types, thus limiting its relevance in the context of contemporary multimodal clinical AI systems.\n\n3. The evaluation, while thorough on MIMIC-III and MIMIC-IV, is confined to ICU populations from a single institution (Beth Israel Deaconess Medical Center), raising concerns about external validity. Algorithmic fairness is highly context-dependent, and biases manifest differently across healthcare systems, geographic regions, and patient demographics. Without validation on more diverse datasets—such as those from community hospitals, international cohorts, or outpatient settings—it remains uncertain whether FEMALA’s gains in fairness and accuracy would generalize beyond the specific structural and demographic characteristics of the MIMIC databases.\n\n4. The fairness intervention in FEMALA assumes access to ground-truth sensitive attributes during fine-tuning, which may not always be available or legally permissible in practice due to privacy regulations or institutional policies. While the paper acknowledges this implicitly by using attributes like race and insurance status, it does not explore or propose alternatives for settings where such attributes are missing or must be inferred, nor does it address the ethical implications of requiring sensitive data to enforce fairness—a paradox that has been noted in prior fairness literature."}, "questions": {"value": "Please refer to the weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "KJEndEoJaN", "forum": "oN7szRflpe", "replyto": "oN7szRflpe", "signatures": ["ICLR.cc/2026/Conference/Submission16100/Reviewer_8e9B"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16100/Reviewer_8e9B"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16100/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761900794757, "cdate": 1761900794757, "tmdate": 1762926278319, "mdate": 1762926278319, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes FEMALA, a two-stage framework for fair EHR analysis that tackles bias from structured missingness. It uses a dual-encoder to model both temporal data and missing patterns, then applies adversarial low-rank adaptation (LoRA) to fine-tune for fairness, achieving state-of-the-art accuracy and fairness."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* **Missingness as Signal:** Innovatively treats missingness patterns as an informative signal, not just noise to be imputed.\n* **Stable Two-Stage Design:** The \"learn first, correct later\" approach using adversarial LoRA achieves a superior accuracy-fairness trade-off.\n* **Extensive Empirical Eval:** Performs a fairly extensive eval across baselines and datasets."}, "weaknesses": {"value": "* **SOTA Claim** The method claims SOTA performance in a few places, yet the only recent baseline is one from 2024, which may not be the best comparison either (due to the focus of the other study on multimodal data).\n* **Fixed Segmentation:** Relies on fixed-length segmentation, which may be less effective than event-based or adaptive methods.\n* **Simple Missingness Encoding:** The method for encoding global missingness patterns (time/feature averages) is relatively simple.\n* **Remaining Biases:** The model still struggles to fully mitigate deep-rooted biases related to sensitive attributes."}, "questions": {"value": "- Do the authors claim that their results are better than FLMD and FFVAE in Fig. 3?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "hW6LsQytMZ", "forum": "oN7szRflpe", "replyto": "oN7szRflpe", "signatures": ["ICLR.cc/2026/Conference/Submission16100/Reviewer_Wp15"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16100/Reviewer_Wp15"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16100/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761924008638, "cdate": 1761924008638, "tmdate": 1762926277923, "mdate": 1762926277923, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The manuscript presents a two-stage framework for fairness aware prediction on EHR time series - FEMALA (Fairness-Aware EHR Analysis via Missing Pattern Modeling and Adversarial Low-Rank Adaptation). In Stage 1, the model jointly encodes EHR temporal dynamics with a Segment Aware Temporal Encoder and structured missingness with a Structured Missing Pattern Encoder. These are then fused. In Stage 2, the model learns an autoencoder based sensitive attribute embedding (gender, race, insurance, age, marital status), estimates mutual information between this embedding and the task representation using MINE. It then performs adversarial finetuning over LoRA adapters to minimize that MI while keeping task performance. In hospital mortality (IHM) and 30 days readmission (READM) are the two tasks used in the experiments on MIMIC-III / IV."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Clearly defined two stage system: Stage 1 creates a representation by jointly encoding EHR segments & structured masks. Stage 2 performs fairness specific adaptation. It connects two ideas of modeling of structured missingness and fairness aware adaptation.\n2. Dual encoder with Structured Missingness Encoder and Missing Pattern Guided Adaptive Fusion module provides a principled way to turn structured missingness patterns into useful signal. The low rank adversarial finetuning that minimizes mutual information with sensitive attributes is a parameter efficient strategy that preserves accuracy while improving fairness.\n3. Results on MIMIC III/IV dataset and two clinical tasks (IHM, readmission) show overall gains in predictive performance and fairness. Includes ablations."}, "weaknesses": {"value": "1. Combining missingness modeling with fairness is valuable - but these components draw on known ideas (Transformers for time series, cross attention fusion, MINE based adversarial training).\n2. Empirical scope is narrow to make a generic conclusion - results are on two related MIMIC datasets and two binary tasks from the same health system.\n3. Proposed MAF uses a learned gating and attention over mask informed weights. Exact dimensions and normalization of α is unclear.\n4. Existing method assumes access to multiple categorical sensitive attributes (race, gender, insurance, age group, marital status) and encodes them. Although mentioned as future work but evaluating on using high cardinality / continuous attributes is important. From the real-world practicality standpoint, these sensitive attributes may not be made available - manuscript paper does not discuss settings where sensitive attributes are partially or not available.\n5. Fairness results are presented for EO and EDDI (group metrics). No per patient or path level analysis is made available.\n6. Limited comparisons to missingness as a signal baseline (dual stream or mask encoder approach)"}, "questions": {"value": "1. Could you please report train on MIMIC III => test on MIMIC IV (and vice versa) to evaluate whether fairness gains remain under dataset shift?\n2. Since one stage adversarial training is unstable, could you please share training curves for Stage 2 and report variance over to show the fairness gains are robust?\n3. Could you please quantify the dependence between SME features and sensitive attributes?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "CwIwacpWoV", "forum": "oN7szRflpe", "replyto": "oN7szRflpe", "signatures": ["ICLR.cc/2026/Conference/Submission16100/Reviewer_fUSL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16100/Reviewer_fUSL"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16100/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761984870497, "cdate": 1761984870497, "tmdate": 1762926277397, "mdate": 1762926277397, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}