{"id": "oRmo4p1KEE", "number": 213, "cdate": 1756731296786, "mdate": 1763738344188, "content": {"title": "QuadGPT: Native Quadrilateral Mesh Generation with Autoregressive Models", "abstract": "The generation of quadrilateral-dominant meshes is a cornerstone of professional 3D content creation. \nHowever, existing generative models generate quad meshes by first generating triangle meshes and then merging triangles into quadrilaterals with some specific rules, which typically produces quad meshes with poor topology.\nIn this paper, we introduce QuadGPT, the first autoregressive framework for generating quadrilateral meshes in an end-to-end manner. \nQuadGPT formulates this as a sequence prediction paradigm, distinguished by two key innovations: a unified tokenization method to handle mixed topologies of triangles and quadrilaterals, and a specialized Reinforcement Learning fine-tuning method tDPO for better generation quality. \nExtensive experiments demonstrate that QuadGPT significantly surpasses previous triangle-to-quad conversion pipelines in both geometric accuracy and topological quality. \nOur work establishes a new benchmark for native quad-mesh generation and showcases the power of combining large-scale autoregressive models with topology-aware RL refinement for creating structured 3D assets.", "tldr": "A novel method that directly generates quad-dominant meshes with superior topology, overcoming the limitations of conversion-based approaches.", "keywords": ["Autoregressive Quad Mesh Generation", "Reinforcement Learning", "Topology Optimization"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/7dd3e80df61a58f212e6212fb617667db98486b6.pdf", "supplementary_material": "/attachment/8f8d0d8dda3d363594e169eba2ef245da4ffd53e.zip"}, "replies": [{"content": {"summary": {"value": "The paper introduces QuadGPT, an end-to-end autoregressive framework for generating native mixed quadrilateral and triangular meshes directly from a point cloud input. QuadGPT proposes a unified serialization scheme that handles both triangle and quad faces using a padding-based tokenization, along with an Hourglass Transformer architecture for efficient processing of long sequences. Furthermore, the model is refined using a reinforcement learning approach, which uses a topological reward function to encourage the formation of clean, production-ready edge loops. The authors demonstrate that this approach significantly surpasses prior state-of-the-art methods in both geometric fidelity and topological coherence on a large, curated dataset."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper is clearly written and easy to follow. \n- The experimental results are impressive, demonstrating strong generalization capability on a wide range of meshes."}, "weaknesses": {"value": "- The method itself is a combination of previous efforts (e.g., hourglass transformer and quad-dominance control form Meshtron, direct mesh tokenization from MeshXL, point cloud encoder from MeshAnything), with the biggest difference as the introduction of a mixed quad-triangle setting, which is a rather simple extension.\n- There is no ablation on the dataset. It's hard to tell if the performance boost is mainly from better data quality, and the comparison with previous works trained on public datasets is unfair. \n- Missing references and discussions on the triangle-to-quad conversion algorithm, for example, Blossom-Quad [1] and Blender's built in algorithm.\n\n[1] Blossom-Quad: A non-uniform quadrilateral mesh generator using a minimum-cost perfect-matching algorithm; Remacle, J‐F., et al."}, "questions": {"value": "- The padding-based serialization seems pretty plain and inefficient for meshes with many triangles. Have the authors considered about using token compression techniques like BPT?\n- I wonder if the authors have tried experiments on openly available dataset? It's unfair to compare with other models trained on different datasets (of potentially worse quality). It's understandable to use proprietary datasets for the best performance, but the author should at least do some ablation study on the dataset quality, which can provide some insights for future research (e.g., the TripoSG paper).\n- How effective is the quad-dominance parameter for controlling the ratio of quad vs triangular faces? It also sounds pretty empirical to gradually anneal the data distribution with r from 0 to 1.\n- What's the insight for native quad mesh generation? Especially, I wonder its difference from first generating pure triangular meshes with the same model (e.g. use r=0), and then apply the proposed triangle-to-quad algorithm."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "DXSXC2gCoN", "forum": "oRmo4p1KEE", "replyto": "oRmo4p1KEE", "signatures": ["ICLR.cc/2026/Conference/Submission213/Reviewer_N2bc"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission213/Reviewer_N2bc"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission213/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761313579967, "cdate": 1761313579967, "tmdate": 1762915471931, "mdate": 1762915471931, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work introduces QuadGPT, an autoregressive framework for direct generation of quadrilateral meshes. The input condition is a point cloud with normals. The authors propose a unified representation through padding, supporting mixed-element topologies (triangles + quads). The model is built upon an hourglass architecture. The pretraining loss is a standard cross-entropy loss. The model is further finetuned by a reinforcement learning approach with truncated direct preference optimization, rewarding coherent edge loops. Experiments show that QuadGPT generates higher quality quad meshes when compared to prior methods, both quantitatively and qualitatively."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "- This work introduces an end-to-end learning-based framework for direct quad mesh generation from point clouds. This is challenging as meshes have complex structures with significantly large numbers of face and vertex elements, and forming coherent edge loops as in professional-crafted quad meshes is difficult.\n- To promote clean topologies in the generated quad meshes, the authors introduce a reinforcement learning stage, optimizing a direct preference optimization objective rewarding long, coherent edge loops. To handle long sequences, the authors use a truncated, local window-based approach."}, "weaknesses": {"value": "- The novelty of the proposed method is somewhat limited: the straightforward padding in the sequence representation to support triangles + quads, the hierarchical hourglass architecture from MeshTron [Hao et al. 2024], the direct preference optimization already proposed for mesh generation in DeepMesh [Zhao et al. 2025]. Overall, the proposed method seems to be a simple extension of those existing works to quad mesh generation.\n- The experimental evaluation is less comprehensive. Comparisons to the triangle mesh generation baselines (e.g., MeshAnything, DeepMesh) may not be fair, due to the difference in training data and model capacity for long sequences (Fig 4).\n- The proposed model has less controllability over the ratio of triangles and quads in the output mesh, though a conditioning mechanism with a quad-dominance parameter is introduced."}, "questions": {"value": "- As mentioned in the weaknesses, the comparisons to triangle mesh generation baselines need to be strengthened. For example, in the training strategy, the authors already pretrained a model exclusively on triangle meshes (L247-248). Combining this model with triangle-to-quadrilateral conversion could be a strong baseline, reducing the difference of training data and model capacity used in other triangle mesh generation baselines.\n- The authors introduced a learnable embedding for a quad-dominance parameter to control the target ratio of face types. However, L990 seems to indicate that this is not effective in practice, and there is no corresponding quantitative analysis.\n- In L111, the authors claim that QuadGPT bridges the gap between text/image inputs and production-ready 3D artist meshes. However, the majority of the results in the main text are generated from point clouds.\n- There is no promise of code and data release. Though the authors mention that a public API will be provided, access to the full model weights and training data is important for reproducibility and follow-up research."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "2s0WtO1Mhj", "forum": "oRmo4p1KEE", "replyto": "oRmo4p1KEE", "signatures": ["ICLR.cc/2026/Conference/Submission213/Reviewer_SA17"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission213/Reviewer_SA17"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission213/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761426023007, "cdate": 1761426023007, "tmdate": 1762915471617, "mdate": 1762915471617, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "1 The paper extends prior triangle-based mesh generation frameworks to quadrilateral mesh generation by introducing an additional vertex in the sequence representation.\n2 The paper propose a topology-aware reinforcement learning fine-tuning method (tDPO) to enhance QuadMesh quality"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Indeed, this paper extends existing triangle-based mesh generation methods to quadrilateral mesh generation.\n\n2. The paper introduces a reinforcement learning strategy with one reward function that encourages long continuous edges and one penalty function that discourages fractures, aiming to improve mesh quality."}, "weaknesses": {"value": "Although this paper is the first to extend autoregressive mesh generation to quadrilateral meshes, the extension—essentially adding one additional vertex—feels rather trivial and not strongly innovative.\n\nThe training process is also computationally expensive, requiring 64 A100 GPUs for 7 days, which makes it difficult for other researchers to reproduce the results. If the authors do not plan to release the code and weights, the paper’s academic contribution will be quite limited. Furthermore, the model is trained on proprietary licensed assets, which further reduces reproducibility and makes independent verification challenging.\n\nOverall, this paper follows a typical data-driven approach—collect/label/clean a large dataset and train a large model. The methodology itself is not particularly innovative or inspiring, and it is unclear how future researchers could benefit from it."}, "questions": {"value": "I could like the author to report NC and |NC| similar to other papers."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ZtOtzPpcft", "forum": "oRmo4p1KEE", "replyto": "oRmo4p1KEE", "signatures": ["ICLR.cc/2026/Conference/Submission213/Reviewer_cNgg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission213/Reviewer_cNgg"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission213/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761816629054, "cdate": 1761816629054, "tmdate": 1762915471109, "mdate": 1762915471109, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents an auto-regressive mesh generation model that can produce both triangular meshes and quadrilateral meshes. The model is trained with a multi-stage training strategy: 1) pre-training on triangular meshes only, 2) fine-tuning on a mixture of triangular and quadrilateral meshes, 3) reinforcement learning post-training to enhance the topology of the generated meshes."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "1. This paper represents the first work on quadrilateral mesh generation. It proposes a hybrid representation for triangles and quadrilaterals, enabling the generation of artist-like 3D meshes input point clouds.\n\n2. The paper presents a multi-stage end-to-end training framework, which incorporates both traditional next-token-prediction and sequence-level reinforcement learning supervision. The generation capability is improved in a targeted manner.\n\n3. As observed in the metrics and qualitative study, the model achieves superior results. The paper also provides many potential applications of the generated meshes, highlighting its practical usefulness."}, "weaknesses": {"value": "1. As the model supports both triangular and quadrilateral mesh generation, it would be better if treated triangular mesh generation as an evaluation task. It is interesting to study: \n    - whether training on the mixed representation helps the generation of triangular meshes, \n    - whether the proposed reinforcement learning also improves the generation of triangular meshes.\n\n    It is also a natural request since previous works mainly focus on generating triangular meshes.\n\n2. How well model follows the `quad-dominance parameter`? Now that we have mixed representations, *i.e.* triangular and mixed triangular and quadrilateral representations. Is the `quad-dominance parameter` sufficient for conditioning the model to generate the desired mesh representation? It would be better to show different generation results (triangular and mixed representations) for the same geometry."}, "questions": {"value": "1. As one of the advantages of generating quadrilateral meshes is to save tokens (representing two triangles ~2 x 9 coords with one quadrilatero ~12 coords) It is also interesting to study how much the current model can represent complex geometries with less tokens compared to previous methods."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "w9Icudi0Iw", "forum": "oRmo4p1KEE", "replyto": "oRmo4p1KEE", "signatures": ["ICLR.cc/2026/Conference/Submission213/Reviewer_87rP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission213/Reviewer_87rP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission213/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761816703468, "cdate": 1761816703468, "tmdate": 1762915470145, "mdate": 1762915470145, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}