{"id": "OwLl8Xi6JG", "number": 11514, "cdate": 1758200737873, "mdate": 1759897570981, "content": {"title": "A Resolution-Agnostic Geometric Transformer for Chromosome Modeling Using Inertial Frame", "abstract": "Chromosomes are the carriers of genetic information. Further understanding their 3D structure can help reveal gene-regulatory mechanisms and cellular functions. A standard pipeline for reconstructing the chromosome 3D structure first applies the Hi-C high-throughput screening method to measure pairwise interactions between DNA fragments at different resolutions; then it adopts computational methods to reconstruct the 3D structures from these contacts. These include traditional numerical methods and deep learning models, which struggle with limited model expressiveness and poor generalization across resolutions. To solve this issue, we propose InertialGenome, a novel transformer-based framework for robust and resolution-agnostic chromosome reconstruction. InertialGenome first adopts the inertial frame for the pose canonicalization. Then, based on such an invariant frame, it proposes a Transformer with geometry-aware positional encoding, leveraging Nyström estimation. To verify the effect of InertialGenome, we evaluate our model on two single-cell 3D reconstruction datasets with four resolutions, reaching superior performance over all four computational baselines. In addition to the structure metrics, we observe that InertialGenome outperforms when analyzing the function of reconstructed structures on two validation tasks. Finally, we leverage InertialGenome for cross-resolution transfer learning, yielding up to a 5\\% improvement from low to high resolution.", "tldr": "", "keywords": ["Chromosome Modeling", "Inertial Frame", "Resolution-Agnostic", "3D Transformer", "AI for Biology"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2648196ad36b4f4b73a9b58fda3f77bb94cedc22.pdf", "supplementary_material": "/attachment/6c14eaff19d06fe6615e6fb257910a555d53f22d.pdf"}, "replies": [{"content": {"summary": {"value": "This paper introduces InertialGenome, a novel Transformer-based framework for reconstructing 3D chromosome structures from Hi-C data. The core contributions are a two-stage process: first, it canonicalizes the initial 3D coordinates using an inertial frame to achieve pose-invariance, removing translational and rotational ambiguity. Second, it employs a geometry-aware Transformer, enhanced with 3D rotary position embeddings (RoPE) and Nyström-based structural features, to refine these coordinates. The proposed method demonstrates state-of-the-art performance on two single-cell datasets across four resolutions, showing particular strength in generalization and cross-resolution transfer learning."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The primary contribution is the elegant and effective use of inertial frame canonicalization as a preprocessing step for 3D chromosome structure refinement. This method directly addresses the fundamental problem of pose variance in geometric deep learning, providing a principled way to standardize inputs. This standardization appears to be the key driver behind the model's impressive resolution-agnostic capabilities and strong generalization performance.\n\nThe paper's novelty lies not in a single component, but in the intelligent synthesis of several ideas. While inertial frames and Transformers are not new in themselves, their application and combination in this domain are novel and well-motivated. The theoretical analysis of the inertial frame's stability (Section 3.5) using the Davis-Kahan theorem is a significant strength."}, "weaknesses": {"value": "The most critical weakness is the omission of highly relevant and recent related work in both the discussion and the experimental comparison. This significantly impacts the claims of novelty and the comprehensiveness of the evaluation.\n\n1. Missing Baseline: A key missing baseline is CHROMFORMER (NIPS'2022), which also uses a Transformer-based architecture for this exact problem. Without a direct comparison, it is difficult to ascertain whether the performance gains of InertialGenome stem from the novel inertial frame canonicalization or simply from the power of the Transformer backbone, which CHROMFORMER already established.\n\n2. Unaddressed Novelty: The paper's geometry-aware positional encoding (3D-RoPE) is presented as a novel adaptation. However, the recent work \"Learning the RoPEs: Better 2D and 3D Position Encodings with STRING (ICML'2025)\" appears to propose a very similar 3D extension of RoPE. The lack of citation and discussion of this work obscures the precise novelty of the authors' formulation."}, "questions": {"value": "1. Comparison with CHROMFORMER: Could the authors please comment on the CHROMFORMER (NIPS'2022) model? Given its use of a Transformer for the same task, it appears to be a crucial baseline. Can you provide a comparison, or a compelling argument for its exclusion, to better situate your performance results?\n\n2. Novelty of 3D-RoPE: The recently proposed STRING (ICML'2025) introduced a similar 3D rotary position encoding. Could you please clarify the novelty of your 3D-RoPE implementation in relation to this prior work?\n\n3. Ablation Study for Loss Parameter α: Your hybrid loss function in Equation (12) is controlled by the parameter α. Could you please provide an ablation study showing how performance (e.g., dSCC and dRMSE) varies with different values of α? This is important for understanding the interplay between the two loss components and for reproducibility.\n\n4. In Section 3.4, you motivate the Value-Weighted MSE by stating that Hi-C data has higher reliability for smaller distances. However, another common approach for handling data with varying reliability or potential outliers is to use the Mean Absolute Error (MAE), which is inherently less sensitive to large errors than MSE. Could you please elaborate on the reasoning for choosing a weighted MSE scheme over a simpler, more robust loss function like MAE?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "woQTAlO3Kg", "forum": "OwLl8Xi6JG", "replyto": "OwLl8Xi6JG", "signatures": ["ICLR.cc/2026/Conference/Submission11514/Reviewer_M6rw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11514/Reviewer_M6rw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission11514/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761116901096, "cdate": 1761116901096, "tmdate": 1762922615497, "mdate": 1762922615497, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This model tackles the problem of inferring genomic 3D coordinates from a distance matrix derived from Hi-C data.  The approach involves training a transformer model to infer coordinates that, essentially, maximize the agreement between the observed distance matrix and the inferred one.  The novel aspects include using something called the Nystrom method to infer candidate sets of points from an RBF kernel matrix, and using RoPE embeddings in 3D."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The overall approach contains several novel ideas, as outlined above.\n\nThe paper contains fairly extensive empirical results, largely following the evaluation protocols proposed in previous work in this area."}, "weaknesses": {"value": "Overall, I found the empirical validation of the methods pretty unsatisfying.  In general, it's difficult to benchmark 3D genome reconstruction methods, because it is hard to find an orthogonal source of gold standard structures.   One common approach is to aggregate the single-cell reconstructions and compare the result to a bulk Hi-C dataset from the same type of cells.  Another approach is it to take similar approach using imaging data (e.g., chromatin tracing).\n\nThe list of methods to infer 3D chromatin contacts (line 44) is radically incomplete.  You should focus on methods that infer genome-wide contacts, which would leave off 3C, 4C, and 5C, but would include GAM, SPRITE, ChIA-PET, and many others.\n\nSimilarly, the list of methods for 3D reconstruction (lines 72-77) is incomplete.  The list later on the same page is better.  You should re-organize the text so that all the related work is discussed at once.\n\nThe critique of related work is pretty vague.  You just say that all of these methods \"rely on simplistic modeling of contact matrices as the sole input, lacking deeper structural interpretation, and their model expression ability may be constrained and limited.\"  It's not clear what you mean by \"lacking deeper structural interpretation\" nor what the \"model expression\" refers to.  I'd rather see specific critiques of particular methods, or at the very least a more precise critique.\n\nline 110: Not every method uses these two steps.  You should make clear that the problem does not have to be solved in this fashion.  And even if it is broken down into two steps, there is not agreement in the field about the proper transfer function to translate from counts to distances.\n\nMinor points:\n\nThe abstract should make it clear earlier (around line 15)  you are talking about single-cell Hi-C data.  You should also be careful to describe it as such in the intro to Section 4.  If you just say \"Hi-C,\" that typically means bulk Hi-C.\n\nline 107: The number of bins in the genome depends on what reference genome you use, not what cell line you are looking at.\n\nline 116: What does \"canonicalized\" mean here?\n\nline 216: Give the Williams & Seeger citation when you first mention the Nystrom method.\n\nline 218: I thought the phrase \"and the effectiveness of this approach has been confirmed by research\" was oddly vague.  What kind of research?\n\nA brief description of the Nystrom method (as in lines 218-221, but shorter) should appear in the Introduction."}, "questions": {"value": "Why did you only use two single-cell Hi-C datasets?  There are many more available.\n\nHow did you decide which methods to compare your method against?  Did you run them yourself, or just compare to published results?\n\nI don't actually understand the sentences (lines 81-83) that describe how an \"inertial frame\" is used.  Some definitions of terms would be helpful.  What do you mean by \"inertial frame\" here, and \"position canonicalization\"?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "sn1Szmir20", "forum": "OwLl8Xi6JG", "replyto": "OwLl8Xi6JG", "signatures": ["ICLR.cc/2026/Conference/Submission11514/Reviewer_FLe5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11514/Reviewer_FLe5"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission11514/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761797513635, "cdate": 1761797513635, "tmdate": 1762922615036, "mdate": 1762922615036, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces InertialGenome, a novel Transformer-based framework for 3D chromosome reconstruction that is designed to be robust to different resolutions. The author proposes an inertial frame canonicalization and geometry-aware positional encoding scheme that combines 3D RoPE and Nyström approximation. The method demonstrates strong empirical results, outperforming baselines."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. The use of inertial frame canonicalization to achieve pose invariance is a reasonable and well-justified preprocessing step.\n\n2. The model consistently outperforms existing baselines in reconstruction metrics, TAD consistency and cross-resolution generalization."}, "weaknesses": {"value": "1. In Sec 3.2, the textual description (L180-183) appears to contradict the mathematical formulation in Eq 5, where 'Selective' and 'Separate' modes seem functionally identical.\n\n2. In Eq 2, the query/key vectors are intended to be 6D vector. Can we understand six as a pair, just as we considered two as a pair in RoPE? This lack of clear explanation hinders understanding.\n\n3. It is not explicitly stated, but is the 'vocab_size' simply the total number of bins for a given chromosome (248,947 at 1Kb resolution)? This confirmation would be helpful for understanding.\n\n4. The paper claims RoPE-3D has limitations in 'capturing pairwise distance relationships' (L214), but this claim is not sufficiently substantiated or demonstrated. The paper should provide an ablation study to demonstrate the contribution of this Nyström approximation .\n\n5. In Sec 3.2, $u_i$, $A$, and $O$ are used in the main text but are only clearly defined several lines later, which hinder understanding.\n\n6. The paper relies exclusively on distance-based metrics (dSCC, dRMSE). For a task focused on 3D structure reconstruction, TM-score or RMSD are essential for evaluating the global structural similarity of the predicted conformations.\n\n7. The paper claims the method is 'resolution-agnostic' and attributes this to the inertial-frame alignment and RoPE. This explanation is high-level and lacks a deep analysis. A more thorough explanation is needed to precisely understand why this specific combination of components grants robustness to resolution changes, which is a key claim of the paper."}, "questions": {"value": "1. On Line 219, the phrase \"relationships between anchor points\" is used twice in the same sentence. Is this a typographical error?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "9JPySjIz21", "forum": "OwLl8Xi6JG", "replyto": "OwLl8Xi6JG", "signatures": ["ICLR.cc/2026/Conference/Submission11514/Reviewer_YNMs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11514/Reviewer_YNMs"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission11514/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761829282254, "cdate": 1761829282254, "tmdate": 1762922614449, "mdate": 1762922614449, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposed InertialGenome, a novel transformer-based framework for robust and resolution-agnostic chromosome reconstruction.  With this new design, it greatly improved the accuracy compraed to previous methods."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The background and problem setting is clearly addressed.\n2. The network architecture is well designed and improved over previous graph-neural-network based approaches.\n3. The performance improvement is impressive."}, "weaknesses": {"value": "1. I think the problem setting has a siginificant limitation: there is no other ways to validate the predicted coordinates. In your setting, you compared the projected contact map from your 3D coordinates and the original contact map. However, single-cell Hi-C is very sparse and it can not fully capture the real 3D coordinates. Therefore, the reconstructed structure can be wrong even it has high agreement with the contact map.  Instead, I suggested to include chromatin tracing data to validate your methods, which you can refer to Higashi, which adopted some popular dataset.\n\n2. The ablation study of the design is very limited, which I think need substantial improvement.\n2.1 How to balance the structural stability loss and MSE loss? Are both losses needed?\n2.2 What is the performances without inertial frame canonicalization?\n2.3 What is ROPE's contribution to the performances?\n2.4 What is the contribution of Nystr¨ om Approximation for Structure Tokenization?\n\n3. The cross-resolution transfer benchmark is not so useful. We should expect we have different models for different resolutions, since they have very different biological focuses.\n\nINERTIAL FRAME CANONICALIZATION"}, "questions": {"value": "1. Problem setting for real chromatin tracing data.\n2. Ablation study to understand the key contribution of the designs.\n3. The biological validation is not so meaningful, since you should expect to have similar TAD/compartment observations if you can make distance map close to the original distance/contact map, but that does not mean"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "HmtcvJfjte", "forum": "OwLl8Xi6JG", "replyto": "OwLl8Xi6JG", "signatures": ["ICLR.cc/2026/Conference/Submission11514/Reviewer_A2GD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission11514/Reviewer_A2GD"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission11514/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762126203394, "cdate": 1762126203394, "tmdate": 1762922613944, "mdate": 1762922613944, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}