{"id": "P1PZBR6a4S", "number": 15675, "cdate": 1758253759357, "mdate": 1759897289731, "content": {"title": "SONATA: Synergistic Coreset Informed Adaptive Temporal Tensor Factorization", "abstract": "Analyzing dynamic tensor streams is fundamentally challenged by complex, evolving temporal dynamics and the need to identify informative data from high-velocity streams. Existing methods often lack the expressiveness to model multi-scale temporal dependencies, limiting their ability to capture evolving patterns. We propose SONATA, a novel framework that unifies expressive dynamic embedding modeling with adaptive coreset selection. SONATA leverages principled machine learning techniques for efficient evaluation of each observation for uncertainty, novelty, influence, and information gain, and dynamically prioritizes learning from the most valuable data using Bellman-inspired optimization. Entity dynamics are modeled with Linear Dynamical Systems and expressive temporal kernels for fine-grained temporal representation. Experiments on synthetic and real-world datasets show that SONATA consistently outperforms state-of-the-art methods in modeling complex temporal patterns and improving predictive accuracy for dynamic tensor streams.", "tldr": "", "keywords": ["dynamic tensor streams", "temporal dynamics", "coreset selection", "Linear Dynamical Systems", "adaptive modeling"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/4a7be7df61baf8f818231c07ed8975c2df602983.pdf", "supplementary_material": "/attachment/e1906f1e548d4c31633ac8a40d1ec755a120178d.zip"}, "replies": [{"content": {"summary": {"value": "The paper introduces SONATA, a novel framework that integrates LDS-based dynamics, multi-faceted coreset selection, and online Bayesian inference for dynamic tensor stream analysis. It combines expressive temporal modeling with adaptive coreset selection to address two fundamental challenges: capturing complex, multi-scale temporal dependencies and achieving computational efficiency in high-velocity streaming settings. SONATA models entity embeddings using Linear Dynamical Systems with Matérn kernels  to represent multi-scale dynamics. Each entity’s latent state evolves via a stochastic differential equation, with embeddings projected linearly for tensor entry prediction under a CP decomposition structure. The proposed synergistic coreset selection strategy  frames selection as a sequential decision-making problem with four criterions that maintains a compact and informative subset of the stream. For inference, SONATA employs an online Expectation Propagation algorithm, where the coreset guides the update process by emphasizing high-value observations, enabling efficient and adaptive learning.\n\nExtensive experiments on synthetic and real-world datasets  demonstrate that SONATA consistently outperforms many static and streaming baselines in predictive accuracy (RMSE and MAE) while maintaining computational efficiency. Ablation studies further confirm the necessity of each coreset criterion and the framework’s robustness to hyperparameter variations. Overall, the paper offers an interesting solution for temporal tensor decomposition."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.The paper is well-written, clearly outlining the problem and the limitations of existing methods, proposing a solution, and demonstrating robust performance.\n\n2.The idea of a synergistic coreset selection strategy, specifically designed to capture evolving dynamics and ensure long-term utility, is  novel and well-motivated. It aims to enhance computational efficiency while  improving model performance.\n\n3.Experiments demonstrate strong performance against various baselines and robustness across a variety of datasets.\n\n4.The ablation study of synergistic coreset selection strategy is convincing and reasonable."}, "weaknesses": {"value": "1. The use of Linear Dynamical Systems: the evolving parameters F,H,L are time-invariant, which limits the model’s expressiveness in capturing complex dynamics.\n\n2. Previous work has already employed SDE-represented Gaussian Processes to model the entities and enable streaming inference (e.g., SFTL; Fang et al., 2023), so the modeling is of fairly limited novelty.\n\n3. The scalibity of the proposed method over data size has not been explored in experiments."}, "questions": {"value": "1. Can this method be directly applied to data with irregularly sampled timesteps? If not, how could it be adapted to handle this more realistic scenario?\n\n2. The authors emphasize the computational efficiency of the proposed method but only report computational time. How does the method scale with respect to the number of data points?\n\n3. Why SONATA is able to capture multi-scale temporal dynamics, is there any special design?\n\n4. I am curious about the motivation for designing the importance score using four criteria: uncertainty, influence, novelty, and information increment. Could the authors provide further explanation? Conducting ablation studies on different combinations of these four criteria may better illustrate the design rationale."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "zm6X7Evnm4", "forum": "P1PZBR6a4S", "replyto": "P1PZBR6a4S", "signatures": ["ICLR.cc/2026/Conference/Submission15675/Reviewer_iw8e"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15675/Reviewer_iw8e"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15675/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760950424951, "cdate": 1760950424951, "tmdate": 1762925928820, "mdate": 1762925928820, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose SONATA, a novel framework that integrates expressive dynamic embedding modeling with adaptive coreset selection. SONATA employs principled machine learning techniques to efficiently evaluate each observation for uncertainty, novelty, influence, and information gain. It dynamically prioritizes learning from the most valuable data using Bellman-inspired optimization."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This paper integrates Linear Dynamical Systems (LDS) with temporal kernels to capture fine-grained and hierarchical temporal dependencies, addressing a key limitation of existing methods.\n\nIt enables adaptive representation of evolving patterns across different time scales (short-term vs. long-term dynamics).\n\nBellman-inspired optimization ensures optimal data selection, improving scalability for high-velocity streams."}, "weaknesses": {"value": "While coreset selection improves efficiency, the evaluation of uncertainty, novelty, and influence for each observation may introduce latency in real-time systems.\n\nThe performance of temporal kernels and LDS models may depend heavily on hyperparameter tuning.\n\nPerformance may degrade with noisy or incomplete streams, as coreset selection relies on accurate uncertainty estimation."}, "questions": {"value": "The representation of SDE in Figure 1 is different from its descriptioin in this paper.\n\nI can not find the details of multi-scale feature extraction in this paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "KIPiqMQEJn", "forum": "P1PZBR6a4S", "replyto": "P1PZBR6a4S", "signatures": ["ICLR.cc/2026/Conference/Submission15675/Reviewer_KKxL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15675/Reviewer_KKxL"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15675/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761443925013, "cdate": 1761443925013, "tmdate": 1762925928419, "mdate": 1762925928419, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents SONATA, a streaming tensor factorization framework that models each factor trajectory with a linear dynamical system (LDS) and augments learning with a multi-criteria, martingale-guided coreset. The work integrates (i) continuous-time state-space priors for temporal dynamics and (ii) an online coreset selector that combines uncertainty, novelty, influence, and a martingale increment into a Bellman-optimized score under a fixed budget. Empirically, SONATA is evaluated on several real-world and synthetic datasets and generally attains lower RMSE/MAE than static and streaming baselines; the paper also reports per-iteration/epoch runtime, kernel/length-scale sensitivity, and additional experiments."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Well-motivated architecture. The combination of continuous-time LDS factors with an online coreset mechanism is coherent and addresses a meaningful streaming setting. The design is carefully tied to spatiotemporal structure via Matérn priors and a principled scoring rule. \n\nConsistent accuracy gains. Experiments report SONATA achieving the best or second-best error across multiple datasets compared to strong static and streaming baselines. \n\nUseful diagnostics of the coreset. Visual comparisons of coreset vs. non-coreset factor trajectories help understand what the selector retains."}, "weaknesses": {"value": "Computational fairness. The paper reports per-iteration/epoch runtime for several methods (e.g., SONATA 0.338s, CT-CP 0.018s, CT-GP 0.105s, THIS-ODE 7.190s), but does not equalize wall-clock time across methods when comparing accuracy; faster methods could take many more iterations within the same time budget. \n\nCompute/memory analysis. The coreset budget directly affects memory footprint and update cost, yet the paper does not provide memory-usage vs. budget or throughput measurements to quantify the trade-off between retained samples and efficiency.\n\nAblations. The coreset analyses (full-data vs. coreset, random sampling) appear focused on a single dataset in the appendix; extending them to more datasets or reporting summary trends would better calibrate the benefits of the martingale-guided selector over simpler heuristics. \n\nHyperparameter. The method exposes several hyperparameters, with dataset-dependent choices. While the paper includes some sensitivity tables, systematic guidance for robust settings in realistic streaming scenarios is limited. \n\nReadability and consistency. The manuscript’s readability suffers in several places due to redundant wording and inconsistent cross-referencing. For example, equation mentions sometimes read like “Eq. equation” and there is mixing of styles (e.g., “Figure” vs. “Fig.”). Please standardize to a single reference style."}, "questions": {"value": "Time-normalized comparisons. Please provide convergence curves for all methods and report each baseline’s accuracy at the same total runtime as SONATA. This would directly address efficiency/accuracy trade-offs. \n\nMemory and budget trade-offs. Please report memory usage and update time as functions of the coreset budget and include accuracy vs. budget curves on multiple datasets. As of now, no budget-sweep experiments are included, which makes it difficult to assess how performance scales with budget.\n\nAblations vs. simple heuristics. The appendix contrasts coreset selection to random sampling on one dataset. Could you add the same comparison across other datasets and summarize whether martingale-guided selection consistently outperforms random sampling at matched budgets? \n\nRobust defaults. The current sensitivity tables are promising but seem dataset-specific. Can the authors propose and validate robust default settings?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fycyE7Q0yC", "forum": "P1PZBR6a4S", "replyto": "P1PZBR6a4S", "signatures": ["ICLR.cc/2026/Conference/Submission15675/Reviewer_QPPP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15675/Reviewer_QPPP"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15675/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761969301498, "cdate": 1761969301498, "tmdate": 1762925928039, "mdate": 1762925928039, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces SONATA, a framework for streaming temporal tensor factorization that integrates: (1) Matérn-kernel-based linear dynamical systems (LDS) for multi-scale temporal modeling, (2) a synergistic coreset selection mechanism combining four criteria (uncertainty, influence, novelty, information gain), (3) Bellman equation inspired long-term value optimization, and (4) expectation propagation (EP) for online Bayesian inference. The approach demonstrates strong empirical performance and computational efficiency compared to existing streaming tensor methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Well-Motivated Integration with Clear Value Proposition\n\nThe paper addresses a problem of balancing expressiveness and efficiency in high-velocity tensor streams.\nThe 4-criterion coreset selection is principled and goes beyond simple heuristics.\nEmpirical gains are substantial: 61.5% RMSE reduction vs. SFTL-CP on CA Traffic (Table 1).\n\n2. Strong Empirical Performance Across Multiple Dimensions\n\nThe authors reprorted statistically significant improvements (p<0.05) across 4 diverse datasets.\nThe proposed method is faster than processing all data, ~21× faster than THIS-ODE (Fig. 3c) while maintaining superior accuracy.\nBayesian uncertainty quantification (Fig. 2) and smooth factor trajectories provide domain-interpretable representations unavailable in deep learning alternatives.\n\n3. Solid Technical Execution\n\nThe Bellman-equation-based long-term coreset optimization (Eq. 17) is conceptually novel in streaming tensor factorization.\nDiscount factor analysis (Table 2) shows data-dependent optimal strategies, suggesting principled adaptability.\nCode availability enhances reproducibility."}, "weaknesses": {"value": "1. Possibliity of Insufficient Related Work and Missing Key Comparisons\nThe paper seems to omit important recent work that directly challenges its novelty claims.\n- OnlineGCP (SIGMOD'23): Generalizes streaming CP to exponential family distributions (Poisson, Bernoulli), directly addressing SONATA's Gaussian limitation. Authors should discuss why Gaussian assumptions are sufficient or provide non-Gaussian extensions\n\n- SOFIA (ICDE'21): Incorporates seasonality + outlier/missing data robustness\n- OR-MSTC (IJCAI'19): Multi-aspect streaming with outlier separation via ADMM\nSONATA's robustness claims are unsupported without comparison to these methods\n\n- SBDT (ICML'21): Streaming Bayesian deep tensor factorization with spike-and-slab priors\nThe \"without deep neural networks\" claim needs explicit comparison to justify EP over deep Bayesian approaches\n\n2. Insufficient Ablation Studies to Support Synergistic\nThe paper does not demonstrate that all components are essential.\nTo support their claims, authors should conduct these experiment:\n-  Individually remove each coreset criterion (uncertainty/influence/novelty/martingale)\n-  Bellman optimization vs. greedy myopic policy (γ=0)\n-  EP vs. simpler online filters \n-  Matérn vs. simpler kernels (RBF, linear)\n\n3. Minor Issues\n- Coreset budget selection: Mmax seems manually tuned per dataset (100-3000 in Appendix B.1). they provide no principled guidance.\n- How does runtime scale with coreset size Mmax?"}, "questions": {"value": "- Could you please clarify your contribution to non-Gaussian and robust streaming methods?\n- Is there a possibility of lacking ablation studies?\n- Can you explain your procedure for selecting hyperparameters?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ypJUIfzKQJ", "forum": "P1PZBR6a4S", "replyto": "P1PZBR6a4S", "signatures": ["ICLR.cc/2026/Conference/Submission15675/Reviewer_WfpD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15675/Reviewer_WfpD"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15675/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762055734242, "cdate": 1762055734242, "tmdate": 1762925927393, "mdate": 1762925927393, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}