{"id": "pKjk2iKZLT", "number": 16681, "cdate": 1758267579893, "mdate": 1763720345630, "content": {"title": "Scaling Higher-Order Graph Learning with Maximal Clique Complexes", "abstract": "Graph neural networks (GNNs) are widely used for learning on graphs but are fundamentally limited to modeling pairwise relationships.\nTopological models based on simplicial or cell complexes can capture higher-order structure and match or surpass the expressive power of the Weisfeiler–Leman (WL) test, but they are difficult to scale because they require constructing higher-order complexes.\nIn this paper, we ask how to retain the expressivity of cellular Weisfeiler networks (CWNs) while improving their scalability, and how to exploit cliques efficiently on large graphs. First, we introduce simplified and factored cellular Weisfeiler–Leman (sCWL and fCWL) tests, and show that they are as expressive as the original CWL test, while achieving better scalability properties. We then define the maximal clique complex, a cell complex whose higher-order cells are the maximal cliques of the graph, and apply the corresponding simplified and factored CWNs (sCWN and fCWN) on this structure, achieving improved time and memory complexity. To avoid explicit enumeration of all maximal cliques, we propose CliqueWalk, a biased random walk that samples (maximal) cliques and scales quasi-linearly with the number of nodes.\nCombining maximal clique complexes with CliqueWalk yields scalable clique-based architectures that preserve CWL-level expressivity.\nExperiments on node and graph classification benchmarks, including large-scale datasets, show that our models are competitive with or better than GNN and higher-order baselines, while substantially reducing computational and memory costs.", "tldr": "", "keywords": ["Graph Neural Networks", "Topological Neural Networks", "Random walks on cliques", "Scalability", "Cellular Neural Networks"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/68917753ba984f52d40f4906b1d447d863d910bf.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces simplified Cellular Weisfeiler Netowrks (sCWN), a novel architecture designed to overcome the limitation of Graph Nueral Networks (GNNs) in capturing relationships that go beyond pairwise interaction. In terms of message passing mechanism, sCWN follow the framework of CW Networks (from [Bodnar et al., NeurIPS 2021]) but operate on a \"maximal clique complex\" which the authors define as a simplified complex containing only the nodes (as the 0-cells) and the maximal cliques of the graph.\nAs exhaustively identifying the maximal cliques in a graph is too expensive computationally, the authors introduce a sampling algorithm based on random walks.\nThe experimental section tests sCWN on both node and graph classification tasks and compares against popular GNNs and higher-order architectures. Results show that most benefits appear in datasets with specific structures, while on many standard benchmarks results are on par with simple GNNs. An ablation study is provided to show the scalability of the proposed model."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The authors introduce a well motivated theoretical background for the method that highlight its theoretical expressivity\n- The method puts focus on practical scalability of the method, which is good for real world applications"}, "weaknesses": {"value": "- The chosen benchmarks are a bit outdated. State-of-the-art GNN papers have typically moved to Open Graph Benchmark (OGB).\n- Experimental results show that for many graphs the proposed model is actually less performant than simple baselines. It seems that the proposed method performs well only on specific datasets (seemingly the ones with the most cliques). A better analysis of the datasets (and their properties) in which the model really outperforms baselines would be useful.\n- Unclear novelty of the algorithm proposed for maximal clique enumeration."}, "questions": {"value": "- From the text it is not clear whether the authors used the standard splits for the benchmark datasets, could you please clarify if the splits were randomly sampled or if they followed the standard ones?\n- Oversmoothing is a well known problem in GNNs (e.g., see \"A Survey on Oversmoothing in Graph Neural Networks\", Rusch et al.). If a graph has large maximal cliques, would the proposed method encourage oversmoothing as it adds more message passing among already fully connected nodes? Could this be the reason why it underperforms on some of the benchmarks?\n- If a graph has very few maximal cliques, and maybe they are also far from each other, would the proposed method provide any benefit over a simple GNN? I think it could be useful to show some study of how maximal cliques are distributed in real world graphs\n- The authors report that they initialize clique features using clique length; it would be useful to provide some ablations to justify this choice\n- There are many algorithms for approximately enumerating cliques, like the ones cited at the beginning of page 6. Is there a specific reason why there is no comparison against them for the proposed method?\n- Related to the question above, could the authors expand on the novelty of CliqueWalk? In particular what are the difference to existing algorithms, like the ones cited at the beginning of page 6?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "E2ALi4j9lU", "forum": "pKjk2iKZLT", "replyto": "pKjk2iKZLT", "signatures": ["ICLR.cc/2026/Conference/Submission16681/Reviewer_ZDei"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16681/Reviewer_ZDei"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16681/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761592418254, "cdate": 1761592418254, "tmdate": 1762926738073, "mdate": 1762926738073, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper tackles the problem of scaling topological neural networks to larger complexes. The main idea is that of only considering maximal cliques as higher-order cells. The authors propose a specific, simplified architecture to work on the so-defined \"maximal clique complexes\", and advance some results in terms of expressive power and computational complexity. In addition to this, they propose a method to only sample a small number of maximal cliques and improve efficiency of the overall approach. Then, the authors turn to experimental analyses, run on node and graph-wise property prediction tasks. They additionally run some sensitivity analyses and ablations. The results are relatively mixed, especially in graph classification."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "[S1] The main motivation behind the approach is clear enough and relevant."}, "weaknesses": {"value": "[W1] There is quite a fundamental confusion between general cell complexes and complexes that can be obtained by considering maximal cliques only. Maximal cliques are constituted by *complete subgraphs*, thus do not include, e.g., induced cycles (rings). It does not seem to be the case from Figures 1 and 2, where the authors shade cells which clearly do not correspond to complete subgraphs. See, e.g., $\\sigma_1$ in Fig. 2.\n\n[W2] The relation between the original CWN network (Bodnar et al., 2021) and the CWN network discussed in the manuscript is not clear. Eq. 1 and 2 seem not to correspond to the original formulation, because, there, higher-order cells could also aggregate information from boundary, non-node cells. This seems not to be allowed in Eq. 1. Additionally, in the original formulation, higher-order cells can also aggregate from upper-adjacent ones, here in Eq. 2, it seems they can only aggregate from boundary cells. This is very confusing and puzzling. So they are supposed to be different models?\n\n[W3] If the model only uses maximal cliques, it seems very unlikely it can generally match the expressive power of CWL from the original paper (Bodnar et al., 2021), as it could use, for example, ring-based lifting and distinguish the cliqueless graphs in the right most pair of figure 8 here (https://arxiv.org/pdf/2106.12575). \n\n[W4] The original justification behind the factored CWN models is lacking. What is its advantage w.r.t., say simplified CWNs?\n\n[W5] Line 270 – the authors say their Clique Walk is inspired by existing clique sampling techniques, but what is exactly the relation? And what is its advantage over those? finding maximal cliques is a common well studied problem in computer science.\n\n[W6] Some experimental details are rather uncommon. What does it mean to carve out an additional 20% of data as internal test set on top of 20% of validation (line 323)? And why not treating Batch Normalisation as just another hyperparameter (line 347)?\n\n[W7] Results are not very conclusive.\n- In node classification, it appears as standard graph models are often better or on par with the proposed approaches. fCWN also seems significantly stronger than standard CWN in some datasets, how is this expected? In the -School datasets some methods obtain suspiciously low results (see e.g. SAGEConv).\n- In graph classification, results are generally low compared to baselines graph models. CWN with ring-based lifting is expected to work relatively better or on par there, especially in chemical tasks. What is the lifting procedure utilised in the CWN baseline?\n- Figure 4a seems to suggest there is no real use-case where it is not convenient to use CWN in terms of acc-complexity tradeoff, but also, what is SCCN exactly?"}, "questions": {"value": "Please see weaknesses and, in particular, W2, W4, W5, W7."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "6VDAWtkTMB", "forum": "pKjk2iKZLT", "replyto": "pKjk2iKZLT", "signatures": ["ICLR.cc/2026/Conference/Submission16681/Reviewer_LUtD"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16681/Reviewer_LUtD"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16681/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761652492025, "cdate": 1761652492025, "tmdate": 1762926737758, "mdate": 1762926737758, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Topological graph neural networks increase the expressivity of standard graph neural networks by considering cell complexes beyond edges and nodes. This paper suggests two improvements to existing topological networks: (a) It shows that certain aggregation operations can be removed without sacrificing expressive power, and as a result achieve a new mechanism with  reduced complexity (b) as finding maximal cliques in a graph is required for this method, and finding all such cliques is time consuming, they suggest a sampling method to replace the full enumeration. Empirical results seem mostly comparable to more expensive topological methods, which is encouraging."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* Overall, the paper is fun to read\n* The theoretical results seem correct (I didn't check them very carefully) and can be helpful in reducing the complexity of using topological gnns.\n*  Empirical results mostly support the conclusion that the reduction in complexity, obtained by both aggregation simplification and clique sampling, leads to comparable results"}, "weaknesses": {"value": "* I have some technical issues with the writing described in the questions section, but I believe they can be easily revised for the camera ready version"}, "questions": {"value": "* Practically, it seems that for standard node level tasks standard MPNN are comparable topological GNN, and the latter are more useful for datasets where the task clearly requires multi-agent interaction (the XXXschool tasks). Do you agree with this statement?\n\nSome comments and questions on writing:\n* I realize this may go back to the Bodnar paper, but in Section 3 you say a graph is a cell complex. This is strange to me, in your definitions, because a graph is a purely combinatorial object. What is the topology on the graph? When you say an edge {i,j} is a 1-cell, then by definition 1 this should mean it is isomorphic to [0,1]. How so? I would imagine describing a graph as an \"abstract (combinatorial) simplicial complex\"\n\n*In definition 3: you talk about cell complexes. How is this test used for checking isomorphisms of graphs?\n\n*In definition 7, in the words before the equatoin you say \"and a cell c\" but in the equations to my understanding you use sigma instead of c?\n\n* equations 2,4,6 confused me, because you used AGG for an operation which people would usually call COMBINE or UPDATE. AGG, for AGGREGATION, usually means some aggregation over a multiset (which you use a $\\oplus$ sign for) did I unserstand correctly? \n\n* In the first expression in equation 3, there is a some over $\\sigma \\ni i$ but inside the summation there is a $j$. What did you mean there?\n\n* I didn't understand the subsection on CliqueWalk very well. In particular, in Proposition 13 I don't recall you defined what $\\omega_{max}$ and $\\omega(G)$ are."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ZWa9GAkYNL", "forum": "pKjk2iKZLT", "replyto": "pKjk2iKZLT", "signatures": ["ICLR.cc/2026/Conference/Submission16681/Reviewer_TemZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16681/Reviewer_TemZ"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16681/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761813989789, "cdate": 1761813989789, "tmdate": 1762926737380, "mdate": 1762926737380, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses scalability challenges in higher-order graph learning by introducing maximal clique complexes and a sampling algorithm called CliqueWalk. The authors propose simplified cellular Weisfeiler networks (sCWN) that maintain CWL-level expressivity while reducing computational costs. The key innovation is using only maximal cliques rather than all cliques up to a fixed size, combined with efficient random walk sampling."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Strong theoretical contributions. \n2. The overall presentation is good and audiences can capture the key ideas of the work.\n3. The experiments are comprehensive and the results are convincing."}, "weaknesses": {"value": "1. Some format inconsistencies: \n    - Definitions does not share a same format, e.g., Definition 1 and Definition 2. \n    \n2. What would happened if the $\\omega_{max} < \\omega(G)$? The walks won't be truly maximal in this case.\n\n3. Can you provide examples where maximal clique CWL distinguishes graphs that WL cannot?"}, "questions": {"value": "See above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "47ng7bkkZ8", "forum": "pKjk2iKZLT", "replyto": "pKjk2iKZLT", "signatures": ["ICLR.cc/2026/Conference/Submission16681/Reviewer_AA9A"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16681/Reviewer_AA9A"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16681/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762027542047, "cdate": 1762027542047, "tmdate": 1762926736950, "mdate": 1762926736950, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}