{"id": "pRSRiXdpkm", "number": 10456, "cdate": 1758172230501, "mdate": 1759897649804, "content": {"title": "CORE: Concept-Oriented Reinforcement for Bridging the Definition–Application Gap in Mathematical Reasoning", "abstract": "Large language models (LLMs) often solve drill-style math exercises yet fail to apply the concept right when the problem requires genuine understanding. Popular outcome-based RL pipelines reinforce final answers but provide little fine-grained conceptual signal, so models improve at pattern reuse rather than concept selection and use. We introduce $\\textit{CORE}$ (Concept-Oriented REinforcement), an algorithm-agnostic training framework that turns explicit concepts into a controllable supervision signal. Starting from a high-quality, low-contamination textbook resource that links verifiable exercises to concise concept descriptions, we run a sanity probe showing LLMs can restate definitions while missing concept-linked quizzes, quantifying the conceptual reasoning gap. $\\textit{CORE}$ then (i) synthesizes additional concept-aligned quizzes, (ii) injects concept snippets into rollouts, and (iii) reinforces trajectories that correctly apply the injected concept while constraining drift with a lightweight divergence penalty; the procedure is compatible with standard policy-gradient methods (e.g., GRPO). On a 7B-class model, $\\textit{CORE}$ yields consistent gains over a vanilla baseline and reinforcement-only training across in-domain concept–exercise suites and diverse out-of-domain math benchmarks (GSM8K, SVAMP, MAWPS, SAT-Math, OlympiadBench, Gaokao, Minerva-Math, CounterMath, TheoremQA). Improvements are largest on concept-heavy categories while maintaining or modestly improving drill performance. $\\textit{CORE}$ demonstrates that concept-injected, outcome-regularized rollouts supply the missing fine-grained supervision needed to bridge drill competence and true conceptual reasoning—without committing to a particular RL algorithm or certain process-based verifiers.", "tldr": "", "keywords": ["large language models", "mathematical reasoning", "conceptual understanding", "fine-tuning", "knowledge distillation", "robustness"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c77ab7afab3d6e9e4956f189e99000c9d2d3b49e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposed the make a new math dataset that, in addition to question and answer pairs, augments related concepts by extracting and translating content from a Chinese math book. The authors then compared 3 GRPO based methods to show the effectiveness of their proposal.\n\nAlthough the paper claims in the abstract that CORE is \"an algorithm-agnostic training framework that turns explicit concepts ...\", the fact that its algorithm relies on the $N$ generation failures suggests it is a derivation of GRPO, which invalidates the claim. In addition, I have 2 major concerns."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* The paper is tackling an important problem: \n* While some details are hard to get (e.g., Sec 3.4), the paper is generally well-written."}, "weaknesses": {"value": "* Unclear technical novelty of the RL method vs. the training data. While the paper emphasizes the goal of bridging the 'definition-application gap', its primary technical contribution (core-cr and core-kl) appears to be an application of existing RL strategies rather than a novel method. The core mechanism involves dynamically intervening with expert guidance when the policy fails. This is methodologically similar to prior work on \"teacher\" or \"expert-anchored\" RL. The paper's novelty therefore seems to be rest on the content of the intervention rather than the mechanism. But are the performance gains attributable to the unique properties of using a declarative concept, or would any high-quality reasoning trace produce the same benefit when used within this dynamic-intervention framework? The paper lacks an ablation study to disentangle the value of the content from the value of the method.\n* Generalizability and conflation of methodological contribution with data curation. The method section describes a non-trivial, multi-stage curation pipeline to create the data, involving generations by Qwen2.5-72B-Instruct, vadilation and filtering by GPT4o, cross-model validation strategy, etc. This rigorous process suggests that the effectiveness of the proposed framework is linked to the quality fo the dataset. Actually, the core-base model, trained on this data, already shows significant improvement over the baselines. When comparing the performance boost after applying core-cr and core-kl, only TB and CM showed meaningful improvements. This thus questions if a large portion of the gains come from the data itself rather than the specific CORE-CR or CORE-KL intervention recipes."}, "questions": {"value": "See details in the weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "fPBwmRf3Wc", "forum": "pRSRiXdpkm", "replyto": "pRSRiXdpkm", "signatures": ["ICLR.cc/2026/Conference/Submission10456/Reviewer_b4Hh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10456/Reviewer_b4Hh"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10456/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761008608630, "cdate": 1761008608630, "tmdate": 1762921754078, "mdate": 1762921754078, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces CORE, an RL training framework that turns explicit math concepts into a controllable supervision signal. The proposed approach comprises three key components: dataset curation, gap diagnostics, and a concept reinforcement recipe. The framework is evaluated on two 7B models across multiple mathematical reasoning benchmarks, demonstrating clear effectiveness under the given experimental setup."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper targets an important research problem: LLMs often solve math problems by pattern matching rather than genuine conceptual understanding\n\n2. The proposed approach, including the curated dataset and the CORE-KL framework, demonstrates clear value and effectiveness."}, "weaknesses": {"value": "1. My main concern lies in the experimental setup. Although the proposed method shows effectiveness under the reported setting, the evaluations are primarily conducted on relatively simple or medium-difficulty math benchmarks. Moreover, the baseline results (Table 2) are inconsistent with those reported in the corresponding technical reports. For example, the performance of Qwen2-Math-7B on GSM8K and MATH does not match, and it is unclear why the model performs significantly worse on the simpler GSM8K compared to the more challenging MATH.\n\n2. The RL training set is synthesized and evaluated by LLMs, raising concerns about data quality and reliability. It remains unclear how the authors ensure the correctness of the training data and mitigate potential issues such as reward hacking when using LLMs as judges."}, "questions": {"value": "See the weaknesses section"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "747I4zawId", "forum": "pRSRiXdpkm", "replyto": "pRSRiXdpkm", "signatures": ["ICLR.cc/2026/Conference/Submission10456/Reviewer_6tm1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10456/Reviewer_6tm1"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10456/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761535085290, "cdate": 1761535085290, "tmdate": 1762921753701, "mdate": 1762921753701, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents concept-oriented approach to create synthetic data based on math concepts. The initial diagnostic evaluation results show that base models, while perform well in standard evaluation, they are prone to error when tested with variation inputs (that permutes parameters). The paper then presents an RL based approach to train models based on guidance from concepts in events of reasoning divergence. The results show that Core RL approaches can generalize beyond the synthetic puzzles."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- puzzle dataset construction based on math text book\n- diagnostic analysis about issues of why current models could fail in truly understand math concepts.\n- RL frameworks to train models to be coherent with concepts with different reward models\n- evaluation shows out of domain generalization"}, "weaknesses": {"value": "- difference in RL methods CR / KL have some improvement over the baseline RL-base, it is not clear how these methods truly improve on top of baseline RL approach.\n- (neutral comment) another simple baseline of enhancing models with variation data (e.g., with permuted params) could also be used to understand the wether concept reasoning is important, or it is just a matter of data augmentation is needed."}, "questions": {"value": "Please elaborate comparison of three RL approaches, and how they differs in contribution to performance gains. It's good to understand importance of augmented data vs new RL methods."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rXXLKd0x3x", "forum": "pRSRiXdpkm", "replyto": "pRSRiXdpkm", "signatures": ["ICLR.cc/2026/Conference/Submission10456/Reviewer_vWn1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10456/Reviewer_vWn1"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10456/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761959351724, "cdate": 1761959351724, "tmdate": 1762921753349, "mdate": 1762921753349, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper focuses on the definition–application gap in large language models (LLMs) for mathematical reasoning, ie, models can accurately recite formal definitions but often fail to select and apply the correct concepts when solving problems.\n\nTo address this issue, the authors curate a structured concept–exercise corpus from a linear algebra textbook, containing 236 concept definitions, 703 examples, and 140 exercises. They further construct a Concept Probes dataset of 1,110 multiple-choice quizzes by generating items with Qwen2.5-72B and filtering them through GPT-4o for quality assurance. This dataset serves both diagnostic and training purposes.\n\nBuilding on GRPO reinforcement learning, the authors propose CORE (Concept-Oriented REinforcement) through three variants:\n\n1. CORE-Base: standard RL training directly on the concept-probe dataset.\n\n2. CORE-CR: when all sampled trajectories fail, failed ones are partially replaced with concept-guided rollouts and assigned a reward bonus.\n\n3. CORE-KL: upon failure, the model minimizes the forward KL divergence between the concept-guided and unguided policies, effectively distilling the reasoning distribution that emerges when a concept is provided.\n\nExperiments on Qwen2-Math-7B and Llama-3-8B-Instruct show that all CORE variants consistently improve both in-domain textbook exercises and multiple out-of-domain mathematical reasoning benchmarks, demonstrating enhanced concept selection and application."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper introduces concept texts as a controllable and fine-grained supervision signal in reinforcement learning, offering richer and more directed feedback compared to traditional scalar rewards based solely on final answer correctness.\n\n\nExperiments are conducted on both base and instruction-tuned models across multiple, stylistically diverse mathematical benchmarks, demonstrating the generality and robustness of the proposed approach.\n\n\nThrough small-scale manual case analysis and perturbation tests with irrelevant concepts, the authors provide preliminary evidence that the performance gains stem from improved concept selection and application rather than superficial heuristic matching."}, "weaknesses": {"value": "The comparison with relevant baselines is insufficient: the paper does not include fair experimental comparisons with conceptually similar methods such as BREAD (which also employs failure-branch replacement), nor with other related process-supervision or verifier-guided RL approaches. As a result, the marginal contribution and uniqueness of CORE remain unclear.\n\nMost reported performance improvements are relatively small and lack statistical significance."}, "questions": {"value": "See Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Ex5TGoyPSL", "forum": "pRSRiXdpkm", "replyto": "pRSRiXdpkm", "signatures": ["ICLR.cc/2026/Conference/Submission10456/Reviewer_kr6a"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10456/Reviewer_kr6a"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10456/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761988756232, "cdate": 1761988756232, "tmdate": 1762921753006, "mdate": 1762921753006, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}