{"id": "q05hC1Pzkr", "number": 25450, "cdate": 1758368192641, "mdate": 1759896720715, "content": {"title": "Characterizing and Optimizing the Spatial Kernel of Multi Resolution Hash Encodings", "abstract": "Multi Resolution Hash Encoding (MHE), the foundational technique behind Instant Neural Graphics Primitives, provides a powerful parameterization for neural fields. However, its spatial behavior lacks rigorous understanding from a physical systems perspective, leading to reliance on heuristics for hyperparameter selection. This work introduces a novel analytical approach that characterizes MHE by examining its Point Spread Function (PSF), which is analogous to the Green's function of the system. This methodology enables a quantification of the encoding's spatial resolution and fidelity. We derive a closed form approximation for the collision free PSF, uncovering inherent grid induced anisotropy and a logarithmic spatial profile. We establish that the idealized spatial bandwidth, specifically the Full Width at Half Maximum (FWHM), is determined by the average resolution, $N_{\\text{avg}}$. This leads to a crucial, counterintuitive finding: the effective resolution of the model is governed by the broadened empirical FWHM (and therefore $N_{\\text{avg}}$), rather than the finest resolution $N_{\\max}$. Furthermore, we analyze the impact of finite hash capacity, demonstrating how collisions introduce speckle noise and degrade the Signal to Noise Ratio (SNR). Leveraging these theoretical insights, we propose two main advancements. First, we establish and validate a principled methodology for hyperparameter selection guided by our PSF analysis, which demonstrably outperforms standard heuristics by accounting for the analytically derived effective resolution and optimization induced broadening. Second, we introduce Rotated MHE (R-MHE), an architecture that employs rotated and independently hashed grids to mitigate anisotropy and average collision noise. This study establishes a methodology based on physical principles that moves beyond heuristics to characterize and optimize MHE.", "tldr": "We analyze Multi-Resolution Hash Encoding (MHE) using its Point Spread Function (PSF) to reveal that effective resolution is governed by average, not finest, resolution, and introduce Rotated MHE to mitigate inherent anisotropy and collision noise.", "keywords": ["multi-resolution hash encoding", "implicit neural representations", "neural fields", "point spread function", "spatial kernel analysis", "anisotropy", "resolution limit", "FWHM", "hash collisions", "signal-to-noise ratio", "NeRF"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/11f4413fe01f01addafd76cd01dfd0c3346c148e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces a method to analyze multi-resolution hash encoding used in implicit neural representations. The authors observe that while MHE is widely adopted, its hyperparameters have been tuned empirically with little mathematical analysis of its behavior. Thus, this paper introduce a point spread function based theoreritcal framework to analyze how MHE operates. Under multi-resolution, they prove that the influence region of each point feature scales with 𝑁min; they also study differences that arise during optimization and propose a model to explain them. They further propose a speckle/noise approximation to model hash collisions, and introduce R-MHE to mitigate these issues. On high-resolution image regression and 3D NeRF training, they show that the analysis is consistent with practice and yields useful hyperparameter guidance."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "Motivation: While practitioners recognize certain behaviors of hash encodings, providing a mathematical model and using it to select hyperparameters is a meaningful contribution.\n\nClarity of modeling: The paper steps through the math cleanly, organizing the required formulas at each stage."}, "weaknesses": {"value": "**3D experiment observations**\n- Even when values are similar, the baseline consistently outperforming the theory in 3D suggests some assumptions may not hold in 3D. Could this stem from the alignment assumption in the theory? A toy misalignment study (small perturbations) could demonstrate how trends evolve and help validate the proposed modeling more precisely.\n\n**Theoretical growth factor experiments.**\n- Results are shown by varying b with ±0.1 steps, but: NeRF training is stochastic; single runs are not sufficient—use N repeated trials to report robustness. Use wider resolution than 0.1 steps to confirm the monotonic/expected trend across denser b values.\n\n**Practical calibration of the broadening factor.**\n- Does the broadening factor depend on training iterations or optimizer choice? If training dynamics materially affect it—even if grids don’t—then practical calibration may be bottleneck for real applying this analysis on real hyperparameter tuning."}, "questions": {"value": "- The anisotropic behavior seems applicable to other encodings (e.g., multi-plane or multi-resolution plane encodings). Do the authors have a unified formulation or insights that transfer to those settings?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "aEtyEfP0sT", "forum": "q05hC1Pzkr", "replyto": "q05hC1Pzkr", "signatures": ["ICLR.cc/2026/Conference/Submission25450/Reviewer_QjpZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25450/Reviewer_QjpZ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission25450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761821408736, "cdate": 1761821408736, "tmdate": 1762943438500, "mdate": 1762943438500, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "## Summary\n* This paper study the Multi Resolution Hash Encodings (MHE) proposed by instant-ngp, which is used to accelerate representation of 3D scene.\n* This paper characterize the PFS of MHE in collision free assumption, concluding both theoretically and empirically that the effective resolution of MHE is not controled by max resolution $N_{MAX}$ as described by instant-ngp, but by average resolution $N_{AVG}$.\n* Besides, this paper makes two practical contribution to HME when considering collision: a scheme for parameter selection and an improvement named R-MHE."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "## Strength\n* The characterization of MHE using PFS is novel and interesting. The conclusion that FWHM is direction dependent and its width is determined by $N_{max}$ is a very useful insight that might inspire later works.\n* The empirical on 2D Image Regression is limited but convincing."}, "weaknesses": {"value": "## Weakness\n* The proposed approach is said to have two advantages, avoiding anisotropy and avoiding hashing collision. Both of the two advantages improve the empirical result. However, either because it is not possible to study the two factors independently, or the authors have not done it, I find it hard to evaluate the contribution of avoiding anisotropy to practical results. In fact, the majority of this paper is about how MHE introduces anisotropy. And I am definitely more interested in how the anisotropy property harms the performance of MHE beyond toy examples. While the current empirical result is not strong enough to show it.\n* The MHE in its original paper (instant-ngp) is well evaluated with different tasks and contains a lot more formal comparsion with other methods. I do agree that this paper has its unique theoretical insights. However, implemented their proposed approach for other tasks and include more comparsion strengthen this paper a lot."}, "questions": {"value": "* Is it possible to study the effect of anisotropy reduction and collision avoidance? Which one contributes mainly to the gain in PSNR?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "bYaNtpNOxR", "forum": "q05hC1Pzkr", "replyto": "q05hC1Pzkr", "signatures": ["ICLR.cc/2026/Conference/Submission25450/Reviewer_6KVQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25450/Reviewer_6KVQ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission25450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761894590168, "cdate": 1761894590168, "tmdate": 1762943438150, "mdate": 1762943438150, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents to provide understandings on multi-resolution hash encoding (MHE) originally presented from Instant-NGP.\n\nIn summary, the paper:\n- Frames MHE as a physical system via its point spread function (PSF); derives a closed-form showing logarithmic decay and grid-induced anisotropy. \n- Shows effective resolution follows the broadened empirical Full-width half-maximum (FWHM) = 1/N_avg (instead of N_max) due to optimization-induced broadening (beta=3). \n- Analyzes finite-capacity collisions causing speckle noise and SNR loss; proposes Rotated MHE (R-MHE) with independently hashed, rotated grids to improve isotropy and SNR.\nThe paper backs its claims with experimental results, through 2D and 3D evaluations."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The paper provides interesting extension of multi-resolution hash encoding. It provides:\n- Clear theory–practice link: closed-form PSF, anisotropy factor, and FWHM = 1/N_avg give actionable design rules.\n- Comprehensive empirical validation: broadened PSF (beta=3) consistently matches measurements; two-point resolution aligns with FWHM, not N_max. \n- Practical payoff with fixed memory: R-MHE markedly improves isotropy and PSNR in 2D (+8.06 dB to 31.30 dB at M=8) and yields steady 3D gains up to +0.65 dB."}, "weaknesses": {"value": "Despite its strong theoretical foundations, the paper contains following potential shortcomings.\n- Broadening factor of beta = 3 is largely empirical; sensitivity to optimizer/architecture/data is not exhaustively characterized in additional experiments.\n- PSF-guided hyperparameter (b) underperforms a tuned baseline in 3D, and R-MHE’s 3D gains are modest (+0.65 dB).\n- The paper fundamentally relies on MHE, of which multiple extensions such as dictionary fields has been proposed already. However, the paper does not compare with these extensions which limits its interpretability."}, "questions": {"value": "1. How are the hyperparameters calculated? Where does beta value come from?\n2. Why does performance gap between 2D and 3D MHE exist?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "wfYfPXjzE1", "forum": "q05hC1Pzkr", "replyto": "q05hC1Pzkr", "signatures": ["ICLR.cc/2026/Conference/Submission25450/Reviewer_Rkrg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25450/Reviewer_Rkrg"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission25450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761986144853, "cdate": 1761986144853, "tmdate": 1762943437782, "mdate": 1762943437782, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes rotated multi-resolution hash encodings, widely used for implicit neural representations in image regression and neural radiance fields. Previous hash encodings are dependent on axes, leading to anisotropy and hindering empirical performance. They fail to capture well frequency patterns like sinusoidal functions because hash encodings are implicitly aligned with the axes of Cartesian coordinates. In contrast, this paper proposes rotated multi-resolution hash encodings that allow us to be independent of Cartesian coordinates. It achieves this by using multiple rotation functions for input position $x$, resulting in an average of randomly sampled rotation functions. This approach mitigates the reliance on representation aligned with Cartesian coordinates and improves prediction performance without degradation in frequency-based patterns. One of the randomly sampled rotation functions may potentially match the directions of the frequency patterns. This paper demonstrates its effectiveness in theoretical and practical cases."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "- This paper introduces a novel approach that explicitly uses multiple random rotation transforms. To maintain the total number of parameters, the paper splits the original feature dimensions into the number of rotation and new feature dimensions. Although it employs a smaller number of feature dimensions, the random rotation function for input $x$ enables it to effectively capture signals that do not align with Cartesian coordinates.\n\n- The paper demonstrates its effectiveness through both mathematical and practical cases. Specifically, it shows that the proposed approach consistently improves prediction performance in image regression and neural radiance fields, while maintaining the same total number of parameters across each case."}, "weaknesses": {"value": "- I believe this paper falls short of meeting the standards of top-tier AI conferences like ICLR. The presentation lacks an effective and efficient way for readers to grasp the main contribution of the paper. While the mathematical contributions are included in the Appendix, and very abstracted equations are elaborated in the manuscript, I disagree that all the content in the manuscript must be abstracted. The Appendix is necessary to fully digest the mathematical details, but it doesn’t justify the need for the entire manuscript to be abstracted. I believe important equations (Eq 2 and 3) and their impact (e.g., FWMH) should be provided in the manuscript, but they aren’t. \n\n- Empirically, maintaining the total number of parameters is crucial for improving prediction performance. However, this paper artificially designs baselines and their parameterization. For instance, its baselines started with a feature dimension of 8, which is not the official parameterization of feature dimensions in NeRFs, which sets it to 2 (To my best knowledge). Therefore, it lacks the space to adjust and accommodate random rotation functions. In this case, the proposed approach naturally faces challenges in its practical implementation. \n\n- Following the second concern in Weakness, they should identify new cases where high-dimensional encodings are required to achieve accurate prediction performance. In that sense, they must demonstrate that rotated MHE not only maintains performance but also reduces the total number of parameters."}, "questions": {"value": "- I’m curious about Figures 1, 2, and 3. The colors in these figures indicate different parameterizations and the value seems to be continuous in all of them. However, the color information is actually discrete because of the parameterization used in this experiment. Adopting a legend for continuous values makes it challenging to understand graphical explanations easily. \n\n- Figure 1 and 2 are particularly difficult to grasp the main messages from. They require more detailed explanations and concepts to understand."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "NQ5gSG6HdQ", "forum": "q05hC1Pzkr", "replyto": "q05hC1Pzkr", "signatures": ["ICLR.cc/2026/Conference/Submission25450/Reviewer_4sPL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25450/Reviewer_4sPL"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission25450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762338624102, "cdate": 1762338624102, "tmdate": 1762943436003, "mdate": 1762943436003, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}