{"id": "q6fnadebht", "number": 12101, "cdate": 1758205690147, "mdate": 1763565204104, "content": {"title": "Hierarchical Quantized Diffusion Based Tree Generation Method for Hierarchical Representation and Lineage Analysis", "abstract": "In single-cell research, tracing and analyzing high-throughput single-cell differentiation trajectories is crucial for understanding complex biological processes. Key to this is the modeling and generation of hierarchical data that represents the intrinsic structure within datasets. Traditional methods face limitations in terms of computational cost, performance, generative capacity, and stability. Recent VAEs based approaches have made strides in addressing these challenges but still require specialized network modules for each tree branch, limiting their stability and ability to capture deep hierarchical relationships. To overcome these challenges, we introduce diffusion-based approach called HDTree. HDTree captures tree relationships within a hierarchical latent space using a unified hierarchical codebook and quantized diffusion processes to model tree node transitions. This method improves stability by eliminating branch-specific modules and enhancing generative capacity through gradual hierarchical changes simulated by the diffusion process. HDTree's effectiveness is demonstrated through comparisons on both general-purpose and single-cell datasets, where it outperforms existing methods in terms of accuracy and performance. These contributions provide a new tool for hierarchical lineage analysis, enabling more accurate and efficient modeling of cellular differentiation paths and offering insights for downstream biological tasks.The code of HDTree is available at anonymous link https://anonymous.4open.science/r/code_HDTree_review-A8DB.", "tldr": "", "keywords": ["Cell", "AI4S", "Hierarchical Representation", "AI for science", "AI4S"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/560c35dacb6e12e218157d6c5d69eb3945e5f308.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes HDTree, a new generative model for hierarchical data, specifically aimed at single-cell lineage analysis. The core problem is that existing methods are unstable as they require branch-specific network modules. HDTree addresses this by combining three components: (1) a standard encoder, (2) a unified Hierarchical Tree Codebook that quantizes latent representations into discrete paths, and (3) a quantized diffusion decoder  that generates data conditioned on these paths. The model is optimized with a composite loss including soft contrastive learning a hierarchical quantization loss , and the diffusion loss. The authors demonstrate that this approach can be used for both lineage trajectory analysis (by finding shortest paths in the codebook graph) and conditional data generation. Experiments on general and single-cell datasets show it outperforms SOTA methods in clustering, tree structure fidelity, and lineage alignment."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "The core architectural idea of using a unified hierarchical codebook to condition a diffusion model is a strong and stable alternative to prior VAE-based methods that required branch-specific modules.\n\nThe model demonstrates consistently strong performance across a wide range of tasks and datasets, outperforming SOTA methods like TreeVAE in clustering (Table 1, Table 2) and, impressively, even beating a semi-supervised method on lineage ground truth alignment (Table 3).\n\nThe ablation study (Table 4) is effective, clearly demonstrating that the novel components (HTC, SCL, HQL) are all critical to the model's success. The large performance drop without the HTC (A2) is particularly convincing.\n\nThe method is computationally efficient in training time compared to competitors, especially TreeVAE and methods requiring expensive offline clustering (tSNE/UMAP+Agg) on large data (Table 5)"}, "weaknesses": {"value": "The evaluation is performed on a downsampled test set of 10,000 points for any dataset larger than this. This is a major weakness. The paper claims performance on large datasets (e.g., Weinreb, 130k cells; ECL, 838k cells) but never evaluates on them (at full scale). The justification (clustering metrics are slow) is an evaluation choice, not a model limitation, and it undermines the claims of scalability.\n\nThe trajectory inference method (Sec 3.4) is not a pure application of the learned tree It requires constructing a new graph by adding k-nearest neighbors edges withineach level of the tree. This introduces a new hyperparameter k (which was tested in Appendix C) and makes the lineage analysis less interpretable, as it's not solely dependent on the learned hierarchy.\n\nThe model's complexity seems high. It requires three separate loss functions , each with its own hyperparameters. This may make the model difficult to tune and reproduce.\n\nThe paper admits that the diffusion decoder is \"computationally expensive during sampling\", which is a well-known diffusion model issue but still a practical limitation for the data generation task."}, "questions": {"value": "1. Regarding the test set downsampling: Since the model is trained on up to 100k-300k points (Table L.5), why not report evaluation metrics (like reconstruction loss, -RL) that don'trequire expensive clustering, but do run on the full, large test sets? This would provide a true measure of scalability.\n\n2. In the trajectory analysis (Sec 3.4), what is the justification for the penalty term P^(L-1) in Eq. 8? This seems to manually enforce hierarchical preference, which one might expect the learned tree structure to handle on its own. How sensitive is the lineage analysis (Table 3) to this value P?\n\n3. The Hierarchical Quantization Loss (Eq. 5) is confusing. What is the set z in the definition ? Is this the set of all zi in the batch? Please clarify the \"consistency term\" in plain.\n\n4. How was the number of hierarchy levels L=10 chosen? This seems like a critical parameter, but there is no sensitivity analysis provided for it. How does performance vary with a shallower or deeper tree?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "76nGZVwuCn", "forum": "q6fnadebht", "replyto": "q6fnadebht", "signatures": ["ICLR.cc/2026/Conference/Submission12101/Reviewer_pDT7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12101/Reviewer_pDT7"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12101/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761622083539, "cdate": 1761622083539, "tmdate": 1762923068414, "mdate": 1762923068414, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Single-cell analysis represents one of the major breakthroughs in recent bioinformatics, generating enthusiastic expectations for elucidating cellular differentiation mechanisms and their applications in regenerative medicine and artificial organs. This paper proposes a novel deep learning-based approach for the data-driven differentiation structure (i.e., hierarchical structure) inference task for such single-cell analysis data, as well as for more general hierarchical structure inference tasks. Traditionally, analytical methods such as visualization techniques, clustering, and factor models have been the standard for differentiation structure tasks. However, deep learning-based methods, particularly those based on Variational Autoencoders (VAEs), have recently gained prominence due to their effectiveness. Even the most advanced methods face limitations, and this paper makes significant progress, especially regarding the module dependency of branching structures inherent in existing approaches. The authors quantitatively demonstrate that their proposed method delivers substantial practical progress by conducting a large-scale, comprehensive investigation on both the subject single-cell data and widely used benchmark datasets in machine learning."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- This paper achieves very solid progress in line with the latest trends in the structural inference task. Specifically, it presents a novel solution using hierarchical codebooks and a stochastic diffusion model to address the issue of unstable learning caused by module dependencies in the branching structure of hierarchical architectures—a problem encountered in recent state-of-the-art VAE-based methods.\n\n- The experiments in this paper are exceptionally robust and comprehensive, providing extremely strong evidence for practical effectiveness. Particularly for single-cell analysis data, the supplementary materials detail the preprocessing procedures, successfully appealing to a broader audience beyond bioinformatics specialists. Furthermore, for readers more interested in standard machine learning tasks, the paper also provides baselines on popular datasets."}, "weaknesses": {"value": "- I have some concerns regarding the novelty or effectiveness of the hierarchical codebook (HCB), one of the key components of the proposed methodology. Specifically, I find it difficult to follow at a concrete level how the HCB effectively resolves the issue of module dependency on branching in hierarchical structures, which the authors highlight as a focus in prior research. I will elaborate further in the questions section."}, "questions": {"value": "**Effectiveness of Hierarchical Codebook**\n\nI understand the weakness of existing VAE research requiring separate configurations for the representation of each branch in the hierarchical structure (binary tree). Intuitively, as one goes deeper into the hierarchy, observational data clues become sparse, making learning extremely difficult. The authors' Hierarchical Codebook (HCB) appears to be a new approach that addresses this weakness in existing research. I understand this overall framework is very promising, but I couldn't clearly discern from the text how HCB specifically overcomes the weaknesses of existing research. Section 3.2 appears to model parent-child relationships in a conventional manner (where the code vector of a child node approaches that of its parent node). For example, this is commonly used in Section 3 of [Adams+, NeurIPS2010] and Section 3 of [Lakshminarayanan+, AISTATS2016] (apologies, my field may bias my specific references towards statistical modeling sense, but this seems like a frequent policy even in optimization contexts). I have reread Section 1's introduction and Section 3's specific model design multiple times. While I broadly agree with the authors' motivation for introducing HCB (overcoming the weaknesses of VAE-type models), I actually cannot accurately discern why HCB is such a brilliant idea for achieving that goal. Based on these considerations, my questions are as follows:\n\n- Is it possible to provide a qualitative explanation that the authors' HCB offers a method with “unique, standout advantages” over other hierarchical modeling approaches for addressing the problem of data sparsity as one moves to the end of the hierarchical structure?\n\nOr is it that while the HCB idea itself is one of the standard approaches in hierarchical representation, it has been experimentally confirmed (I commend the authors' extremely large-scale and comprehensive experiments across diverse data) to demonstrate outstanding performance?\n\n[Adams+, NeurIPS2010]  Adams, R. P. , Jordan, M., Ghahramani, Z. & (2010). Tree-structured stick breaking for hierarchical data. Advances in neural information processing systems, 23.\n\n[Lakshminarayanan+, AISTATS2016]  Lakshminarayanan, B., Roy, D. M., & Teh, Y. W. (2016). Mondrian forests for large-scale regression when uncertainty matters. In Artificial Intelligence and Statistics, pp. 1478-1487.\n\n\n**Relevance to the supertree construction problem**\n\nTo the best of my knowledge, problems explicitly addressing the sparsity inherent in hierarchical structures—namely, the requirement for existing VAE-based approaches to have separate modules for each branch—appear to have long been discussed as a significant research topic in the field of bioinformatics, specifically as the supertree construction problem. The authors do not appear to discuss this topic either in the main text or supplementary materials (apologies if I missed it), but isn't this a relevant issue? In the context of single-cell analysis, data scarcity is a fundamental challenge, not just at the terminal nodes of hierarchical structures. For instance, acquiring single-cell analysis data for specific human organs is costly, limiting available datasets. This motivates the use of single-cell analysis data from other organisms (such as mice, chosen for similar biological characteristics). However, naturally, the surface-level observations (broad trends in gene expression levels) of these datasets differ significantly. Consequently, the approach of attempting to capture a consensus tree (supertree) between the hierarchical structure of humans and that of another organism emerges. My impression is that the unified code book the authors aim to capture with HCB shares a fundamental similarity in motivation and core principles with this supertree construction problem. Perhaps if the authors were to discuss this point, the paper might gain greater persuasive power for readers in the traditional bioinformatics field. (This point does not directly affect my impression or evaluation of the paper, so the authors are free to consider it without concern. If it seems unrelated, feel free to disregard it.)"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "yU3k8a2hrY", "forum": "q6fnadebht", "replyto": "q6fnadebht", "signatures": ["ICLR.cc/2026/Conference/Submission12101/Reviewer_m6bZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12101/Reviewer_m6bZ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12101/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761977842122, "cdate": 1761977842122, "tmdate": 1762923067457, "mdate": 1762923067457, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes HDTree, a hierarchical diffusion-based framework designed for hierarchical representation learning and lineage analysis. The method integrates a hierarchical vector-quantized codebook with a quantized diffusion process, enabling the model to capture multi-level dependencies among data points and generate biologically meaningful hierarchies. Unlike previous VAE-based models (e.g., TreeVAE), which require branch-specific modules, HDTree employs a unified hierarchical latent space that enhances both stability and generative capacity. Comprehensive experiments on general-purpose datasets and single-cell datasets demonstrate the superiority of HDTree in clustering accuracy, tree purity, and lineage reconstruction. The results show consistent improvements in both representation quality and biological interpretability, highlighting the model’s potential as a powerful tool for hierarchical modeling and generative analysis in biological data. Overall, the work is conceptually solid, well-motivated, and empirically convincing."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "S1. The paper addresses a meaningful and increasingly important topic. It is particularly relevant to single-cell data modeling, which remains a major challenge in computational biology and generative modeling.\n\nS2. Extensive experiments across both general and domain-specific datasets show clear performance gains over existing baselines, validating both the stability and scalability of the approach.\n\nS3. The paper evaluates multiple aspects—tree structure purity, clustering accuracy, reconstruction loss, lineage consistency, and computational efficiency. This provides a convincing and multidimensional assessment of HDTree’s strengths.\n\nS4. The proposed combination of hierarchical vector quantization with diffusion processes may eliminate the need for branch-specific networks while maintaining high flexibility and generative accuracy."}, "weaknesses": {"value": "**Concerns**\n\nC1. The Method section is written in a very direct “component-by-component” manner, explaining what each module does but not why each design choice is necessary or how it contributes to solving the stated problems. For instance, when the authors argue that previous methods “require specialized network modules for each tree branch,” it would strengthen the explanation if they discussed alternative perspectives (e.g., whether a shared backbone with dynamically extended subnetworks, similar to continual learning, could achieve similar adaptability). Adding this type of reasoning would help readers understand the technical logic and design motivation more deeply.\n\nC2. The manuscript would benefit from polishing to improve readability and layout. In several places, multiple bolded labels \\textbf{XXX.} appear within a single paragraph, which disrupts the flow. These should ideally start as separate paragraphs or be converted into sub-headings. Moreover, some overly technical derivations or implementation details could be moved to the Appendix to enhance readability in the main text.\n\nC3. Figure 1 currently does not clearly differentiate the three comparative frameworks or visually convey why the proposed HDTree offers a tangible improvement. The figure could better highlight the distinctions and illustrate the hierarchical structure more intuitively."}, "questions": {"value": "Please mainly respond to C1."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "D7qURYMcD4", "forum": "q6fnadebht", "replyto": "q6fnadebht", "signatures": ["ICLR.cc/2026/Conference/Submission12101/Reviewer_tW7p"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12101/Reviewer_tW7p"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12101/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761992716375, "cdate": 1761992716375, "tmdate": 1762923066996, "mdate": 1762923066996, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}