{"id": "qD4N15aL2W", "number": 24689, "cdate": 1758359364565, "mdate": 1759896754561, "content": {"title": "MTSSRL-MD: Multi-Task Self-Supervised Representation Learning for EEG Signals across Multiple Datasets", "abstract": "Electroencephalography (EEG) supports diverse clinical applications. However, effective EEG representation learning remains difficult because scarce label annotations and heterogeneous EEG montages limit the scale of available datasets. In practice, single and small-scale datasets often result in models with poor generalization, particularly for underrepresented classes with limited samples, which are harder to learn reliably. These challenges become even more critical in the EEG-based sleep stage classification task, especially for minority stages that are not only scarce but also transitional with overlapping characteristics, which makes them prone to misclassification. In this work, we propose MTSSRL-MD (Multi-Task Self-Supervised Representation Learning for EEG Signals across Multiple Datasets), a unified framework that combines multi-dataset and multi-task self-supervised pretraining with a channel alignment module to alleviate the impact of scarce labels, heterogeneous EEG montages, and small-scale datasets that often cause poor generalization. This design enables the learning of EEG representations that are generalizable. Multi-dataset learning provides broader feature diversity that facilitates more robust cross-dataset generalization. A spatial-attention Channel Alignment Module (CAM) projects heterogeneous EEG montages into a shared channel space and provides spatial weights that highlight regions aligned with standard EEG montages, offering interpretability. Complementary self-supervised tasks—augmentation contrastive, temporal shuffling discrimination, and frequency band masking—provide temporal and spectral information that improve robustness on these underrepresented classes. Experiments on three heterogeneous EEG sleep datasets show that MTSSRL-MD consistently outperforms single-dataset SSRL baselines and even surpasses SeqCLR, a representative multi-dataset single-task SSRL method, particularly under low-label conditions, demonstrating the effectiveness of integrating multi-dataset and multi-task learning for EEG-based sleep stage classification. Besides classification performance, MTSSRL-MD achieves more efficient inference than single- and multi-dataset SSRL baselines. Moreover, the unified design of our proposed method allows the use of a single pretrained encoder to be fine-tuned across diverse datasets, highlighting efficiency and practical value for clinical research, suggesting strong potential for deployment in real-world settings.", "tldr": "MTSSRL-MD integrates multi-dataset and multi-task self-supervised representation learning with channel alignment to enable efficient, interpretable, and generalizable EEG sleep staging under label scarcity.", "keywords": ["Channel alignment", "Cross-dataset generalization", "Electroencephalography", "Heterogeneous EEG datasets", "Multi-dataset pre-training", "Multi-task learning", "Sleep stage classification", "Self-supervised learning", "Uncertainty-weighted loss"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/40bd7629b195de050c07e7e5834cce9ba5eac355.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper introduces a new method for multi-dataset self-supervised learning for dealing with heterogeneous datasets. This architectures use a Channel Alignment Module to project each dataset with a different number of channels to a space with the same number of channels. \nThe CAM and the encoder are pre-trained using a three-loss supervised learning. Then, a fine-tuning is made for the encoder and a classifier with a classification loss. \nThis method is evaluated on three sleep staging datasets and compared to different self-supervised methods and fine-tuning methods."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper is easy to follow."}, "weaknesses": {"value": "The major weakness, in my opinion, is the motivation of the paper.\n\n- The authors claim that:  \"As a result, the sample size of available labeled data is small\". In sleep staging, a huge database is available with the NSRR and several datasets, such as RobustSleepNet or U-Sleep, which used more than 10 datasets for their experiments, reaching more than 10.000 subjects. I agree that a missing label is something that is possible in the EEG field; sleep staging avoids this problem. Sleep staging remains a good modality for proof of concept, but using the method on other EEG tasks can help strengthen the claim.\n\n- The authors motivate their method to be more generalizable across domains (datasets), but their method needs to see the domain for pretraining. This is a major bottleneck to claiming that the method is generalizable to a new domain. Since the CAM is dataset-specific, you cannot pretrain before having access to the new datasets.\n\n- In Table 3, the authors compare MTSSRL-MD with ATCNET and DeepSleepNet. This Table makes me wonder if self-supervised learning is very useful since the scores seem very close for SleepEDF, lower for ISRUC, and better for ANPHY.  Can you try to compare with other supervised learning baselines, like CareSleepNet[1], U-Net[2], and SeqSleepNet[3] ?\n\n- Very often, sleep staging only uses a few channels, even 1. Spatial information is not crucial for classifying sleep. Having the motivation to add more channels in sleep staging is somewhat contradictory since one doesn't need a lot of channels to have a good prediction. And it is exactly what is shown in the spatial attention weight, where a lot of datasets are not taken into account. \nNevertheless, the heterogeneity in the EEG field is still an open question, and the proposed CAM is very interesting, and I would like to see some results on other modalities to see if it also helps.\n\n[1] Wang et. al., CareSleepNet: A Hybrid Deep Learning Network for Automatic Sleep Staging, 2024\n[2] Perslev et. al., U-Sleep: resilient high-frequency sleep staging, 2021\n[3] Phan et. al., SeqSleepNet: End-to-End Hierarchical Recurrent Neural Network for Sequence-to-Sequence Automatic Sleep Staging, 2018"}, "questions": {"value": "- What is the final ratio that you get with the uncertainty weighting?\n- It is not clear what the meaning of 5%, 10% or 100% of labeled fine-tuning is. Do you split by subjects and then use a percentage of training subjects?\n- How did you choose the $c^*$  parameters ?\n- The ablation study shows that using the uncertainty weighted loss is useful. I would like to see if the CAM is useful. Right now, it is not clear if it is the weighted loss that helps or the fact that you train on more datasets than the dataset-specific pretraining. Adding an MTSSRL-MD train only on one dataset or training MTSSRL-MD without CAM on a subsample of common channels between the three datasets to see if the results are still high.\n\n- How is the split done? I didn't find the information."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "e99RkTs4br", "forum": "qD4N15aL2W", "replyto": "qD4N15aL2W", "signatures": ["ICLR.cc/2026/Conference/Submission24689/Reviewer_LS6M"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24689/Reviewer_LS6M"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24689/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761754108096, "cdate": 1761754108096, "tmdate": 1762943164544, "mdate": 1762943164544, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces MTSSRL-MD, a unified framework for multi-task self-supervised representation learning (SSRL) from EEG signals across heterogeneous datasets. The approach incorporates a Channel Alignment Module (CAM) to align montages, three self-supervised pretext tasks (augmentation contrastive, temporal shuffling discrimination, and frequency band masking), and an uncertainty-weighted multi-task loss. MTSSRL-MD is empirically evaluated on three public EEG sleep stage datasets improvements over baseline methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. The paper's motivation is clear. It targets the difficulty in learning robust EEG representations due to label scarcity and dataset heterogeneity.\n2. MTSSRL-MD is efficient in terms of parameters, memory, and latency, making it well-suited for real-time clinical deployment compared to prior models."}, "weaknesses": {"value": "The primary concern with this paper is that the authors appear to be largely unaware of recent advancements in EEG foundation models [1].\n\n1. The core mechanisms introduced in this work—namely, the channel alignment module, shared multi-channel encoder, and multi-task self-supervised loss—have been extensively explored in prior studies [2–4]. As a result, the paper’s technical novelty is limited.\n2. The authors employ SleepEDF-20, ISRUC-S1, and ANPHY-Sleep as pretraining datasets. However, these datasets are relatively small and do not fully leverage the advantages of self-supervised learning. In contrast, recent EEG foundation models are typically pretrained on much larger datasets such as TUEG, which provide broader generalization and robustness. Consequently, the practical implementation in this work is weak and may limit the impact of the proposed approach.\n3. In the experimental section, the only self-supervised baseline considered is SeqCLR (2020). Given the substantial progress in EEG foundation models in recent years, the authors should include more recent and competitive baselines, such as LaBraM [2] and Cbramod [4]. Without such comparisons, the evaluation is insufficient and does not convincingly demonstrate the advantages of the proposed method.\n\n[1] Wu, Jiamin, et al. \"Adabrain-bench: Benchmarking brain foundation models for brain-computer interface applications.\" arXiv preprint arXiv:2507.09882 (2025).\n\n[2] Jiang, Wei-Bang, Li-Ming Zhao, and Bao-Liang Lu. \"Large brain model for learning generic representations with tremendous EEG data in BCI.\" arXiv preprint arXiv:2405.18765 (2024).\n\n[3] Yi, Ke, et al. \"Learning topology-agnostic EEG representations with geometry-aware modeling.\" Advances in Neural Information Processing Systems 36 (2023): 53875-53891.\n\n[4] Wang, Jiquan, et al. \"Cbramod: A criss-cross brain foundation model for eeg decoding.\" arXiv preprint arXiv:2412.07236 (2024)."}, "questions": {"value": "1. Did the authors conduct a literature review beyond 2022 to ensure coverage of recent developments in EEG pretraining?\n2. What specific innovations distinguish this work from existing methods that use similar architectures or objectives?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Dk4FEZ59zq", "forum": "qD4N15aL2W", "replyto": "qD4N15aL2W", "signatures": ["ICLR.cc/2026/Conference/Submission24689/Reviewer_z6TT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24689/Reviewer_z6TT"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission24689/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761793139390, "cdate": 1761793139390, "tmdate": 1762943164269, "mdate": 1762943164269, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes MTSSRL-MD, a unified framework for multi-task self-supervised representation learning (SSRL) across multiple EEG datasets. The framework aims to improve generalization under label scarcity and heterogeneous EEG montages by integrating three components:\n\n(1) Multi-dataset learning, to leverage diverse EEG sources and mitigate overfitting to specific datasets;\n\n(2) Channel Alignment Module (CAM), a spatial attention mechanism that projects heterogeneous montages into a shared channel space;\n\n(3) Multi-task SSL optimization, combining contrastive, temporal order, and spectral masking tasks with uncertainty-weighted loss balancing.\n\nExperiments are conducted on three heterogeneous sleep-staging datasets (SleepEDF-20, ISRUC-S1, and ANPHY-Sleep) to validate the framework."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The research direction is valuable, addressing the problem of cross-dataset EEG representation learning, which is a crucial step toward robust and scalable EEG analysis."}, "weaknesses": {"value": "**1. Unclear problem framing.**\n\nWhile the paper’s objective is generally understandable, the introduction lacks a clear articulation of the core challenges motivating the use of multi-task learning and explicit montage modeling. It remains unclear what specific limitations the authors refer to when stating that “These strategies show the promise of dataset fusion but also its limitations.” The specific limitations of previous strategies should be explicitly defined, and the authors should further clarify why explicit montage alignment is necessary or beneficial, especially considering the potential inter-subject variability and the fact that implicit alignment methods may already capture spatial dependencies to some extent.\n\n**2. Limited novelty.**\n\nEach component of the proposed framework has clear prior art, and the main contribution lies in the integration of existing ideas rather than introducing substantial algorithmic novelty.\n\n**3. Task scope limitation.**\n\nAlthough framed as a unified framework for EEG representation learning, the experiments focus solely on sleep staging. Evaluating on additional EEG tasks (e.g., seizure detection, emotion recognition) would better support claims of generality.\n\n**4. Unclear advantage of CAM.**\n\nWhile CAM is central to the proposed framework, the paper does not quantitatively isolate its contribution or demonstrate why explicit alignment outperforms other approaches. In particular, recent foundation models for EEG representation learning, such as MMM and CBraMod, have already proposed more systematic solutions for montage alignment and domain generalization. The paper does not include comparisons with these representative methods and therefore fails to show a clear advantage or competitiveness in handling montage heterogeneity.\n\n**5. Outdated baselines.**\n\nThe latest baseline referenced in this paper is from 2022 (ATCNet). For a fair and up-to-date evaluation, the authors should include comparisons with stronger and more recent sleep-staging baselines, as well as SSRL baselines (particularly EEG foundation models), published between 2023 and 2025.\n\n**6. Minor presentation issues.**\n\n- Line 112: “Self-supervised learning (SSRL)” should be “Self-supervised representation learning (SSRL)”.\n- Section 3.4.1 is a single subheading and should be merged or renumbered.\n- Page 8–9 reference jump issue.\n- Code is not provided."}, "questions": {"value": "1. Can the authors clearly define the core challenge and explain how each proposed component directly addresses it?\n\n2. The three SSRL tasks are commonly used in self-supervised learning. The paper should clarify what advantages this particular combination offers and how their complementary effects are demonstrated.\n\n3. How transferable is MTSSRL-MD to other EEG domains such as seizure detection or emotion classification?\n\n4. Why choose uncertainty weighting over alternatives like GradNorm or PCGrad for task balancing?\n\n5. Can the authors theoretically or empirically demonstrate why this kind of explicit montage alignment yields stronger generalization than others?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ZpWwtbHRFi", "forum": "qD4N15aL2W", "replyto": "qD4N15aL2W", "signatures": ["ICLR.cc/2026/Conference/Submission24689/Reviewer_VgrX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24689/Reviewer_VgrX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission24689/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761896264405, "cdate": 1761896264405, "tmdate": 1762943163917, "mdate": 1762943163917, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes MTSSRL-MD, a framework for learning generalizable EEG representations across heterogeneous datasets for sleep stage classification. The method combines: (1) a Channel Alignment Module (CAM) to handle heterogeneous EEG montages, (2) three complementary self-supervised learning tasks (augmentation contrastive, temporal shuffling discrimination, and frequency band masking), and (3) uncertainty-weighted multi-task optimization. Experiments on three public sleep datasets (SleepEDF-20, ISRUC-S1, ANPHY-Sleep) demonstrate improvements over single-dataset SSRL and multi-dataset baseline SeqCLR, particularly in low-label regimes."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper clearly articulates three critical challenges in EEG-based sleep staging: (a) label scarcity, (b) small dataset scale, and (c) montage heterogeneity. \n- Experimental validation is quite comprehensive (multiple baselines, multiple metrics, different amounts of labels)\n- Considerable improvements over SeqCLR and single-dataset SSRL baselines, while maintaining competitive performance at full supervision and achieving superior computational efficiency\n- Results are supported through visualizations of CAM spatial attention"}, "weaknesses": {"value": "- Limited novelty in individual components of MTSSRL-MD (e.g., three SRRL tasks, CAM) The main contribution appears to be the engineering combination of existing techniques rather than fundamental algorithmic innovations.\n- Limited amount of comparisons (SeqCLR is the main method and rather old), graph-based and feature fusion approaches are discussed but not empirically compared. \n- Only three data sets are tested, all for sleep staging\n- Ablation studies quite limited (only with respect to multi-task weighting strategies)."}, "questions": {"value": "- Can you provide a systematic ablation study that isolates the individual contributions of CAM and multi-task learning? Specifically, please report results for Basline, CAM-only, Multitask-only, full model. \n- Why were recent multi-dataset EEG methods not included in the experimental comparison?  Comparing only against SeqCLR is insufficient to claim state-of-the-art performance. \n- Have you evaluated MTSSRL-MD on any EEG tasks beyond sleep staging? E.g., seizure detection?\n- When does MTSSRL-MD fail? Are there subjects or sleep patterns where the method struggles?\n- Interpretability: Have you consulted with sleep clinicians or neurophysiologists to validate that the CAM spatial attention patterns (Fig 2) are clinically meaningful?\n- How does MTSSRL-MD scale with increasing numbers of datasets? You tested 3 datasets - what happens with 5, 10, or 20 datasets?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "pE7cq57e6o", "forum": "qD4N15aL2W", "replyto": "qD4N15aL2W", "signatures": ["ICLR.cc/2026/Conference/Submission24689/Reviewer_8YwF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24689/Reviewer_8YwF"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission24689/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761909557527, "cdate": 1761909557527, "tmdate": 1762943163709, "mdate": 1762943163709, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a self-supervised learning framework for EEG for a multi-dataset, multi-task context. It uses a Channel Alignment Module to handle different EEG montages. While the paper is clearly written and addresses the important problem of cross-dataset generalization, its contributions are significantly undermined by a severe lack of relevant baseline comparisons and ablation studies being absent for one of its primary methodological proposals."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The paper is well-written and clearly articulates its methods and aims. The goal of creating a unified SSL framework that is cross-domain is important to the field.\n- The combination of multiple pretext tasks which have been shown to perform well is a solid choice; combining this with the uncertainty weighting of these multiple objectives is very sensible and is shown to improve effectiveness."}, "weaknesses": {"value": "- **Severe lack of baseline comparisons**: A primary claim of the paper is the benefit of the multi-dataset approach, yet the paper does not compare against any recent multi-dataset SSL methods for EEG. Examples would have included EEGPT, BIOT, Labram, CBramod, among others. A single comparison to a workshop paper from 2020 (SeqCLR) is simply insufficient to judge the method's performance relative to the literature. Similarly for single-dataset baselines; These comparisons are also insufficient, relying on methods from 2021. To make the current paper relevant, it would need to either show that a combination of methods by Banville et al. (2021) is at least as good as current methods, or provide insight into how using and weighting multiple pretext tasks interacts with current/modern pretext strategies.\n\n- **No ablation or analysis on the Channel Alignment Module**: A central component of the paper is the Channel Alignment Module yet no ablation studies are performed to validate its effectiveness. Although it aims to address precisely the same issue other cross-domain methods tackle (e.g. tokenizers in Labram or Cbramod), no comparisons either theoretical or empirical are provided.\n\n- **Limited methodological novelty and/or insight**: The paper largely combines existing pieces (known pretext tasks, uncertainty weighting). The only potentially novel piece is the CAM, which is unverified. As the paper stands, its only clear contribution is showing that multi-task pretraining is useful, which has now been shown in multiple publications. The work fails to provide new and interesting insights for the field and feels incomplete as is.\n\n- **Conflation of contributions**: The paper appears to marry the concepts of pretraining tasks and single vs multi-dataset pretraining. These are fairly independent from my understanding; SeqCLR can be performed on single datasets and singular Banville et al. methods can be applied in a multi-dataset setting. The paper would be stronger if it decoupled these contributions and analyzed them independently.\n\n\nIn its current state, the paper feels seriously incomplete. The lack of crucial baseline comparisons and any ablation or analysis of the proposed Channel Alignment Module makes it impossible to validate the paper's claims or understand its relevance. The paper does not offer sufficient new insight to warrant acceptance."}, "questions": {"value": "1. To make the paper more relevant to the field, are you able to present analyses for pretraining with modern methods? (Either as comparisons or added in during multi-task pretraining)\n\n2. Did you perform any analyses into the channel alignment module? \n\n3. Do the authors see any problems with disentangling the pretext tasks from single- vs multi-dataset training? If not, why was this not done?\n\nMinor:\n- Figure 2 Presentation: Figure 2 appears to be raw matplotlib output with very small fonts, making it difficult to read. Here the presentation could be improved."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hbp5swRP8s", "forum": "qD4N15aL2W", "replyto": "qD4N15aL2W", "signatures": ["ICLR.cc/2026/Conference/Submission24689/Reviewer_R97R"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24689/Reviewer_R97R"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission24689/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761920899475, "cdate": 1761920899475, "tmdate": 1762943163472, "mdate": 1762943163472, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}