{"id": "QNpBrPiUUW", "number": 15576, "cdate": 1758252862154, "mdate": 1759897298035, "content": {"title": "Regime-Aware Semi-Supervised Regression via Clustering-Gated Experts", "abstract": "We study regime-aware semi-supervised \\emph{regression} for tunnel boring machine (TBM) operation modeling under cross-strata nonstationarity and label scarcity. We propose \\textbf{CGE}—\\emph{Clustering-Gated Experts}—a three-stage framework that (i) discovers latent geological regimes via robust, ensemble clustering; (ii) trains per-regime heterogeneous ensembles with agreement-based pseudo-labeling and consistency regularization; and (iii) routes predictions by a lightweight distance-based soft gate. For risk-aware deployment, we equip all predictors with conformalized quantile regression (CQR) to yield calibrated prediction intervals. On real TBM data with 5–20\\% label budgets, \\textbf{CGE} surpasses strong semi-supervised baselines, achieving at 10\\% labels an average $R^2$ of $\\mathbf{0.942}\\!\\pm\\!0.018$ and RMSE of $\\mathbf{0.112}\\!\\pm\\!0.015$. With 90\\% CQR intervals, it attains near-nominal coverage  and the narrowest widths, alongside lower NLL/CRPS. Overall, \\textbf{CGE} offers a practical accuracy–uncertainty trade-off for safety-critical TBM decision-making under nonstationary geology.", "tldr": "", "keywords": ["semi-supervised regression; mixture of experts; regime discovery; clustering-gated routing; tabular learning; uncertainty estimation; pseudo-label risk control; consistency regularization; conditional shift; industrial analytics"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a9cd63f2173d502296d0e5bf6d336e81e5374a50.pdf", "supplementary_material": "/attachment/fc9177e935d4b9a9e11acf3a6c0813ae9187da94.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a Regime-Aware Semi-Supervised Regression framework that combines ensemble clustering, regime-specific semi-supervised experts, and distance-based soft gating. The system aims to address heterogeneity in regression tasks where data are drawn from different regimes. The authors integrate pseudo-labeling, consistency regularization, and conformalized quantile regression (CQR) to achieve both predictive accuracy and calibrated uncertainty, evaluating the approach on a tunnel-boring machine (TBM) dataset."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- Well-engineered system: The overall pipeline is coherent, and each component (clustering, gating, SSL, CQR) is implemented soundly.\n\n- Empirical performance: Results show noticeable improvement over baselines in the low-label (10%) regime and reasonable uncertainty calibration.\n\n- Comprehensive evaluation: The experiments include ablations of the clustering and gating components and quantify uncertainty coverage.\n\n- Practical relevance: The TBM case study represents a genuine industrial regression problem with heterogeneous data sources."}, "weaknesses": {"value": "- Incremental contribution: The method primarily combines existing components—ensemble clustering, per-cluster SSL experts with pseudo-labeling and consistency loss, distance-based gating, and post-hoc CQR calibration. There is no new algorithmic element or theoretical insight. The novelty lies mainly in the integration and application to TBM data.\n\n- Weak motivation and problem definition: The paper does not rigorously define the regime setting or quantify why standard SSL or mixture-of-experts approaches fail. Without a formal characterization or failure analysis, the need for a bespoke “regime-aware” pipeline remains under-motivated."}, "questions": {"value": "- How sensitive are the results to the number of discovered regimes?\n\n- What happens if geological attributes are missing or noisy at test time?\n\n- Could a learned neural gating network perform as well as (or better than) the distance-based scheme?\n\n- Have you considered public datasets with known regime structure (e.g., datasets with covariate shifts) to test generalization?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "jsyGGOTCid", "forum": "QNpBrPiUUW", "replyto": "QNpBrPiUUW", "signatures": ["ICLR.cc/2026/Conference/Submission15576/Reviewer_hBKm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15576/Reviewer_hBKm"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15576/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761688192709, "cdate": 1761688192709, "tmdate": 1762925848999, "mdate": 1762925848999, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces CGE, a three-stage framework designed to address the challenges of nonstationarity and label scarcity prevalent in Tunnel Boring Machine  operational data. The method first discovers geological regimes via ensemble clustering, then trains specialized semi-supervised expert ensembles for each regime, and finally utilizes an interpretable, distance-based soft gating mechanism for prediction. On a real-world TBM dataset, the method achieves state-of-the-art results in both prediction accuracy and uncertainty calibration. The contribution lies in providing a robust, efficient, and interpretable semi-supervised learning solution for complex engineering systems."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper addresses a practical TBM tunneling problem with a robust and interpretable solution. It  couples unsupervised geological clustering with an MoE gating mechanism and integrates semi-supervised learning within each expert. This “cluster–enhance–conquer” framework effectively handles highly nonstationary engineering data.\n- By co-training pseudo-labels and consistency regularization, the training data within each regime is effectively expanded, alleviating the performance bottleneck caused by label scarcity.\n- The paper's experiments are rigorous, comparing both SOTA semi-supervised regression methods and domain-specific time-series models. Evaluation extends beyond accuracy metrics to uncertainty measures (PICP, MPIW, CRPS), offering a holistic performance view. The ablation study quantitatively validates each component’s contribution, reinforcing the framework’s design rationale."}, "weaknesses": {"value": "- All experiments are based on a single project (Jiluo Road Tunnel). While the data are high-quality, the framework’s generality remains untested on other projects with different geology, TBM types, or construction standards. Its success may partly reflect dataset-specific characteristics, limiting the universality of the framework.\n- The paper lacks a clear, centralized summary of dataset statistics. While Appendices B and D describe the case study and preprocessing, they omit key scale and dimensionality details. Crucial information—such as total sample size, data logging frequency, and overall duration or coverage—is missing or unclear.\n- TBM excavation is a continuous time series, yet the current model assumes i.i.d. data within each regime, ignoring temporal correlations. This may cause information loss, and strong performance could partly stem from sharply distinct geological regimes. In settings with subtler geological changes but highly dynamic operations, the model may underperform.\n- Appendix D details an expert-driven, complex feature engineering pipeline, including high-order interactions, statistical aggregations, and physics-informed features. While valuable, this raises uncertainty about how much performance gains stem from the CGE architecture versus these features. Reliance on such domain-specific engineering may limit CGE’s generalizability as a machine learning method.\n- There are some formula symbols in the Abstract that have not been rendered correctly, and the authors should check them carefully."}, "questions": {"value": "Same as weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "b0wi6kMBNk", "forum": "QNpBrPiUUW", "replyto": "QNpBrPiUUW", "signatures": ["ICLR.cc/2026/Conference/Submission15576/Reviewer_2Fdu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15576/Reviewer_2Fdu"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15576/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761796862052, "cdate": 1761796862052, "tmdate": 1762925848522, "mdate": 1762925848522, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a multi-stage training approach for regression in an industrial application where scarcity of labels is a challenge. The approach combines several elements: Clustering identifies latent geological regimes, per-regime ensemble is trained, and then soft-gated predictors equipped with conformalized quantile regression for prediction intervals. The methods are clearly explained including the motivation for choosing each approach. The approach is evaluated against other semisupervised learning approaches. An ablation study assesses the contribution of each piece of the workflow."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This is a combination of recent developments in machine learning applied to a novel problem that is complex. The challenges of the problem space are clearly laid out: scarcity of labels, non-stationarity, noise, and need for uncertainty estimation. The paper is clearly written, explaining details of each piece of the workflow concisely. Tradeoffs are explored, for example, between retaining all labels and filtering for consistent labels. The results demonstrate an improved accuracy and uncertainty estimation for the specific application. Yet, there is also potential impact for other applications areas that have similar characteristics to this industrial setting."}, "weaknesses": {"value": "Overall, the main weakness is in clarity of presentation. This is mostly due to densely packing information into the space. Where more explanation is needed, it could be better presented with the details in the appendix (and clearly references from the main text). For example, Figure 3 shows a “sharpness-coverage frontier” but it would help to have that calculation explained in the Appendix. What is sharpness?\n\nAcronyms (some undefined) in abstract.\n\nFigure 3 has formatting issues as detailed in the questions. Overall the spacing around figures seems compressed which makes them hard to read. Removing the plot titles (and putting that information in the caption) would help with readability. Generally, I appreciate that the font sizes in the plots (axis labels, etc) are not small, but in this case they are actually bigger than the font of the paper, so they could be made smaller so that they don’t run out of space."}, "questions": {"value": "Table 3 shows that removing clustering reduces performance, but it does not demonstrate that the clustering is discovering geologic regimes. Do the clustering results align with known geological regimes? What makes the clustering “geology-driven” rather than just data-driven? Purely data-driven clusters may actually improve performance more than geologically-aware clusters, but at the expense of explainability and trustworthiness in the domain.\n\nParagraph starting at Line 409 does not appear to belong in this paper? There are no shaded areas or stars in your plots.\n\nFigures 3a and 3b are confusing. It seems that one legend covers both plots? But then, there are 5 colors in 3b instead of 4 colors and the last bar in R4 is cut off from plot 3b? Why does Figure 3b imply that LP does quite well but this is in disagreement with Table 2? What is the dashed horizontal line in Figure 3a?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ZBF4TVcsTd", "forum": "QNpBrPiUUW", "replyto": "QNpBrPiUUW", "signatures": ["ICLR.cc/2026/Conference/Submission15576/Reviewer_iy8c"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15576/Reviewer_iy8c"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15576/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761949533421, "cdate": 1761949533421, "tmdate": 1762925848056, "mdate": 1762925848056, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper is outside my area of expertise, I cannot provide a meaningful review"}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "-"}, "weaknesses": {"value": "-"}, "questions": {"value": "-"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "JpBcYqgXGf", "forum": "QNpBrPiUUW", "replyto": "QNpBrPiUUW", "signatures": ["ICLR.cc/2026/Conference/Submission15576/Reviewer_m71b"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15576/Reviewer_m71b"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15576/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761961085292, "cdate": 1761961085292, "tmdate": 1762925847667, "mdate": 1762925847667, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}