{"id": "Qu2A8wBTBJ", "number": 22164, "cdate": 1758326961947, "mdate": 1759896882722, "content": {"title": "Low-rank Interpretable Cell–Cell Hidden Interactions from Embeddings", "abstract": "Multicellular organisms rely on continuously changing cell–cell interactions that govern critical biological processes as cells modify their internal states and trajectories in space over time. Studying these interactions is critical to understand development, homeostasis, and disease progression. Live-cell imaging provides a unique opportunity to directly observe these dynamical events; however, current computational approaches often fail to model complex, time-varying events involving diverse populations and spatial contexts. Here, we present LICCHIE, a model designed to infer time-changing, feature-based cell-cell interactions, applicable across systems and conditions. Our approach represents each cell with a dynamic multi-feature vector, and interactions are modeled as spatially constrained, directed influences between cell pairs, evolving over time. We optimize the model using an iterative scheme balancing data fidelity, interactions smoothness, and low-rank sparse structure. We validated LICCHIE’s ability to capture cellular interactions across populations in a controlled synthetic setting and applied it to real-world 3D live-cell imaging of patient-derived tumor organoids to (1) identify components with interpretable structures that capture interaction type and directionality, and (2) suggest modulation strategies that may accelerate NK polarization and tumor cell death.", "tldr": "LICCHIE, a data-driven method for interpretable cell–cell interactions inference, revealing their underlying mechanisms", "keywords": ["cell–cell interactions", "live-cell imaging", "interaction networks", "dynamical systems", "data-driven modeling", "interpretable representation", "low-rank optimization"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/cf20165fd9ed08328679a0266eb72050b3512069.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces LICCHIE — a low-rank dynamic model designed to infer time-varying cell–cell interactions” from live-cell imaging data. Each cell is represented as a temporal feature vector derived from morphological and spatial descriptors, and pairwise influences between cells are modeled as time-dependent linear transformations. These interactions are constrained to be low-rank, sparse, and temporally smooth, aiming to balance interpretability and expressiveness. The authors validate LICCHIE on synthetic datasets and apply it to live-cell microscopy of tumor–NK co-cultures, claiming that the learned interaction matrices reveal biologically meaningful influence patterns and potential regulatory mechanisms."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "**Readable presentation:**\n\nThe manuscript is well-written and clearly organized, with intuitive figures that make the mathematical setup easy to follow even for non-domain experts.\n\n**Mathematical clarity:**\n\n The formulation is compact and well-structured, combining ideas from linear dynamical systems, low-rank decomposition, and temporal smoothness regularization in an interpretable way."}, "weaknesses": {"value": "**Conceptual and biological validity concern**\n\nThe paper defines cell–cell interactions from live-cell imaging sequences, yet the experimental setup appears to involve isolated cells or loosely adherent co-cultures rather than structured tissue or organoid environments.  In such conditions, cells are not embedded within a continuous microenvironment, and long-range or contact-based signaling is largely absent.  Therefore, what the model captures is more accurately morphological co-variation or motion correlation among nearby cells, rather than bona-fide cell–cell communication.  This distinction should be made explicit, as it fundamentally affects the biological interpretation of the inferred interaction matrices. \n\n**Lack of molecular or mechanistic validation**\n\n The inferred interaction matrices are not validated against known ligand–receptor signaling pathways, transcriptional profiles, or perturbation responses.  Without molecular or experimental corroboration, it remains unclear whether the model captures meaningful communication or merely statistical dependencies.  This weakens the biological interpretability of the proposed “interaction components."}, "questions": {"value": "None"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "LIYwBUbbCe", "forum": "Qu2A8wBTBJ", "replyto": "Qu2A8wBTBJ", "signatures": ["ICLR.cc/2026/Conference/Submission22164/Reviewer_Siuv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22164/Reviewer_Siuv"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22164/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761822835378, "cdate": 1761822835378, "tmdate": 1762942098120, "mdate": 1762942098120, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents LICCHIE, a low-rank, interpretable framework for modelling cell-cell interactions from live-cell imaging data.  It represents pairwise influences between cells as combinations of shared rank-1 “interaction motifs,” enabling biologically interpretable analysis of how cellular features dynamically affect one another over time."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "- The problem is very well articulated and follows a very coherent flow. \n- The approach is biologically grounded and is well-motivated at every architectural component."}, "weaknesses": {"value": "- In the abstract, NK is not defined. \n- Ambiguity in biological grounding and temporal consistency: The decision to avoid explicit cell tracking and instead operate purely in “feature space” is only loosely justified in Section 3. Without clear temporal correspondence between specific cells across frames, it is uncertain how the model distinguishes genuine dynamic interactions from coincidental correlations among transient feature observations.\n- Lack of clarity in feature-space formulation and identity handling: While the authors justify avoiding explicit cell tracking by operating in “feature space,” it remains unclear how temporal consistency is maintained when cell identities are not preserved. Without explicit linking across frames, it is ambiguous how the model distinguishes genuine temporal evolution of a single cell from population-level variability or measurement noise."}, "questions": {"value": "None"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "rzifw1iBl5", "forum": "Qu2A8wBTBJ", "replyto": "Qu2A8wBTBJ", "signatures": ["ICLR.cc/2026/Conference/Submission22164/Reviewer_j8Lv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22164/Reviewer_j8Lv"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22164/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761948798191, "cdate": 1761948798191, "tmdate": 1762942096392, "mdate": 1762942096392, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper develops LICCHIE, a model for inferring cell-cell interactions from live imaging of biological cell data. The model learns time-varying interaction matrices that are constrained by spatial proximity and a low-rank regularization. Optimization is performed by iterative linear regression and canonical polyadic tensor decomposition (PARAFAC)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "1.\tThe formulation of the biological problem is, to my knowledge, unique. I have not seen any papers tackling this problem previously. This is an important biological problem, however, and an initial approach to solving it is an important contribution.\n2.\tThe model formulation is sensible and parsimonious, but also interesting from an ML perspective.\n3.\tThe biological insights gained from running the model on real data are quite interesting. It seems that this method provides new important new insights into these kinds of live-cell imaging datasets.\n4.\tEvaluations using simulated data show that the method accurately recovers ground truth interactions compared to baseline models."}, "weaknesses": {"value": "1.\tBaselines used for simulated data comparison are a bit simplistic. I understand that there are not really competing methods to compare with here. But, it seems that you could for example ablate your model more to understand which parts of the objective are most important for strong performance.\n2.\tComparisons with baselines on the real data are missing."}, "questions": {"value": "1.\tUsing a tensor decomposition here is an interesting approach. You imposed a low-rank constraint to obtain rank-1 components. Does it make biological sense to consider a tensor decomposition with a core tensor instead (Tucker decomposition)? This could give a different perspective on the structure of the cell interactions.\n2.\tThe paper mentions cell state several times, but this seems largely aspirational, unless I misunderstood the details of the real dataset. Can you clarify what “cell state” means in the real data application presented here? If you’re not modeling it here, what sort of data would you need to do true cell state modeling?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "x5xkSHLB5f", "forum": "Qu2A8wBTBJ", "replyto": "Qu2A8wBTBJ", "signatures": ["ICLR.cc/2026/Conference/Submission22164/Reviewer_J9Kt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22164/Reviewer_J9Kt"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22164/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761963272384, "cdate": 1761963272384, "tmdate": 1762942096126, "mdate": 1762942096126, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}