{"id": "QZvqSNIUq6", "number": 1263, "cdate": 1756868107709, "mdate": 1763100637669, "content": {"title": "Journey to the Centre of Cluster: Harnessing Interior Nodes for A/B Testing under Network Interference", "abstract": "A/B testing on platforms often faces challenges from network interference, where a unit's outcome depends not only on its own treatment but also on the treatments of its network neighbors. To address this, cluster-level randomization has become standard, enabling the use of network-aware estimators. These estimators typically trim the data to retain only a subset of informative units, achieving low bias under suitable conditions but often suffering from high variance. \nIn this paper, we first demonstrate that the interior nodes—units whose neighbors all lie within the same cluster—constitute the vast majority of the post-trimming subpopulation. In light of this, we propose directly averaging over the interior nodes to construct the mean-in-interior (MII) estimator, which circumvents the delicate reweighting required by existing network-aware estimators and substantially reduces variance in classical settings. However, we show that interior nodes are often not representative of the full population, particularly in terms of network-dependent covariates, leading to notable bias. \nWe then augment the MII estimator with a counterfactual predictor trained on the entire network, allowing us to adjust for covariate distribution shifts between the interior nodes and full population.\nBy rearranging the expression, we reveal that our augmented MII estimator embodies an analytical form of the point estimator within prediction-powered inference framework~\\citep{angelopoulos2023prediction,angelopoulos2023ppi++}. This insight motivates a semi-supervised lens, wherein interior nodes are treated as labeled data subject to selection bias. Extensive and challenging simulation studies demonstrate the outstanding performance of our augmented MII estimator across various settings.", "tldr": "We develop a novel estimator for A/B test under network interference, which specifically leverages the interior nodes with a regression component for eliminating selection bias and achieving significant reduction in MSE.", "keywords": ["causal inference", "A/B test", "network interference", "cluster-level randomization"], "primary_area": "causal reasoning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c89892a8519136544673ec21b12157a4beb3b8eb.pdf", "supplementary_material": "/attachment/63df6507a241502cd812f039e5f792ec0cb1e1a3.zip"}, "replies": [{"content": {"summary": {"value": "This paper addresses the challenge of conducting A/B tests on networks where interference between connected units violates standard causal assumptions. The authors propose the Mean-in-Interior (MII) estimator, which leverages interior nodes lying within the same cluster and *eliminates the inefficiency* introduced by the cluster-relevant weights used in the previous CAE estimator. Recognizing that interior nodes may not represent the overall population, the paper further introduces the Augmented MII (AMII) estimator, which employs a GNN-based counterfactual predictor to correct for selection bias. Theoretical analysis implies that AMII has an intuitively smaller bias than MII estimator in specific additive model, with another interpretation based on semi-supervised adjustment provided in terms of this method. Extensive simulations on semi-synthetic social network data demonstrate that AMII generally achieves lower MSE than comparative methods, establishing it as an efficient and practical approach for causal estimation under network interference."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The paper introduces the Mean-in-Interior (MII) and Augmented MII (AMII) estimators, fulfilling the gaps in GATE estimation based on interior nodes, and draws the attention on possible incomplete representativeness of the interior nodes to the entire cluster."}, "weaknesses": {"value": "The paper features several notable weaknesses. While the authors attempt to convey dense ideas through multiple key intuitions and assertions, few are elaborated with sufficient rigor to enable non-expert readers to fully grasp them. The theoretical justification for the advantages of the MII and AMII estimators remains limited. Moreover, the rationale for viewing the MII estimator as an improvement over the CAE estimator is insufficient and not theoretically supported. Additionally, Section 3, which introduces the MII estimator, and Section 4, which discusses covariate adjustment, appear insufficiently connected in their conceptual development. Please see Questions for details."}, "questions": {"value": "1. **On the novelty of the MII estimator**  \n   Overall, I think the novelty of the proposed MII estimator could be better explained. From what I can tell, it’s basically a difference-in-means estimator applied to interior nodes, which is a pretty classical idea in causal inference. Also, the idea of leveraging interior nodes has been seen in earlier work. It would help if the authors could clarify the genuine improvement on MII estimator here in rigorous theories.\n\n2. **On theoretical justification for the advantage of MII over CAE**  \n   In lines 250–262, the paper argues that MII improves efficiency over the CAE estimator by using better cluster-relevant weights. But CAE’s weighting scheme is rooted in **cluster randomization**, which doesn’t seem to be part of the main assumptions (2.1 and 3.1). So, it feels like the two estimators might be targeting different experimental designs, making the motivation a bit insufficient. Also, there doesn’t seem to be a clear theoretical guarantee backing this claim—some clarification would be great.\n\n3. **On clarity of statements**  \n   A few parts could use clearer explanations or more precise wording:  \n   - *Line 48:* The paper says that leveraging the known graph structure is *much more appealing*, but it doesn’t really argue why.  \n   - *Line 251:* I didn’t quite follow why the model *helps build intuition* that variance analysis is more complex than bias analysis—or why it’s necessary to emphasize that intuition here.  \n   - *Lines 315–316:* The statement *they may struggle … a comparative advantage* is confusing. It’s not clear why it “struggles,” or why an $f$ -model that doesn’t estimate the interference function $h$ should be considered an advantage. Since any model $f$ can adapt, this doesn’t seem to tie closely to the covariate adjustment goal. \n   - *Line 275-276:* *We argue that ... can be violated.* It does not provide any explanation not state exactly which assumptions are violated. \n   - *Line 281-282:* *Most estimators without a regression component tend to rely heavily on interior nodes*, there have been a number of estimators on exposure effects that do not rely on interior nodes as well, thus an arbitrary assertion.\n   - The inconsistent names of $h$ as both ''transformation function'' (line 255) and ''interference function'' (line 315).\n\n4. **On covariate adjustment and coherence**  \n   Covariate adjustment can be applied to pretty much any estimator, not just MII. So it would be fairer to compare **AMII** with the augmented versions of all other estimators too. Also, Sections 3 and 4 don’t quite feel conceptually aligned—cluster-related weights and covariate adjustment seem like two separate issues, and it might help to connect them more clearly.\n\n5. **On Assumption 4.1 and model training**  \n   Assumption 4.1 says that $f$ is trained in a regression form, but in line 290 the paper says $f$ is trained using a GNN. How does that assumption hold in this case? A short explanation would make this part clearer.\n\n6. **On experiments and ablation studies**  \n   The experimental section feels a bit thin. It would really help to include a few ablation studies, for example:\n   - What happens if covariates actually affect the outcome?\n   - What if the interior nodes aren’t very representative of the full cluster?  \n   Seeing these variations would strengthen the experimental support for MII."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "No concerns on ethnics."}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "BK6D4JYVln", "forum": "QZvqSNIUq6", "replyto": "QZvqSNIUq6", "signatures": ["ICLR.cc/2026/Conference/Submission1263/Reviewer_RLAt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1263/Reviewer_RLAt"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1263/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761547225109, "cdate": 1761547225109, "tmdate": 1762915722682, "mdate": 1762915722682, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes two methods for estimating the global average treatment effect (GATE) when the effect of a unit may depend on the treatment assignments of nearby units, with proximity defined by a graph structure over the units.\n\nThe first proposed method, Mean-In-Interior (MII) estimator, averages the outcomes of the interior nodes receiving the same treatment as that of each unit. The authors show that the MII estimator is consistent (Theorem 3.1) under the Neighborhood Interference Assumption (NIA; Assumption 2.1) and the assumption about the interior nodes (Assumption 3.1).\nThe authors also claim that the MII estimator reduces the variance compared to the recently proposed CAE estimator (Liu et al., 2024).\n\nThe second method, called Augmented MII (AMII), corrects the bias of the MII estimator due to the focus on the interior points, using a counterfactual predictor $f$, which predicts the expected outcome given specified treatment assignments of all units (as well as covariates and the graph). Theorem 4.1 presents the bias of this estimator under Assumption 4.1 about the model.\n\nFinally, the paper presents experiments using a synthetic dataset with several specifications of the parameters of the data generating process. The results shown in Figure 2 demonstrate that the MII estimator has lower variance compared to the previous methods, and the AMII reduces the bias leading to reduced MSEs."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The task of estimation of GATE in the presence of interference is practically relevant and challenging.\n\n- The proposed methods are developed based on interesting ideas.\n\n- Theorems 3.1 and 4.1 provide soundness and strength of the proposed methods.\n\nI set the Contribution score 3: good because the direction of this work looks great."}, "weaknesses": {"value": "- The proof of Theorem 4.1 (Appendix B.2) uses Eq. (24), which is only introduced \"to illustrate the idea behind the AMII estimator\". (The statement of Theorem 4.1 does not mention this.)\n\n- I would need (at least) some more details about the Eq. (21) in the proof of Theorem 3.1 to verify the proof.\n\n- It is unclear to me what Eq. (13) is illustrating.\n\n- The AMII estimator looks like doubly robust/debiased estimators proposed in the standard treatment effect estimation literature, but there is no reference or discussion on this.\n\n- The statement of Assumption 4.1 is not clear to me.\n\n- The proposed methods are shown to work well on one dataset, which is a little underwhelming.\n\n- The authors claim that the distributions in Figure 3 \"exhibit clear discrepancies\". However, it seems like a subjective observation and the criterion of this claim is not clear."}, "questions": {"value": "Major concerns:\n- Does the statement of each theorem include all of its required assumptions? For example, \"treatment is assigned at the cluster level, meaning that all units within the same cluster receive the same treatment\" (l.168): It is not clear if this is an assumption in the theory. Does Theorem 4.1 only needs Assumption 4.1? Please also see the Weaknesses section.\n\n- Is Assumption 4.1 a condition about the true regression function, or the function used in the estimator? Is the function $g$ known to the estimator?\n\n- Could you discuss the contributions in relation to doubly robust/debiased estimators?\n\n- l. 227, \"the MII estimator exhibits substantially lower variance\": Why does the MII have lower variance compared to the CAE?\n\n- I suppose the proposed estimators depends on the clusters through $\\text{Int}_k$. Do the estimators fail if the clusters are not correct?\n\n\nMinor issues:\n- l.466, \"In the absence of the interaction term and 2-hop interference, we find that MII is nearly unbiased\": How did the author draw this observation?\n\n- Is the difference between the distribution in Figure 3 statistically significant?\n\n- Punctuation is missing after the equations.\n\n- l.475, \"increases exponentially\": Isn't it polynomial in $p$?\n\n- l.396, what is the difference between $\\text{deg}_i$ and $c_i$?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PS3R2wCUZp", "forum": "QZvqSNIUq6", "replyto": "QZvqSNIUq6", "signatures": ["ICLR.cc/2026/Conference/Submission1263/Reviewer_vtCm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1263/Reviewer_vtCm"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission1263/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761556445844, "cdate": 1761556445844, "tmdate": 1762915722509, "mdate": 1762915722509, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new estimator for the global average treatment effect (also known as the total treatment effect) in the presence of network interference. The work falls under the framework of cluster randomization, where conventional methods (e.g. difference in means or Horvitz-Thompson) suffer from either bias due to inter-cluster interference or large variance due to randomization. Specifically, the authors propose to focus on the interior units whose potential neighbors are all within the same cluster in order to reduce the variance. Furthermore, the bias from sub-sampling is corrected (or partially corrected when mis-specified) by a counterfactual predictor. Under certain assumptions, the bias bound is carefully elaborated, and more simulations are added for model misspecification."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "- **originality**: the proposed method focusing on interior units is new and novel.  \n- **quality**: the paper is well-written with solid theoretical results and simulations. \n- **clarity**: the paper is clear and well-explained assumptions \n- **significance**: the significance is relatively fair (see weakness part)."}, "weaknesses": {"value": "Although the paper provides a thorough analysis of the bias of the proposed method, the variance analysis part of the MII estimator is missing, which makes it hard to conduct a real test of the causal effects. More detailed questions are left to the questions part."}, "questions": {"value": "1. How can we use the proposed method to do hypothesis testing on GATE? Is there any direct way that we can estimate the variance of the MII estimator along with the asymptotical normality property? \n2. I'm a bit confused about the asymptotic scheme the assumption 3.1 is working on. Are we considering a sequence of networks with an incremental number of clusters? It could be more helpful if the authors can show that the assumption 3.1 is easy to satisfy for common random network models. The $o_p(K^{-1})$ bound for the maximum deviation does not sound trivial to me. My intuition for the bound is around $O_p(K^{-1/2}\\log K)$ for Erdos-Renyi random networks or similar. \n3. The bound in Theorem 3.1 does provide a convergence rate related to either cluster size or number of clusters. It could be refined to provide more insights on designing an experiment."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "WFSx2nE6pA", "forum": "QZvqSNIUq6", "replyto": "QZvqSNIUq6", "signatures": ["ICLR.cc/2026/Conference/Submission1263/Reviewer_gJGo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1263/Reviewer_gJGo"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission1263/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761967872769, "cdate": 1761967872769, "tmdate": 1762915722319, "mdate": 1762915722319, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the challenge of estimating the Global Average Treatment Effect (GATE) in the presence of network interference, a scenario where a unit’s outcome is influenced not only by its own treatment but also by the treatments of its neighbors. The authors focus on cluster-level randomization and identify limitations in existing estimators and propose new mean-in-interior estimator and augmented mean-in-interior to address the limitations in existing estimators for estimating GATE. Simulation studies are conducted to assess and validate the effectiveness of the proposed estimators and compare with existing estimators across a range of network and treatment settings."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.  The paper addresses the important problem of estimating the average treatment effect under network interference, which has practical significance for causal inference in many real-world applications.\n\n2. The motivation to extend existing estimands is well-articulated, and the comparisons with prior work are thoroughly examined.\n3. Viewing interior nodes as \"biased labeled data\" and approaching the problem from a semi-supervised learning angle is conceptually compelling.\n4. The core idea is clearly explained and easy to follow."}, "weaknesses": {"value": "1. The proposed estimators rely on strong parametric assumptions, which may limit their robustness and applicability in real-world settings. Moreover, the practical implementation of these estimators could be challenging, particularly in large-scale or heterogeneous networks where model assumptions may not hold or be verifiable.\n2. The impact of network interference on the proposed estimators is not thoroughly addressed. In particular, the paper does not fully analyze how varying levels or structures of interference may affect estimator performance, which raises concerns about their robustness in complex or sparse networks."}, "questions": {"value": "1. The nodes within each cluster are partitioned into interior and boundary nodes. In sparse networks, the number of interior nodes may be relatively small, which could adversely impact the performance and stability of the proposed estimators. Could the authors elaborate on how the estimators behave under such conditions, and whether any adjustments are needed to ensure reliable performance in sparse or low-density network settings?\n2. The paper proposes mitigating selection bias in the Mean-in-Interior estimator by training a counterfactual predictor over the entire graph. Could the authors elaborate on the rationale behind this approach?\n3. In the proposed approach, boundary nodes are excluded and only interior nodes are retained for estimating the global average treatment effect under network interference. However, interference is inherently present in GATE since it captures both direct and indirect effects propagated through the network. How do the authors account for or mitigate the influence of network interference on the estimation process, given that boundary nodes—where interference effects may be most pronounced—are omitted from the analysis?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "QPvATDzDes", "forum": "QZvqSNIUq6", "replyto": "QZvqSNIUq6", "signatures": ["ICLR.cc/2026/Conference/Submission1263/Reviewer_JmRm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1263/Reviewer_JmRm"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission1263/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761994662989, "cdate": 1761994662989, "tmdate": 1762915722090, "mdate": 1762915722090, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"comment": {"value": "We have synthesized the suggestions and questions proposed by reviewers and updated a new version of the paper (PDF). Specifically, we mainly:\n- add connecting and explanatory sentences for enhancing the flow and clarifying the position of our paper, \n- add more intermediate steps and explanations in our proof\n- fix typos"}}, "id": "zOSeiLzuyS", "forum": "QZvqSNIUq6", "replyto": "QZvqSNIUq6", "signatures": ["ICLR.cc/2026/Conference/Submission1263/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1263/Authors"], "number": 11, "invitations": ["ICLR.cc/2026/Conference/Submission1263/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763102570449, "cdate": 1763102570449, "tmdate": 1763102570449, "mdate": 1763102570449, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}