{"id": "refcXHU1Nh", "number": 24026, "cdate": 1758351916044, "mdate": 1759896785701, "content": {"title": "SafeFlowMatcher: Safe and Fast Planning using Flow Matching with Control Barrier Functions", "abstract": "Generative planners based on Flow Matching (FM) produce high-quality paths in a single or a few ODE steps, but their sampling dynamics offer no formal safety guarantees and can yield incomplete paths near constraints. We present \\emph{SafeFlowMatcher}, a planning framework that couples FM with control barrier functions (CBFs) to achieve \\emph{both} real-time efficiency and certified safety. SafeFlowMatcher uses a two-phase \\emph{prediction--correction} (PC) integrator: (i) a prediction phase integrates the learned FM once (or a few steps) to obtain a candidate path without intervention; (ii) a correction phase refines this path with a vanishing time‑scaled vector field and a CBF-based quadratic program that minimally perturbs the vector field. We prove a barrier certificate for the resulting flow system, establishing forward invariance of a robust safe set and finite-time convergence to the safe set. In addition, by enforcing safety only on the executed path---rather than all intermediate latent paths---SafeFlowMatcher avoids distributional drift and mitigates local trap problems. Moreover, SafeFlowMatcher attains faster, smoother, and safer paths than diffusion- and FM-based baselines on maze navigation and locomotion. Extensive ablations corroborate the contributions of the PC integrator and the barrier certificate.", "tldr": "We propose SafeFlowMatcher, a novel method for safe and fast planning that couples flow matching with control barrier functions via a two-phase prediction–correction integrator", "keywords": ["Flow matching", "Safety guarantees", "Planning and Control"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/bf1dbc59f88901dcea1302b4a91d20ba6e9668f9.pdf", "supplementary_material": "/attachment/2e2b3bad62f9aee7f4aae8913ac536368f95d672.zip"}, "replies": [{"content": {"summary": {"value": "SafeFlowMatcher meaningfully advances SafeDiffuser’s core idea—using CBFs to guarantee safety in generative planning—by swapping the stochastic, per-step–constrained diffusion backbone for a deterministic flow-matching model with a prediction–correction integrator and vanishing time-scaled CBF correction. This shift strengthens the theory (deterministic forward invariance with finite-time convergence vs. SafeDiffuser’s finite-time probabilistic invariance), slashes computational load (one/few ODE passes and a single lightweight QP, rather than a QP at every denoising step), and improves practical behavior (no boundary trapping, higher task scores, and real-time feasibility). The trade-offs are modest—FM is less naturally exploratory than diffusion and both approaches still require known, differentiable safety functions—but for robotics/control where safety and latency dominate, SafeFlowMatcher is a clear, useful step beyond the original SafeDiffuser."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Deterministic safety guarantees with forward invariance and finite-time convergence, rather than SafeDiffuser’s almost-sure (probabilistic) invariance across stochastic reverse steps. This yields cleaner, stronger theory for deployment.\n\n- Much lower computational load: one/few ODE integrations plus a single lightweight CBF-QP, instead of solving a QP at every denoising step. This makes real-time online planning feasible where SafeDiffuser typically isn’t.\n\n- Prediction–correction decoupling minimizes distributional distortion. The model first predicts with flow matching, then applies a vanishing time-scaled CBF correction that avoids boundary sticking/local traps that SafeDiffuser mitigates with relaxed or time-varying specs.\n\n- Better empirical planning quality at equal or stronger safety: smoother rollouts, higher task scores, and zero safety violations. Deterministic dynamics reduce stochastic artifacts present in diffusion-based sampling.\n\n- Simpler and more portable pipeline: no long reverse diffusion chain, fewer sensitivity knobs, and a safety layer that operates on executed trajectories. This makes it easier to plug into different environments/backbones than SafeDiffuser’s stepwise embedded constraints."}, "weaknesses": {"value": "- Requires known, differentiable, and correctly calibrated safety sets b(x). In real systems with perception noise, contacts, or nonconvex geometry, specifying (or learning) smooth, faithful barriers is hard and errors can yield either over-conservatism or false safety.\n\n- CBF-QP feasibility is not guaranteed, especially under tight actuation limits or when the predicted state is far inside the unsafe set. Slack-based fallbacks weaken guarantees and the paper lacks a systematic analysis of infeasibility rates and recovery.\n\n- Limited robustness treatment to uncertainty and mismatch (estimation noise, delays, unmodeled dynamics, moving constraints). The deterministic guarantees don’t provide ISS/chance-constrained bounds, so small errors could accumulate into violations.\n\n- Potential distributional drift from repeated corrections: even with vanishing scaling, the safety projection can bias trajectories away from the learned flow over long horizons, reducing diversity and pushing states out of the model’s training support.\n\n- Empirical scope and baselines: comparisons focus on diffusion backbones; fewer head-to-head results versus strong control baselines (e.g., MPC + CBF-CLF-QP, Neural-ODE/CNF + CBF filters) and no on-hardware validation to substantiate real-time claims.\n- The temperature-based reweighting is conceptually intuitive but still handcrafted; there is no exploration of whether β or weighting could be learned adaptively or optimized end-to-end.\n\n- The paper’s computational trade-offs (≈1.5× CFG cost) are reasonable but may still pose challenges for real-time or large-scale deployment scenarios."}, "questions": {"value": "- Can you quantify the practical bottlenecks of SafeDiffuser that specifically motivated your design choices (e.g., per-step QP latency, end-to-end wall clock, trap rates), and state the a priori performance targets you aimed to hit so readers can judge whether the reported gains meet those targets?\n\n- What conditions ensure feasibility of the CBF-QP in the correction step under tight actuation limits or when the predictor proposes states deep inside the unsafe set, and what is the formal recovery strategy when the QP is infeasible (e.g., backtracking the rollout, horizon extension, or schedule adjustment)?\n\n- How sensitive is performance and safety to the vanishing time-scaling schedule and the choice of the class-K function α(·), and can you provide ablations and practical tuning guidance that demonstrate stable behavior near boundaries without excessive conservatism or reward loss?\n\n- To what extent do repeated corrections induce distributional drift away from the nominal flow, and can you report quantitative divergence metrics (e.g., energy distance or trajectory FID) alongside impacts on trajectory diversity and long-horizon returns?\n\n- Could you include baselines beyond diffusion backbones—such as MPC with CBF-CLF-QP, Neural-ODE/CNF planners with a CBF filter, and diffusion with a single-shot CBF projection—to isolate how much of the gain arises from the prediction–correction plus vanishing mechanism rather than from the backbone swap alone?\n\n- How robust are the proposed guarantees in the presence of state-estimation errors, dynamics mismatch, delays, or moving constraints, and can you provide an ISS or chance-constrained analysis (or targeted experiments) that bounds violation probability under realistic sensing and model errors?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ypey9PJnpX", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_DQsF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_DQsF"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760525279422, "cdate": 1760525279422, "tmdate": 1763004302463, "mdate": 1763004302463, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "SafeFlowMatcher meaningfully advances SafeDiffuser’s core idea—using CBFs to guarantee safety in generative planning—by swapping the stochastic, per-step–constrained diffusion backbone for a deterministic flow-matching model with a prediction–correction integrator and vanishing time-scaled CBF correction. This shift strengthens the theory (deterministic forward invariance with finite-time convergence vs. SafeDiffuser’s finite-time probabilistic invariance), slashes computational load (one/few ODE passes and a single lightweight QP, rather than a QP at every denoising step), and improves practical behavior (no boundary trapping, higher task scores, and real-time feasibility). The trade-offs are modest—FM is less naturally exploratory than diffusion and both approaches still require known, differentiable safety functions—but for robotics/control where safety and latency dominate, SafeFlowMatcher is a clear, useful step beyond the original SafeDiffuser."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Deterministic safety guarantees with forward invariance and finite-time convergence, rather than SafeDiffuser’s almost-sure (probabilistic) invariance across stochastic reverse steps. This yields cleaner, stronger theory for deployment.\n\n- Much lower computational load: one/few ODE integrations plus a single lightweight CBF-QP, instead of solving a QP at every denoising step. This makes real-time online planning feasible where SafeDiffuser typically isn’t.\n\n- Prediction–correction decoupling minimizes distributional distortion. The model first predicts with flow matching, then applies a vanishing time-scaled CBF correction that avoids boundary sticking/local traps that SafeDiffuser mitigates with relaxed or time-varying specs.\n\n- Better empirical planning quality at equal or stronger safety: smoother rollouts, higher task scores, and zero safety violations. Deterministic dynamics reduce stochastic artifacts present in diffusion-based sampling.\n\n- Simpler and more portable pipeline: no long reverse diffusion chain, fewer sensitivity knobs, and a safety layer that operates on executed trajectories. This makes it easier to plug into different environments/backbones than SafeDiffuser’s stepwise embedded constraints."}, "weaknesses": {"value": "- Requires known, differentiable, and correctly calibrated safety sets b(x). In real systems with perception noise, contacts, or nonconvex geometry, specifying (or learning) smooth, faithful barriers is hard and errors can yield either over-conservatism or false safety.\n\n- CBF-QP feasibility is not guaranteed, especially under tight actuation limits or when the predicted state is far inside the unsafe set. Slack-based fallbacks weaken guarantees and the paper lacks a systematic analysis of infeasibility rates and recovery.\n\n- Limited robustness treatment to uncertainty and mismatch (estimation noise, delays, unmodeled dynamics, moving constraints). The deterministic guarantees don’t provide ISS/chance-constrained bounds, so small errors could accumulate into violations.\n\n- Potential distributional drift from repeated corrections: even with vanishing scaling, the safety projection can bias trajectories away from the learned flow over long horizons, reducing diversity and pushing states out of the model’s training support.\n\n- Empirical scope and baselines: comparisons focus on diffusion backbones; fewer head-to-head results versus strong control baselines (e.g., MPC + CBF-CLF-QP, Neural-ODE/CNF + CBF filters) and no on-hardware validation to substantiate real-time claims."}, "questions": {"value": "- Can you quantify the practical bottlenecks of SafeDiffuser that specifically motivated your design choices (e.g., per-step QP latency, end-to-end wall clock, trap rates), and state the a priori performance targets you aimed to hit so readers can judge whether the reported gains meet those targets?\n\n- What conditions ensure feasibility of the CBF-QP in the correction step under tight actuation limits or when the predictor proposes states deep inside the unsafe set, and what is the formal recovery strategy when the QP is infeasible (e.g., backtracking the rollout, horizon extension, or schedule adjustment)?\n\n- How sensitive is performance and safety to the vanishing time-scaling schedule and the choice of the class-K function α(·), and can you provide ablations and practical tuning guidance that demonstrate stable behavior near boundaries without excessive conservatism or reward loss?\n\n- To what extent do repeated corrections induce distributional drift away from the nominal flow, and can you report quantitative divergence metrics (e.g., energy distance or trajectory FID) alongside impacts on trajectory diversity and long-horizon returns?\n\n- Could you include baselines beyond diffusion backbones—such as MPC with CBF-CLF-QP, Neural-ODE/CNF planners with a CBF filter, and diffusion with a single-shot CBF projection—to isolate how much of the gain arises from the prediction–correction plus vanishing mechanism rather than from the backbone swap alone?\n\n- How robust are the proposed guarantees in the presence of state-estimation errors, dynamics mismatch, delays, or moving constraints, and can you provide an ISS or chance-constrained analysis (or targeted experiments) that bounds violation probability under realistic sensing and model errors?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ypey9PJnpX", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_DQsF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_DQsF"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760525279422, "cdate": 1760525279422, "tmdate": 1763036031381, "mdate": 1763036031381, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces SafeFlowMatcher, a novel planning framework that integrates Flow Matching (FM) with Control Barrier Functions (CBFs) to achieve both real-time efficiency and certified safety in robotic path planning. The core of SafeFlowMatcher is a two-phase Prediction-Correction (PC) integrator. The prediction phase efficiently generates a candidate path using learned FM dynamics without safety interventions. The subsequent correction phase refines this path by (i) reducing integration errors through vanishing time-scaled flow dynamics (VTFD) and (ii) enforcing hard safety constraints using a CBF-based quadratic program (QP), minimally perturbing the vector field. This decoupling strategy prevents distributional drift and mitigates \"local trap\" problems often encountered by other certification-based generative planners. Extensive experiments on Maze2D navigation and high-dimensional locomotion tasks demonstrate that SafeFlowMatcher outperforms existing diffusion- and FM-based baselines in terms of safety (zero trap rate), planning performance (higher scores), path quality (smoother paths), and computational efficiency. Ablation studies confirm the necessity of both prediction and correction phases and the effectiveness of VTFD."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper proposes a unique combination of Flow Matching for efficient path generation and Control Barrier Functions for formal safety guarantees. This addresses a critical need in robotic planning for both speed and reliability. The two-phase PC integrator is a significant contribution. By separating the initial path generation (prediction) from safety enforcement (correction), SafeFlowMatcher avoids issues like distributional drift and local traps that plague other methods that attempt to enforce safety on intermediate latent states.\n2.  The paper provides rigorous mathematical proofs for the forward invariance of a robust safe set and finite-time convergence to this set. This theoretical backing strengthens the credibility of the proposed safety guarantees.\n3. By leveraging Flow Matching, SafeFlowMatcher demonstrates efficiency comparable to or better than diffusion-based methods, which often require many more sampling steps. The ability to achieve high performance with a small number of function evaluations (e.g., $T^p=1$) is a notable advantage."}, "weaknesses": {"value": "1.  The paper highlights the reliance on well-defined CBFs. Could the authors elaborate on the practical challenges and potential solutions for designing or learning CBFs for more complex, dynamic, or unstructured real-world robotic environments beyond the relatively simple constraints presented? Are there any ongoing efforts to integrate CBF learning within SafeFlowMatcher?\n2. Given that hyperparameter tuning is identified as future work, can the authors provide more insight into the sensitivity of SafeFlowMatcher's performance to the choice of $\\epsilon$, $\\rho$, $\\delta$, $\\alpha$, and $t_w$? Are there any heuristics or adaptive strategies that could be employed to simplify this tuning process for new tasks or environments?\n3. While closed-form QP solutions are mentioned for simple cases, how does the computational overhead of the QP solver scale with a larger number of waypoints ($H$) or a more extensive set of complex safety constraints? Have the authors encountered scenarios where the QP solving time becomes a bottleneck, and what strategies could mitigate this?\n4. The paper mentions developing a guidance-free version as future work. Could the authors expand on the specific challenges in achieving this (e.g., in terms of exploration, multimodal goal reaching) and their initial thoughts on how to approach such a development?\n5. Lemma 1 assumes a symmetric, zero-mean distribution for the prediction error $\\epsilon$. How robust is SafeFlowMatcher to deviations from this assumption, particularly if the prediction errors are biased or exhibit heavy tails? What are the practical implications of such deviations on safety guarantees and performance?\n6. While Naive Safe FM serves as a baseline, could the authors provide a more in-depth discussion on why directly applying safety constraints from the beginning leads to a high trap rate? A clearer theoretical or empirical breakdown of the failure modes of Naive Safe FM would further strengthen the argument for the PC integrator.\n7. For the vanishing time-scaled flow dynamics, the optimal $\\alpha=2$ was found empirically. Is there a deeper theoretical justification for this specific value or for the general range of $\\alpha$ that provides a good trade-off between accelerated convergence and stability?\n8. The current experimental validation focuses on maze navigation and locomotion. How would SafeFlowMatcher perform on more complex robotic manipulation tasks (e.g., pick-and-place with moving obstacles) that typically involve higher-dimensional state and action spaces, more intricate safety constraints, and potentially longer planning horizons?"}, "questions": {"value": "See Weaknesses^"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "pRlJLZfEfM", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_gaEu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_gaEu"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761736171562, "cdate": 1761736171562, "tmdate": 1762942902268, "mdate": 1762942902268, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces SafeFlowMatcher, a planning framework that integrates conditional flow matching with control barrier functions to generate trajectories that are efficient to sample and provably converge to a robust safe set. The method addresses a key limitation of flow-matching and diffusion planners, which produce high-quality paths but lack safety control and can become trapped when constraints are enforced at each latent step.\nSafeFlowMatcher relies on a two-phase prediction-correction scheme. The prediction phase runs standard FM dynamics to propose an unconstrained path, while the correction phase refines it using a vanishing time-scaled FM field and a CBF-based quadratic program that projects waypoints back into the safe set, ensuring finite-time convergence under the derived barrier conditions.\nOn the theoretical side, the authors restate finite-time CBF results and provide a flow-invariance certificate guaranteeing safety for the corrected flow. Empirically, the framework is validated on Maze2D and MuJoCo locomotion. It consistently outperforms FM, DDIM, and SafeDiffuser-based baselines on the Maze2D environment, achieving higher scores while ablations confirm the role of each phase and the vanishing-scale mechanism."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper identifies a genuine mismatch in existing “safe” generative planners: safety is typically enforced at intermediate latent steps of the denoising or flow-matching process, although only the final trajectory is executed. This “semantic misalignment” is addressed cleanly by decoupling generation and certification: safety is enforced only in the correction phase of the flow. This clarification is timely and relevant for the diffusion/FM-for-planning community.\n- The prediction-correction (PC) scheme is well motivated. The prediction phase runs unconstrained FM dynamics to avoid distributional drift, while the correction phase refines the path using a vanishing time-scaled FM vector field and a one-constraint CBF-QP projecting waypoints into the safe set. The finite-time safety guarantee applies to this corrected flow. The ablation in section 4.2 (prediction-only / correction-only / full PC) clearly supports this design.\n- The QP correction is computationally light: the authors define a convex problem with a single CBF constraint and closed-form projection, countering concerns about runtime overhead. The running time reported in the experiments shows that this approach is quite fast compared to other SOTA methods.\n- The authors performed a serious experimental analysis and comparisons by comparing their approach to a wide variety of baselines (for which they have themselves reproduced the results). Experiments are coherent with the claims and SafeFlowMatcher always achieves a postivie barrier function with zero trap rate, outperforming all baselines while remaining efficient."}, "weaknesses": {"value": "- On p.3, the authors introduce CBFs in their general control-affine form: $\\dot x = f(x)+g(x)u$, which normally presupposes known dynamics; in experiments, they seem not to use a physical model, but instead plug in analytic obstacle functions. This distinction is not clearly stated.\n- Definition 1 and Lemma 1 are written for general systems with Lipschitz $f,g$, but in practice, the “dynamics” is the FM vector field with vanishing scaling (cf. equation 10). The paper does state this in section 3.2, but the transition is quick. I think the authors should give a short explanation with intuitions; the CBF is not certified in the real environment, but on the generated flow. Furthermore, Definitions 1 and Lemma 1 should be more intuitively justified; currently, they are just \"dropped\" there without a clear explanation, which makes it difficult for the reader to understand their consequences and intuitive meanings.\n- I noticed some clarity issues: on page 3, line 108, some distribution over paths $q$ appears, but has not been introduced anywhere. I also found that, in the main text, the environments and the assumptions made on those environments were not well-specified. For instance, what is the state space and what are the dynamics of the $2$D maze? Does the method assume access to the exact dynamics or just to a dataset containing random trajectories? If this is the case, from where do they come? A short description of the environments and assumptions would help."}, "questions": {"value": "- Could you make explicit what you actually assume in the experiments? Am I correct that you do not know the environment transition dynamics and that the only environment-specific information you use is offline trajectories for FM training and analytic, differentiable obstacle/safety functions $b(x)$ with known centers and scales? Is there any case where you used the true simulator for $\\nabla b$? \n- In the maze experiments, are you conditioning FM on start-goal or only on start and letting it flow to the high-density goal region? Could you clarify what is actually fed to the network at inference time?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "NuaeQYjsUC", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_rRLo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_rRLo"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761838042677, "cdate": 1761838042677, "tmdate": 1762942902072, "mdate": 1762942902072, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes SafeFlowMatcher, a planning framework that aims to combine Flow Matching (FM) generative models with the certified safety of Control Barrier Functions (CBFs). The core contribution is a two-phase \"Prediction-Correction\" (PC) integrator. First, a \"Prediction\" phase uses the learned FM model to generate a candidate path in one or a few steps, without safety constraints. Second, a \"Correction\" phase refines this path using a proposed \"vanishing time-scaled flow dynamics\" (VTFD) and a CBF-based quadratic program (QP) to enforce safety and finite-time convergence to the safe set. The authors claim this two-phase approach decouples generation from certification, thereby avoiding the \"local trap\" problem. The method is evaluated on 2D maze navigation and locomotion tasks, showing improved safety and task performance and a zero \"trap rate\" compared to baselines like SafeDiffuser."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper identifies a clear and important problem in safe generative planning. Applying hard safety constraints (like CBFs) directly within the sampling loop of a generative model (like diffusion or flow matching) can distort the learned dynamics, leading to \"distributional drift\" and \"local trap\" failures. The goal of decoupling generation from certification is well-motivated. \n\n2. To further enhance sampling stability in the correction phase, this paper proposes a time-scaled flow dynamics method to contract the prediction errors and mitigate drifting.\n\n3. The paper compares the proposed method with multiple baselines and conducts various ablation studies to demonstrate the efficiency and effectiveness of SafeFlowMatcher."}, "weaknesses": {"value": "1. The theoretical guarantees for the correction phase (Lemma 2 and 3) rest on strong assumptions about the prediction error $\\epsilon$ (e.g., symmetric, zero-mean, and a locally strongly convex negative log-density). There is no empirical validation to show that the actual integration error from a deep FM model satisfies these convenient properties.\n\n\n\n2. In the experiments (Table 1), SafeFlowMatcher achieves zero trap rate. How does the proposed method guarantee the low trap rate? Can the method consistently achieve a zero trap rate in some higher-dimensional or more complex navigation tasks? Are there any theoretical guarantees?\n\n\n\n3. The current evaluation only includes three simple environments: one maze and two locomotion environments. Can the author provide experimental results on robot manipulation tasks as well? For example, the environment used in SafeDiffuser might be a good starting point.\n\n\n\n4. In Algorithm 1, SafeFlowMatcher first samples a trajectory and solves QP in a double for-loop. The authors report a very fast sampling time of ~4.7ms. To better understand the efficiency of the method, it would be more informative to report the computation time of both phases.\n\n\n\n5. Does the QP always have a solution? What will Algorithm 1 do if the QP can not be solved? Will the safety guarantee still be satisfied in that case? \n\n\n\n6. Does the method always require a specific function $b$ as in equation (6)? How to obtain $b$ for environments with irregular geometry, agents with high-dimensional state space, or robots with image-based observation?\n\n\n\n7. In line 214, \"that places $\\tau_0^p$ sufficiently close to ...\", should the term here be $\\tau_1^p$?"}, "questions": {"value": "See the weakness above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "telqSRh1xG", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_ZPuJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_ZPuJ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762539237610, "cdate": 1762539237610, "tmdate": 1762942901846, "mdate": 1762942901846, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents SafeFlowMatcher, a novel framework for safe robotic path planning that\neffectively couples generative Flow Matching (FM) with Control Barrier Functions (CBFs). The\nauthors identify a key problem with existing generative planners: they either lack formal safety\nguarantees or, if certification-based, suffer from local trap problems where interventions distort\nthe generative process and cause the plan to fail."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "● Paper is very well written and easy to understand\n● The key idea of a two-phase Prediction-Correction (PC) integrator is both simple and\nhighly effective. Decoupling the initial path generation from the subsequent safety\ncorrection elegantly solves the local trap problem\n● The paper provides a formal barrier certificate and a proof of finite-time convergence -\nstrong mathematical guarantees.\n● The method is validated on maze navigation and high-dimensional locomotion tasks,\ndemonstrating superior performance across key metrics: safety, path quality, and\nefficiency"}, "weaknesses": {"value": "● The paper's baselines are exclusively generative models (diffusion- and FM-based) .\nWhile this is the direct field of contribution, classical sampling- or optimization-based\nplanners are still the gold standard in many robotics applications. A comparison against a\nstrong classical baseline (e.g., an optimization-based planner) would have provided a\nbetter picture of the practical performance."}, "questions": {"value": "● How does the framework handle dynamically changing environments? The CBF-QP is\nsolved at each control step, which seems well-suited for this, but the underlying FM\nmodel is trained to generate paths based on a static map. How would the model perform\nif an obstacle changed position mid-rollout?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "wxZe5w39jq", "forum": "refcXHU1Nh", "replyto": "refcXHU1Nh", "signatures": ["ICLR.cc/2026/Conference/Submission24026/Reviewer_Jozp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24026/Reviewer_Jozp"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission24026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762662994321, "cdate": 1762662994321, "tmdate": 1762942901664, "mdate": 1762942901664, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}