{"id": "RMRmPKo5X3", "number": 12889, "cdate": 1758211239606, "mdate": 1762924207156, "content": {"title": "GACET: A Graph-Aware Cross-Domain EEG Transformer with the CD-MWL Benchmark", "abstract": "Robust generalization of brain state decoding across days remains a grand challenge for brain-computer interfaces (BCIs), throttling the real-world deployment of applications like mental-workload (MWL) estimation. This long-standing problem has been difficult to address, largely due to the scarcity of public corpora suitable for rigorous long-term evaluation. To establish the first robust benchmark for this challenge, we introduce CD-MWL, the longest public MWL dataset to date: 42 hours of EEG from 14 participants over three days. Building on this benchmark, we argue that true generalization requires models that are not only high-performing but also neuroscientifically plausible. We therefore propose GACET, a Graph-Aware Cross-domain EEG Transformer that achieves superior generalization by dynamically learning the brain's underlying functional connectivity in a neuroscientifically plausible manner. Through topology-aware message passing on this learned graph, GACET not only delivers significant performance gains over all state-of-the-art methods but also provides a transparent window into its decision-making process. Crucially, we demonstrate that the model's learned connectivity patterns align with established neuroscience, establishing a powerful, evidence-based link between its interpretability and robust performance. All data, code, training logs and a one-command reproduction script are publicly available at https://anonymous.4open.science/r/GACET-B6F8.", "tldr": "This paper introduces CD-MWL, the largest publicly available multi-day EEG mental-workload dataset, and GACET, a graph-aware transformer that achieves state-of-the-art cross-days brain-state decoding.", "keywords": ["Neuroscience", "Computational Neuroscience", "BCI", "EEG"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/c4ad384ea0ab31e4698b9bb62815f978d856b9aa.pdf", "supplementary_material": "/attachment/ac6609a9e62c38c72e43fce9a3d10ad71285dc78.zip"}, "replies": [{"content": {"summary": {"value": "The authors introduced an EEG-based mental workload (MWL) assessment dataset comprising 14 participants, which remains relatively small compared to established EEG benchmarks in other domains, such as motor imagery (e.g., the EEG Motor Movement/Imagery Dataset, https://archive.physionet.org/pn4/eegmmidb/, with 109 participants). In addition to the MWL dataset, the authors proposed a novel architecture, a graph-aware cross-domain EEG Transformer, that integrates spectral-temporal features through topology-aware graph reasoning. However, no explainability is illustrated in the current manuscript, though the authors claimed that their model’s learned connectivity patterns align with established neuroscience."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "[1] A new dataset for MWL (5 difficulty levels) with a detailed data collection procedure\\\n[2] Cross-day evaluation and cross-subject/leave-one-subject-out evaluation"}, "weaknesses": {"value": "[1] Table 1 – The authors are encouraged to specify the number of sessions conducted per participant.\\\n[2] CD-MWL – The relatively small number of participants in the proposed dataset limits the ability to thoroughly evaluate both subject-independent and subject-dependent cross-session performance.\\\n[3] Cross-day generalization – The authors should clearly clarify how cross-day generalization differs from cross-session generalization.\\\n[4] Related Works – The discussion of existing deep learning approaches for brain state decoding is limited. The authors are encouraged to include additional relevant studies to provide a more comprehensive overview of the field.\\\n[5] Figure 2 – It is recommended that the authors visually demonstrate the dynamic adjacency formulation in Figure 2 rather than only presenting mathematical equations."}, "questions": {"value": "[1] What exactly are Feature 1 and Feature 2 in Figure 2? The authors are encouraged to clearly indicate the type of the feature, e.g., frequency, time, etc.\\\n[2] What exactly is the built graph? The quality of the manuscript should be substantially improved.\\\n[3] Many notations/parameters are unclear in the manuscript. For example, how are the “temperature/gating parameters” learned in Equations 7 and 8?\\\n[4] Why did the authors add Gumbel noise while building the graph? Why didn’t the authors use a fixed graph for a fixed EEG nodes? Equation 10 is very confusing. The authors should provide more details."}, "flag_for_ethics_review": {"value": ["Yes, Responsible research practice (e.g., human subjects, annotator compensation, data release)"]}, "details_of_ethics_concerns": {"value": "The authors conducted human experiments with high workload conditions. Side effects, such as depression, stress, and unhappiness, should be considered, or, a non-harmful acknowledgement from all participants should be provided."}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6kP9AwXoR4", "forum": "RMRmPKo5X3", "replyto": "RMRmPKo5X3", "signatures": ["ICLR.cc/2026/Conference/Submission12889/Reviewer_cxJ8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12889/Reviewer_cxJ8"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12889/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761408867127, "cdate": 1761408867127, "tmdate": 1762923672374, "mdate": 1762923672374, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "ZrKiPmZVvo", "forum": "RMRmPKo5X3", "replyto": "RMRmPKo5X3", "signatures": ["ICLR.cc/2026/Conference/Submission12889/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12889/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762924204460, "cdate": 1762924204460, "tmdate": 1762924204460, "mdate": 1762924204460, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces CD-MWL, the largest public EEG dataset to date for cross-day mental-workload (MWL) assessment, comprising 42 hours of EEG recordings from 14 participants over 3 days. Building on this benchmark, the authors propose GACET (Graph-Aware Cross-domain EEG Transformer), an interpretable neural architecture designed to improve cross-day and cross-subject generalization in brain-computer interface (BCI) tasks.\n\nGACET integrates three core modules: 1. Spectral-temporal feature extraction via differential entropy and sample entropy. 2. Axial Attention Fusion (AAF) to bidirectionally fuse features across frequency and entropy domains. 3. Dynamic Graph Transformer Conv (DGTConv), which learns task-specific functional connectivity using a Gumbel-Softmax-based adjacency construction and topology-aware message passing.\n\nExtensive experiments across multiple EEG datasets (COG_BCI and CD-MWL) and tasks (MATB-II and N-back) demonstrate that GACET outperforms recent SOTA baselines (MAET, TSLANet, LaBraM, SFT-Net, MCA) by 1–4 % in accuracy and F1 under both cross-day and cross-subject settings. Ablation studies confirm the complementary roles of AAF and DGTConv, and connectivity analyses show that the learned graphs align with known fronto-parietal neural networks, supporting the claim of neuroscientific plausibility."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The CD-MWL dataset expands existing EEG MWL corpora in duration and session diversity, addressing the lack of standardized cross-day evaluation benchmarks.\n\n2. The integration of Axial Attention Fusion and Dynamic Graph TransformerConv blends feature-fusion and learned-connectivity reasoning in a unified, end-to-end framework.\n\n3. Comprehensive baselines, cross-day/subject protocols, and public release of code and logs.\n\n4. The writing is accessible, figures are informative, and the methodological flow is coherent and easy to follow."}, "weaknesses": {"value": "1. The citation in L466 indeed supports frontal-parietal connectivity as a core cognitive-control hub, but does not discuss central-region involvement or occipital connectivity under visual load. The Section 4.5 claim should therefore be narrowed to frontal and parietal regions or augmented with additional references addressing central and occipital roles.\n\n2. The authors claim that their benchmark and model exhibit strong generalization capabilities. However, the evaluation is limited to within-task (MWL) and primarily cross-time generalization. To substantiate the claim, additional experiments demonstrating cross-subject or, ideally, cross-dataset generalization are needed to validate broader transferability across EEG domains.\n\n3. Omission of recent GNN-based BCI models [1] weakens the “graph-aware” claim.\n\n\n[1] LGGNet: Learning From Local-Global-Graph Representations for Brain–Computer Interface"}, "questions": {"value": "1. Are the learned adjacency matrices consistent across subjects and runs?\n\n2. Does “Cross-Domain” mean cross-day, cross-subject, or cross-task?\n\n3. Could you provide a quantitative metric (e.g., ROI correlation) showing alignment with known FPN connectivity?\n\n4. How does DGTConv’s computational cost compare with standard attention layers for real-time BCI use?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "YaYsUEjxgj", "forum": "RMRmPKo5X3", "replyto": "RMRmPKo5X3", "signatures": ["ICLR.cc/2026/Conference/Submission12889/Reviewer_WKV3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12889/Reviewer_WKV3"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12889/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761858722402, "cdate": 1761858722402, "tmdate": 1762923672096, "mdate": 1762923672096, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a model (GACET) and a dataset (CD-MWL) to address the critical challenge of cross-day generalization in EEG-based mental workload estimation. The dataset aims to solve the challenges that existing EEG datasets are limited by short durations, low channel counts, or a lack of cross-day data. The proposed GACET aims to solve the problem that traditional models for EEG decoding fail to capture the brain’s dynamic functional connectivity. GACET integrates spectral-temporal feature extraction (DE + SampEn), axial attention fusion (AAF), and dynamic graph Transformer convolution (DGTConv). Empirical studies on the proposed datasets show that GACET outperforms SOTA baselines (e.g., LaBraM, TSLANet, MAET)."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The contribution is multi-facet, including a novel dataset and an interpretable framework.\n\n- The authors released the CD-MWL dataset, covering 14 subjects, 3 days, and 42 hours of EEG mental-workload data. This dataset fills the gap in public benchmarks for multi-day/cross-day EEG mental-workload estimation research. The data, code, training logs, and one-click reproduction scripts are all open-source, enhancing research reproducibility.\n\n- The proposed GACET model not only achieves strong performance in cross-day/cross-session tasks but also provides interpretable brain-network structures via dynamically learned graphs."}, "weaknesses": {"value": "- In section 4.5, the author provides evidence that the importance of brain regions learned by GACET aligns with neurophysiological prior. However, it is different from functional connectivity, which reflects how the information should be gathered from different regions. Hence, it does not mean that GACET is Interpretable, as most existing EEG models tend to assign higher weights to task-relevant brain regions.  \n\n- The authors validate the model on their own dataset (Dataset 2) and public dataset (Dataset 1) and in different settings (cross-time, cross-day, cross-subject). The author has addressed their difference in lines 101-108. However, the experimental conclusions and setups are highly similar, making it difficult to justify the necessity of constructing their own dataset. \n\n- The experiments still lack in-depth analysis. For example, how is the performance in different levels of tasks (may lack a confusion matrix) ?"}, "questions": {"value": "- Could you further explain why, in Table 5, M4 underperforms M2 and M3? What is the meaning of \"module mismatch\"?\n- According to the performance across different subjects, the average performance of the proposed method depends more on a few low-performance subjects. Does this mean that the proposed method fails with certain subjects, or that all methods perform poorly on these subjects? Would such a situation undermine the significance of designing this method and affect the evaluation results?\n- Could you further explain the different settings, e.g., N-back and cross-time? I suggest summarizing different settings in a figure or in a table."}, "flag_for_ethics_review": {"value": ["Yes, Privacy, security and safety", "Yes, Responsible research practice (e.g., human subjects, annotator compensation, data release)"]}, "details_of_ethics_concerns": {"value": "Privacy and security of the EEG data collected."}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "mJRtNWhLJo", "forum": "RMRmPKo5X3", "replyto": "RMRmPKo5X3", "signatures": ["ICLR.cc/2026/Conference/Submission12889/Reviewer_7NFo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12889/Reviewer_7NFo"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12889/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761967031499, "cdate": 1761967031499, "tmdate": 1762923671706, "mdate": 1762923671706, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}