{"id": "s0Y6RBdN28", "number": 20450, "cdate": 1758306282880, "mdate": 1759896977091, "content": {"title": "Spatial Deconfounder: Interference-Aware Deconfounding for Spatial Causal Inference", "abstract": "Causal inference in spatial domains faces two intertwined challenges: (1) unmeasured spatial factors, such as weather, air pollution, or mobility, that confound treatment and outcome, and (2) interference from nearby treatments that violate standard no-interference assumptions. While existing methods typically address one by assuming away the other, we show they are deeply connected: *interference reveals structure* in the latent confounder.\nLeveraging this insight, we propose the **Spatial Deconfounder**, a two-stage method that reconstructs a substitute confounder from local treatment vectors using a conditional variational autoencoder (CVAE) with a spatial prior, then estimates causal effects via a flexible outcome model. We show that this approach enables nonparametric identification of both direct and spillover effects under weak assumptions—without requiring multiple treatment types or a known model of the latent field.\nEmpirically, we extend `SpaCE`, a benchmark suite for spatial confounding, to include treatment interference, and show that the Spatial Deconfounder consistently improves effect estimation across real-world datasets in environmental health and social science. By turning interference into a multi-cause signal, our framework bridges spatial and deconfounding literatures to advance robust causal inference in structured data.", "tldr": "We use spatial interference as signal to deconfound spatial causal effects.", "keywords": ["causal inference", "spatial data", "unobserved confounding", "interference", "spillover effects", "observational studies"], "primary_area": "causal reasoning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/21a0d60c707522a576ad5d9cc49794dc1659feae.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposed a new method, CVAE-SPATIAL+ for spatial causal inference with two challenges in spatial settings: localized interference (spillovers from neighbors) and unobserved spatial confounding (latent fields like meteorology or socioeconomic context). This is a two-stage method. The key idea is to treat interference as a multi‑cause signal: by looking at a unit’s treatment/covariates together with its neighbors’ treatments/covariates, a CVAE is trained for recovering a smooth substitute confounder, then estimate direct and spillover effects with a flexible outcome regression model (e.g., U‑Net/GNN architecture). An important “latent‑field sufficiency” assumption is proposed, which shows that the Z representation of the observed assignment/covariates that is equivalent to the latent field for the purpose of adjustment. The paper provides results for both effects under localized confounding and spatial confounding and evaluates the approach on an extended SpaCE semi‑synthetic benchmark. Across air‑quality/health and PM₂.₅‑components tasks, the proposed method reduces standardized absolute bias relative to spatial econometric, spline/RSR, matching, GCNN, and U‑Net baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThe methodology is pretty clear and straightforward. Easy to understand and follow.\n2.\tUsing a Gaussian–Markov random‑field prior over the grid Laplacian to enforce smoothness is very reasonable\n3.\tMethods comparison is comprehensive, the proposed method shows clear advantage over existing methods versus S2SLS‑LAG1, SPATIAL/SPATIAL+, GCNN, DAPSM"}, "weaknesses": {"value": "1.\tEspecially what additional information has CVAE learned in Z. Since all inputs are also used in the second stage.\n2.\tTheoretical analysis is relatively weak, the intuition is not clear why adding a CVAE is better than just use SPATIAL+.\n3.\tThe radius is set to only 1 or 2 in experimental settings, which may be quite impractical in real applications. The real data typically reply on irregular graphs."}, "questions": {"value": "1.\tAssumption 4 is very strong and even impractical given unmeasured confounder. Could the authors provide intuition and failure modes and show robustness when this is violated?\n2.\tIn Theorem 1, How necessary is the additivity for Z? This also seems very strong assumption since Z is essentially a representation of A,As,X,Xs.\n3.\tSome deeper analysis is needed to show intuition of what type of additional information contained in the Z that is learned and contribute to the performance gain.\n4.\tA systematic sensitivity analysis over neighborhood radius r is very necessary.\n5.\tHow data size and dimensionality of X affect the performance of the new method?\n6.\tHow the dimension of Z affect the final results?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "OlwwOGg2xv", "forum": "s0Y6RBdN28", "replyto": "s0Y6RBdN28", "signatures": ["ICLR.cc/2026/Conference/Submission20450/Reviewer_yeAS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20450/Reviewer_yeAS"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761605246753, "cdate": 1761605246753, "tmdate": 1762933895074, "mdate": 1762933895074, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the problem of spatial confounding by proposing a method to recover an unobserved spatial confounder from observed neighbor treatments and covariates. The core methodology employs a Conditional Variational Autoencoder (CVAE), where the latent variable is intended to represent this hidden confounder. \n\nFor identification, the paper relies on a key assumption (Assumption 4) that extends a single-site ignorability condition to hold uniformly across all sites if it holds for some. The proposed estimator's validity is assumed directly (Assumption 5), with a reference made to a multi-cause confounding model by Wang and Blei (2019) as a conceptual analogy. The paper's setting is ambitious, aiming to handle spatial confounding in a broad context."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- Relatively well written.\n- Transparent about its assumptions.\n- Ambitious general problem setting and goals."}, "weaknesses": {"value": "### 1: Estimation\nThe paper assumes away the core difficulties of estimation. It directly posits that the CVAE estimator is valid (Assumption 5), implying the hidden confounder can be fully recovered. However, a valid estimator must be tied to a specific identification strategy. Even with identification in hand, designing a valid estimator is highly nontrivial—especially for VAEs, where identifiability remains an active research area [1, 2]. The current approach mirrors the CEVAE paper [3], which has faced similar critiques [4, 5]. \n\nThe reference to Wang and Blei (2019) does not substantiate the estimator's validity. The proposed estimator diverges from the identification and modeling in Wang and Blei: the multi-cause structure it alludes to is merely a vague analogy, and the VAE does not leverage their factor model.\n\nThe estimator offers limited novelty and relies on arbitrary architecture choices. The broad idea of a VAE-based causal effect estimator appears in numerous works [2, 3] (see references in [2, 5] for more examples), and this paper contributes nothing new. Moreover, the loss in eq. (8) leaves unclear what observational distribution the variational inference targets and how it factorizes. It is also unclear why the encoder takes its current form rather than other viable options. These details matter, as they encode the independence relationships assumed by the inference procedure.\n\n### 2: Identification\nAssumption 4, crucial for identification, is unclear and appears unrealistic. It states that if eq. (14) (ignorability?) “holds for some sites, then it holds uniformly across sites.” This is unclear compared to standard ignorability of joint exposure given observed covariates. First, it should be explicitly stated as an additional assumption that single-site ignorability (eq. 14) must hold. The paper seems to imply that ignorability is typically assumed across all sites, but it fails to explain why a \"some sites, then uniformly across sites\" condition would hold in practice—an example (perhaps based on Figure 2) would help.\n\nThe confounding/spatial structure is underexplained. This seems to tie back to Assumption 4, but it reads more like \"global sharing\" than true structure. Readers would expect a graphical model, or some algebraic/analytical structure in the functional equations, to substantiate it.\n\n### 3: Missing Related Work\nKey omissions include [2, 5], which develop general ideas for identifiable deep models, particularly *conditional VAEs*, that could bolster the current work. Specifically, they include an application to network deconfounding that exploits spatial information from neighbor cities—relevant to spatial deconfounding here. They also analyze and demonstrate the role of the $\\beta$ parameter, which appears in this paper. See further applications to real-world health data in [6].\n\n\n### Minor Points\n- \"Exposure\" and \"treatment\" appear to be used interchangeably, which is confusing. Clarify or standardize to one term.\n\n### References\n[1] Khemakhem, Ilyes, et al. \"Variational autoencoders and nonlinear ICA: A unifying framework.\" *International Conference on Artificial Intelligence and Statistics*. PMLR, 2020.\n\n[2] Wu, Pengzhou Abel, and Kenji Fukumizu. \"\\beta-Intact-VAE: Identifying and Estimating Causal Effects under Limited Overlap.\" *International Conference on Learning Representations* (2022).\n\n[3] Louizos, Christos, et al. \"Causal effect inference with deep latent-variable models.\" *Advances in Neural Information Processing Systems* 30 (2017). [Early work, *not* recommended]\n\n[4] Rissanen, Severi, and Pekka Marttinen. \"A critical look at the consistency of causal estimation with deep latent variable models.\" *Advances in Neural Information Processing Systems* 34 (2021): 4207-4217.\n\n[5] Wu, Pengzhou, and Kenji Fukumizu. \"Towards principled causal effect estimation by deep identifiable models.\" *arXiv preprint arXiv:2109.15062* (2021).\n\n[6] Ma, Wenao, et al. \"Treatment outcome prediction for intracerebral hemorrhage via generative prognostic model with imaging and tabular data.\" *International Conference on Medical Image Computing and Computer-Assisted Intervention*. 2023."}, "questions": {"value": "Please refer to the points in Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7jyBROdGLz", "forum": "s0Y6RBdN28", "replyto": "s0Y6RBdN28", "signatures": ["ICLR.cc/2026/Conference/Submission20450/Reviewer_2eqm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20450/Reviewer_2eqm"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761652690745, "cdate": 1761652690745, "tmdate": 1762933894070, "mdate": 1762933894070, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes the Spatial Deconfounder, a two-stage framework for spatial causal inference that handles both unmeasured spatial confounders and interference (spillovers) between neighboring units. It treats the vector of a site’s own and neighbors’ treatments as a multi-cause signal and uses a CVAE with a spatial prior to reconstruct a smooth substitute confounder; this proxy is then fed into a flexible outcome model (e.g., U-Net/GNN) to estimate direct and spillover effects via plug-in contrasts. Under localized interference, positivity, and a weak “latent-field sufficiency” assumption, the authors show nonparametric identification of both effects without specifying a parametric latent-field model. Empirically, they extend the SpaCE benchmark to include interference and demonstrate, on environmental health and social-science datasets, that Spatial Deconfounder variants consistently reduce bias versus spatial econometric, spline/RSR, matching, and GNN baselines—while uniquely recovering spillover effects. Conceptually, the work reframes interference from a nuisance into a source of information for uncovering hidden spatial structure."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper tackles unmeasured spatial confounding and localized interference together and establishes identifiability of both direct and spillover effects under spatial consistency, spatial positivity, localized interference, and a latent-field sufficiency assumption.\n\n- The paper relaxes full ignorability by allowing an unobserved latent spatial field while only requiring that purely local confounders are observed, formalizing this with a latent-field sufficiency condition that is plausible for lattice-structured data.\n\n- The paper provides explicit, nonparametric identification expressions for the direct and spillover effects, which anchor the subsequent estimation strategy.\n\n- The estimation procedure cleanly separates confounder reconstruction from outcome modeling by using an interference-aware CVAE with a Gaussian-Markov random-field prior to recover a smooth substitute confounder, and then plugging this proxy into flexible outcome models such as U-Nets or GNNs."}, "weaknesses": {"value": "1/ The approach relies critically on accurate reconstruction of the latent confounder via a CVAE; if the substitute confounder is poorly recovered, both direct and spillover effect estimates can be biased. can the authors quantify how estimation error in the latent proxy translates into bias or variance of the effect estimators?\n\n2/ As a VAE-based method, the assignment model is vulnerable to posterior collapse and latent non-identifiability, which could yield an uninformative latent and ineffective adjustment. What concrete safeguards (e.g., KL warm-up schedules, mutual-information terms, decoder constraints) are used, and how often do collapse diagnostics fail in practice?\n\n3/ The identifiability story ultimately assumes a \"sufficient\" latent field and that the learned proxy recovers a valid transformation of it; this is a strong modeling assumption at the learning stage. Can the authors provide formal or empirical evidence that their training procedure consistently recovers an informative proxy under realistic misspecification?\n\n4/ Performance may be sensitive to hyperparameters that directly affect identifiability and collapse (e.g., \\beta in the KL term, temperature or strength of the spatial prior). Do the results remain stable under a systematic sensitivity analysis over these hyperparameters?\n\n5/ The spatial smoothness prior (e.g., GMRF) imposes a particular structure on the latent field; if the true confounding varies non-smoothly or anisotropically, the proxy may be biased. Have the authors evaluated robustness to misspecified spatial priors (non-stationary/anisotropic fields, sharp boundaries)?\n\n6/ The localized-interference assumption is central; if interference extends beyond the specified neighborhood, the multi-cause signal may be mis-modeled and the recovered latent may absorb spillovers rather than confounders. How sensitive are estimates to enlarging or shrinking the interference neighborhood, and do the authors provide misspecification experiments?\n\n7/ The method’s benefits rely on interference providing a strong multi-cause signal; in sparse treatments or weak neighbor correlations, the signal may be too weak to recover the latent reliably. Please present stress tests varying treatment sparsity and network density to map the regime where the approach is reliable."}, "questions": {"value": "Please refer to the questions in Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "I7we55QC8b", "forum": "s0Y6RBdN28", "replyto": "s0Y6RBdN28", "signatures": ["ICLR.cc/2026/Conference/Submission20450/Reviewer_jtsH"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20450/Reviewer_jtsH"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761941391455, "cdate": 1761941391455, "tmdate": 1762933893309, "mdate": 1762933893309, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work focuses on learning a model for which to perform causal inference in settings where covariates, treatments and outcomes live withing a spatial grid (such that neighboring variables can cause each other), and where the goal is to do so under: 1) interference, where treatments can affect outcomes in neighboring cells; and 2) spatially structured hidden confounding, which affects both the treatment and the outcome in that grid cell. The key idea of this work is that interference can be interpreted as a multiple-cause setting, for which they can leverage the work on the deconfounder framework to enable causal inference. Then, the authors propose a model based on conditional VAEs to build up a substitute of the hidden confounder, which is then fed to a potential outcome model that uses that substitute to perform causal inference. Moreover, the authors show causal identifiability results and empirically test their proposed method."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **S1.** The core idea behind this work is sound and interesting: Interference as observed in climate science applications can be interpreted as a multi-cause framework.\n- **S2.** The paper is well-motivated and well-written, with clear text, explanations, and walking the reader through all the process.\n- **S3.** The proposed model is sound, and the authors provide some causal identifiability results to back it up.\n- **S4.** All the assumptions are clearly stated and they are reasonable and sound.\n- **S5.** The experimental results show promise on the proposed model."}, "weaknesses": {"value": "- **W1.** I have a few concerns regarding assumptions:\n  - **W1.1.** Assumption 5 sounds a bit unrealistic, given that the model uses a Gaussian with positive variance to model the hidden confounder. I understand it can be interpreted in the \"nearly-deterministic\" setting if the variance is extremely small, but it needs to be ensured. ([This paper](http://arxiv.org/abs/2206.02416) could be of interest to the authors regarding this topic.)\n  - **W1.2.** Causal identifiability in theorem 1 relies on the hidden confounding being separable from the rest of variables in the structural equation.\n  - **W1.3.** Assumption 2 regard the learned hidden confounder as far as I understand, which depends on the model itself.\n- **W2.** Related work does not include any causal generative models, which are relevant and related with the current work. This includes  [NCMs](https://arxiv.org/abs/2107.00793), [CNFs](https://arxiv.org/abs/2306.05415), or [Diff-SCM](http://arxiv.org/abs/2202.10166), among others (see references therein). [Follow-up work](https://proceedings.mlr.press/v139/wang21c.html) of the deconfounder framework by the same lab should also be relevant.\n   - **W2.1.** Particularly related to this work is [DeCaFlow](https://arxiv.org/pdf/2503.15114), which combines the Deconfounder framework with Causal Normalizing Flows to perform causal inference under hidden confounding with a given yet general causal graph. DeCaFlow shares quite some similarities with the proposed model, where it also uses a encoder-decoder architecture to build a substitute of the hidden confounder, and trains with the ELBO. Indeed, DeCaFlow should be applicable in the experiments as a baseline. I'd suggest to relax the statements regarding being the \"first framework\" (line 70).\n- **W3.** Following up on the experiments, I have three main concerns.\n  - **W3.1.** I am not sure to understand what it means to \"mask\" some elements. Does it mean to zero-them out? Or to completely removed them from the model's input?\n  - **W3.2.** Similarly, I am not sure why the exogenous noise was introduced in equations 19 and 20 as additive, rather than as another input to the function $f$.\n  - **W3.3.** Finally, I am concerned about the selection of baselines, most of them looking rather weak as they are not causally-aware and, despite that, the differences in performance with the proposed model are not statistically significant, which concerns me the most. (Indeed, I find the bold numbering misleading.)"}, "questions": {"value": "- **Q1.** What do the authors mean by \"Posterior draws of Zs yield uncertainty bands.\" in line 263?\n- **Q2.** Are the samples of the treatment from the decoder in line 269 sampled using samples from the prior of z? or from the posterior?\n- **Q3.** Where are the predictive checks used? \n- **Q4.** What is $L_Y$ in remark 1?\n\n---\nOther feedback:\n- I'd be careful with using CVAE as name during the manuscript, as it closely resembles another causal inference work: [CEVAE](https://arxiv.org/abs/1705.08821).\n\nI'll happily increase my score after my concerns are addressed."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "s53xt9brQM", "forum": "s0Y6RBdN28", "replyto": "s0Y6RBdN28", "signatures": ["ICLR.cc/2026/Conference/Submission20450/Reviewer_UF6e"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20450/Reviewer_UF6e"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20450/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762126402265, "cdate": 1762126402265, "tmdate": 1762933892379, "mdate": 1762933892379, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}