{"id": "ScQ7irexRS", "number": 3769, "cdate": 1757516294725, "mdate": 1763199778675, "content": {"title": "Learning to Allocate Propagating Treatments: Maximize Uplift under Network Interference", "abstract": "Uplift modeling and treatment allocation are classical tasks in promotion marketing. Yet existing allocations ignore propagating treatments and network interference, where both outcomes and the propagation mechanism vary with peers’ treatment history, making policy value hard to estimate and optimize. We formalize a history-driven uplift objective with activation probability $g(\\bm Z_i^t,\\bm X_i)$ and outcomes that depend on neighbors’ treated states. Theoretically, we establish conditions for identification and provide finite-sample guarantees for policy evaluation under interference and model misspecification. Methodologically, we propose GUM-DT via a Monte-Carlo policy search: learn an ensemble of lightweight propagation models and an outcome model, and evaluate candidate allocations via double-robust (DR) estimators with IPW corrections. On synthetic networks, experiments demonstrate consistent gains over uplift allocations of GUM-DT, validating robustness and effectiveness.", "tldr": "Learning to Allocate Propagating Treatments: Maximize Uplift under Network Interference", "keywords": ["causality; network interfernece"], "primary_area": "causal reasoning", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/d1c13d68095e337f303c1942b8f0e218d685e73e.pdf", "supplementary_material": ""}, "replies": [{"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "LRJZZhdQ37", "forum": "ScQ7irexRS", "replyto": "ScQ7irexRS", "signatures": ["ICLR.cc/2026/Conference/Submission3769/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3769/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763199777773, "cdate": 1763199777773, "tmdate": 1763199777773, "mdate": 1763199777773, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a new method for optimizing treatment allocation when treatment effects can propagate through a network. In addition, the authors theoretically show the regret bound for their method."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The authors investigate an interesting and relevant problem: optimizing treatment allocation when treatment effects can propragate through the network."}, "weaknesses": {"value": "The authors seem to ignore some related works in areas that are highly relevant to their work. \n\n- I am not convinced that the problem they are investigating is different from Influence Maximization (IM), as the authors claim in the Introduction (Line 45). As I understand it, the goal in IM is to select a set of entities so as to maximize the total influence spread. While these papers often make assumptions regarding how influence spreads through the network that are different from the assumptions in this paper, I believe the core problem is the same. Additionally, there are a lot more relevant papers in IM that try to estimate influence spread or diffusion models using data. For example, [1-4].\n- There are a lot more relevant works related to Causal effect estimation in networks, such as [5-8]. Additionally, [9] even proposes a method for estimating treatment effects in networks over time, and [10] does something very similar to your work.\n\nOverall, the authors are very vague about the motivation for their modelling choices and how they implemented everything. Therefore, it is very hard to judge whether their method makes sense. Below, I list some issues.\n\n- I do not fully understand why you model $m$ directly as the sum of outcomes. Is there a reason you do not predict the outcomes of each entity separately and then sum them?\n\n- To encode the history, a time-channel GNN is used. However, there are no references or explanations about what this is and why this is the best choice. Related to this point, the authors use GNN to model $m$. I find it hard to understand how this works exactly. What are the inputs, operations, and outputs of this GNN?\n\n- The authors never describe how they implement the baselines used in the experiment. For example, what diffusion model is used vor CELF?\n\n- The data-generating process is only introduced on a very high level, making it impossible to understand how exactly it works.\n\n\n\n[1] Goyal, A., Bonchi, F., Lakshmanan, L.V., 2010. Learning influence probabilities in social networks, in: Proceedings of the third ACM International conference on Web search and data mining, pp. 241–250.\n\n[2] Saito, K., Nakano, R., Kimura, M., 2008. Prediction of information diffusion probabilities for independent cascade model, in: International conference on knowledge-based and intelligent information and engineering systems, Springer. pp. 67–75.\n\n[3] Aral, S., Dhillon, P.S., 2018. Social influence maximization under empirical influence models. Nature human behaviour 2, 375–382.\n[4] Bourigault, S., Lamprier, S., Gallinari, P., 2016. Representation learning for information diffusion through social networks: an embedded cascade model, in: Proceedings of the Ninth ACM international conference on Web Search and Data Mining, pp. 573–582.\n\n[5] Laura Forastiere, Edoardo M Airoldi, and Fabrizia Mealli. Identification and estimation of treatment and interference effects in observational studies on networks. Journal of the American Statistical Association, 116(534):901–918, 2021.\n\n[6] Song Jiang and Yizhou Sun. Estimating causal effects on networked observational data via representation learning. In Proceedings of the 31st ACM International Conference on Information 2022.\n\n[7] Elizabeth L Ogburn, Oleg Sofrygin, Ivan Diaz, and Mark J Van der Laan. Causal inference for social network data. Journal of the American Statistical Association, 119(545):597–611, 2024.\n\n[8] Weilin Chen, Ruichu Cai, Zeqin Yang, Jie Qiao, Yuguang Yan, Zijian Li, and Zhifeng Hao. Doubly robust causal effect estimation under networked interference via targeted learning. In International Conference on Machine Learning, 2024.\n\n[9] Song Jiang, Zijie Huang, Xiao Luo, and Yizhou Sun. Cf-gode: Continuous-time causal inference for multi-agent dynamical systems. In Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining, pp. 997–1009, 2023.\n\n[10] Daan Caljon, Jente Van Belle, Jeroen Berrevoets, and Wouter Verbeke. Optimizing treatment allocation in the presence of interference. European Journal of Operational Research, 2025."}, "questions": {"value": "I invite the authors to interpret the Weaknesses section as questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "A0GveHTuko", "forum": "ScQ7irexRS", "replyto": "ScQ7irexRS", "signatures": ["ICLR.cc/2026/Conference/Submission3769/Reviewer_hJ9z"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3769/Reviewer_hJ9z"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3769/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761913556913, "cdate": 1761913556913, "tmdate": 1762916978389, "mdate": 1762916978389, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The papers propose a double-robust estimator and a dynamic turning algorithm to estimate the causal policy outcome of a dynamic network model in an off-policy fashion. The authors formalize the causal setup for such a system whose potential outcome has both network interference and temporal dependency. The authors also provided some theoretical analysis on the performance of the proposed method."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The problem setup is interesting with both network inference and temporal dependence. The paper has its originality in putting it under a causal framework to assess its causal properties, including the identifiability of the causal estimands."}, "weaknesses": {"value": "The major weakness of this paper: \n1. The paper is hard to read and quite unclear. Although the authors list all assumptions and conditions, the paper is a stacking of definitions/assumptions/conditions with minimal explanations and elaboration on the subject. \n2. The paper's contribution to causal inference is marginal. I appreciate that the authors introduced the causal framework and discussed important causal conditions, including Rubin's potential outcome framework and ignorability assumption. But the paper is essentially working on an off-policy evaluation problem for temporal network data. \n3. Lots of assumptions/conditions/theorems lack justification. Some proofs are \"proof sketches\" and existing proofs are far from rigorous."}, "questions": {"value": "1. Assumption 2 implies that every node has a positive self-activation (i.e. it is activated when all its neighbors are not) probability? Is that expected? \n2. In Condition 1, I'm confused with the expression \"is a consistent estimator to some function\". Is it pointwise consistent, uniformly consistent or consistent under a functional norm？And why introduce the notations $g$ and $m$ here?\n3. In Proposition 2, does the \"consistency\" here means \"unbiasedness\"? In addition, a pointwise consistency of $\\hat g$ to $g$ does not guarantee unbiasedness nor L1 convergence. The latter requires a stronger condition like uniform integrability.  \n4. The second part of condition 3 is a strong assumption. Any justification on why it is plausible for it to be true?\n5. Proof of Theorem 1 is incomplete. Necessary elaboration is missing."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7lVVoZRQQx", "forum": "ScQ7irexRS", "replyto": "ScQ7irexRS", "signatures": ["ICLR.cc/2026/Conference/Submission3769/Reviewer_e2gV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3769/Reviewer_e2gV"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3769/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761973954709, "cdate": 1761973954709, "tmdate": 1762916978166, "mdate": 1762916978166, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the problem of causal uplift maximization in networks with propagating treatments, where interventions on one unit may influence others via network connections. To enable reliable off-policy evaluation in this setting, the authors develop a tailored doubly robust (DR) estimator that incorporates ensembling and targeted techniques to improve stability and performance under interference. Building on this estimator, they introduce a dynamic-greedy allocator that iteratively updates marginal treatment gains using the targeted DR oracle. The authors further provide theoretical guarantees for this allocation strategy"}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper presents a novel framework that effectively integrates causal inference with a dynamic-greedy allocation strategy.\n2. This paper is very well-organized, easy to follow, and clearly presents its contributions."}, "weaknesses": {"value": "1. While the paper includes empirical comparisons with classical baselines using simulations on synthetic networks, additional experiments—particularly on real-world network data—are needed to more convincingly demonstrate the practical effectiveness and robustness of the proposed approach."}, "questions": {"value": "1. Could the authors provide additional intuition or illustrative examples to clarify the usage of Path-dependent Potential Outcomes? A more intuitive explanation would help readers better understand how treatment propagation and historical dependencies affect outcome definitions in this context.\n2. Does the consistency of the proposed framework depend on correct specification of both the propagation model and the outcome model?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "t8e9eUuHXE", "forum": "ScQ7irexRS", "replyto": "ScQ7irexRS", "signatures": ["ICLR.cc/2026/Conference/Submission3769/Reviewer_Gr9p"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3769/Reviewer_Gr9p"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3769/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762326973414, "cdate": 1762326973414, "tmdate": 1762916977993, "mdate": 1762916977993, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies treatment allocation on networks where interventions propagate and outcomes depend on neighbors’ states, causing network interference and history-dependent dynamics. Unlike standard uplift modeling or influence maximization, the goal here is to select a seed set that maximizes net uplift in outcomes relative to a baseline policy, considering multi-step diffusion and spillover effects. The major technique the authors uses are causal inference and combinatorial optimization. Although the idea is very innovative, I can not accept the paper because of several issues mentioned in the weakness and questions sections. I will reconsider my decision if my concerns can be appropriately handled."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Theoretical Guarantees. The regret decomposition is elegant and clarifies where errors come from (model vs. algorithm).\n\n2. Empirical Performance. Experimental results convincingly show advantage over strong baselines.\n\n3. The major technique the authors used in these paper are causal inference and combinatorial optimization, which is pretty novel."}, "weaknesses": {"value": "1. Synthetic Data Only. Experiments are performed only on synthetic cascades. Lack of real-world evaluation weakens external validity.\n\n2. Clarity of Algorithmic Complexity. The computational cost of each marginal evaluation is not quantified; complexity could be large because every candidate add requires Monte Carlo estimation.\n\n3. Poor Presentation. The sequence of algorithms and proof are somehow entangled together, you may want to separate section 4 into 2 sections so that you can first finish showing the methodology and then focus on theoretical analysis.\n\n4. Difficult to understand for general readers. It is great for the authors to combine causal inference and combinatorial optimization technique to solve the problem, but it seems the article is very difficult to follow. Many notations are not clearly explained with assumptions which may not be practical. The authors should give some simple examples right after formulating the problem and clearly explain in these specific examples, what these notations mean and why the assumptions hold. This will convince the readers and make them much easier to understand the problem."}, "questions": {"value": "1. Are there any real-world application? I suggest the author to give some simple examples after formulating the problem. This will give the readers a clear understanding of the problem.\n\n2. Is it possible to give the computationally complexity of each algorithm? The propagating treatment allocation problem is NP-hard, then what's the gain if we use approximation algorithm? Also, It is a 2-approximation or what? It seems Theorem 1 is trying to answer these questions, but a clear explanation may be needed after presenting the theorem.\n\n3. I suggest the author to separate section 4 into 2 sections so that both the methodology and the theoretical analysis can be more clear.\n\n4. The idea of combining causal inference and combinatorial optimization technique to solve the problem is very interesting, but the authors need to think about a better way to help the reader easily follow the presentation.\n\n5. Small typo. Line 109 \"depend on on\"."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "7nLLDs6jLZ", "forum": "ScQ7irexRS", "replyto": "ScQ7irexRS", "signatures": ["ICLR.cc/2026/Conference/Submission3769/Reviewer_CG1F"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3769/Reviewer_CG1F"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission3769/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762467823019, "cdate": 1762467823019, "tmdate": 1762916977778, "mdate": 1762916977778, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}