{"id": "Sfk40QgQNz", "number": 16091, "cdate": 1758259793403, "mdate": 1759897262430, "content": {"title": "Learning Beyond Proximity: Causal Reasoning with LLMs for Robust POI Prediction", "abstract": "Point-of-Interest (POI) prediction forecasts a user’s next destination from mobility history. A key challenge is geographic exposure bias, where users often visit nearby or popular places out of convenience rather than genuine interest. Such convenience-driven behaviors create spurious correlations that obscure true preferences, leading models to misinterpret frequent check-ins as strong signals of interest. Traditional sequential/graph models rely on surface-level statistical correlations, and recent Large Language Model (LLM)-based methods improve semantic coverage but still inherits exposure bias from observational logs. We address this with causal inference, explicitly modeling the data-generating process and distinguishes preference-driven behaviors from convenience-driven ones. In particular, we estimate geographic propensity scores that quantify the likelihood of a visit due to spatial exposure, and use them to reweight check-ins and align trajectory retrieval in exposure-consistent space. Towards this end, we propose Causal Geographic Prediction (CGP), a unified framework that integrates causal inference with LLM-based trajectory modeling. It employs exposure-aware trajectory prompting, causal-geographic similarity alignment, and supervised fine-tuning to separate genuine preferences from convenience-driven behaviors. Experiments on real-world datasets show that CGP outperforms state-of-the-art baselines.", "tldr": "To the best of our knowledge, this is the first work to embed causal inference into LLM-based POI prediction, explicitly mitigating exposure bias from a geographic perspective for more robust performance.", "keywords": ["Large Language Models", "Point of Interests", "Spatial", "Causal Inference"], "primary_area": "causal reasoning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a871ba645f54f6241ef5415586d598ab39410cc4.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper tackles the problem of Point-of-Interest (POI) prediction and focuses on mitigating geographic exposure bias, where users’ check-ins are frequently influenced by spatial convenience rather than genuine preferences. The authors propose CGP, a framework integrating causal inference with LLM-based trajectory prompting to disentangle preference-driven and convenience-driven behavior. The method includes trajectory prompting, geographic propensity estimation, causal-geographic similarity, exposure-consistent retrieval, and LoRA-based fine-tuning. Experiments on three real-world datasets (Gowalla, NYC-T, and Ma-ST) show improvements over prior sequential and LLM-based baselines, along with ablation studies and interpretability analysis."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Overall, the paper identifies and clearly motivates the influence of geographic exposure bias in POI prediction and ties it to causal inference principles. The causal perspective is coherent and well justified.\n2. Extensive experiments were conducted on multiple real-world datasets, and the evaluation includes stratified comparisons on near/far and popular/long-tail POIs, which could effectively demonstrate the significance of the proposed scheme."}, "weaknesses": {"value": "1. The geographic propensity score modeling is introduced as a key component, but the paper lacks more explicit analysis or validation of its estimation quality. For example, there is no discussion of calibration, sensitivity to spatial binning, or comparison with simpler baselines (e.g., distance only methods).\n2. The trajectory prompting relies heavily on converting structured data into natural language templates. However, the design choice of the specific textual format is not ablated, and it remains unclear how sensitive final performance is to prompt phrasing.\n3. Although the method achieves performance gains, the absolute improvements over the strongest LLM-based baseline (GA-LLM) are moderate, especially on datasets where exposure bias is weaker. The generalization advantage may not be uniform across mobility settings."}, "questions": {"value": "Please refer to the weakness section for my questions. The authors are encouraged to provide more clarifications regarding the details in the paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "0UiO9Rl1OX", "forum": "Sfk40QgQNz", "replyto": "Sfk40QgQNz", "signatures": ["ICLR.cc/2026/Conference/Submission16091/Reviewer_y7go"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16091/Reviewer_y7go"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16091/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761456476170, "cdate": 1761456476170, "tmdate": 1762926272597, "mdate": 1762926272597, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a solution based on LLM and causal reasoning to address geographic exposure bias in POI prediction. This bias occurs when models mistakenly interpret locations frequently visited for convenience as genuine user preferences. To distinguish convenience from genuine preference, we introduce the Causal Geographic Prediction (CGP) framework, which integrates causal reasoning with LLMs. The core of this approach involves estimating a geographic propensity score to quantify the influence of convenience, thereby adjusting the retrieval of historical trajectories. This enables LLMs to learn to identify users' true interests. Experiments demonstrate that our method outperforms existing baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. This is the first work to consider the mixed relationship between users' actual trajectories and POIs, and to embed causal inference into POI prediction based on LLM.\n2. This framework enhances the interpretability of POI predictions. By estimating geographic propensity scores, the model can explain its reasoning process and thereby generate more accurate predictions.\n3. Across multiple real-world datasets (Gowalla, NYC-T, Ma-ST), the CGP framework consistently outperforms all existing baseline models, particularly in predicting POI with geographic exposure bias."}, "weaknesses": {"value": "1. In the methodology section of this paper, the core assumption is that a high “geographic propensity score” P(p∣d,c,t) equates to convenience-driven visits. This may overlook POI that simultaneously possess both convenience and preference.\n2. The proposed framework exhibits overconfidence in the “causal reasoning” capabilities of LLMs, as it directly inputs bias scores as numerical values into LLM prompts. The authors assume that LLMs can understand the causal implications of these numbers through fine-tuning. However, is it possible that LLM models have merely learned a new statistical correlation rather than performing the “causal reasoning” claimed by the authors?\n3. This paper employs a single evaluation metric, relying solely on Acc@1 during assessment. POI prediction is fundamentally a ranking task. The sole Acc@1 metric is far from sufficient, as it fails to reflect the model's overall ranking quality across the Top-K list.\n4. Regarding the second component of CGP, Geographic Propensity Estimation, it is unclear how a simple MLP can be used to predict the score based on trajectory prompting."}, "questions": {"value": "1. I disagree with the author's proposed motivation for geographic exposure bias. If users frequently visit certain locations for convenience, this should also represent a user preference. When predicting the next POI based on historical data, this factor should inherently be taken into account."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "S5GsK14JAw", "forum": "Sfk40QgQNz", "replyto": "Sfk40QgQNz", "signatures": ["ICLR.cc/2026/Conference/Submission16091/Reviewer_dGYv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16091/Reviewer_dGYv"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16091/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761554236661, "cdate": 1761554236661, "tmdate": 1762926272202, "mdate": 1762926272202, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a method named Causal Geographic POI Prediction (CGP), which aims to address the Geographic Exposure Bias in location prediction through causal inference. Traditional sequence-based or graph-based POI prediction methods are often influenced by the convenience of users' access to geographical locations, thereby overlooking their genuine preferences. To tackle this issue, CGP integrates causal reasoning and large language models (LLMs) by estimating Geographic Propensity Scores to identify visit behaviors driven by geographical convenience. This adjustment is then leveraged to improve POI prediction."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1.The research motivation is clear, focusing on addressing POI prediction errors caused by geographic exposure bias.\n2.By incorporating causal inference and geographic propensity estimation, the proposed method tackles the geographic exposure bias issue faced by traditional POI prediction approaches, demonstrating high innovation.\n3.Across multiple experimental settings, the proposed method consistently outperforms baseline methods."}, "weaknesses": {"value": "1.The symbols and related modules in the overall framework diagram of the paper are not provided with necessary explanations alongside the diagram. Additionally, there are detail errors in the text and logic, which cause difficulties in understanding.\n2.The core innovation points, such as the definition and calculation principles of the geographic propensity score, are not introduced in the main text. Please provide the relevant details of these key innovations. This includes how the embedded vectors Emb(d), Emb(c), and Emb(t) are input into the MLP to learn the geographic propensity output.\n3.The experimental details are not clear enough. For example, the number of layers involved in MLP training, the loss function, and the loss function involved during fine-tuning need to be specified. What is the target for fine-tuning? The parameters for LoRA fine-tuning, such as the rank of matrices A and B, should be provided as well. The lack of these key parameters weakens the reliability and reproducibility of the results. The paper also does not include an appendix to provide these details.\n4.Is the proposed method end-to-end, or does it involve staged training?\n5.While the comparison experiments include 10 baseline models, some of the baseline models are relatively outdated. Are there any more recent relevant works?"}, "questions": {"value": "Please refer to weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "mcV1jnho0M", "forum": "Sfk40QgQNz", "replyto": "Sfk40QgQNz", "signatures": ["ICLR.cc/2026/Conference/Submission16091/Reviewer_8o19"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16091/Reviewer_8o19"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16091/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761729425743, "cdate": 1761729425743, "tmdate": 1762926271853, "mdate": 1762926271853, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper targets exposure bias in next-POI prediction—i.e., users’ convenience-driven visits being mistaken as genuine preferences. It  proposes CGP, which combines geographic propensity estimation and a causal-geographic similarity for exposure-consistent retrieval, and  LLM-based trajectory prompting with PEFT fine-tuning. Empirically, CGP improves Acc@1 on Gowalla, NYC-T, and Ma-ST."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "+ Tackles an important issue in POI prediction by considering geographic exposure bias.\n+ Explicitly aims to separate convenience-driven visits from true user preferences using causal reasoning with LLMs.\n+ Propose to distinguish genuine preferences and convenience-driven behaviors with the propensity scores used as balancing variables and with retrieval aligned in exposure-consistent space."}, "weaknesses": {"value": "- POI prediction has a long history; the paper should clarify concrete application scenarios\n- It remains unclear how text prompting alone enables reliable separation of habitual proximity from true interests; the paper should analyze which prompt tokens (distance, propensity, category, time) most influence decisions and whether LLM explanations align with ground truth. \n- The benefits of fine-tuning are not cleanly isolated: report with/without SFT, parameter counts, data size sensitivity, and whether gains persist across different LLM backbones under a fixed retrieval/propensity setup.\n- The proposed causal-geographic similarity lacks theoretical guarantees or identification assumptions. The paper should articulate conditions (ignorability/overlap/SUTVA) under which propensity-based reweighting and retrieval yield unbiased preference estimation."}, "questions": {"value": "Please refer to the weakness section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "QpLY3WzySB", "forum": "Sfk40QgQNz", "replyto": "Sfk40QgQNz", "signatures": ["ICLR.cc/2026/Conference/Submission16091/Reviewer_ciXm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16091/Reviewer_ciXm"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16091/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762266850231, "cdate": 1762266850231, "tmdate": 1762926271348, "mdate": 1762926271348, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}