{"id": "SgSfmOuK6Z", "number": 7309, "cdate": 1758015082219, "mdate": 1763343765740, "content": {"title": "HG-Mamba: Heuristic-Guided State Space Model for Laparoscopic Image Desmoking", "abstract": "Developing smoke removal algorithms for laparoscopic surgery is crucial for enhancing surgical visibility and supporting accurate intraoperative decision-making. Recently, Mamba, a representative state space model (SSM), has shown strong potential in visual tasks by balancing global receptive fields with efficiency. However, its reliance on sequential state transitions limits spatial correlation modeling, and its feed-forward layers lack mechanisms to model frequency features—both of which hinder effective removal of complex surgical smoke. To overcome these limitations, we propose Heuristic-Guided Mamba (HG-Mamba), which extends Mamba by integrating spatial and frequency domain improvements.  HG-Mamba comprises two key components: a Heuristic-Guided State Space Model (HG-SSM), which performs input-guided dynamic sampling and flexible state fusion to enable adaptive spatial context modeling; and a Frequency Refine Feed-Forward Network (FR-FFN), which conducts multi-band frequency decomposition and adaptive weighting to enhance frequency-domain representations. By jointly leveraging spatial adaptability and frequency-aware refinement, HG-Mamba serves as an effective backbone for surgical smoke removal. Extensive experiments demonstrate that HG-Mamba outperforms state-of-the-art methods on both synthetic and real-world smoke/smokeless datasets. The code will be publicly released.", "tldr": "", "keywords": ["Laparoscopic Surgery", "Surgical Smoke Removal", "State Space Model", "Deep learning"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/14e63a27a1b839982a4449010a4f40479a3b6b05.pdf", "supplementary_material": "/attachment/a8a1451f89e463608707becb7d6b66e79d4ef751.zip"}, "replies": [{"content": {"summary": {"value": "This method describes a mamba-based method for Laparoscopic Image Desmoking.They proposed to use deformable vmamba block and frequency-refine FFN. The proposed method shows positive results on synthethic and real datasets."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "+ The manuscript is well-organized."}, "weaknesses": {"value": "+ The proposed method is not well-motivated. What is the unique challenge of Laparoscopic Image Desmoking comparing with natural image desmoking? Why do we need deformable sampling for such a task? \n+ The technical noverlty of this manuscript is limited. It is already a common practice in the low-level community to involve frequency-awareness to the model design([1-5], to name just a few). Deformable sampling is also not new[6]. It is a neat engineering solution to stack the most powerful component to form a powerful model, but they are not suitable for a research paper in top venue.  \n+ The author should add more comparision with recent desmoke and dehaze methods.\n+ The author should demonstate generalization performance. Can the model trained on syntheic data generalize on real-world scenarios? Can the proposed laparoscopic image desmoking model work in other medical image desmoking task?\n\n[1] Revitalizing Convolutional Network for Image Restoration, TPAMI 25\n\n[2] Image Restoration via Frequency Selection, TPAMI 25\n\n[3] High-Resolution Document Shadow Removal via A Large-Scale Real-World Dataset and A Frequency-Aware Shadow Erasing Net, ICCV 23\n\n[4] Frequency and Spatial Dual Guidance for Image Dehazing, ECCV 24\n\n[5] Unveiling Advanced Frequency Disentanglement Paradigm for Low-Light Image Enhancement, ECCV 24\n\n[6] DefMamba: Deformable Visual State Space Model, CVPR 25"}, "questions": {"value": "Please refer to the weakness part."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "sDwbDVcO1Y", "forum": "SgSfmOuK6Z", "replyto": "SgSfmOuK6Z", "signatures": ["ICLR.cc/2026/Conference/Submission7309/Reviewer_nPXX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7309/Reviewer_nPXX"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7309/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761896980743, "cdate": 1761896980743, "tmdate": 1762919424468, "mdate": 1762919424468, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "me1lU5rRWh", "forum": "SgSfmOuK6Z", "replyto": "SgSfmOuK6Z", "signatures": ["ICLR.cc/2026/Conference/Submission7309/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7309/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763343764876, "cdate": 1763343764876, "tmdate": 1763343764876, "mdate": 1763343764876, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes HG-Mamba, a Mamba-based image desmoking network for laparoscopic surgery. It comprises a Heuristic-Guided State Space Model (HG-SSM) for adaptive spatial context modeling and a Frequency Refine Feed-Forward Network (FR-FFN) for better feature representation by fusing frequency information. Experiments are conducted on synthetic and real-world data, showing the performance improvement."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Heuristic-Guided State Space Model (HG-SSM) utilizes dynamic sampling and state fusion for flexible context modeling.\n2.  Frequency Refine Feed-Forward Network (FR-FFN) utilizes multi-frequency decomposition and dynamic weighting to improve desmoking performance.\n3. A large synthetic smoke dataset is constructed. Experiments demonstrate that the proposed method gains superior performance over state-of-the-art ones."}, "weaknesses": {"value": "1. The motivation and reasons for the effectiveness of HG-SSM still require further discussion. It's somewhat like a combination of ideas from DefMamba and deformable convolution.\n2. The proposed method needs to be validated on more similar tasks (such as deraining and dehazing).\n3. The inference time can be given in Tables 1 and 2.\n4. The improvement in visual effects in Figures 3 and 4 does not appear to be significant.\n5. From Table 3 in Suppl., Frequency-domain Contrastive Regularization (FCR) loss plays a crucial role in improving performance. How do the compared methods perform when trained using this loss?\n6. Lack related citations. e.g., [1,2]. It would be better to validate the proposed method on SurgClean [2] dataset.\n\n[1] Self-Supervised Video Desmoking for Laparoscopic Surgery.\n[2] Benchmarking Laparoscopic Surgical Image Restoration and Beyond."}, "questions": {"value": "Please see Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "7GryqrXN7w", "forum": "SgSfmOuK6Z", "replyto": "SgSfmOuK6Z", "signatures": ["ICLR.cc/2026/Conference/Submission7309/Reviewer_qmDz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7309/Reviewer_qmDz"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7309/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761925890516, "cdate": 1761925890516, "tmdate": 1762919423812, "mdate": 1762919423812, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose Heuristic-Guided Mamba (HG-Mamba), which extends Mamba by integrating spatial and frequency domain improvements. HG-Mamba comprises two key components: a Heuristic-Guided State Space Model (HG-SSM), which performs input-guided dynamic sampling and flexible state fusion to enable adaptive spatial context modeling; and a Frequency Refine Feed-Forward Network (FR-FFN), which conducts multi-band frequency decomposition and adaptive weighting to enhance frequency-domain representations."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "According to the authors, the paper's contributions are summarized in the following:\n\n1. HG-SSM is proposed, utilizing dynamic sampling and state fusion.\n2. FR-FFN is designed to enhance feature representation.\n3. HG-Mamba is a novel laparoscopic de-smoking backbone combining HG-SSM and FR-FFN.\n4. The authors proposed a large synthetic smoke dataset.\n\nOverall, the comparison results do not show much significant improvement; however, the overhead results look very promising."}, "weaknesses": {"value": "1. Regarding the 4th stated contribution, it is unclear whether the authors are claiming to be the first to propose the smoke dataset or if the dataset is adapted or derived from previously published work. The authors should explicitly clarify the origin of the dataset, including whether it is newly created or based on an existing dataset that previously released. If it is new, details such as the data collection process, annotation methodology, and dataset availability should be provided to substantiate its novelty and reproducibility.\n\n2. The paper currently lacks any statistical or significance testing to demonstrate whether the reported performance improvements are meaningful compared to existing methods. Without such analyses, it is difficult to assess the robustness and generalizability of the proposed approach. The authors are strongly encouraged to include quantitative significance tests to validate that the observed differences are statistically significant and not due to random variation when comparing with competing methods.\n\n3. The manuscript would be strengthened by a discussion of the limitations of the proposed method. For example, under what conditions does the approach fail or underperform? Are there constraints related to dataset diversity or generalizability to unseen scenarios? Clearly outlining these limitations would not only enhance the scientific rigor of the paper but also provide valuable insights for the proposed work."}, "questions": {"value": "Please refer to the weakness section."}, "flag_for_ethics_review": {"value": ["Yes, Responsible research practice (e.g., human subjects, annotator compensation, data release)"]}, "details_of_ethics_concerns": {"value": "No Institutional Review Board (IRB) or ethical approval statement is provided, even though the authors mention constructing a dataset as part of their contribution. It is unclear whether this dataset is entirely synthetic or includes real data. The authors should clarify the nature of the dataset and, if real data were used, provide an appropriate IRB or ethics approval statement to ensure compliance with research ethics standards."}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "59g6SyUejM", "forum": "SgSfmOuK6Z", "replyto": "SgSfmOuK6Z", "signatures": ["ICLR.cc/2026/Conference/Submission7309/Reviewer_TH4y"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7309/Reviewer_TH4y"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7309/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762130139234, "cdate": 1762130139234, "tmdate": 1762919423184, "mdate": 1762919423184, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the removal of laparoscopic surgical smoke to enhance visibility. The authors claimed that existing Mamba-based models are limited by sequential state transitions that restrict spatial correlation modeling in 2D images, and their MLP-based feed-forward networks do not consider frequency-domain characteristics needed for smoke removal. Therefore, they propose HG-Mamba: HG-SSM for input-guided dynamic sampling and fusion of spatially related states (breaking sequential dependencies), and FR-FFN for multi-band frequency decomposition with adaptive weighting."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* Parameter efficiency makes the method potentially deployable in settings with limited resources.\n* The dual-domain approach (spatial and frequency) is interesting.\n* Ablation studies show the contribution of each component"}, "weaknesses": {"value": "- Lack of theoratical justification\n- Empirical frequency filtering mechanisms.\n- Lack of empirical validation of the computational efficacy for the overhead of dynamic sampling\n- The validation with synthetic data lowers the authenticity of the experiments"}, "questions": {"value": "Have you considered dynamic frequency band selection where the frequency boundaries adapt based on input characteristics rather than using fixed octave-based divisions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hKh14LYngn", "forum": "SgSfmOuK6Z", "replyto": "SgSfmOuK6Z", "signatures": ["ICLR.cc/2026/Conference/Submission7309/Reviewer_WKgY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7309/Reviewer_WKgY"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission7309/-/Official_Review"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762950809675, "cdate": 1762950809675, "tmdate": 1762950809675, "mdate": 1762950809675, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}