{"id": "sKaVaASqOQ", "number": 21590, "cdate": 1758319361698, "mdate": 1758806386271, "content": {"title": "SEAL: Skill-Embedded Action for Hierarchical Vision–Language–Action Models", "abstract": "Vision-Language-Action (VLA) models are promising for robotic foundation models, but monolithic designs that decode actions with a large vision–language model (VLM) at each timestep are computationally costly and require extensive demonstration data. \nWe propose SEAL, a hierarchical VLA model that separates long-horizon reasoning from stepwise control: a high-level module outputs a compact skill embedding at a lower temporal frequency, and a lightweight low-level policy executes closed-loop actions at every step. \nThis embedding forms a bottleneck that provides temporal abstraction, enabling better learning efficiency. We stabilize this representation with variance–covariance regularization to prevent collapse, and apply a contrastive loss to ensure different skills guide different behaviors. \nBy reducing the frequency of VLM inference, our method also lowers per-step latency without degrading task success. \nSEAL replaces the standard vision/language $\\rightarrow$ action paradigm with a vision/language $\\rightarrow$ skill $\\rightarrow$ action hierarchy. This explicit, regularized skill bottleneck reduces error accumulation, achieves lower latency, and improves data efficiency. \nOn the LIBERO benchmark, it achieves faster inference and improved data efficiency while maintaining or exceeding success rates, demonstrating that the hierarchical VLA model with regularized skill bottlenecks is a scalable path toward robotic foundation models.", "tldr": "SEAL is a hierarchical VLA model with a skill-embedding bottleneck that reduces VLM usage and error accumulation for efficient, low-latency, long-horizon execution.", "keywords": ["Vision–Language–Action Models", "Robotic Manipulation", "Hierarchical Learning"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "", "supplementary_material": ""}, "replies": [], "withdrawn": true}