{"id": "sYxct6G8Ut", "number": 4197, "cdate": 1757630659318, "mdate": 1759898047963, "content": {"title": "From Bits to Chips: An LLM-based Hardware-Aware Quantization Agent for Streamlined Deployment of LLMs", "abstract": "Deploying models, especially large language models (LLMs), is becoming increasingly attractive to a broader user base, including those without specialized expertise. However, due to the resource constraints of certain hardware, maintaining high accuracy with larger models while meeting the hardware requirements remains a significant challenge. Model quantization techniques help mitigate memory and compute bottlenecks, yet the added complexities of tuning and deploying quantized models further exacerbate these challenges, making the process unfriendly to most users.  We introduce the **Hardware-Aware Quantization Agent (HAQA)**, an automated framework that leverages LLMs to streamline the entire quantization and deployment process by enabling efficient hyperparameter tuning and hardware configuration, thereby simultaneously improving deployment quality and ease of use for a broad range of users.  Our results demonstrate up to a **2.3×** speedup in inference, along with increased throughput and improved accuracy compared to unoptimized models on Llama. Additionally, HAQA is designed to implement adaptive quantization strategies across diverse hardware platforms, as it automatically finds optimal settings even when they appear counterintuitive, thereby reducing extensive manual effort and demonstrating superior adaptability.", "tldr": "", "keywords": ["LLMs", "Agent", "Model Compression"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ffc6b3526452a1d93d7dd46dc84d5d3aba481eec.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper introduces HAQA, a framework that integrates LLM within a quantization and deployment pipeline to search for optimal hyperparameter settings. LLM proposes different configurations including bit-widths, learning rate, and hardware parameters in an iterative fashion, taking into account past runs. Authors report accuracy results on Resnet and llama models and compare results with A6000 and Snapdragon 8 Gen 2 hardware."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The work introduces a novel idea. Leveraging LLMs to find quantization params seems like a timely idea. \n- Clear motivation and writing."}, "weaknesses": {"value": "- The proposed method has no mathematical foundation. \n- The underlying usecase is fairly limited. While it’s largely useful for non-experts to leverage LLMs and optimize these model parameters, the process itself can be orders of magnitude more expensive in terms of compute as compared to traditional methods. While the cost of leveraging ChatGPT API calls is fairly cheap, in reality, they can be far more computationally intensive. It is not clear how LLM based optimization can be better than existing methods like grid search, bayesian optimization, etc. without any convergence guarantees. \n- The framework may not perform well for new models and any new hardware intrinsics where the foundation model lacks knowledge of. \n- Quantization generally involves params like scaling factor type, min/max range, etc and training includes params like learning rate, batch size, gradient accumulation steps, LoRA rank/dropout, etc. It is not clear whether and to what extent LLM based tuning helped with these methods. Existing methods leverage gradient-based information to guide this decision-making."}, "questions": {"value": "- How sensitive are results to prompt wording and random seed?\n- Did you evaluate failure cases (hallucinated configs, invalid bit-widths)?\n- Could the same gains be achieved by a simple rule-based search conditioned on accuracy-latency feedback?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "T3zExDzG6O", "forum": "sYxct6G8Ut", "replyto": "sYxct6G8Ut", "signatures": ["ICLR.cc/2026/Conference/Submission4197/Reviewer_LR7t"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4197/Reviewer_LR7t"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission4197/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761298907282, "cdate": 1761298907282, "tmdate": 1762917224245, "mdate": 1762917224245, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes HAQA, a hardware-aware quantization agent framework based on large language models (LLMs), to automate the quantization tuning and hardware deployment process for large language models. By designing static and dynamic hints and leveraging the inference capabilities of LLMs, this framework jointly optimizes quantization training hyperparameters and hardware deployment configurations, significantly improving model inference speed and accuracy on resource-constrained devices. Experiments demonstrate that HAQA outperforms manual tuning and traditional optimization methods across multiple models and hardware platforms."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "Highly Innovative: This approach utilizes LLM as an automated agent for the joint optimization of quantized training and hardware deployment, demonstrating its originality.\n\nHighly Practical: This approach significantly reduces the difficulty of deploying quantized models for non-expert users, improving deployment efficiency and model performance.\n\nExtensively Experimented: This approach has been extensively validated across multiple models, datasets, and hardware platforms, yielding compelling results.\n\nHighly Hardware-Aware: This approach can detect counterintuitive configurations, demonstrating a deep understanding of hardware characteristics.\n\nLow Cost: This approach can be optimized with only a few API calls , demonstrating excellent scalability."}, "weaknesses": {"value": "Reliance on closed-source models: The experiments are based entirely on the GPT-4 API and lack validation against open-source LLMs, potentially impacting the generalizability and reproducibility of the method.\n\nLack of in-depth comparisons: While comparisons were conducted with various optimization methods, they were not fully compared with the latest hardware-aware quantization methods.\n\nComplex prompt design: The design of static and dynamic prompts is complex, requiring users to understand and modify them.\n\nUnverified generalizability: The experiments primarily focused on vision and language models, lacking validation of other modalities.\n\nFailure cases not discussed: The potential failures that may occur during the agent optimization process and their handling mechanisms are not analyzed."}, "questions": {"value": "Dependency on Proprietary LLMs:\nThe entire HAQA framework relies on the closed-source GPT-4 API. Have you experimented with open-source LLMs (e.g., Llama, Mistral) as the agent? If not, do you believe HAQA’s performance is generalizable across different LLMs, especially smaller or open-source ones?\n\nGeneralization to Other Domains:\nThe experiments focus on vision (ResNet) and language models (LLaMA). Can HAQA be applied to other model types, such as speech or multimodal models? Have you conducted any preliminary experiments in those areas?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "xfzAToNHl9", "forum": "sYxct6G8Ut", "replyto": "sYxct6G8Ut", "signatures": ["ICLR.cc/2026/Conference/Submission4197/Reviewer_ySir"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4197/Reviewer_ySir"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission4197/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761634730364, "cdate": 1761634730364, "tmdate": 1762917223807, "mdate": 1762917223807, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a hardware-aware quantization agent centered on a large model, which unifies quantization fine-tuning and underlying kernel configuration into a single \"feedback-driven\" workflow, automatically performing joint parameter tuning in a vast and strongly coupled search space with hardware. The framework achieves accelerated results while maintaining or approaching accuracy across platforms through a closed loop of standardized prompts and runtime metrics, demonstrating the end-to-end, transferable idea and feasibility of automated deployment."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Closed-loop optimization driven by large model agents incorporates hardware information and operational feedback into decision-making, transcending the traditional fragmented process of \"quantification first, then deployment\".\n\n2.It can adaptively select configurations based on the characteristics of different devices and backends, revealing and leveraging the non-intuitive optimality brought about by platform differences.\n\n3.The search space, constraints and action templates are clear, with logs and boundary checks. The optimization process is controllable and auditable, making it easy to expand to new hardware or new operators."}, "weaknesses": {"value": "1. The optimization criteria and convergence conditions for multi-objective compromises (accuracy, delay, throughput, and video memory) are not clearly described. The agent mainly relies on static/dynamic prompts and heuristic loops, and is easily affected by prompt design and model preferences. It is recommended to provide explicit multi-objective optimization objectives and constraints, and report failure modes and safety boundaries.\n\n2. Lack of equal budget comparisons with standard automatic tuning /HPO baselines; Please provide the convergence curve and the optimal value distribution under the same number of parameters, training steps, data quota and evaluation calls, and report the variance and significance of multiple repetitions.\n\n2. The key components of the agent workflow are not dissolved item by item. It is recommended to provide a robustness assessment under grid ablation and noise injection."}, "questions": {"value": "1. Can you provide some intuitions or examples of what the better hyper-parameters are? And how does the agent find these parameters?\n\n2. LLaMA/Alpaca results are unclear. While Llama models are mentioned trained on Alpaca dataset, which results in the table use QLoRA fine-tuning and which are quantization-only?\n\n2. The paper only reports API costs and overhead. However, does the LLM-based agent need to run more trials or evaluations to reach the current performance than other search methods?\n\n3. If so, would this make comparisons unfair? The added experiments and time increase should also be counted toward the total overhead. Please report these details."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "FEONKVDUfF", "forum": "sYxct6G8Ut", "replyto": "sYxct6G8Ut", "signatures": ["ICLR.cc/2026/Conference/Submission4197/Reviewer_C2Fi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4197/Reviewer_C2Fi"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission4197/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761861319443, "cdate": 1761861319443, "tmdate": 1762917223350, "mdate": 1762917223350, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a hardware-aware quantization agent (HAQA) designed to facilitate the deployment of quantization algorithms on target hardware through efficient hyperparameter tuning and the knowledge of the hardware platform. The authors claim that HAQA can automatically identify optimal settings for various hardware platforms and contribute to accelerating inference speed."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The authors address a practical problem: the difficulty of efficiently identifying optimal configurations for different quantization techniques across diverse hardware platforms due to the vast search space. They also validate the effectiveness of their framework through experiments on various models."}, "weaknesses": {"value": "1. It is unclear why this framework is specifically tailored for quantization. The proposed strategy contains few quantization-specific components beyond the target problem, deploying quantization techniques. For instance, it addresses only a limited number of quantization methods, which (e.g., QLoRa) are outdated, raising doubts about HAQA’s efficiency for current state-of-the-art techniques.\n\n2. Although the framework aims to find optimal parameters/configurations for quantization techniques, some parameters, such as optimal data format, depend on activations (input data distributions), which HAQA cannot currently handle. Also, this framework may be more suitable for quantization-aware training (QAT) or fine-tuning rather than post-training quantization (PTQ), which is more widely used, while its efficiency relative to human experts also remains uncertain.\n\n3. The claimed effectiveness across diverse hardware platforms is questionable, as HAQA relies on knowledge from existing LLM models. For practical cases involving deployment on new accelerators with unfamiliar hardware components or dataflows, applying HAQA directly may be challenging.\n\n4. The authors suggest that HAQA can handle hardware platforms with unknown or unintuitive characteristics, citing an example where INT8 outperforms INT4 on mobile GPUs. However, in practice, supported data formats are usually pre-known (also included in authors’ prompt) and easily obtainable, making the claimed advantage less significant. Additionally, the search space and evaluation time for such parameters are relatively small. A more convincing case is needed.\n\n5. Deploying a new quantization technique on novel hardware often requires generating efficient kernels and compilers, which remains a major bottleneck or deployment and is difficult to achieve reliably through LLM-based methods. This paper does not address this software stack issue, focusing only on hyperparameter or pipeline tuning, which may have limited impact on overall hardware performance.\n\nMinor: There appear to be numerical inconsistencies in Table 2 (LLaMA-3.2B–3B), where the average human results outperform HAQA, even though individual task results are lower."}, "questions": {"value": "Which aspects of this framework are specifically targeted toward quantization? Many components appear applicable to broader domains, as the framework primarily operates as an LLM agent without fine-tuning or training from scratch. Please clarify why this method is particularly effective for quantization and what novel contributions it offers from that perspective, beyond prompt engineering or leveraging existing hardware knowledge.\n\nCan this approach be extended to novel hardware platforms that are not recognized by existing generative AI APIs? The deployment of new quantization techniques often hinges on hardware-specific information, which should be carefully addressed. Existing platforms are relatively straightforward to handle due to available prior results, but it is unclear how HAQA would perform on entirely new hardware. Additionally, please elaborate on how HAQA could provide advantages in the development of the software stack, including kernel generation and compiler optimization."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "HQ0imdHBdh", "forum": "sYxct6G8Ut", "replyto": "sYxct6G8Ut", "signatures": ["ICLR.cc/2026/Conference/Submission4197/Reviewer_1qQf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission4197/Reviewer_1qQf"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission4197/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891262957, "cdate": 1761891262957, "tmdate": 1762917222910, "mdate": 1762917222910, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}