{"id": "t7wIerUT2E", "number": 14506, "cdate": 1758237526484, "mdate": 1759897366103, "content": {"title": "Controllable diffusion-based generation for multi-channel biological data", "abstract": "Biological profiling technologies, such as imaging mass cytometry (IMC) and spatial transcriptomics (ST), generate multi-channel data with strong spatial alignment and complex inter-channel relationships. Modeling such data requires generative frameworks that can jointly model spatial structure and channel relationships, while also generalizing across arbitrary combinations of observed and missing channels for practical applications. Existing generative models typically assume low-dimensional inputs (e.g., RGB images) and rely on simple conditioning mechanisms that break spatial correspondence and overlook inter-channel dependencies. This work proposes a unified multi-channel diffusion (MCD) framework for controllable generation of structured biological data with intricate inter-channel relationships. Our model introduces two key innovations: (1) a hierarchical feature injection mechanism that enables multi-resolution conditioning on spatially aligned observed channels, and (2) two complementary channel attention modules to capture inter-channel relationships and recalibrate latent features. To support flexible conditioning and generalization to arbitrary sets of observed channels, we train the model using a random channel masking strategy, enabling it to reconstruct missing channels from any combination of observed channels as the spatial condition. We demonstrate state-of-the-art performance across both spatial and non-spatial biological data generation tasks, including imputation in spatial proteomics and clinical imaging, as well as gene-to-protein prediction in single-cell datasets, and show strong generalizability to unseen conditional configurations.", "tldr": "", "keywords": ["diffusion model", "conditional imputation", "channel attention", "random-masking guidance", "imaging mass cytometry"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/adf51dda4e48a3c0e18ca7b440716831e3a559c4.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "Many biological modalities are inherently multi‑channel and spatially co‑registered (IMC, clinical imaging, spatial transcriptomics). Off‑the‑shelf conditional diffusion often assumes low‑dimensional channels and crude conditioning that breaks spatial correspondence. The paper proposes MCD (multi‑channel diffusion) for controllable generation and imputation given arbitrary subsets of observed channels. Core claims: (1) hierarchical feature injection to keep spatial alignment; (2) two channel‑attention modules to model inter‑channel dependencies; and (3) random channel masking for amortized training across any condition configuration. Experiments cover single‑cell gene‑to‑protein prediction, IMC imputation, and cross‑dataset generalization."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The hierarchical feature‑injection pipeline preserves spatial correspondence at every resolution, which is exactly what biological channels need. The injection is simple to deploy and avoids brittle concatenation tricks common in vision diffusion.\n- Pairing SE gating with transformer‑style channel attention gives a plausible division of labor: per‑sample recalibration and higher‑order inter‑channel structure. The additional SE head at the output enforces cross‑channel coupling where it matters."}, "weaknesses": {"value": "- Comparators underpowered for spatial tasks. ControlNet is a fair reference, but the paper doesn’t benchmark strong end‑to‑end, jointly‑trained spatial conditioners or ablate cross‑attention conditioning versus the proposed SE‑gated injection. Given that the method already computes $E_{\\ell}(c)$, a direct cross‑attention baseline would be informative.\n- Masking policy and distribution shift. Random masking zeros unobserved channels in the condition (Algorithm 1). The paper does not analyze whether zero‑masking creates a train/test mismatch when “missing” at test time means “physically unmeasured but nonzero distribution,” especially for modalities where absolute intensity carries semantics.\n- Metrics don’t reflect calibration. Spatial evaluation is Pearson r. No per‑channel calibration (e.g., bias/variance decomposition), no uncertainty quality, no region‑level histograms for key biomarkers. For clinical‑adjacent imaging, correlation alone can be misleading."}, "questions": {"value": "- (Multi-channel vs multi-source) The setting is similar to multi-source integration problem, and the masking idea is similar to scVAEIT. It would be interesting to discuss the connection. (Du, J.‑H., Cai, Z., Roeder, K. (2022), Robust probabilistic modeling for single‑cell multimodal mosaic integration and imputation via scVAEIT.”)\n- (Masking policy) What masking probability $p$ and schedule work best? Any performance cliffs when masks are extremely sparse/dense? Show sensitivity curves and OOD mask combos not seen in training.\n- (Scalability) Provide computational complexity (e.g., wall‑clock, memory, and FLOPs) versus $C$, $D$, and $H\\times W$ for both attention modules. Where does channel self‑attention become the bottleneck?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "aoilMLBXfc", "forum": "t7wIerUT2E", "replyto": "t7wIerUT2E", "signatures": ["ICLR.cc/2026/Conference/Submission14506/Reviewer_t6Ur"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14506/Reviewer_t6Ur"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14506/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760797838101, "cdate": 1760797838101, "tmdate": 1762924901111, "mdate": 1762924901111, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes MCD, a conditional diffusion framework for multi-channel biological data. Conditioning is handled via masked images. The proposed architecture is a dual network with hierarchical feature injection from a contextual encoder into the denoiser, plus two channel-attention mechanisms (SE for injection and transformer-style channel self-attention inside unet blocks). Experiments show state of the art level results on CITE-seq protein prediction, IMC channel imputation including a union vs intersection multi-dataset study, hybrid controls versus ControlNet/BrushNet, and BraTS MRI."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "- **Problem relevance.** Training with random channel masking yields one model that accepts arbitrary observed subsets and making it flexible. The union and intersection result supports cross-dataset integration under partial channel overlap.\n\n- **Strong empirical results.** When reported, the method consistently outperforms baselines. Experiments are broad and span single/multi dataset setups and including hybrid controls.\n\n- **Ablations.** Stepwise ablations and ControlNet/BrushNet hybrids help attribute gains to hierarchical injection."}, "weaknesses": {"value": "- **Subset-size stress-tests are missing.** One of the core claims is robustness to arbitrary observed subsets, but there is no sweep of performance vs. #observed channels / masking-probability p, nor targeted leave a group out per channel families. Single vs multi channel and union vs intersection is positive but partial.\n\n- **Efficiency evidence.** Table 1 lists SiD(1-step) with near identical accuracy and claims two orders of magnitude speedup, but there are no wallclock analysis for readers to observe the real performance gains. \n\n- **Method clarity.** I find the pieces in the methods section hard to put together. It requires stitching together several sections to reconstruct the exact flow of input, context encoder, SE-gated injections per scale, denoiser block attention, output SE flow. A single forward schematic/pseudocode can improve the clarity significantly. \n\n- **CFG analogy is conceptual.** I could not directly link random masking with CFG. Instead, the authors can provide a deeper the analysis of how the compared baselines actually operate and where they fall short.\n\n- **Reproducibility.** The paper promises code upon publication without anonymous repo or supplementary materials. This limits the verification significantly."}, "questions": {"value": "See the questions and actionable items below. I find the core idea is strong, but the draft feels rushed; clearer presentation and a few added analyses would better show the paper's potential.\n\n\n- **MedVAE ablation.** It would be nice to see the effect of the latent space choice on the results. One can convert each channel into grayscale (or stack each channel 3 times to imitate RGB) and run through a stable diffusion VAE pipeline do the latent diffusion.\n\n- **Efficiency plots.** Single step generation has a clear advantage from its strong results and efficiency but it would be nice to see more details on how you distilled together with the performance comparisons with other baselines.\n\n- **Confidence intervals.** Report mean $\\pm95\\%$ CI over multiple seeds for all main tables to quantify variance from training and random masking. \n\n### Mistakes in text.\n\n- **Section 2.2** The part describing classical RGB image imputation and classical RGB colorization problems are not correct. If we have $C_m = 0$ and $C_o = C = 3$ there is nothing to impute. Additionally, for the colorization example $C_m = 3$ and $C_o = 1$ implies $C = C_m + C_o = 4$ which is clearly not RGB. \n\n- **Dataset reference for BMMC.** Table 1 report BMMC (bone marrow mononuclear cells) as BMNC both in the body and in the caption.\n\n- **Different acronym on Table 3.** Throughout the paper the authors refer their method as MCD however Table 3 uses DiffuseMRI"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "JGl0dLFmd3", "forum": "t7wIerUT2E", "replyto": "t7wIerUT2E", "signatures": ["ICLR.cc/2026/Conference/Submission14506/Reviewer_iF6S"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14506/Reviewer_iF6S"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14506/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761760362316, "cdate": 1761760362316, "tmdate": 1762924900502, "mdate": 1762924900502, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a unified multi-channel diffusion (MCD) framework for controllable generation of structured biological data."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. The idea of developing a framework capable of controllably generating multi-channel biological data using diffusion models is interesting."}, "weaknesses": {"value": "1. The paper is quite obscure and its objective remains unclear. The title suggests that it focuses on developing a generative framework for multi-channel biological data, but the type of data is not specified. I assumed the authors were referring to images, yet in the experiments they attempt to predict protein expression from paired scRNA-seq data, and later they evaluate their method on MRI images. This inconsistency makes the overall methodology difficult to understand and significantly undermines the coherence of the paper.\n\n2. The paper contains several incorrect claims and assertions. To list a few: “Existing generative models typically assume low-dimensional inputs (e.g., RGB images)” and “In spatial profiling data, each channel designates a specific molecule of interest (e.g., proteins n ≥ 30 and genes n ≥ 100), and each pixel (or cell)…”.\n\n3. The manuscript contains numerous writing inconsistencies, redundant and buzzword-heavy claims, and incorrect or oversimplified descriptions of diffusion theory. Core method elements (random channel masking, SE attention) are incremental and poorly justified as novel contributions."}, "questions": {"value": "1. The authors declared the following: \"All experiments were trained on NVIDIA A5000 GPUs with 24 GB of VRAM. The model was trained for 2000k imgs with a batch size of 256, taking approximately 2 hours to complete at 16 × 16 resolution. All results were obtained using a single-GPU setup unless otherwise specified.\" Which kind of biological data have a resolution of 16 × 16?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hdi5pEbz7k", "forum": "t7wIerUT2E", "replyto": "t7wIerUT2E", "signatures": ["ICLR.cc/2026/Conference/Submission14506/Reviewer_aLRt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14506/Reviewer_aLRt"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14506/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761867156893, "cdate": 1761867156893, "tmdate": 1762924899855, "mdate": 1762924899855, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors introduce a Multi-Channel Diffusion (MCD) framework, designed for controllable synthesis and imputation of multi-channel biological data such as spatial proteomics, single-cell omics, and MRI. This framework integrates a mechanism for hierarchical spatial feature injection with a dual channel-attention module. This enables the resulting models to preserve spatial alignment while capturing complex inter-channel dependencies. A wide range of experiments on publicly available benchmarks suggest that MCD outperforms existing baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1) This paper combines two different methodological innovations in a quite ingenious way, effectively addressing the spatial and inter-channel complexity of biological data.\n\n2) The resulting models demonstrates versatility across multiple domains, including spatial proteomics, single-cell omics, and MRI modality synthesis, showing strong generalization and scalability.\n\n3) Finally, the presented evaluation is quite comprehensive. I particularly appreciate the ablation studies that assess the individual contributions of model components."}, "weaknesses": {"value": "1) All comparisons reported in Tables 1 to 3 lack any assessement of stastistical significance. This makes it difficult to gauge whether differences in performances are actually significant.\n2) There is not biologically-grounded evaluation of the imputed data. For example, are known protein markers expressed in their corresponding cells?"}, "questions": {"value": "I would ask the authors to address the weaknesses highlighted above. Particularly:\n1) Evaluate differences in predictive performance between their method and the others through appropriate statistical tests\n2) Check whether expected cell-specific markers are expressed in the inputed data. You could also scale up this assessement to the pathway level, and check which biological pathways are enriched in the imputed data and if the enrichment results are biologically meaningful"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "KhQmNvvvYH", "forum": "t7wIerUT2E", "replyto": "t7wIerUT2E", "signatures": ["ICLR.cc/2026/Conference/Submission14506/Reviewer_WNmC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14506/Reviewer_WNmC"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14506/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761877152290, "cdate": 1761877152290, "tmdate": 1762924899252, "mdate": 1762924899252, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}