{"id": "tAb8aUxuzd", "number": 17470, "cdate": 1758276419885, "mdate": 1759897173390, "content": {"title": "AG-ViT: Atlas-Guided Vision Transformer for Predicting Cognitive Decline", "abstract": "The use of resting state fMRI (rs-fMRI) to improve the diagnosis and treatment of neurodegenerative diseases has increased dramatically in recent years. Despite evident progress, producing accurate predictions from rs-fMRI scans remains challenging due to the data's high dimensionality and the limited number of samples. In this work, our aim is to estimate the probability of cognitive decline within a given time frame based on rs-fMRI scans of Alzheimer’s patients. Accurate predictions of disease trajectory can guide medical decision-making and contribute to personalized medicine. To this end, we design a vision transformer to obtain low-dimensional embeddings of rs-fMRI scans. These embeddings are used to train a network that estimates the probability of cognitive decline. By testing our approach on scans from the Alzheimer's Disease Neuroimaging Initiative, we show that models trained on our transformer-based features outperform those trained on handcrafted connectivity features by 15\\%–26\\% in F1-score.\nFor interpretability, we develop a simple yet effective method to identify brain regions whose fMRI-derived signal significantly impacted model predictions. The results identified a set of brain regions, some recognized for their early involvement in AD and others for their relative resilience to AD pathology.", "tldr": "We develop a transformer for learning  fMRI representations  from Alzheimer’s patients and predicts the probability of cognitive decline within a given time frame.", "keywords": ["Transformers", "fMRI", "Alzheimer's disease", "self-supervised learning"], "primary_area": "applications to neuroscience & cognitive science", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/85c57bac523b1c160624ed89c9cc0716a14611b1.pdf", "supplementary_material": "/attachment/5f220513a667f51ebf1c802734f2a23eaef17efd.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes a attention-based pretraining scheme to reduce a high dimensionality of resting state fMRI data. The model yields low dimensional embedding features, and these features are used to estimate the probability of cognitive decline. Experiments were performed on the ADNI dataset. Neuroscientific analyses, e.g., brain regional analyses, were performed to identify significant brain regions that affected model predictions."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1)\tThe paper includes statistical analysis to enhance model interpretability, which is important to understand medical data. Also, multiple metrics were used to evaluate the model performance."}, "weaknesses": {"value": "1)\tLack of technical novelty. The proposed AG-ViT does not introduce a fundamentally new learning mechanism. The model is simply built upon the existing ViT architecture with fine-tuning of additional bottleneck features, offering only incremental modifications. Specifically, the benefit of the pretraining step incorporating atlas representation is unclear. Compared to the typical ViT, what is the concrete advantage of learning bottleneck features through the atlas decoder, and how does this component meaningfully contribute to model performance or interpretability?\n\n2)\tGiven that there are many existing studies for feature processing, this paper does not explain any motivations and rationales to specifically choose the attention mechanism for solving the task. \n\n3)\tSignificant lack of baseline models and insufficient data usage. Basically, only two basic ML frameworks (i.e., logistic regression and 2-layer MLP) were used, without adopting recent models. More comparisons with recent studies and additional datasets are necessary to sufficiently evaluate the generalizability of the proposed model. For example, [1,2,3,4,5] can be adopted for additional baselines. Moreover, given that 4D (brain) image classification and brain network-based studies are heavily researched topics, I believe that authors can easily find more studies on this task with open source codes.\n\n[1] Kan et al., “Brain network transformer”, NeurIPS 2022.\n\n[2] Kawahara et al. \"BrainNetCNN: Convolutional neural networks for brain networks; towards predicting neurodevelopment.\" NeuroImage 2017.\n\n[3] Li et al. \"Braingnn: Interpretable brain graph neural network for fmri analysis.\" Medical Image Analysis, 2021.\n\n[4] Jiang et al., “Characterizing functional brain networks via Spatio-Temporal Attention 4D Convolutional Neural Networks”, Neural Networks, 2023.\n\n[5] Choy et al., “4D Spatio-Temporal ConvNets: Minkowski Convolutional Neural Networks”, CVPR, 2019.\n\n4)\tThe identified brain regions with high important scores do not generally align with the patterns of A$\\beta$ uptake, which raises questions about the biological plausibility of the model’s decision process."}, "questions": {"value": "1)\tWhat is the main technical novelty compared to recent studies?\n\n2)\tWhy should the attention mechanism be used, and what is the advantage of it for solving the task compared to other studies?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "tBDU2MDJeN", "forum": "tAb8aUxuzd", "replyto": "tAb8aUxuzd", "signatures": ["ICLR.cc/2026/Conference/Submission17470/Reviewer_qBDF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17470/Reviewer_qBDF"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17470/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761479411700, "cdate": 1761479411700, "tmdate": 1762927352325, "mdate": 1762927352325, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposed an atlas-guided VIT for AD prediction. The proposed method consists of a self-supervised pretraining method and a supervised finetuning stage. The proposed method is validated on ADNI datasets. The experimental results show that the proposed method  achieve a better performance when compared with the competing methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. An atlas-based self-supervised pretraining method is proposed in this work.\n2. The experimental results are better than the competing methods."}, "weaknesses": {"value": "This study has several methodological limitations that warrant attention. The reliance solely on the Schaefer 2018 parcellation method raises concerns about the robustness of findings across different brain atlases. While proposing an atlas-based self-supervised learning approach, the authors fail to establish its advantages over existing self-supervised methods. The experimental design is constrained by simplistic baseline comparisons lacking state-of-the-art benchmarks, limited evaluation metrics (only F1-score and Accuracy), and insufficient methodological details regarding image preprocessing and data partitioning. Furthermore, the exclusive validation on the ADNI dataset without external testing undermines claims about the method's generalization capability. These issues collectively impact the reliability and generalizability of the reported results."}, "questions": {"value": "1. This paper employed the Schaefer 2018 parcellation method to obtain the brain atlas. In reality, there are numerous atlas parcellation methods. Whether different parcellation methods would significantly impact the methodology was not mentioned in the paper.\n2. An important innovation of this paper is its atlas-based self-supervised learning method. There are many self-supervised learning methods proposed; the authors did not discuss the advantages of their proposed method compared to these methods.\n3. The comparative methods used in the paper are overly simplistic and lack comparison with state-of-the-art methods.\n4. The evaluation metrics are limited to only F1-score and Accuracy.\n5. The experimental description lacks crucial details, such as image preprocessing procedures and dataset partitioning.\n6. The experiments were only validated on the ADNI dataset, lacking external dataset validation to demonstrate the method's generalization capability."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "QyVR7RC00h", "forum": "tAb8aUxuzd", "replyto": "tAb8aUxuzd", "signatures": ["ICLR.cc/2026/Conference/Submission17470/Reviewer_UeV1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17470/Reviewer_UeV1"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17470/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761788873517, "cdate": 1761788873517, "tmdate": 1762927351906, "mdate": 1762927351906, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This study presents an approach for predicting the probability of cognitive decline in Alzheimer's disease patients by developing AG-ViT, a model that learns low-dimensional embeddings from 4D rs-fMRI scan data. As its core methodology, the model employs a self-supervised pretraining strategy, training it to reconstruct 2D atlas-based temporal representations from the original 4D fMRI scans. The embeddings learned through this process are then used as input for a downstream network that predicts cognitive decline.\nTrained on rs-fMRI scan data from the ADNI, the model demonstrated improved performance compared to existing functional connectivity-based models. Furthermore, performance was additionally enhanced using a TTA technique, and the study also demonstrated an interpretability methodology to identify brain regions that significantly impact the model's predictions."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The motivation to incorporate neuroanatomical priors (via atlas guidance) into transformer architectures for rs-fMRI analysis is reasonable and timely.\nThe integration of test-time adaptation for clinical stability adds a practical dimension, aligning with deployment concerns in medical AI."}, "weaknesses": {"value": "Except for the atlas-guided component, AG-ViT represents only an incremental improvement over prior works. Although the authors hypothesize that reconstructing functionally meaningful regional dynamics through atlas parcellation enhances robustness relative to voxel-wise or masked regional representations, this claim is not substantiated by quantitative evidence or dedicated ablation experiments in the manuscript.\nThe manuscript frequently claims that pairwise FC-based methods are suboptimal but provides limited experimental or theoretical justification. While FC-based baselines are included, comparisons are superficial (F1/Accuracy only), lacking interpretability or clinical analyses that demonstrate genuine superiority.\n\nThe proposed model relies on a specific Schaefer atlas, but robustness across different parcellations (Craddock, Power, etc.) is not tested.\n\nThe paper omits detailed descriptions of dataset splits (train/val/test ratios, subject-level independence). This omission hinders reproducibility and fair evaluation.\n\nResults are presented as single scores without variance or significance testing, undermining the statistical reliability of claims.\n\nComparative models are limited to logistic regression and simple neural networks. The absence of modern baselines, such as Brain Transformer, BrainLM, SwiFT, or self-supervised/MAE-based approaches, reduces the credibility of reported performance gains.\n\nSome notations and arrows in Figures 2 and 3 are too small and the colors lack sufficient contrast, making them difficult to read. \n\nAdditionally, certain parts of Figure 2 do not appear to be consistent (e.g., Figure 2b) with the corresponding descriptions in the main text."}, "questions": {"value": "The model uses a fixed 3D patch size of 6×6×6. What motivated this choice? Was it empirically validated or based on prior literature? A sensitivity analysis could clarify model stability.\n\nAlthough the abstract and introduction describe the task as a probabilistic prediction of cognitive decline, the experimental design reformulates it as a binary classification problem, labeling ‘1’ when a subject’s CDR score increases within a specified time window and ‘0’ otherwise. Furthermore, the evaluation relies solely on deterministic metrics such as F1 score and accuracy, without employing any calibration- or probability-based measures. This discrepancy between the stated objective and the implemented methodology detracts from the conceptual clarity of the manuscript and raises concerns regarding the validity of framing the problem as a probabilistic prediction.\n\nThe authors emphasize the efficiency benefit of using an atlas-guided decoder with fewer parameters during training. However, the final model also incorporates a TTA procedure, which involves additional gradient-based update steps and thus introduces extra computational cost. This raises a question: in practical deployment scenarios, wouldn’t a model that incurs higher cost during training but operates faster and more efficiently at inference be more desirable than the proposed structure?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "77rT3HaSD2", "forum": "tAb8aUxuzd", "replyto": "tAb8aUxuzd", "signatures": ["ICLR.cc/2026/Conference/Submission17470/Reviewer_U82q"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17470/Reviewer_U82q"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17470/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761875596078, "cdate": 1761875596078, "tmdate": 1762927351327, "mdate": 1762927351327, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents an atlas-guided vision transformer (AG-ViT) or longitudinal prediction in Alzheimer’s disease. The model is trained to predict clinical status at a future time horizon (e.g., 1-3 years), and it produces region-level importance scores. These scores are then compared against Alzheimer’s disease pathology patterns, in order to support biological interpretability."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The introduction of an explicit prediction time horizon (e.g., 3-year outcome) is clinically meaningful. \n\n2. The authors compare the most important regions highlighted by the model with established biological markers of Alzheimer’s disease pathology, which makes the interpretation concrete and clinically relevant."}, "weaknesses": {"value": "1.  When reporting gains in metrics over standard baselines, please include significance tests or confidence intervals. This is especially important given the limited dataset size.\n\n2. ADNI (and similar longitudinal Alzheimer’s cohorts) is not extremely large. A transformer-style model can be high capacity. The paper should report model size (number of parameters), training cost, and any regularization strategies used. How do you mitigate overfitting? This matters for generalizability.\n\n3. The method is evaluated for a 3-year horizon. Have you also evaluated longer horizons?"}, "questions": {"value": "The authors propose an atlas-guided ViT instead of a voxel-wise approach. Can you explain why atlas guidance is especially suitable for Alzheimer’s disease? And how sensitive are the results to the choice of atlas? If a different atlas (different resolution, different network definitions) is used, do you obtain similar importance maps and predictions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Dm6NnSuvPQ", "forum": "tAb8aUxuzd", "replyto": "tAb8aUxuzd", "signatures": ["ICLR.cc/2026/Conference/Submission17470/Reviewer_xSyh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17470/Reviewer_xSyh"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission17470/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761971537227, "cdate": 1761971537227, "tmdate": 1762927350802, "mdate": 1762927350802, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}