{"id": "tBSLnyT5US", "number": 11127, "cdate": 1758189865357, "mdate": 1760703594690, "content": {"title": "MATRIX: Multimodal Agent Tuning for Robust Tool-Use Reasoning", "abstract": "Vision language models (VLMs) are increasingly deployed as controllers with access to external tools for complex reasoning and decision-making, yet their effectiveness remains limited by the scarcity of high-quality multimodal trajectories and the cost of manual annotation. \nWe address this challenge with a vision-centric agent tuning framework that automatically synthesizes multimodal trajectories, generates step-wise preference pairs, and trains a VLM controller for robust tool-use reasoning. Our pipeline first constructs M-Trace, a large-scale dataset of 28.5K multimodal tasks with 177K verified trajectories, enabling imitation-based trajectory tuning. Building on this, we develop MATRIX Agent, a controller finetuned on M-Trace for step-wise tool reasoning. To achieve finer alignment, we further introduce Pref-X, a set of 11K automatically generated preference pairs, and optimize MATRIX on it via step-wise preference learning. Across three benchmarks, Agent-X, GTA, and GAIA, \\ours consistently surpasses both open- and closed-source \\vlms, demonstrating scalable and effective multimodal tool use. Our datasets and models will be open-sourced to support future research.", "tldr": "MATRIX is a vision-centric agent tuning framework that combines large-scale multimodal data synthesis with step-wise preference optimization, outperforming strong open- and closed-source baselines by up to 23% on Agent-X, GTA, and GAIA.", "keywords": ["Multimodal Agents", "Vision-language Model", "Tool usage"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/7faa1c43184d5192d66c33d84bfc9fd26e3e2857.pdf", "supplementary_material": ""}, "replies": [{"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We have come across a parallel approach that has not been properly attributed at the time of submission and compared in a fair setting. Therefore, we would like to withdraw the paper to address these concerns."}}, "id": "3Wu0NMvMR3", "forum": "tBSLnyT5US", "replyto": "tBSLnyT5US", "signatures": ["ICLR.cc/2026/Conference/Submission11127/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission11127/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760703594066, "cdate": 1760703594066, "tmdate": 1760703594066, "mdate": 1760703594066, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}