{"id": "tvFF19XsQq", "number": 2117, "cdate": 1756992300176, "mdate": 1759898168391, "content": {"title": "DLDP-BF: A Differentiated Local Differential Privacy Bloom Filter for Membership Queries", "abstract": "In privacy-preserving data processing, Bloom filters are widely used for their efficiency and scalability. \nHowever, existing methods adopt a fixed number of hash functions for all elements, disregarding their varying importance or frequency within the dataset. \nThis uniform treatment leads to a suboptimal trade-off between privacy and utility, as high-priority elements, such as frequent or critical data, require more precise encoding and finely tuned privacy protection, while less significant elements can tolerate greater uncertainty without severely affecting system performance.\nTo address this issue, we propose a Differentiated Local Differential Privacy Bloom Filter for Membership Queries (DLDP-BF). \nThis method dynamically allocates hash functions based on the relative importance of elements, enabling configuration of differentiated Bloom filters. \nDLDP-BF allocates more resources to high-priority elements, improving their encoding precision and reducing perturbations, thereby ensuring query accuracy for critical data.\nFurthermore, we design a novel local differential privacy (LDP) budget allocation algorithm based on differentiated Bloom filters that adaptively adjusts noise intensity based on element importance.\nThis algorithm ensures strict privacy protection while minimizing the impact on data utility.\nWe construct a mathematical model linking the importance of elements and privacy budget allocation, and theoretically demonstrate that our method maintains privacy while also balancing data utility.\nExperimental results show that DLDP-BF significantly improves data utility while preserving privacy. Specifically, it achieves an average reduction in RMSE of 37.1\\% and an average improvement in accuracy of 9.05\\%.", "tldr": "We propose DLDP-BF, a differentiated local differential privacy Bloom filter that adapts hash functions, ensuring LDP guarantees, formal utility–privacy tradeoff, and superior performance over existing methods.", "keywords": ["Bloom filter", "membership query", "Local Differential Privacy"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/cf1bcb34b2fe0579ef947dcd24cc114c1f7e8818.pdf", "supplementary_material": "/attachment/6e919496d168348ca5264ed4e5b14f47911f7ea8.pdf"}, "replies": [{"content": {"summary": {"value": "This paper proposes DLDP-BF, a Differentiated Local Differential Privacy Bloom Filter that addresses limitations in existing LDP Bloom filter methods by dynamically allocating hash functions and privacy budgets based on element importance. The authors introduce two algorithms: DHFA (Differentiated Hash Function Assignment) that assigns more hash functions to frequently queried elements, and PBA (Personalized Budget Allocation) that allocates privacy budgets proportionally to query frequency and membership probability. Experiments on three datasets demonstrate 49.0% RMSE reduction and 12.3% accuracy improvement compared to RAPPOR and DPBloomFilter, though the evaluation scope remains limited."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Well-motivated technical contribution with theoretical support. The paper identifies two genuine limitations in existing work: uniform hash function assignment regardless of data importance and fixed privacy budget allocation across all elements (lines 086-098). The proposed differentiated approach is intuitive and addresses a real practical need. The theoretical analysis (Section 4) provides formal privacy guarantees (Theorem 2) and utility bounds (Theorem 3), with the privacy proof properly accounting for the permanent randomized response mechanism.\n\n\n2. New privacy budget allocation framework. The PBA algorithm (Algorithm 3, Equation 2) represents, to the authors' knowledge, the first local differential privacy budget allocation method that jointly considers membership probability and query frequency (lines 106-107). This personalized approach is more realistic than uniform allocation and the formulation elegantly balances privacy protection for critical elements while maintaining utility for frequently queried items."}, "weaknesses": {"value": "1. Insufficient experimental evaluation. The experiments only compare against three methods (Non_Privacy, RAPPOR, DPBloomFilter) on three datasets (Section 5.1), which is limited for demonstrating broad applicability. Critically, the paper claims DPBloomFilter (Ke et al. 2025) is \"a representative solution\" (line 068) yet this is a very recent concurrent work that may not represent the state-of-the-art.\n\n2. Critical methodological details are unclear. The paper does not explain how query frequency Fi and membership likelihood Li are obtained in practice. Are these estimated from historical data, provided by applications, or learned? This is crucial since the entire method depends on these values (Algorithm 2, line 258; Algorithm 3, line 272). The DHFA algorithm (Equation 1) computes optimal hash count h*i but line 268 states \"Let the expected size of the set be n\" without clarifying whether n is known beforehand or estimated. \n\n3. Privacy-utility trade-off analysis lacks depth and the privacy model has limitations. While Figure 3 and 4 show performance across different ε values, the paper does not analyze the fundamental trade-off: how much privacy is sacrificed for utility gains compared to uniform allocation? For instance, does allocating more budget to high-frequency elements disproportionately expose their membership? The privacy guarantee (Theorem 2) assumes the hash function family and number of hash functions are public (Definition 2, lines 146-149), but the differentiated assignment itself may leak information about element importance."}, "questions": {"value": "1. Why was DPBloomFilter chosen as the primary comparison method rather than earlier established LDP Bloom filter works?\n\n2. What happens in cold-start scenarios where no historical data exists for new elements?\n\n3. For membership likelihood, how do you estimate the probability that an element belongs to a set before actually querying it?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "uKFZ0PlxYy", "forum": "tvFF19XsQq", "replyto": "tvFF19XsQq", "signatures": ["ICLR.cc/2026/Conference/Submission2117/Reviewer_wb3W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2117/Reviewer_wb3W"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2117/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761707621026, "cdate": 1761707621026, "tmdate": 1762916037728, "mdate": 1762916037728, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a Differentiated Local Differential Privacy Bloom Filter (DLDP-BF). It is a local-DP Bloom-filter scheme that adapts both the number of hash functions and the privacy budget to element importance. They have 2 components: (1) DHFA dynamically assigns more hash functions to elements with higher query frequency, (2) PBA assigns privacy budgets in proportion to query frequency and estimated membership probability. Across 3 datasets, DLDP-BF reports a $49%$ RMSE reduction and a $12.3%$ accuracy gain over RAPPOR and DPBloomFilter."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper identified two gaps in prior work: uniform hash-function assignment that ignores element importance, and fixed privacy budgets applied uniformly across all items (lines 086-098). It is neat and addresses a practical need. The authors also backup their method with theoretical results in Sec 4 for privacy guarantees (Thm 2) and utility bounds (Thm 3).\n\n2. The PBA algorithm (Algo 3, Eq. 2) is, to my knowledge, the first local-DP budget-allocation scheme. It incorporates both membership probability and query frequency (lines 106-107). This personalized design is more realistic than uniform allocation. It protects key elements while preserving utility for frequently queried items. I found it refreshing."}, "weaknesses": {"value": "1. Insufficient evaluation. The experiments compare only 3 methods (Non-Privacy, RAPPOR, DPBloomFilter) on 3 datasets (Sec 5.1). This setup is narrow and weakens applicability. The paper also refers to DPBloomFilter (Ke et al., 2025) as “a representative solution’’ (line 068). Yet, it is a very recent concurrent work and may not reflect the real SOTA.\n\n\n2. Incomplete details. This paper does not provide enough details of the proposed method. It does not specify how the query frequency $F_i$ and membership likelihood $L_i$ are obtained. Are they estimated from logs? provided by applications? or learned from data? Since both quantities are used in DHFA and PBA (Algo 2, line 258 & Algo 3, line 272), the omission is fatal for reproducibility. In DHFA, Eqn (1) defines the optimal hash count $h_i$. Yet, line 268 introduces “the expected size of the set $n$’’ without stating whether $n$ is known or estimated. This makes it unclear how $h_i$ should be instantiated in real deployments. Please specify.\n\n\n3. Privacy-utility trade-off and model limitations. Figures 3-4 report performance for different $\\epsilon$ values but do not discuss the underlying trade-off: how much privacy is traded for the reported utility gains over uniform allocation? For example, assigning larger budgets to high-frequency elements may increase their exposure risk. In addition, Thm. 2 assumes the hash-function family and the number of hash functions are public (Def. 2, lines 146-149). However, the differentiated assignment itself can reveal information about element importance. Please, clarify whether this leakage is acceptable under the threat model. Also, if  possible, explain how it is mitigated."}, "questions": {"value": "1. Why you made DPBloomFilter as the primary comparison method rather than earlier established LDP Bloom filter works?\n\n2. Consider no data exists, what happens in such cold-start scenarios?\n\n3. For membership likelihood, can you sketch how to estimate the probability that an element belongs to a set before actually querying it?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "uKFZ0PlxYy", "forum": "tvFF19XsQq", "replyto": "tvFF19XsQq", "signatures": ["ICLR.cc/2026/Conference/Submission2117/Reviewer_wb3W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2117/Reviewer_wb3W"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission2117/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761707621026, "cdate": 1761707621026, "tmdate": 1763611138270, "mdate": 1763611138270, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper studies privacy-preserving membership queries with Bloom filters under LDP. It argues that existing LDP-BF methods use uniform parameters (same number of hash functions, same privacy budget) for all elements, which can be inefficient when elements differ in importance (e.g., membership likelihood or query frequency). The authors propose DLDP-BF, which differentiates both (i) the number of hash functions and (ii) the local privacy budget per element according to importance, aiming to improve utility at fixed privacy."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "S1: The problem studied in this paper is clearly defined and well-motivated. \n\nS2: The experimental results demonstrate performance gains, showing that the proposed approach outperforms four existing baseline methods across multiple datasets.\n\nS3: The paper provides theoretical analysis covering computational complexity, privacy guarantees, and utility bounds."}, "weaknesses": {"value": "W1: More clarification of the threat model is expected. The method assumes access to (or accurate estimation of) per-element membership likelihood and query frequency to drive DHFA/PBA, but it does not specify how to obtain these safely under privacy constraints or how robust the system is to estimation errors or distribution shift.\n\nW2: Since the proposed method assigns a larger $h_i$ to high-importance items, a server can possibly infer an item’s importance class from the number/structure of touched bits. It is better to analyze or bound this ‘importance-label leakage,’ or propose a mitigation.\n\nW3: Similarly, since the proposed method assigns larger privacy budgets to high-importance elements, a server may be able to infer an item’s importance level based on differences in noise magnitude or output variance.\n\nW4: The DHFA logic leverages prior knowledge of frequency/likelihood distributions; however, the paper does not analyze worst-case mismatch. \n\nW5: Experiments report RMSE and accuracy across datasets and parameters, but there is no measurement of runtime/throughput, memory, or client/server communication overhead, which are important for Bloom-filter pipelines at scale.\n\nW6: Algorithms 1–3 need clearer, step-by-step explanations."}, "questions": {"value": "Q1: Could the authors clarify the assumed threat model in more detail? Specifically, how are per-element membership likelihood and query frequency obtained or estimated without violating privacy guarantees? \n\nQ2: How robust is the proposed framework if these statistics are inaccurate or shift over time?\n\nQ3: Since the proposed method assigns a larger privacy budget/a larger number of hash functions (h_i) to higher-importance items, could a server or an attacker potentially infer an element’s importance level or class from observable Bloom filter updates?\n\nQ4: Similarly, as the proposed method allocates larger privacy budgets to high-importance elements, could the server infer an item's importance level from the differing noise magnitude or output variance?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "UhvxPrgq8R", "forum": "tvFF19XsQq", "replyto": "tvFF19XsQq", "signatures": ["ICLR.cc/2026/Conference/Submission2117/Reviewer_Q7gb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2117/Reviewer_Q7gb"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission2117/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761771115892, "cdate": 1761771115892, "tmdate": 1762916037237, "mdate": 1762916037237, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the problem of privacy-preserving membership queries over large-scale datasets. Traditional Bloom filter-based approaches typically employ a fixed number of hash functions for all elements, overlooking differences in their importance or frequency, which leads to a suboptimal balance between privacy and utility.\n\nThe authors propose a Differentiated Local Differential Privacy Bloom Filter (DLDP-BF), which dynamically allocates the number of hash functions and privacy budgets according to element importance, thereby improving query accuracy. The paper also designs a novel LDP budget allocation algorithm that adaptively adjusts noise intensity proportionate to element importance. Theoretical analysis proves that the method provides strict Local Differential Privacy (LDP) guarantees while enhancing data utility. Experimental results demonstrate the superior performance of the proposed approach in real-world scenarios, confirming its practical value."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.  **Originality**: This paper innovatively incorporates element importance into privacy budgeting and hash function allocation to achieve differential privacy protection. The introduction of Personalized Budget Allocation (PBA) represents a novel direction in privacy-preserving membership query scenarios.\n\n2.  **Clarity**: Figure 2 provides an intuitive illustration of the DLDP-BF workflow, effectively facilitating the understanding of inter-modular relationships within the system. The paper features a complete structure, with precise textual expression and coherent logical flow."}, "weaknesses": {"value": "1. Using Bloom filter with LDP for privacy-preserving membership query is not well-motivated. The competitor RAPPOR is originally designed for statistical frequency queries.\n\n2. The proposed method requires prior knowledge about importance/frequency of elements, which can be hard obtain in privacy-sensitive scenarios.\n \n3. While the paper provides proofs for privacy guarantees and complexity analysis, it does not establish theoretical performance bounds under varying importance distributions .\n\n4.  The adaptability of DLDP-BF requires further validation in dynamic query scenarios or under distribution drift conditions."}, "questions": {"value": "1. Please provide motivation scenarios of Bloom filter with LDP for privacy-preserving membership query.\n\n2. Please discuss the practicalness of requiring prior statistical profile about elements.\n\n3. Please discuss the permances under distribution drift."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "neXqtuKo13", "forum": "tvFF19XsQq", "replyto": "tvFF19XsQq", "signatures": ["ICLR.cc/2026/Conference/Submission2117/Reviewer_sE9T"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2117/Reviewer_sE9T"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission2117/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761875539625, "cdate": 1761875539625, "tmdate": 1762916036938, "mdate": 1762916036938, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel variant of locally differentially-private Bloom filter in which the number of hash functions assigned as well as the privacy budget allocated are chosen in a data-dependent manner to improve on the utility."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "-The authors have clearly introduced the background on Bloom filters, including their efficiency for performing membership queries but also the privacy issues associated to their uses. \n\n-The proposed approach has been validated experimentally on three different datasets and compare to two other local differentially-private versions of Bloom filters and seem to display a higher performance in terms of utility."}, "weaknesses": {"value": "-The review of local differentially-private Bloom filters methods should be strengthen and detailed more. For instance, currently only two methods are cited but without providing any details on the underlying constructions. This issue is really important to be able to position the approach proposed and assess its novelty. Additionally, the literature review should also refer to papers that have studied how to integrate heterogenous or personalized privacy budget in a differentially-private mechanism.\n\n-The dynamic adjustment of the hash function and the privacy budget requires to be able to store a significant amount of information on each element, which defeats the purpose of the Bloom filter that requires to have a highly efficient data structure that can be updated on the fly. More precisely, the choice of the hyper parameters of the proposed data structure should depend on a set of realistic assumptions about the distribution but not require to store an amount of data that is significantly larger than the size of the data structure. \n\n-The dynamic adjustment of the hash function assignment and the privacy budget based on an element importance is directly in tension with privacy as estimating one of these two parameters can directly leak information about the element. This aspect is crucial to the privacy analysis but is not discussed at all in the paper, which raises serious doubts about the privacy protection provided.\n\n-The papers are not appropriately cited in the text. In particular, there are not between parentheses.\n\nMinor typo :\n-« the overall privacy security of the system »"}, "questions": {"value": "Please see the main points raised in the weaknesses section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7EB3xm2YAC", "forum": "tvFF19XsQq", "replyto": "tvFF19XsQq", "signatures": ["ICLR.cc/2026/Conference/Submission2117/Reviewer_kZsJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission2117/Reviewer_kZsJ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission2117/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762232923430, "cdate": 1762232923430, "tmdate": 1762916036587, "mdate": 1762916036587, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}