{"id": "TvpaeQVTGQ", "number": 14018, "cdate": 1758227016412, "mdate": 1759897395778, "content": {"title": "A Fast, Reliable, and Secure Programming Language for LLM Agents with Code Actions", "abstract": "Modern large language models (LLMs) are often deployed as agents, calling external tools adaptively to solve tasks. Rather than directly calling tools, it can be more effective for LLMs to write code to perform the tool calls, enabling them to automatically generate complex control flow such as conditionals and loops. Such code actions are typically provided as Python code, since LLMs are quite proficient at it; however, Python may not be the ideal language due to limited built-in support for performance, security, and reliability. We propose a novel programming language for code actions, called QUASAR, which has several benefits: (1) automated parallelization to improve performance, (2) uncertainty quantification to improve reliability and mitigate hallucinations, and (3) security features enabling the user to validate actions. LLMs can write code in a subset of Python, which is automatically transpiled to QUASAR. We evaluate our approach on the ViperGPT and CaMeL agents, applied to the GQA visual question answering and AgentDojo AI assistant datasets, demonstrating that LLMs with QUASAR actions instead of Python actions retain strong performance, while reducing execution time by up to 56%, improving security by reducing user approvals by up to 53%, and improving reliability by applying conformal prediction to achieve a desired target coverage level.", "tldr": "We propose a new language for LLM agents to use for actions, and we show its benefits over Python in terms of performance, reliability, and security.", "keywords": ["llm", "agent", "code actions", "code generation"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2a868ef22a3e694e356398a52802a3688f9521f5.pdf", "supplementary_material": "/attachment/2322990336908c1f77a5d4b15ed4599b2d5db0d9.zip"}, "replies": [{"content": {"summary": {"value": "This paper falls outside my area of expertise.  I'm unable to assess this paper."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "N/A"}, "weaknesses": {"value": "N/A"}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "5nILa6oIgp", "forum": "TvpaeQVTGQ", "replyto": "TvpaeQVTGQ", "signatures": ["ICLR.cc/2026/Conference/Submission14018/Reviewer_MYLk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14018/Reviewer_MYLk"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14018/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760504646793, "cdate": 1760504646793, "tmdate": 1762924512831, "mdate": 1762924512831, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces QUASAR, a novel programming language designed to improve the performance, security, and reliability of LLM-based agents. QUASAR achieves this by separating internal computations from external side effects, supporting parallel execution, and utilizing conformal semantics for uncertainty quantification. The language is implemented through a workflow where LLMs generate Python code, which is then transpiled to QUASAR. Experimental results show that QUASAR improves execution speed (up to 56% faster), reduces user interaction for security validation, and maintains high reliability with a target error rate of 0.1."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper effectively identifies challenges in LLM-based agents which write Python code to invoke tool APIs, and presents a practical solution through QUASAR.\n- The \"internal computation - external side effects separation\" architecture and the introduction of conformal semantics are novel and offer significant advantages in performance, security, and reliability.\n- Experiments on real-world agents like ViperGPT and CaMeL, covering performance, security, and reliability, demonstrate the practical benefits of QUASAR."}, "weaknesses": {"value": "- Lack of Detailed Technical Explanation: The paper lacks in-depth descriptions of key components like QUASAR’s rewrite rules, Python subset syntax, and transpiler implementation, which could impact reproducibility and understanding.\n- Flexibility Concerns in Tool-Calling Scenarios: While QUASAR improves upon Python in certain areas, there is a concern about whether it can maintain the same flexibility as Python in all tool-calling scenarios. Python’s ecosystem is rich with libraries that facilitate diverse use cases (e.g., system administration tasks, network programming, data processing). It’s unclear if QUASAR can handle such diverse scenarios with the same ease and flexibility, particularly in more dynamic, real-time applications where Python’s built-in flexibility is often crucial. A clearer discussion on this aspect and how QUASAR addresses such scenarios, if at all, would be valuable."}, "questions": {"value": "- What optimizations would you suggest for fine-tuning on small datasets like AgentDojo? Are techniques like transfer learning or data augmentation being considered to improve performance on such tasks?\n- How does QUASAR address tasks that cannot be parallelized due to dependencies? Could you provide more insight into the characteristics of tasks that hinder parallel execution?\n- Could QUASAR be considered more of a specialized Python interpreter rather than a new programming language? How does it differ from existing solutions such as parallel-execution Python interpreters (PyPy, Cython) or security frameworks (e.g., Sandboxed Python), which already provide performance improvements for Python code? What makes QUASAR’s approach more beneficial than these well-established, mature solutions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "bmUeKsprI0", "forum": "TvpaeQVTGQ", "replyto": "TvpaeQVTGQ", "signatures": ["ICLR.cc/2026/Conference/Submission14018/Reviewer_JjBk"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14018/Reviewer_JjBk"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14018/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761997343098, "cdate": 1761997343098, "tmdate": 1762924512083, "mdate": 1762924512083, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces QUASAR, a new programming language designed to make LLM-driven code execution faster, safer, and statistically reliable. It combines a pure functional core, explicit side-effect isolation, automatic parallelization, and conformal prediction–based uncertainty propagation. The work is ambitious and conceptually motivated, aiming to establish a formal, language-level foundation for trustworthy agent behavior. Broadening experiments and addressing realistic LLM integration would make it stronger in practice and more convincing."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Designing an LLM-native programming language for code generation action is innovative and promising. \n- QUASAR introduces a pure functional core that separates computation from side effects.\nThis separation allows deterministic execution, simplifies formal reasoning, and makes program behavior easier to verify and audit.\n- The runtime system can automatically detect independent external calls and execute them concurrently.\nExperiments show up to 56% reduction in total execution time, demonstrating concrete performance gains compared to sequential baselines.\n- QUASAR enforces strict external-call isolation through explicit user approval.\nIt introduces a batch-approval mechanism that reduces the number of user interactions by over 50%, balancing usability and safety while preventing unverified API calls."}, "weaknesses": {"value": "- **Narrow evaluation scope:**\nThe experiments are confined to small, synthetic benchmarks (GQA and AgentDojo). These tasks are short and prestructured, which limits the external validity of the claims. There is no evaluation in complex or dynamic environments that real LLM agents operate in.\n- **Limited language expressiveness:**\nQUASAR only supports a very restricted subset of Python (functions, variables, simple control flow). It does not handle classes, exceptions, pattern matching, or early returns. This simplicity makes formal analysis easier but severely limits applicability to realistic agent workflows that depend on richer language features.\n- **Unclear LLM integration strategy:**\nThe paper proposes transpiling from a restricted Python subset but does not explain how LLMs are constrained to generate only this subset. There is no discussion of prompting or fine-tuning when the model produces invalid constructs. This leaves a major usability gap between theory and practice."}, "questions": {"value": "How are LLMs guided or constrained to produce valid Python subsets that can be reliably transpiled into QUASAR, and what is the success rate of this process in practice?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "klRly1X6if", "forum": "TvpaeQVTGQ", "replyto": "TvpaeQVTGQ", "signatures": ["ICLR.cc/2026/Conference/Submission14018/Reviewer_M2ub"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14018/Reviewer_M2ub"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14018/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762075873334, "cdate": 1762075873334, "tmdate": 1762924511562, "mdate": 1762924511562, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces QUASAR, a novel programming language designed specifically for LLM agents that use code actions. Unlike Python—which is the standard medium for LLM-generated code—QUASAR provides built-in mechanisms for performance optimization (via automatic parallelization), security (via dynamic access control and user approval of external calls), and reliability (via conformal semantics for uncertainty quantification)."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "+ The rewrite-rule semantics and external call dispatch mechanism are rigorously formalized.\n\n+ The ability to propagate model uncertainty at the program level is a novel contribution that could inspire future work on trustworthy agent execution.\n\n+ The use of a Python subset and a transpiler ensures backward compatibility with current LLMs, addressing real-world deployability concerns (without performance degradation)."}, "weaknesses": {"value": "- The paper does not specify how QUASAR manages external call failures, exceptions, or thread-level errors. For example, what happens if an external API call fails, times out, or returns an invalid response? Is the failure propagated, retried, or absorbed?\n\n- While QUASAR executes external calls “as soon as all their arguments are available,” it is not clear whether “futures” or deferred results are explicitly represented in the language. How does the interpreter manage dependencies among pending external calls or enforce order when results are reused?"}, "questions": {"value": "It wasn’t clear to me what the sentence “There is only one external rule Rext = {Rext}. This rule is designed to enable calls to external functions f ∈ Fext” means in practice. Does this imply that all side-effecting operations (e.g., API calls, LLM queries) are handled uniformly through this single rewrite rule? How does QUASAR distinguish between different external APIs at runtime?\n\nCould QUASAR’s transpilation strategy be generalized to other host languages (e.g., typescript) or is it fundamentally tied to Python’s semantics?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "uwDUZ3rzdg", "forum": "TvpaeQVTGQ", "replyto": "TvpaeQVTGQ", "signatures": ["ICLR.cc/2026/Conference/Submission14018/Reviewer_FyqM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14018/Reviewer_FyqM"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14018/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762165776847, "cdate": 1762165776847, "tmdate": 1762924510982, "mdate": 1762924510982, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}