{"id": "TVZUs605BB", "number": 17972, "cdate": 1758282529331, "mdate": 1759897141701, "content": {"title": "Efficient Quad Bayer Demosaicing with Look-Up Tables", "abstract": "This paper presents a novel look-up table-based demosaicing method for quad Bayer pattern. Recent deep learning approaches, though effective, are computationally expensive and unsuitable for efficient implementation. We first introduces a residual LUT to reduce memory and computational complexity. The method employs a two-stage demosaicing process: the first stage performs primary demosaicing, while the second stage enhances high-frequency components. Each stage consists of a number of residual LUTs and they are stacked both in serial and parallel to effectively enlarge the receptive field size. In experiments, our method achieves stable performance and improved image quality with efficiency. In addition, the size and the computational complexity of our method enable efficient hardware implementation.", "tldr": "", "keywords": ["quad bayer", "demosaicing", "real-time", "efficient", "isp"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b628649c1dffd2f1534ba2106dc0c19bf5132f82.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents a novel, lookup table (LUT)-based approach for Quad Bayer demosaicking, targeting efficient computation and hardware-friendly implementation. The proposed method adopts a two-stage architecture: the first stage performs initial demosaicking, while the second stage focuses on enhancing high-frequency components to restore fine details and edges. Each stage is composed of multiple residual LUTs, which are flexibly stacked in both serial and parallel configurations to expand the effective receptive field without significantly increasing computational cost. Notably, the model achieves competitive image quality even with a very compact LUT size (as small as 73KB), making it highly suitable for deployment in resource-constrained environments such as mobile ISPs. Experimental results demonstrate that the method outperforms existing approaches in terms of efficiency and maintains robust performance across different sensor data."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper introduces the LUT-based deep learning framework tailored specifically for Quad Bayer demosaicking. This rethinking of neural network components as compact, reusable lookup tables is conceptually novel and aligns well with hardware optimization goals.\n- With a total LUT size of only 73KB, the method achieves strong performance while being exceptionally lightweight. This makes it ideal for real-time applications and embedded systems where memory and power are limited.\n- The separation between coarse reconstruction (Stage 1) and detail refinement (Stage 2), particularly focusing on high-frequency enhancement, allows for better control over image quality and edge preservation.\n- The paper includes evaluations demonstrating performance gains over baseline methods, supporting claims about efficiency and effectiveness."}, "weaknesses": {"value": "- The paper does not actually perform demosaicking. It only reconstructs the green (G) channel with a 50% sampling rate. This cannot be regarded as a demosaicking task, since true demosaicking requires the estimation of all three RGB channels. Moreover, effective demosaicking methods typically exploit inter-channel correlations, which are not utilized in the current approach.\n\n- The experiments are conducted on clear scenes, while the Quad Bayer pattern was originally designed for low-light conditions, where pixel binning is applied to improve the signal-to-noise ratio (SNR) at the cost of spatial resolution.\n\n- The paper lacks validation on real Quad Bayer images. Given that many smartphones equipped with Quad Bayer  CFAs are capable of capturing RAW images, the proposed method should be evaluated on real-world data to demonstrate its practical effectiveness.\n\n- The paper does not test the inference speed and throughput achieved on actual hardware (e.g., FPGA or mobile NPU)."}, "questions": {"value": "-  From an experimental perspective, this paper is far from complete. Please refer to the weaknesses described above.\n- Can the current framework adapt to varying CFA patterns or must it be retrained for each specific sensor layout? What is the transferability across devices?\n- What are the inference speed and throughput achieved on actual hardware (e.g., FPGA or mobile NPU)? Providing real-world latency metrics would greatly enhance the practical relevance of the claims."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "da2D7ub51p", "forum": "TVZUs605BB", "replyto": "TVZUs605BB", "signatures": ["ICLR.cc/2026/Conference/Submission17972/Reviewer_Nk16"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17972/Reviewer_Nk16"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17972/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761840100412, "cdate": 1761840100412, "tmdate": 1762927765713, "mdate": 1762927765713, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces an efficient method for Quad Bayer pattern demosaicing using look-up tables (LUTs). Addressing the high computational cost of existing deep learning-based methods, the authors propose a pipeline centered around a new \"residual LUT\" concept, which significantly reduces the memory and computational complexity. The proposed architecture consists of a two-stage process: a primary demosaicing stage followed by a high-frequency enhancement stage. To handle the large receptive field required for demosaicing, the method stacks multiple small residual LUTs in both serial and parallel configurations. By integrating principles from classical demosaicing, such as directional chroma processing, the model achieves a good balance between performance and efficiency. Experiments show that the method achieves competitive image quality and significantly lower energy cost compared to DNN-based approaches, making it highly suitable for hardware implementation on edge devices."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "S1. The paper introduces a practical LUT-based approach for Quad Bayer demosaicing. The core \"residual LUT\" concept is a clever way to reduce a 4D LUT to a 3D LUT, fundamentally slashing memory and computational requirements.\n\nS2. The efficiency of the proposed approach is highly compelling for mobile/edge hardware.\n\nS3. The two-stage design (primary demosaicing + high-frequency enhancement) is reasonable. The use of cascaded LUTs (both serial and parallel) to build a large receptive field from small components is a good design choice."}, "weaknesses": {"value": "W1. Demosaicing is a color reconstruction task. By addressing only the green channel, the paper fails to solve the actual problem. The claim that it \"can be extended\" to R/B channels is insufficient without experimental results. As presented, the work is a gray-only reconstructor, not a full demosaicing solution.\n\nW2. The method feels more like bespoke, hardware-centric engineering. The architecture (Fig. 4 and 7) is an intricate, hand-crafted cascade of specialized LUTs. \n\nW3. The gradient block design (Fig. 4, Fig. 7) is extremely complex and poorly explained. \n\nW4. The \"stepwise finetuning\" (Sec 3.5) is presented as an empirical trick \"determined through extensive experiments\"  with no theoretical or intuitive justification for the specific order, weakening the methodological rigor."}, "questions": {"value": "Refer to Weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "gj5xIyssqe", "forum": "TVZUs605BB", "replyto": "TVZUs605BB", "signatures": ["ICLR.cc/2026/Conference/Submission17972/Reviewer_e7gE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17972/Reviewer_e7gE"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17972/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761981930597, "cdate": 1761981930597, "tmdate": 1762927765302, "mdate": 1762927765302, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a two-stage residual Look-Up Table (LUT)-based framework for quad Bayer demosaicing. It aims for a hardware-efficient, low-latency solution suitable for resource-constrained devices like smartphone ISPs, featuring a compact model size of 73kB."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The residual LUT design is genuinely compact and hardware-friendly, addressing a key industry demand, also the need for efficient solutions compared to large Deep Neural Networks (DNNs) is well-articulated."}, "weaknesses": {"value": "Lacks direct, concrete efficiency comparisons (latency/energy) against modern, lightweight CNNs (e.g., MobileNetV3). The method is not demonstrated on the full Red (R) and Blue (B) channels, limiting its practical applicability for full-color images. Lacks deep analysis of ablation results (e.g., why the 2nd stage is necessary; how the design leverages the quad-Bayer pattern). PSNR gains reported do not consistently translate to better visual sharpness than rival methods (e.g., PIPINet)."}, "questions": {"value": "The core idea is promising for industrial application, but the submission is fundamentally limited by insufficient experimental validation, limited scope (green-only), and a lack of detailed analysis. The authors must provide stronger evidence of efficiency against true state-of-the-art baselines and demonstrate full-color demosaicing capability."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "jZYsOceDWq", "forum": "TVZUs605BB", "replyto": "TVZUs605BB", "signatures": ["ICLR.cc/2026/Conference/Submission17972/Reviewer_691u"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17972/Reviewer_691u"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17972/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762043164223, "cdate": 1762043164223, "tmdate": 1762927764633, "mdate": 1762927764633, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}