{"id": "uCZtTolnY8", "number": 8205, "cdate": 1758074207566, "mdate": 1759897800288, "content": {"title": "D-CHOPT: DISCOVERING CLOSED-FORM HIGH-DIMENSIONAL ODEs FROM PARTIAL OBSERVED TRAJECTORIES", "abstract": "Machine learning algorithms have become a new paradigm for automatically discovering closed-form ordinary differential equations (ODEs) from observed trajectories. Although significant breakthroughs have been made in this field, such as symbolic regression and sparse identification of nonlinear dynamics (SINDy), existing approaches primarily perform well for low-dimensional ODEs. This limitation arises due to the lack of understanding of observability limitations in partially observed trajectories, and the additional challenges introduced by complex topological properties. In this work, we propose a method for discovering closed-form high-dimensional ODEs from partially observed trajectories, called D-CHOPT, which advances ODE discovery methods beyond the natural limitations of high-dimensional ODEs. D-CHOPT uses an invertible neural network as the backbone to find the optimal solution within the diffeomorphic equivariant group of the reconstructed dynamical systems, while preserving topological properties and integrating a variable selection method. We provide a formal analysis of observability and the learning limitations of partial trajectories, and explain the enhancements in a manner consistent with the theoretical results. In experiments, D-CHOPT successfully discovered the governing equations for a wide range of dynamical systems, both low and high dimensional.", "tldr": "In this work, we propose a method for discovering closed-form high-dimensional ODEs from partially observed trajectories, called D-CHOT, which advances ODE discovery methods beyond the natural limitations of high-dimensional ODEs.", "keywords": ["Ordinary Differential Equation", "Sparse Identification of Nonlinear Dynamic System", "Partial Observed Data"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0373b0b0f8e16180214ecc8baed66e5e00f6007a.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes a framework to recover the closed-form solution of ODEs from partially observable data. Some theories are introduced and the models are evaluated in several systems."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The theory and numerical results seem good for several systems."}, "weaknesses": {"value": "1. The paper needs revision to remove typos in notations and reorganize some sections. \n2. The experiments are limited.\n3. The methods are not well elaborated."}, "questions": {"value": "1.\tThe author lacks the review of learning equations with partial observability, e.g., \na.\tLi, Haoran, and Yang Weng. \"Physical equation discovery using physics-consistent neural network (PCNN) under incomplete observability.\" Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining. 2021.\nb.\tStepaniants, George, et al. \"Discovering dynamics and parameters of nonlinear oscillatory and chaotic systems from partial observations.\" Physical Review Research 6.4 (2024): 043062.\n2.\tWhere is your n in your \\phi(t;n,\\tau)? y(t) is what coordinate from \\boldsymbol{y}(t)? Do you mean each entry of \\boldsymbol{y}(t)? The author should carefully revise the paper.\n3.\tIf the construction of the H uses only an entry of \\boldsymbol{y}(t), does this mean that each coordinate can be independently recovered? This seems to ignore the intra-correlations between ODE variables. \n4.\tSection 3 seems to be related work, rather than model and algorithm.\n5.\tI don’t quite understand why should we select measurements for the embedding. The example h(x)=x1 or h(x)=x2 is unclear to me. \n6.\tIt’s hard to understand why we should introduce 6 losses in Section 4.2. \n7.\tThe experiments are limited. For example, there is no ablation study. No sensitivity analysis for the hyper parameters \\lambda1 to \\lambda6."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "gURDkxKEwj", "forum": "uCZtTolnY8", "replyto": "uCZtTolnY8", "signatures": ["ICLR.cc/2026/Conference/Submission8205/Reviewer_1WdS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8205/Reviewer_1WdS"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761776946924, "cdate": 1761776946924, "tmdate": 1762920154917, "mdate": 1762920154917, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles a challenging and important problem in the realm of scientific machine learning: recovering closed-form ordinary differential equations (ODEs) when only partial trajectories are observed, particularly in high-dimensional dynamical systems. Traditional methods like SINDy or symbolic regression perform well in low-dimensional, fully observed settings, but struggle when the observation is incomplete or the system is chaotic and high-dimensional. To address this, the authors propose D-CHOPT — a novel, theoretically grounded framework that blends delay-coordinate embedding, observability theory, and invertible neural networks (iResFlow) to reconstruct the full state dynamics and then discover sparse, interpretable ODEs."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "This paper tackles a genuinely hard and underexplored problem — discovering closed-form high-dimensional ODEs from partially observed trajectories. The formulation of D-CHOPT is theoretically grounded, combining observability theory, Takens’ embedding, and invertible neural networks in a coherent way. The authors provide a rigorous discussion of the mathematical underpinnings, including the role of the singular manifold and differential embedding, which is rare in machine learning papers attempting ODE discovery. \n\nEmpirically, the experiments on canonical dynamical systems (Lorenz, Rössler, linear/nonlinear oscillators) convincingly demonstrate that D-CHOPT can recover governing equations under conditions where SINDy-AE fails. The inclusion of topology-preserving losses (RTD-Lite) and the clear analysis of observability are both original and significant contributions."}, "weaknesses": {"value": "1. The exposition could be improved — many sections (especially on Takens’ theorem and observability proofs) are mathematically heavy and could be summarized more intuitively for clarity.\n2. The experimental evaluation has no demonstration on real or noisy experimental data (e.g., chaotic physical signals, fluid dynamics, or sensor systems). \n3. The comparison baselines are narrow — mostly SINDy-AE.\n4. Adding some ablation on the influence of topology loss or invertibility constraints. Because it will be helpful to clarify where performance gains actually come from."}, "questions": {"value": "1. How sensitive is D-CHOPT to the choice of embedding dimension and time delay in Takens’ mapping? Can the method adaptively learn these parameters?\n2. Can variable selection algorithm handle cases where the observables are nonlinear combinations, not coordinate projections?\n3. The topology loss (RTD-Lite) seems critical. Could the authors provide an ablation or visualization showing how the topology is preserved versus SINDy-AE?\n4. Can author do more comparison baselines, not just only SINDy-AE?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "40rNN0usNg", "forum": "uCZtTolnY8", "replyto": "uCZtTolnY8", "signatures": ["ICLR.cc/2026/Conference/Submission8205/Reviewer_Uujn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8205/Reviewer_Uujn"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761912767444, "cdate": 1761912767444, "tmdate": 1762920154408, "mdate": 1762920154408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces D-CHOPT which aims to identify analytic ODE equations from limited observations of dynamical systems.\nThe approach builds on Takens’ embedding theorem, combining a variable-selection algorithm (to choose the most observable coordinate) with an invertible neural-network architecture that reconstructsmappings between the observed trajectories and the latent state space.\nThe model jointly optimizes several losses to recover a parsimonious closed-form ODE. Experiments on canonical systems are compared against SINDy-AE, showing marginal or inconsistent improvements."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper tackles an important problem: discovering interpretable dynamical laws from partial and noisy observations, which is central to the broader effort of AI-driven scientific discovery. The integration of observability theory and topological constraints into a neural framework is conceptually appealing and demonstrates a thoughtful attempt to link classical dynamical-systems theory with modern machine-learning methods. The exposition includes substantial theoretical background. The overall structure of the method shows a degree of comprehensiveness and reflects an awareness of the main challenges in ODE discovery. The authors also provide qualitative visualizations and clear figures that help convey the intuition behind the approach."}, "weaknesses": {"value": "Despite these conceptual merits, the paper suffers from several significant limitations. First, the problem formulation is internally inconsistent: although the method is presented as handling partial observability, it assumes access to all possible observables in order to choose the “best” one. This assumption undermines the realism of the setting and makes the proposed solution somewhat artificial. Moreover, the restriction to reconstructing the system from a single selected variable, rather than using all available observed signals jointly, appears sub-optimal and contrary to how partial observability is usually addressed in practice. Second, while the paper repeatedly claims scalability to high-dimensional systems, all experiments are performed on low-dimensional benchmarks. No evidence is provided that D-CHOPT can handle genuinely high-dimensional cases, so the “high-dimensional” claim remains unsubstantiated.\nThird, the main methodological contribution is insufficiently rigorous. The algorithm is only briefly described in the main text and deferred largely to the appendix, with no theoretical guarantees or analysis of convergence. Empirically, it appears ineffective: for instance, the observability scores reported in Table 1 for the Lorenz system are nearly identical, suggesting the method fails to distinguish between variables meaningfully. Fourth, the empirical evaluation is inconclusive. The comparisons with SINDy-AE show no consistent advantage, and in several cases D-CHOPT performs worse. Some reported variances of 0.00 are implausible and likely indicate flaws in the experimental protocol or insufficient statistical sampling. Finally, the experimental conditions are overly benign—using only 1 % Gaussian noise and regular sampling—so the results do not demonstrate robustness to more realistic or challenging data conditions.\n\nOverall, while the paper proposes an interesting synthesis of ideas, the novelty is limited relative to prior frameworks such as SINDy-AE, and the empirical evidence does not convincingly support the claimed improvements. The combination of conceptual inconsistencies, weak empirical validation and lack of theoretical clarity limits the paper’s contribution at this stage."}, "questions": {"value": "See weaknesses above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "dVX8qYBdCm", "forum": "uCZtTolnY8", "replyto": "uCZtTolnY8", "signatures": ["ICLR.cc/2026/Conference/Submission8205/Reviewer_2aMj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8205/Reviewer_2aMj"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761926256061, "cdate": 1761926256061, "tmdate": 1762920154002, "mdate": 1762920154002, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work proposes a variant of the SINDy autoencoder method for discovering symbolic governing equations from partially observed dynamics."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The authors make an interesting observation regarding variable selection and the issue of a singular manifold that prevents a globally well-defined embedding using a small number of delay coordinates."}, "weaknesses": {"value": "While this work presents an interesting theoretical setup, the method itself is not particularly novel. Previous work has already used similar approaches to discover governing equations from partial observations, including Bakarji et al (cited in the paper), as well as other work not cited:\n1. https://pubs.aip.org/aip/cha/article/32/6/063101/2835714/Model-selection-of-chaotic-systems-from-data-with\n2. https://journals.aps.org/prresearch/abstract/10.1103/PhysRevResearch.6.043062\n3. https://www.nature.com/articles/s42005-022-00987-z\nThe authors do not compare against nor discuss these works in the context of their approach.\n\nThe proposed method introduces a few new loss functions into the SINDy autoencoder setup, which further complicates hyperparameter tuning. This tuning is not discussed, nor are ablation studies performed, when introducing these new terms.\n\nThe results in Table 2 seem to suggest very similar performance with SINDy autoencoder, calling into question the benefit of this approach. This is also reflected in Figure 3, where the SINDy-AE seems to discover a nonlinear equation that has the right behavior for the Lorenz attractor, whereas the proposed D-CHOPT discovers a purely linear governing equation (according to the equation in the figure) that is therefore not even chaotic. The plots in Figure 3 for D-CHOPT also do not seem to reflect the discovered governing equation, calling into question the validity of the result.\n\nFinally, the authors claim to be dealing with \"high-dimensional ODEs\", but none of the examples are beyond 3 variables."}, "questions": {"value": "1. Why restrict yourself to using one observation variable, requiring you to devise a method for choosing one, rather than using all available observations? It seems that the proposed method throws away potentially useful information for reconstructing the dynamics.\n2. Figure 2 is generally confusing. What is CoeffsNet?\n3. Are the plots in Figure 3 showing full trajectories from the discovered governing equations starting from a single initial condition or is something else being plotted?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "qYtHvXxOOa", "forum": "uCZtTolnY8", "replyto": "uCZtTolnY8", "signatures": ["ICLR.cc/2026/Conference/Submission8205/Reviewer_wVRd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8205/Reviewer_wVRd"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8205/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762028031211, "cdate": 1762028031211, "tmdate": 1762920153683, "mdate": 1762920153683, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}