{"id": "uEND0LWlc8", "number": 24295, "cdate": 1758355050995, "mdate": 1759896772355, "content": {"title": "Obj2CAD: Object-Oriented Text-to-CAD Generation with Large Language Models", "abstract": "Text-to-CAD aims to generate CAD models directly from natural language descriptions. Existing methods predominantly follow a procedural paradigm that represents modeling as long sequences of operations. This approach suffers from several inherent limitations: strictly order-dependent, prone to error accumulation, cluttered with redundant low-level constraints, and misaligned with the object-centric reasoning of both human designers and large language models (LLMs). We introduce Obj2CAD, the first framework to shift text-to-CAD from a procedural to an object-oriented paradigm. To support this shift, we curate a new dataset of 1,000 examples, including both industrial parts and carefully selected shapes that are linguistically describable. Each example is converted into an object-oriented representation that emphasizes hierarchical structure and semantic constraints while de-emphasizing redundant low-level constraints. Building on this foundation, we design an LLM-driven framework that combines top-down planning with bottom-up generation, offering a divide-and-conquer approach to text-to-CAD. To enhance spatial reliability, we propose geometric assembly reasoning to formulate assembly explicitly as geometric-mathematical problems. Finally, we introduce an interactive iterative mechanism that incorporates user feedback to refine objects and expand the object graph, enabling continuous system improvement. We provide a live demo of Obj2CAD and will publicly release the dataset to support future research on object-oriented CAD generation.", "tldr": "", "keywords": ["CAD", "LLM", "Graph", "Object-Oriented"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/be9e5b3f574d4b3197293a4b1d8d9dcd1647eeb9.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes OBJ2CAD, a framework that shifts text-to-CAD generation from a procedural paradigm to an object-oriented paradigm. The authors construct a dataset of 1,000 object-oriented CAD examples and design an LLM-driven system combining top-down planning with bottom-up generation. The framework includes geometric assembly reasoning and an interactive feedback mechanism for iterative refinement."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1- Novel Paradigm Shift: The conceptual shift from procedural to object-oriented CAD generation is well-motivated and addresses genuine limitations of existing approaches (error accumulation, lack of modularity, poor alignment with human design intuition).\n\n2- Thoughtful Dataset Design: The curation of 1,000 examples with emphasis on linguistic describability, hierarchical structure, and semantic constraints represents a valuable contribution.\n\n3- Practical Interactive Mechanism: The object-level feedback mechanism (Section 3.3) is elegant and practical, enabling localized corrections without full regeneration while accumulating knowledge over time."}, "weaknesses": {"value": "1- The paper claims object-oriented representations are better aligned with LLMs, but doesn't adequately address whether 1,000 examples provide sufficient coverage of the design space\n\n2- \"Vision Consistency\" using GPT-5-mini as a judge is concerning - no validation of judge reliability, no inter-annotator agreement metrics\n\n3- No confidence intervals, statistical significance tests, or error bars\n\n4- Ablation Study: Uses the same tiny 25-example test set"}, "questions": {"value": "What happens when the object library doesn't contain relevant examples for a novel query?\n\nWhat is the generalization performance on completely unseen industrial domains?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "HQx5gWcxI5", "forum": "uEND0LWlc8", "replyto": "uEND0LWlc8", "signatures": ["ICLR.cc/2026/Conference/Submission24295/Reviewer_sFGX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24295/Reviewer_sFGX"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24295/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761874724984, "cdate": 1761874724984, "tmdate": 1762943032572, "mdate": 1762943032572, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a framework that transforms text-to-CAD generation from a procedural to an object-oriented paradigm. The authors construct a dataset of 1,000 examples with hierarchical, semantically rich object representations. Obj2CAD integrates top-down planning and bottom-up generation to improve reasoning and structure, and introduces geometric assembly reasoning for spatial consistency. An interactive feedback mechanism allows iterative refinement and object graph expansion."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Shifting text-to-CAD from a procedural paradigm to an object-oriented paradigm is both novel and interesting.\n2. As shown in Figure 2, OBJ2CAD is capable of generating complex CAD models with visually appealing results.\n3. The figures and tables are self-contained and clearly presented."}, "weaknesses": {"value": "1. The paper lacks analysis of failure cases where OBJ2CAD fails to follow the given instructions.\n2. In Figure 1, the meaning of each node in the graph is unclear, and specific examples are missing.\n3. The cost associated with using closed-source models in the FEEDBACK MECHANISM is not discussed."}, "questions": {"value": "Please address the weaknesses above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "d6xJ0XddGA", "forum": "uEND0LWlc8", "replyto": "uEND0LWlc8", "signatures": ["ICLR.cc/2026/Conference/Submission24295/Reviewer_yz2U"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24295/Reviewer_yz2U"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission24295/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761903053743, "cdate": 1761903053743, "tmdate": 1762943032364, "mdate": 1762943032364, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors propose OBJ2CAD framework that models LLM-based text-to-CAD problem as an object-oriented problem. They also curate a dataset of 1000 examples to align CAD synthesis with human design intuition and propose a generation pipeline with hierarchical retrieval, top-down planning, bottom-up generation, and iterative feedback. The results are showcased on 4 different LLMs on a 100-example test set."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- the limitations of procedural CAD generation are well documented\n- dataset curation is explained in a sensible manner\n- FreeCAD based GUI is practical"}, "weaknesses": {"value": "- the claimed shift in paradigm is not substantiated by new representational theory or measurable gains\n- no examples of generated designs beyond screenshots are analyzed qualitatively or quantitatively\n- \"vision consistency\" and \"human consistency\" metrics seem high-level and somewhat subjective\n- quantitative metrics (e.g. chamfer distance) or comparisons against procedural baselines are missing\n- no measurement of functional correctness or constraint satisfaction"}, "questions": {"value": "- I maybe missing something but what is the evidence that \"object-oriented paradigm\" is actually reducing errors or improving reliability?\n- can you run Text2CAD or other methods on your test set and compare success rates, iteration counts, and quality metrics?\n- how do you validate functional correctness? because visual similarity does not guarantee gears meshing correctly or holes being concentric or dimensions meeting specifications"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "oYEMWF3p1k", "forum": "uEND0LWlc8", "replyto": "uEND0LWlc8", "signatures": ["ICLR.cc/2026/Conference/Submission24295/Reviewer_DFgT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24295/Reviewer_DFgT"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission24295/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761957332237, "cdate": 1761957332237, "tmdate": 1762943032162, "mdate": 1762943032162, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}