{"id": "uMD75SDTTA", "number": 23631, "cdate": 1758346554205, "mdate": 1759896804069, "content": {"title": "Pallatom-Ligand: an All-Atom Diffusion Model for Designing Ligand-Binding Proteins", "abstract": "Small-molecule ligands extend protein functionality beyond natural amino acids, enabling sophisticated processes like catalysis, signal transduction, and light harvesting. However, designing proteins with high affinity and selectivity for arbitrary ligands remains a major challenge. We present Pallatom-Ligand, a diffusion model that performs end-to-end generation of ligand-binding proteins at atomic resolution. By directly learning the joint distribution of all atoms in the protein–ligand complexes, Pallatom-Ligand delivers state-of-the-art performance, achieving the highest *in silico* success rates in a comprehensive benchmark. In addition, Pallatom-Ligand's novel conditioning framework enables programmable control over global protein fold and atomic-level ligand solvent accessibility. With these capabilities, Pallatom-Ligand opens new opportunities for exploring the protein function space, advancing both generative modeling and computational protein engineering.", "tldr": "", "keywords": ["Diffusion", "Protein Design", "Ligand Binding"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/01ead01ede906d11126b592a21d265e0f4ceb665.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes a method for generating protein–ligand complexes based on small-molecule ligands. The approach outperforms existing baseline methods on in silico evaluation metrics and, to some extent, addresses the challenge of generating protein–ligand complexes with non-helical protein structures."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The proposed method outperforms the current state-of-the-art on most evaluation metrics and, to some extent, increases the proportion of designable non-helical structures in the generated results.\n2. The paper introduces a well-designed benchmarking strategy for this problem, which enriches the evaluation process.\n3. The writing is clear and well organized."}, "weaknesses": {"value": "1. In terms of novelty, the model architecture is almost identical to those of AF3 and P(allatom), with the only additions being the alpha ratio and solvent accessibility (SA) as inputs. There are no significant differences in the generation or training methods, indicating a lack of machine learning novelty.\n2. Although the paper claims to generate more non-helical structures, this aspect is not compared against other models; the evaluation is only performed through self-comparison."}, "questions": {"value": "Why was the SA experiment conducted on only three ligands?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "X6DSW9G81Y", "forum": "uMD75SDTTA", "replyto": "uMD75SDTTA", "signatures": ["ICLR.cc/2026/Conference/Submission23631/Reviewer_4PX2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23631/Reviewer_4PX2"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission23631/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761652972173, "cdate": 1761652972173, "tmdate": 1762942738415, "mdate": 1762942738415, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents Pallatom-Ligand, an end-to-end all-atom diffusion model for generating ligand-binding proteins. The key idea is to unify the representation of small molecules and protein residues at the atomic level and to jointly model their spatial and chemical interactions. The model introduces a ligand-aware all-atom diffusion transformer that integrates atom- and token-level representations to capture both global and local dependencies within protein-ligand complexes. Furthermore, a conditioning framework is proposed to control global protein fold diversity (through α/β ratio conditioning) and atomic-level ligand solvent accessibility (SA). Evaluation on eight chemically diverse small molecules using AlphaFold3-based component-specific metrics demonstrates improved in-silico structural plausibility over RFdiffusion2 and RFdiffusionAA."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The idea of a unified atomic representation for both proteins and small molecules is conceptually elegant and well-motivated. Modeling all atoms within one generative framework could in principle enhance data efficiency and the precision of atomic interactions.\n2. The paper proposes a multi-level conditioning framework that allows explicit control over protein fold topology (via α/β ratio) and ligand solvent accessibility. This design makes the generation process more interpretable and programmable.\n3. The authors conduct a broader benchmark than prior work, testing on eight ligands with diverse physicochemical properties, and systematically report AlphaFold3-based component-specific metrics. This gives a relatively thorough in-silico comparison."}, "weaknesses": {"value": "1. The architecture introduces a “triple-attention” transformer combining token-, atom-, and pair-level streams, but the paper does not include any ablation study to clarify what each component contributes. Without that, it is unclear which part is essential for the observed performance gain.\n2. The paper describes two sampling modes for dual-objective training, but there is no experimental analysis of how the chosen ratio between them influences training dynamics or the final results, as no sensitivity or ablation study is provided.\n3. The evaluation framework relies entirely on AlphaFold3 predictions as pseudo–ground truth. This is acceptable for initial screening, but the paper could be clearer that these metrics measure structural consistency rather than true binding affinity or physical validity.\n4. The presentation is difficult to follow for readers outside the protein-design community. Several evaluation metrics (e.g., pLDDT, ipAE) are introduced as part of the “AlphaFold3-based component-specific metrics,” but the paper provides little intuition about their meaning or justification. While these values come from AlphaFold3 predictions, the manuscript does not clarify how they reflect the underlying biophysical objectives or why they are appropriate for assessing generative quality. This lack of context makes it difficult for readers from a machine-learning background to interpret the reported results."}, "questions": {"value": "See Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8n38b2fAne", "forum": "uMD75SDTTA", "replyto": "uMD75SDTTA", "signatures": ["ICLR.cc/2026/Conference/Submission23631/Reviewer_HUmp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23631/Reviewer_HUmp"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission23631/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891350332, "cdate": 1761891350332, "tmdate": 1762942738166, "mdate": 1762942738166, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new diffusion model that jointly generates protein-ligand complexes operating at the atomic resolution. The key contributions are a novel diffusion transformer architecture for protein-ligand complexes and a novel conditioning framework that allows conditioning on global protein properties and atomic-level properties. Extensive experiments are presented to showcase the strong performance of this model."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* The paper is well-written and the key ideas are clearly presented.\n* The idea of modeling the joint distribution of all atoms in a protein-ligand complex to improve generation quality and data efficiency is sound and promising.\n* The presented experiments are quite extensive and showcase the superior performance of the proposed model compared to baselines.\n* The introduced set of component-specific metrics that reflect the multi-faceted nature of the protein design problem is reasonable and should better evaluate the different models."}, "weaknesses": {"value": "* The reliance on LigandMPNN to redesign the generated sequences hints at some limitations in the proposed model, especially because the model with MPNN outperforms the one without quite significantly (Figure 4). The authors should discuss the problems with the structures directly generated by their model and explore possible solutions to address them.\n* The model achieves a quite poor diversity rate compared to the baselines (0.14-0.17 vs 0.30). In the global control setting, this seems to be improved, but at the cost of lower success rates. The authors should discuss this and some potential fixes.\n* The paper assumes that the reader is familiar with the field of protein design. It would greatly improve the accessibility of the paper if some technical terms were explained, e.g., the metrics discussed in section 3.1: pLDDT, ipAE, etc."}, "questions": {"value": "1. What is the Transition module used in Equations 2 and 5? I couldn't find any explanations in the paper.\n2. The atom-level pair features $p$ used in Equation 4 should be defined along with the other variables at the start of that section.\n3. In Table 1, I assume Nov. refers to novelty. If so, why is a lower value better? If not, please clarify what it means. Also, Div. is not formally introduced in the paper."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "1Z7ORICmuM", "forum": "uMD75SDTTA", "replyto": "uMD75SDTTA", "signatures": ["ICLR.cc/2026/Conference/Submission23631/Reviewer_zHoF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23631/Reviewer_zHoF"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission23631/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761947784014, "cdate": 1761947784014, "tmdate": 1762942737886, "mdate": 1762942737886, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents Pallatom-Ligand, an all-atom diffusion model for generating ligand-binding proteins directly from atomic coordinates. It jointly models all atoms in protein–ligand complexes using a triple-attention transformer and introduces two conditioning mechanisms: global control of protein fold (α/β ratio) and atomic-level control of ligand solvent accessibility. Benchmarked against RFdiffusionAA and RFdiffusion2 on eight ligands, Pallatom-Ligand achieves higher in silico success rates and better control over structure and binding geometry."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Unlike backbone-only or inverse folding models, Pallatom-Ligand directly generates protein–ligand complexes at the atomic level, capturing fine-grained chemical and spatial interactions critical for ligand specificity.\n2. The model introduces multi-level conditioning (fold ratio and solvent accessibility), enabling programmable structural control—something that earlier diffusion-based models lack."}, "weaknesses": {"value": "1. The training relies on a relatively small number of protein–ligand complexes with strong bias in ligand–fold distribution. Although the authors introduce a dual sampling strategy, scalability to rare or novel ligands may be limited.\n2. All-atom diffusion transformers with block-sparse attention and multi-level conditioning are computationally intensive, potentially restricting usability for large complexes or extensive sampling."}, "questions": {"value": "Can Pallatom-Ligand generalize to unseen ligand chemotypes or novel binding motifs outside the training distribution, and how does its performance degrade in such zero-shot settings?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "RgM0l3rNmZ", "forum": "uMD75SDTTA", "replyto": "uMD75SDTTA", "signatures": ["ICLR.cc/2026/Conference/Submission23631/Reviewer_HKE3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23631/Reviewer_HKE3"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission23631/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762094768382, "cdate": 1762094768382, "tmdate": 1762942737674, "mdate": 1762942737674, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}