{"id": "Uo9xZ2kePW", "number": 12026, "cdate": 1758205252800, "mdate": 1759897538481, "content": {"title": "COTCAgent: Preventive Care Proactive Consultation Driven by a Probabilistic Chain-of-Thought Completion Framework", "abstract": "Current agent-based healthcare AI systems struggle with dynamic temporal reasoning and hallucination mitigation, limiting their preventive care utility. We introduce COTCAgent, a proactive consultation framework featuring a novel Probabilistic Chain-of-Thought completion mechanism. Our approach integrates two synergistic modules: a Time Series Analysis Module that extracts clinical trends from longitudinal EHRs, and a COTC Module that calculates disease risks via Inverse Disease Frequency weighting and completes reasoning chains through targeted questioning. Extensive evaluations demonstrate state-of-the-art performance, with COTCAgent achieving 89.2\\% accuracy in medical risk prediction (vs. 77.9-80.2\\% for baselines) and 69.8\\% on the challenging HealthBench sequential diagnosis benchmark. This work bridges temporal analysis with probabilistic reasoning to enable truly personalized preventive care.", "tldr": "The first to propose a query method for completing the Chain-of-Thought (CoT) based on time-series health check-up data, which significantly improves the accuracy and satisfaction of personalized proactive consultation and risk prediction", "keywords": ["Chain-of-Thought，LLM Agent，Healthcare，Time Series Indicators，Risk Quantification"], "primary_area": "interpretability and explainable AI", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1527d4425f5bc2628109812cd700772b3a5b0f6a.pdf", "supplementary_material": "/attachment/d34bdfc3e0f59172adccf4f5b75641e87e25fdf7.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces COTCAgent, a novel agent framework for proactive medical consultation, designed to address the limitations of current healthcare AI systems in dynamic temporal reasoning and hallucination mitigation. The framework consists of two synergistic modules: a Time Series Analysis (TSA) module that programmatically extracts clinical trends from longitudinal EHR data, and a Probabilistic Chain-of-Thought Completion (COTC) module. The COTC module calculates disease risks using a novel Inverse Disease Frequency weighting scheme, identifies gaps in the reasoning chain for high-probability diseases, and proactively queries the user to complete the chain. Extensive experiments show that COTCAgent achieves state-of-the-art performance on a medical record prediction task and on the HealthBench sequential diagnosis benchmark. The work represents a significant step towards building more reliable and interactive agent-aided clinical systems."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. Novel and Well-Motivated Framework: The core idea of \"Probabilistic Chain-of-Thought Completion\" is a conceptual advance over standard CoT. The framework more faithfully mimics clinical reasoning than existing approaches. The decoupling of quantitative time-series analysis from probabilistic reasoning is a good architectural choice.\n\n\n2. Addressing a Critical and High-Impact Problem: The paper tackles two of the most pressing challenges for LLMs in healthcare: reasoning over dynamic, longitudinal data and mitigating harmful hallucinations. \n\n\n3. Enhanced Interpretability and Trustworthiness: By design, the agent's reasoning is not a black box. The explicit, multi-turn dialogue to resolve uncertainties provides a clear audit trail of its diagnostic process."}, "weaknesses": {"value": "1. Dependence on a Custom, Partially Synthetic Knowledge Base: The framework's performance heavily relies on the \"Symptom-Trend-Disease Database.\" While the inclusion of temporal trends is innovative, the database's construction involves LLM-based augmentation, and its size is modest (23,456 entities). This raises concerns about its completeness, potential biases inherited from the augmenting LLM, and the generalizability of the system. The model's performance on diseases or symptom trends not present in this specific knowledge base is unclear.\n\n2. Simplicity of the Probabilistic Heuristic: The Inverse Disease Frequency (IDF) weighting is an intuitive and clever heuristic, but it is a simplified proxy for true diagnostic probability. It does not account for symptom co-occurrence, disease prevalence, or more complex conditional dependencies that are central to differential diagnosis. The paper would be strengthened by a discussion against more established probabilistic graphical models (e.g., Bayesian Networks)."}, "questions": {"value": "1. Regarding the Database: Could the authors elaborate on the validation process for the Symptom-Trend-Disease Database? How was the agreement among the 16 validating clinicians measured? More importantly, how does the COTCAgent handle \"out-of-knowledge-base\" scenarios where a patient's symptoms or trends do not have a match in the database? Does it gracefully degrade, or does it fail?\n\n2. Regarding the Proactive Consultation Logic: The proactive questioning is a key feature. How does the system decide which and how many questions to ask? For instance, is there a confidence threshold after which the agent stops inquiring, or a limit to the number of interaction turns?\n\n3. Regarding the TSA Module's Generality: The mathematical formulations in the appendix are impressive, but how are they operationalized? For a novel user query, how does the system select the appropriate statistical test (e.g., choose a mixed-effects model over a simple regression)? Is this selection process itself automated and robust?\n\n4. Regarding Baselines: In Tables 2 and 3, the paper compares against TimeCAP and Google's Agent. Could the authors briefly characterize the architectures of these baselines to better contextualize why they fall short? Specifically, do they also employ an agent-based framework but lack the programmatic TSA module or the probabilistic COTC logic?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "RDh0GHJKlj", "forum": "Uo9xZ2kePW", "replyto": "Uo9xZ2kePW", "signatures": ["ICLR.cc/2026/Conference/Submission12026/Reviewer_cBZg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12026/Reviewer_cBZg"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761384068444, "cdate": 1761384068444, "tmdate": 1762923009098, "mdate": 1762923009098, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces COTCAgent, a novel agent framework designed for proactive medical consultation from longitudinal electronic health records (EHRs). The system aims to address the shortcomings of current LLM-based systems in handling dynamic temporal data and mitigating hallucinations. The architecture has two key modules:\n\n(1) Time Series Analysis (TSA) Module: A computational core that executes statistical code (Bayesian change detection, mixed-effects models) to extract meaningful clinical trends from a patient's historical EHR data.\n\n(2) COTC (Probabilistic Chain-of-Thought Completion) Module: A reasoning module that calculates disease risks by mapping the extracted trends to a custom-built \"Symptom-Trend-Disease Database\" using an Inverse Disease Frequency (IDF) weighting scheme. Crucially, the COTC module identifies gaps in its reasoning chain and initiates a proactive consultation (i.e., asking the user targeted questions) to complete the Chain-of-Thought, thereby refining the risk assessment.\n\nThe agent is evaluated on medical risk prediction and the sequential diagnosis benchmark HealthBench, where it achieves state-of-the-art results over strong baselines."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper focus on an important challenge in AI healthcare domain, where we can transform medical AI from a passive question-and-answer system into an intelligent agent capable of proactive intervention. The goal of COTCAgent is to enable precise proactive consultation for truly personalized medical care. \n\n2. Combining time series EHR data with LLM is novel. \n\n3. Results on two different medical tasks significantly outperform state-of-the-art baseline models, including TimeCAP and Google Agent.\n\n4. The paper gives the code for reproduce.  Meanwhile, Appendix C is a huge asset for transparency and reproducibility. It clearly illustrates the complex flow of data from EHRs to TSA output, initial CoT, proactive questioning, and final CoT completion."}, "weaknesses": {"value": "1. The description of core mechanism, Probabilistic Chain-of-Thought Completion, is not clear. The paper details how to calculate the weighted matching score between symptoms and diseases (Eq. 12), but the process of using this score to \"complete\" a thought chain is described rather vaguely. I am struggling to understand what is the way to complete, for example, based on logic rules or natural language text? \n2. The claim of \"proactiveness\" lacks direct evaluation: The paper's title and abstract emphasize the \"proactive\" nature of the framework, for example, by using \"targeted questioning\" to complete the reasoning chain. However, the experimental evaluation section focuses primarily on quantitative indicators such as predictive accuracy, without directly assessing the quality of its proactive consultation. For example, are the \"questions\" generated by the model truly helpful for clinical diagnosis? Are the proactive \"warnings\" timely and accurate? This lack of qualitative or quantitative analysis makes the core novelty of \"proactiveness\" seem somewhat unsupported.\n3. The author mentioned “Bayesian reasoning over symptom trajectories maintains uncertainty awarenes”, however, the paper lacks a formal probabilistic definition like a Bayesian posterior. Instead, it is more likely be a heuristic ranking score. Such missing definition thus makes the paper is more of a system engineering contribution than a conceptual or theoretical advance.\n4. The Symptom/Trend-Disease Database is important, but the details of how to build this database are not enough. The expressiveness of figure 2 is limited. The paper mentioned “multi-source medical data was extracted”, “validated by 16 clinicians”; however, the details of data source are missing, and the validation process and results are not reported.\n5. In TSA module, the paper overclaims “state-of-the-art” methods. Appendix A.1 - A.5 listed many methods in time series analysis, however, most methods are classic and old models, thus it is not consistent with the claim on paper which “leverages state-of-the-art statistical and machine learning techniques to extract meaningful patterns from longitudinal healthcare records”.\n6. The paper presentation could be polished. It is not easy to follow. For example, when introducing the model, a motivating example would be helpful to understand each module design.\n7. More related work could be added like knowledge graph path finding or neural symbolic reasoning."}, "questions": {"value": "1. Typo in line 781: Table ??\n\n2. No reference for A.1 - A.5. Such methods are classic statistical models in most textbook.\n\n3. What is the prompting setup on baselines?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "rNc8dCwyk7", "forum": "Uo9xZ2kePW", "replyto": "Uo9xZ2kePW", "signatures": ["ICLR.cc/2026/Conference/Submission12026/Reviewer_WWJR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12026/Reviewer_WWJR"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761931016787, "cdate": 1761931016787, "tmdate": 1762923008602, "mdate": 1762923008602, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper propose COTCAgent, which is an interesting agent work which conducted on longutidinal EHRs. This work first ntegrates time-series EHR analysis with a probabilistic CoT completion mechanism. This work has two main modules: TSA module and COTC module. The first one transforms natural language queries into mathematical analyses (e.g., linear mixed models, Bayesian change-point detection, Gaussian processes) to extract clinically meaningful temporal trends instead direct input numeric values to LLMs; the last one build a time-series RAG databse, which leverages a newly constructed Symptom–Trend–Disease knowledge base to calculate disease risks using an IDF-weighted matching algorithm, and proactively formulates questions to resolve reasoning gaps. The extensive experiments on MedQA and HealthBench, COTCAgent demonstrates significant performance improvements."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. A novel medical agent framework for processing longitudinal EHRs in disease risk prediction.\n\n2. An effective method for transforming numeric time-series data into clinically meaningful textual representations through mathematical analyses.\n\n3. A robust approach for building a time-series RAG knowledge base, verified by clinical experts to reduce hallucination risk during the LLM-based data augmentation process.\n\n4. Superior performance on multiple medical benchmarks compared with existing medical agents."}, "weaknesses": {"value": "1. Limited validation on real-world clinical datasets. Additional evaluation on datasets such as Time-MMD or the MIMIC series would strengthen the generalizability of the approach.\n\n2. The knowledge base construction, which relies partly on DeepSeek-based data augmentation, may involve synthetic data leakage; a clearer description of data governance and validation is recommended.\n\n3. More baseline comparisons are needed, particularly with recent reasoning-based models such as DirPred [1] and KARE [2].\n\nReferences:\n\n1. Niu, Shuai, et al. \"Enhancing healthcare decision support through explainable AI models for risk prediction.\" Decision Support Systems 181 (2024): 114228.\n2. Jiang, Pengcheng, et al. \"Reasoning-Enhanced Healthcare Predictions with Knowledge Graph Community Retrieval.\" The Thirteenth International Conference on Learning Representations."}, "questions": {"value": "Please see my weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "ZCrOFpUUfQ", "forum": "Uo9xZ2kePW", "replyto": "Uo9xZ2kePW", "signatures": ["ICLR.cc/2026/Conference/Submission12026/Reviewer_tDiV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12026/Reviewer_tDiV"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12026/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761957548251, "cdate": 1761957548251, "tmdate": 1762923008055, "mdate": 1762923008055, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}