{"id": "UqjoMDJCmM", "number": 14670, "cdate": 1758241304019, "mdate": 1759897356033, "content": {"title": "Real-time Routing under Partial Observability: Information-Efficient Policies for Connected Vehicles", "abstract": "Real-time navigation in urban road networks requires making sequential routing decisions with incomplete and noisy information. Recent advances in IoT infrastructure and vehicle-to-everything (V2X) technologies enable connected vehicles to communicate with roadside units and traffic signals in real time. However, in practice, communication bandwidth and deployment budgets severely restrict the number of intersections that can be queried at each decision step, creating a partially observable environment for real-time navigation. Existing pipelines which separately train predictors of traffic states and then apply non-differentiable routing solvers struggle under such conditions, as they assume access to dense and complete sensing. In this paper, we present an end-to-end differentiable framework that jointly addresses vehicle-to-infrastructure(V2I) information acquisition, traffic state inference, and dynamic routing optimization. In the proposed framework, a learnable selection module proactively determines which intersections to query under communication constraints, followed by a spatio-temporal aware encoder that infers network-wide travel costs from the resulting sparse signals, and a differentiable soft shortest-path decision decoder computes re-routing strategies while allowing gradients of downstream travel cost to flow back through the entire pipeline. This tight coupling aligns model training with the true system objective of minimizing vehicle travel time. Experiments on microscopic simulation with city-scale networks demonstrate that our approach outperforms comparable baselines in travel efficiency while requiring only minimal communication. By integrating selective information acquisition and differentiable decision-making, our framework advances real-time urban navigation under partial observability and provides a scalable path toward deployment in intelligent transportation systems.", "tldr": "", "keywords": ["intelligent transportation"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e28ff814480acd8edd09ce23a1aa4016bb33f897.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper studies real-time routing under limited communication in vehicular networks. The authors argue that traditional predict-then-optimize pipelines are suboptimal because the prediction objective (minimizing MSE) is not aligned with the final routing objective (minimizing travel time). To address this, they propose an end-to-end differentiable framework that integrates (i) a proactive observation selector (based on differentiable Top-k sampling), (ii) a spatio-temporal inference module to estimate global travel costs, and (iii) a soft Bellman routing layer to approximate shortest paths in a differentiable way. The entire system is trained with the ultimate objective of minimizing travel time and delay. Experiments on Jinan and Hangzhou networks show consistent improvements over predict-then-optimize baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1) The paper addresses a realistic setting: limited communication bandwidth in V2X routing, which is less studied compared to fully observable routing.\n2) The integration of differentiable observation selection and differentiable routing is intuitive and makes the overall system end-to-end trainable.\n3) The framework highlights the misalignment issue between prediction accuracy and decision quality, and offers a principled way to align training with the final system objective.\n4) Results show improvements across two real-world networks, with reductions in average travel time, delay, and waiting time."}, "weaknesses": {"value": "1.\tInsufficient experimental evidence: 1) The paper refers to ablations in the appendix, but these materials were not accessible in the submission I reviewed. 2) The main body only presents a single result table, which is too limited to support strong claims.\n2.\tMethodological novelty is limited: The methodological novelty is limited, since all core components (differentiable Top-k, soft Bellman, spatio-temporal models) exist in prior work; the contribution is mainly a system integration.\n3.\tPerformance gains are small: 1) Reported improvements are only around 0.5%–2.5% in average travel time or delay compared to the best baselines; 2) Such small margins may not convincingly justify the complexity of the proposed approach, especially given the lack of stronger baselines and broader benchmarks.\n4.\tUnconvincing V2X bandwidth motivation: 1) The motivation relies on V2X bandwidth constraints, but it is not entirely convincing—one may argue that centralized server-based aggregation (e.g., in current navigation apps already provides real waiting time traffic lights and congestion information) could already mitigate this; 2) Unless the authors clarify why distributed V2X is strictly necessary, the motivation remains weak."}, "questions": {"value": "1) Reported improvements are only around 0.5%–2.5% in average travel time or delay compared to the best baselines. Such small margins may not convincingly justify the complexity of the proposed approach, especially given the lack of stronger baselines and broader benchmarks.\n2) Why distributed V2X is strictly necessary?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "g77XY5t5Xq", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_G9wA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_G9wA"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761397991290, "cdate": 1761397991290, "tmdate": 1762925042012, "mdate": 1762925042012, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose an end-to-end and differentiable framework for traffic state inference and dynamic routing optimization. A key differentiator that authors point out is that previous work assumes an idealistic setting that degrades in practical settings due to partial observability and budget constraints. While previous work usually split state inference and routing optimization into two separate stages, the authors suggest that it’s better to address these problems jointly."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The approach is novel in that it enables end-to-end differentiability of vehicle routing under partial observability. The authors motivate it with practical resource considerations. \n- Paper is well-written; authors provide enough background information on PtO paradigm to understand how their proposed method addresses limitations of PtO."}, "weaknesses": {"value": "- I am a little unsure at the strength of the baselines in results. While PtO is a standard paradigm for routing problems, have the authors checked whether this problem can modeled with existing reinforcement learning algorithms? For example, could this problem be benchmarked against a standard policy gradient algorithm like PPO? Authors mention RL as a promising direction in related works, but do not compare.\n- It is unclear the complexity of baseline models (STGCN and DCRNN) in comparison to the author’s transformer-based architecture. Additionally, it is my understanding that the prediction models are supervised with MSE on travel times queried from the SUMO API. Thus, I believe the prediction model does not need to be constrained to these two GCN and RNN networks. Can the authors provide a transformer PtO baseline with a similar parameter count to the proposed transformer architecture? I think this would make the results more convincing. \n- Lack of explanatory figures. It would greatly help the readability of the paper if a RL-esque feedback diagram was added in. Figure 1 is a helpful overview of the components proposed, but a feedback diagram would help with visualization gradient propagation and information flow."}, "questions": {"value": "1. Just curious, do authors have intuition on how PtO performs naively with partial observability? Could some naive masking of the fully-observable setup provide some baseline for partially observable PtO? \n2. L227: How is sampling from a structured exponential family distribution differentiable? There are existing approaches to differentiable top-k, why not use those? \n3. L232: Surrogate loss-informed target distribution places more prob mass on intersection subsets that lead to lower routing cost. This sounds like a local gradient technique (perturb and see what direction the gradient is in), as opposed to gradient of a smooth function. Can authors confirm for my understanding? \n4. L246: Seems like a typo.. missing a word?\n5. I would be curious to see how the select-predict-navigate framework performs when using the proposed V2I transformer network, except with the objective switched out. In other words, I would be curious to know how much an architecture change would contribute to select-predict-navigate paradigm. (Related to weakness point 2 above)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "YnS3q7Upkq", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_btY4"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_btY4"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762147319314, "cdate": 1762147319314, "tmdate": 1762925041590, "mdate": 1762925041590, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "To address the challenges of partially observable environments in real-time navigation, this paper presents an end-to-end framework, different from the traditional predict-then-optimize paradigm. \nThe framework jointly tackles vehicle-to-infrastructure (V2I) information acquisition, traffic state inference, and dynamic routing optimization.\nExperiments on conducted on a dozen of simulated intersections based on two datasets, Jinan and Hangzhou."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The motivation of the paper is well-grounded. The authors aim to investigate the partial observation setting, which has not been thoroughly explored in previous studies.\n2. The paper is clearly structured and easy to follow, although the Related Work and Method sections might be slightly too long."}, "weaknesses": {"value": "1. The experimental evaluation is somewhat limited, and the baselines appear to be outdated.\n2. While I understand that the proposed E2E method is designed to perform best under partial observation, the paper does not clearly explain how the simulated experiments implement this partial observation setting. In addition, no comparison is provided against a full observation scenario.\n3. I have some doubts about the claim that this is the only end-to-end framework (as opposed to the predict-then-optimize paradigm) in this area.\n4. There are several typos (e.g., line 246). It would also be better to standardize capitalization at the beginning of paragraphs for consistency."}, "questions": {"value": "- How would the previous methods, discussed in Section 2, perform if their settings were changed to partial observation?\n- Are there any existing works in this area that do not follow the predict-then-optimize (PtO) paradigm?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "IpTydVj9gx", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_Bigw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_Bigw"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762409755544, "cdate": 1762409755544, "tmdate": 1762925041226, "mdate": 1762925041226, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes an end-to-end differentiable framework for real-time vehicle routing under partial observability in connected-vehicle environments. The authors address the challenge that vehicles can query only a limited number of intersections via Vehicle-to-Infrastructure (V2I) communication, which restricts access to full traffic information. To handle this, the model learns a V2I utility estimation module that selects the most informative intersections to query, a spatio-temporal encoder (based on a Transformer) that infers global traffic conditions from sparse and time-varying local observations, and a differentiable routing head that replaces the non-differentiable shortest-path solver with a soft Bellman operator, enabling gradient-based training throughout the pipeline. The entire system is trained end-to-end to directly minimize expected travel time, integrating sensing, inference, and decision-making. Experiments in SUMO simulations across multiple urban networks show that the proposed method outperforms modular “select–predict–optimize” baselines (e.g., Proximity–STGCN–Dijkstra) in travel time and delay efficiency, demonstrating that differentiable joint optimization leads to better routing under limited communication."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "This paper presents a novel integration of information acquisition, traffic state inference, and routing optimization into an end-to-end differentiable framework, addressing a realistic and previously under-explored challenge—real-time routing under partial observability. It reformulates the traditionally discrete, non-differentiable components of routing (intersection selection and shortest-path computation) into trainable modules, enabling true end-to-end optimization of travel time. The combination of a learnable V2I utility network, a spatio-temporal transformer for inferring global traffic states from sparse data, and a soft Bellman routing head represents an advance over modular “predict-then-optimize” approaches. The framework has also been experimentally validated across multiple road network scenarios."}, "weaknesses": {"value": "1. Several key terms are introduced without sufficient explanation, including utility, MAP, routing head, and even core metrics such as travel time, delay, and waiting time. These should be explicitly defined to ensure accessibility for readers outside the field.\n\n2. The paper would benefit from a concise summary of all inputs to the model (vehicle context, intersection features, temporal data, and graph structure), clarification of which inputs are time-series and which are one-shot, and a clear explanation of how multi-vehicle data are incorporated into the shared framework. It is also not made explicit which of the three evaluation metrics (average travel time, average delay, and average waiting time) is actually optimized during training.\n\n3. The paper claims to be “uncertainty-aware”, but it does not concretely explain how uncertainty is represented or managed in the pipeline. The role of MAP is also ambiguous—it's unclear whether this reflects a Bayesian approach or merely an optimization heuristic.\n\n4. It remains unclear whether the pipeline is conceptually inspired by the Transformer architecture or just directly incorporated a Transformer-based spatio-temporal encoder.\n\n5. The paper can have more explicit explanations on the namings of the baselines. Also, when referring to the strongest PtO baseline (Proximity–STGCN), it is unclear whether this includes both Proximity–STGCN–Dijkstra and Proximity–STGCN–A*, and this simplified naming is due to the fact that the two solves (Dijkstra and A*) always lead to the same outcome. \n\n6. Most references should use \\citep instead of \\citet.\n\n7. Minor typos: “Context-Aware Utility Estimation. , we”."}, "questions": {"value": "Repeating from the \"Weakness\" section:\n\n1. What are all the inputs to the pipeline, and what are their data types (e.g., time-series, vector, graph)? Which data are provided at each decision step, and which are static inputs specified at the beginning of an episode? How are observations from multiple vehicles incorporated? What are the user-provided inputs, and what are the decision variables of the pipeline?\n\n2. While the experiments report average travel time, delay, and waiting time, which of these metrics is actually optimized by the model during training? If only travel time is optimized, how should improvements in the other two be interpreted?\n\n3. How exactly does the pipeline represent or respond to uncertainty arising from partial observability? Additionally, what is the conceptual role of “MAP” in the V2I selection process—is this derived from a Bayesian formulation, or is it a differentiable approximation to a discrete optimization problem?\n\n4. Is the proposed pipeline conceptually inspired by the Transformer architecture or just directly incorporated a Transformer-based spatio-temporal encoder?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "043oR1P40C", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_Z6jN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_Z6jN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762458181347, "cdate": 1762458181347, "tmdate": 1762925040475, "mdate": 1762925040475, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes an end-to-end differentiable framework for real-time vehicle routing under partial observability in connected-vehicle environments. The authors address the challenge that vehicles can query only a limited number of intersections via Vehicle-to-Infrastructure (V2I) communication, which restricts access to full traffic information. To handle this, the model learns a V2I utility estimation module that selects the most informative intersections to query, a spatio-temporal encoder (based on a Transformer) that infers global traffic conditions from sparse and time-varying local observations, and a differentiable routing head that replaces the non-differentiable shortest-path solver with a soft Bellman operator, enabling gradient-based training throughout the pipeline. The entire system is trained end-to-end to directly minimize expected travel time, integrating sensing, inference, and decision-making. Experiments in SUMO simulations across multiple urban networks show that the proposed method outperforms modular “select–predict–optimize” baselines (e.g., Proximity–STGCN–Dijkstra) in travel time and delay efficiency, demonstrating that differentiable joint optimization leads to better routing under limited communication."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "This paper presents a novel integration of information acquisition, traffic state inference, and routing optimization into an end-to-end differentiable framework, addressing a realistic and previously under-explored challenge: real-time routing under partial observability. It reformulates the traditionally discrete, non-differentiable components of routing (intersection selection and shortest-path computation) into trainable modules, enabling true end-to-end optimization of travel time. The combination of a learnable V2I utility network, a spatio-temporal transformer for inferring global traffic states from sparse data, and a soft Bellman routing head represents an advance over modular “predict-then-optimize” approaches. The framework has also been experimentally validated across multiple road network scenarios."}, "weaknesses": {"value": "1. Several key terms are introduced without sufficient explanation, including utility, MAP, routing head, and even core metrics such as travel time, delay, and waiting time. These should be explicitly defined to ensure accessibility for readers outside the field.\n\n2. The paper would benefit from a concise summary of all inputs to the model (vehicle context, intersection features, temporal data, and graph structure), clarification of which inputs are time-series and which are one-shot, and a clear explanation of how multi-vehicle data are incorporated into the shared framework. It is also not made explicit which of the three evaluation metrics (average travel time, average delay, and average waiting time) is actually optimized during training.\n\n3. The paper claims to be “uncertainty-aware”, but it does not concretely explain how uncertainty is represented or managed in the pipeline. The role of MAP is also ambiguous: it's unclear whether this reflects a Bayesian approach or merely an optimization heuristic.\n\n4. It remains unclear whether the pipeline is conceptually inspired by the Transformer architecture or just directly incorporated a Transformer-based spatio-temporal encoder.\n\n5. The paper can have more explicit explanations on the namings of the baselines. Also, when referring to the strongest PtO baseline (Proximity–STGCN), it is unclear whether this includes both Proximity–STGCN–Dijkstra and Proximity–STGCN–A*, and this simplified naming is due to the fact that the two solves (Dijkstra and A*) always lead to the same outcome. \n\n6. Most references should use \\citep instead of \\citet.\n\n7. Minor typos: “Context-Aware Utility Estimation. , we”."}, "questions": {"value": "Repeating from the \"Weakness\" section:\n\n1. What are all the inputs to the pipeline, and what are their data types (e.g., time-series, vector, graph)? Which data are provided at each decision step, and which are static inputs specified at the beginning of an episode? How are observations from multiple vehicles incorporated? What are the user-provided inputs, and what are the decision variables of the pipeline?\n\n2. While the experiments report average travel time, delay, and waiting time, which of these metrics is actually optimized by the model during training? If only travel time is optimized, how should improvements in the other two be interpreted?\n\n3. How exactly does the pipeline represent or respond to uncertainty arising from partial observability? Additionally, what is the conceptual role of “MAP” in the V2I selection process? Is this derived from a Bayesian formulation, or is it a differentiable approximation to a discrete optimization problem?\n\n4. Is the proposed pipeline conceptually inspired by the Transformer architecture or just directly incorporated a Transformer-based spatio-temporal encoder?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "043oR1P40C", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_Z6jN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_Z6jN"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762458181347, "cdate": 1762458181347, "tmdate": 1763607906168, "mdate": 1763607906168, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles real-time routing under partial observability in connected-vehicle environments. Because vehicles can query only a limited number of intersections due to bandwidth and deployment constraints, the authors propose an end-to-end differentiable framework that jointly learns:\n(1) which intersections to query (a perturb-and-MAP–based discrete selection module),\n(2) how to infer global travel costs from sparse and noisy observations (a spatio-temporal transformer encoder), and\n(3) how to make routing decisions via a soft Bellman operator that provides a differentiable surrogate for shortest-path computation.\n\nExperiments on small SUMO simulations (Jinan with 12 intersections; Hangzhou with 16 intersections) show that the proposed model achieves modest improvements (typically 1–3%) over several “predict-then-optimize” baselines that combine heuristic intersection selection, STGCN/DCRNN predictors, and classical routing solvers."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "Clear problem motivation: communication-limited routing is realistic and underexplored.\n\nEnd-to-end design aligns model training with the actual routing objective.\n\nPerturb-and-MAP selection provides a more principled way to handle discrete top-k under constraints.\n\nSoft Bellman operator is well-constructed and differentiable.\n\nAblations indicate that intersection selection significantly affects routing performance."}, "weaknesses": {"value": "Experiments are conducted only on very small city networks (12–16 intersections). It is unclear whether the method scales to realistic road networks with thousands of nodes.\n\nPerformance gains over baselines are small (≈1–3%) and confidence intervals/statistical significance are not reported.\n\nThe baselines do not include stronger decision-focused approaches or reinforcement-learning-based navigation, making it difficult to assess relative advantage.\n\nNo analysis of latency, communication delay, or robustness to noise/loss, despite these being central to the motivation.\n\nLimited sensitivity studies (e.g., varying k, temperature τ, entropy regularization γ)."}, "questions": {"value": "How does training and inference time scale with the size of the network and the number of vehicles?\n\nHave you tested the framework on larger networks, or is there any theoretical reason to expect scalability?\n\nHow sensitive is performance to k (number of queried intersections) and to the temperature τ of the soft Bellman operator?\n\nCould the framework handle communication failures, delays, or asynchronous querying?\n\nWhy were no reinforcement-learning or decision-focused routing baselines included?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "pnQNnyYxfi", "forum": "UqjoMDJCmM", "replyto": "UqjoMDJCmM", "signatures": ["ICLR.cc/2026/Conference/Submission14670/Reviewer_iH9B"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission14670/Reviewer_iH9B"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission14670/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762882174877, "cdate": 1762882174877, "tmdate": 1762925039916, "mdate": 1762925039916, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}