{"id": "UYnq6YAAe8", "number": 12066, "cdate": 1758205487454, "mdate": 1763638592197, "content": {"title": "Iterative Importance Fine-tuning of Diffusion Models", "abstract": "Diffusion models are an important tool for generative modelling, serving as effective priors in applications such as imaging and protein design. A key challenge in applying diffusion models for downstream tasks is efficiently sampling from resulting posterior distributions, which can be addressed using the $h$-transform. This work introduces a self-supervised algorithm for fine-tuning diffusion models by estimating the $h$-transform, enabling amortised conditional sampling. Our method iteratively refines the $h$-transform using a synthetic dataset resampled with path-based importance weights. We demonstrate the effectiveness of this framework on class-conditional sampling, inverse problems and reward fine-tuning for text-to-image diffusion models.", "tldr": "An iterative refinement framework for fine-tuning diffusion models using path-based importance-weighted resampling without requiring additional datasets", "keywords": ["Diffusion models", "Conditional sampling", "Fine-tuning", "Generative modeling", "Inverse problems", "Stochastic control"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ff59ced35609255563fba83713320ab2c3314531.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "Oftentimes we want to use a pretrained diffusion model as a prior for conditional sampling for some downstream task. The posterior distribution in this case can be thought of as a tilted version of the pretrained diffusion model's distribution. One method of sampling from such tilted distributions involves using the Doob's h-transform. In this paper, the authors propose an iterative algorithm for estimating the h-transform. Specifically, they propose refining the estimate of the h-transform by sampling from the diffusion model using the current estimate of the h-transform, filtering samples based on how well they fit the tilted distribution, and using those samples for supervised fine-tuning. This procedure is applied iteratively many times, yielding a sequence of improved estimates for the h-transform. They present experiments applying this approach to class-conditional sampling, super-resolution, and reward-based finetuning."}, "soundness": {"value": 2}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The paper is well-written and presents a novel method for estimating the h-transform to improve conditional sampling from diffusion models, which draws on methods such as importance based fine-tuning as well as iterative fine-tuning procedures. Notably, this method does not require differentiating the score function of the base model and also is more memory efficient than other methods. The authors additionally prove that their iterative approach is a descent algorithm that minimizes the general loss function for the h-transform and that the distribution of samples at each step is closer to that of the tilted distribution."}, "weaknesses": {"value": "The experiments in the paper could be improved. For class-conditional sampling, I would like to see additional results in a more difficult setting with more classes such as ImageNet. For super-resolution, I would like to see a few different things. First, I think there should be experiments with more than 2x super-resolution, such as 4x and 8x super-resolution. Additionally, I would like to see experiments on additional datasets, such as ImageNet and CelebA-HQ, which are more standard. For super-resolution, I also don't think you compare with other methods, such as DDRM [1] and SR3 [2]. For reward-based fine-tuning, you should use a larger set of prompts for evaluation. Finally, you should compare with additional baselines. SMC-based approaches also allow for sampling from the tilted distribution and you should compare with recent SMC-based methods for this problem, such as FK Steering [3]. I would also like to see a simple Best-of-N baseline for each setting.\n\n[1] Kawar, Bahjat, Michael Elad, Stefano Ermon, and Jiaming Song. \"Denoising diffusion restoration models.\" NeurIPS 2022. [https://proceedings.neurips.cc/paper_files/paper/2022/hash/95504595b6169131b6ed6cd72eb05616-Abstract-Conference.html](https://proceedings.neurips.cc/paper_files/paper/2022/hash/95504595b6169131b6ed6cd72eb05616-Abstract-Conference.html).\n\n[2] Saharia, Chitwan, Jonathan Ho, William Chan, Tim Salimans, David J. Fleet, and Mohammad Norouzi. \"Image super-resolution via iterative refinement.\" IEEE transactions on pattern analysis and machine intelligence 2022. [https://ieeexplore.ieee.org/document/9887996/](https://ieeexplore.ieee.org/document/9887996/).\n\n[3] Singhal, Raghav, Zachary Horvitz, Ryan Teehan, Mengye Ren, Zhou Yu, Kathleen McKeown, and Rajesh Ranganath. \"A General Framework for Inference-time Scaling and Steering of Diffusion Models.\" ICML 2025. [https://arxiv.org/abs/2501.06848](https://arxiv.org/abs/2501.06848)."}, "questions": {"value": "How did you choose the set of prompts you use for the reward-based fine-tuning experiments?\n\nDid you consider applying this to non-differentiable reward functions? Since you don't need to differentiate the reward function it may be useful to evaluating in this setting."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Z3THWegeV4", "forum": "UYnq6YAAe8", "replyto": "UYnq6YAAe8", "signatures": ["ICLR.cc/2026/Conference/Submission12066/Reviewer_cW2k"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12066/Reviewer_cW2k"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12066/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761848359108, "cdate": 1761848359108, "tmdate": 1762923038598, "mdate": 1762923038598, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a new method to finetune diffusion models to achieve high rewards. The main idea is an iterative approach, where the models are continuously trained on importance-weighted samples (or with a similar rejection sampling adjustment). These reweighted samples are supposed to align with the posterior distribution, induced by the prior distribution model and the exponentiated reward. The method is compared to a range of other methods in synthetic 2D, image super-resolution, class-conditional image generation and text-to-image generation tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper in general is easy to follow. The proposed idea is simple and straightforward to implement."}, "weaknesses": {"value": "The main weakness of the current submission is that the efficiency and effectiveness of the proposed method remain unclear. The presentation lacks critical algorithmic details, making it difficult to understand how the method actually work. Moreover, the empirical comparisons to prior work are limited and not convincingly justified. See more details below, \n\n- Important algorithmic details are not included in the main paper. The choice of hyperparameter $c$ should be important for the efficiency of rejection sampler, however it is not discussed and only reference is mentioned to prior work. Similarly, while the computation of importance weights are built upon prior work, it should be explained in the main paper for the completeness of the method. The importance weights presented in Alg. 13 is not directly tractable.\n\n- Empirical evaluation should include the algorithm efficiency or complexity aspects. For example, how many total training samples each method uses, and what is the sample acceptance rate for the proposed method. If we control for such compute factors, what is the margin of the proposed method to others?\n\n- For each experiment subsection, too few benchmarks are considered. For example, inverse problem in sec 4.2 only includes one example, and text-to-image reward finetuning only includes 3 prompts. In addition,  I believe the paper can benefit from adding more baseline methods for comparison ,for example, for the image super-resolution task. \n\n- Empirical results did not include standard errors. \n\n- Finally, as the authors pointed out in the limitation section, such importance sampling or rejection sampling methods rely on the assumption that the proposal (the prior model) has sufficient support on the high reward region. This point is more about the assumption of the method rather than a critique."}, "questions": {"value": "- Eq 16 states parameterizes the network with reward gradient conditioning. Is my understanding correct that is reward gradient conditioning is used across all experiments except the text-to-image ones? What would happen if you didn't use such conditioning for the remaining experiments? \n\n- Why is the Stochastic loss presented in Figure 2? Isn't the proposed method trained on $L_{FT}$ loss in eq 15?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "LFzJZMe2xa", "forum": "UYnq6YAAe8", "replyto": "UYnq6YAAe8", "signatures": ["ICLR.cc/2026/Conference/Submission12066/Reviewer_4U4W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12066/Reviewer_4U4W"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12066/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761881192789, "cdate": 1761881192789, "tmdate": 1762923037721, "mdate": 1762923037721, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Given a diffusion model $p_\\theta(x_0)$ and a reward model $r(x_0)$, the authors propose a method to sample from the reward tilted distribution. The authors introduce a fine-tuning method that builds on the h-transform learning framework introduced in Denker et al 2024, which learns the gradient of the intermediate reward $\\nabla_{x_t} \\log E_{p(x_0 | x_t)}[\\exp(r(x_0))]$. \n\n- Unlike typical fine-tuning (or equivalently variational inference) methods that make use of the reverse KL, the authors propose using the supervised, forward KL, objective in eq 7.\n- However, as samples from the tilted distribution are not available, the authors use the current iteration of the fine-tuned model to generate samples and then defining an accept/reject step using the Radon-Nikodym derivative (ie the importance weight) between the tilted path measure and the model defined path measure."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Unlike prior methods such as RAFT that make use of importance sampling with the current iteration as the proposal generator, the authors derive a principled approach for fine-tuning. The authors propose a tractable accept/reject probability for use in the diffusion fine-tuning setting."}, "weaknesses": {"value": "1. The authors should engage with existing literature in a more thorough manner. For instance, iterative cross-entropy (De Boer et al 2005), reinforced self-training (Gulcehre et al 2023), and RAFT (Dong et al 2023), all use importance-sampling and rejection sampling for fine-tuning.\n2. As baselines, the authors should include a comparison to sequential Monte Carlo methods, which in the low particle regime have been shown to outperform fine-tuned models. \n3. The authors also make use of reward gradient in parameterizing the h-transform, making it unclear to what extent the proposed fine-tuning method works.\n\nDe Boer, Pieter-Tjerk, et al. \"A tutorial on the cross-entropy method.\" Annals of operations research 134.1 (2005): 19-67.\n\nGulcehre, Caglar, et al. \"Reinforced self-training (rest) for language modeling.\" arXiv preprint arXiv:2308.08998 (2023).\n\nDong, Hanze, et al. \"Raft: Reward ranked finetuning for generative foundation model alignment.\" arXiv preprint arXiv:2304.06767 (2023)."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eg2Cjx5Nig", "forum": "UYnq6YAAe8", "replyto": "UYnq6YAAe8", "signatures": ["ICLR.cc/2026/Conference/Submission12066/Reviewer_q1ny"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12066/Reviewer_q1ny"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12066/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761930032674, "cdate": 1761930032674, "tmdate": 1762923037157, "mdate": 1762923037157, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work tackles the problem of fine-tuning a diffusion model $p_\\theta(x_0)$ to sample from the reward-tilted distribution $p_{\\mathrm{tilted}}(x) \\propto p_\\theta(x_0) \\exp(r(x_0))$. It does so by obtaining approximate samples from $p_{\\mathrm{tilted}}(x)$, and then minimizing the denoising score matching loss on these samples. The approximate samples are obtained by sampling from the model in its current iteration, and correcting them using a rejection sampling scheme with importance weights computed over trajectories. This optimization algorithm (with importance sampling) is shown to monotonically minimize the reverse KL ($KL(p_{\\theta}(x) || p_{\\mathrm{tilted}}(x))$ to the target distribution. The method is demonstrated by reward-tilted sampling for 2D Gaussian mixture models, class conditional sampling in MNIST, a linear-inverse problem in super-resolution, and improving prompt alignment in Stable Diffusion."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The main important contribution of the paper is the use of relaxed importance sampling (from (Hertrich & Gruhlke, 2025)) to bypass the requirement of a fine-tuning dataset (as in DEFT), which is a useful and important improvement over that algorithm\n    - Theorem 6, and the empirical validation in Fig 2 is useful for demonstrating that the relaxed importance sampling method doesn’t compromise theoretical validity of the method.\n2. The method has a benefit over other methods in not storing (or backpropagating through) trajectories for training\n3. The experimental settings chosen are relevant and useful for the proposed method (class conditional sampling, inverse problems, and prompt-alignment)\n    - The method is demonstrated on a larger scale problem in prompt alignment for Stable Diffusion\n4. The work is clearly written and has a logical presentation of ideas"}, "weaknesses": {"value": "1) The use of the replay buffer requires further explanation or justification, since it is critical to the efficiency of the algorithm:\n    - Why is it reasonable to use a replay buffer? Shouldn’t trajectories be drawn on-policy (according to current $h$ ) to have the correct importance weights computed according to eq. 14 (I am assuming the accepted samples are placed in the buffer, as described in Algorithm 1)?\n        - Notably in other works (eg. in Sendera et. al., 2024), the use of a replay buffer is justified by the training loss itself not needing on-policy samples, but such a justification doesn’t seem to hold for the proposed algorithm\n        - Is there any degradation in performance for longer buffer lengths, it would be helpful to experimentally demonstrate the impact of the replay buffer.\n        \n\n2) For experiments - some more comprehensive evaluations are needed to demonstrate the performance of the method:\n    - For the toy GMM task - from the figure or the reported metrics in Table 4 it is unclear whether the proposed method is less biased compared to alternatives (in particular classifier guidance). A metric based on reverse KL, or a comparison to a “ground truth” baseline (such as a diffusion model trained on ground truth samples from $p_{\\mathrm{tilted}}$) would better illustrate the performance\n    - For the linear inverse problem - the method should be compared to baselines such as VarGrad, or Adjoint Matching, to demonstrate how the method compares to alternatives\n    - For prompt alignment fine-tuning - the images  produced by Importance FT seem overly bright and saturated, or with some artefacts, compared to the other fine-tuning methods (in Fig 4, as well as 8, 9, 10). Is there any degradation in performance due to the fine-tuning?\n\n3) The advantages for the proposed method should be more clearly outlined, over the alternatives, in particular since the metrics in Table 3 doesn’t show a clear improvement for Importance FT over the alternatives. In my opinion this would be remedied by more empirical support for two claims made in the paper:\n    - The conclusion implies the training method is more stable in terms of requiring fewer tricks (eg. loss clipping). Does this hold more broadly?  Eg. does the reward improve more smoothly along training iterations, or do the gradients have smaller variance compared to other baselines? Does the reward improve at a faster rate (either in terms of wall-clock time or the number of gradient updates made)? If so, the method would be more clearly useful.\n    - The method has the same memory complexity as Adjoint matching (or other online RL methods using the adjoint method) (O(B)), so the claim of importance FT offering “a more efficient and scalable training pipeline” should be supported more clearly. If there is a time-overhead in adjoint matching compared to Importance FT, its significance to the prompt alignment experiment should be demonstrated clearly.\n\n4) Minor grammar errors include:\n   - Line 41 space between citation and “.Further, the tilted …”\n   - Between Line 71, 73, “stable diffusion” should be capitalized for consistency\n   - Line 179 “… sampling from unnormalised probability density function**s**” (s missing)\n   - Line 205 “are in particular satisfied **if** the guidance $h$ …”\n   - Line 277 (ii) - Should be “ $\\mathbb{P}\\_{tilted}$  rather than $\\mathbb{P}_{tilde}$” - also proportion sign here doesn’t make sense, it should be off by a constant term\n   - Line 400-401: “samples are **shown**”\n   - Line 415: “samples **do** not always”\n   - Line 473-474: missing word “We present **experiments** for class conditional sampling,”\n   - Line 481 quotations around “good” are inverted\n   - Line 483 “and high reward samples are are”\n\n5) For related works, the paper is missing a reference and discussions to Particle Denoising Diffusion sampling (Phillips et. al., 2024), which uses a similar optimization scheme of sampling from the current iteration of the model, correcting with importance weights (in their case SMC), and then performing supervised training (albeit targeted at the sampling problem rather than reward fine-tuning).\n\nFor now I am recommending a weak accept. The primary concern being point 3 above. If more comprehensive evidence is provided which clearly shows the advantages of the proposed method, then I will strongly consider raising my score.\n\nA. Phillips, H.-D. Dau, M. J. Hutchinson, V. De Bortoli, G. Deligiannidis, and A. Doucet, “Particle denoising diffusion sampler,” International Conference on Machine Learning (ICML), 2024."}, "questions": {"value": "1. How crucial is the relaxed importance sampling step - eg. if you resampled directly based on the importance weights  - what would the effective sample size be? Or would it be infeasible?\n2. Given that rejection sampling is used - do you sample a fixed number of trajectories in the outer loop, then accept a portion depending on the weights (to put in the buffer), or do you keep sampling until a fixed number of trajectories is accepted? \n3. The claim in \n    \n    > We emphasize that our importance-based fine-tuning does not require to differentiate the score function of the base-model and never considers more **than one step of the generation process at once**. In particular, it can\n    be applied for very large base-models where other methods run out of memory.\n    > \n    \n    is inaccurate (or unclear) since the method requires running the generation process to obtain trajectories (and importance weights). Did this mean to emphasize that the method doesn’t backpropagate at the level of the trajectory?\n    \n\n4. Experimental questions:\n    - For the classifier guidance used for the 2D GMM, and MNIST - was DPS used, or was a time-conditioned classifier trained?\n    - The main gap in performance for adjoint matching appears to be from moving to a LoRA parameterization. Is there any understanding for why this impacts the method so much?\n    - Why is DPOK memory listed as O(B) instead of O(BT)? The (on-policy) gradient update in that paper appears to require backpropagation at each step of the generation trajectory.\n        - This line (431) is inconsistent with the table “Importance fine-tuning reaches a competitive\n        reward with similar diversity and the same O(B) memory footprint as DPOK or RTB”"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "e8GHVn2HCi", "forum": "UYnq6YAAe8", "replyto": "UYnq6YAAe8", "signatures": ["ICLR.cc/2026/Conference/Submission12066/Reviewer_gj6W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12066/Reviewer_gj6W"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12066/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761950083014, "cdate": 1761950083014, "tmdate": 1762923036670, "mdate": 1762923036670, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}