{"id": "uZxyvmN72d", "number": 18388, "cdate": 1758287108987, "mdate": 1763730664004, "content": {"title": "Extending RLVR to Open-Ended Tasks via Verifiable Multiple-Choice Reformulation", "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has demonstrated great potential in enhancing the reasoning capabilities of large language models (LLMs), achieving remarkable progress in domains such as mathematics and programming where standard answers are available. However, for open-ended tasks lacking ground-truth solutions (e.g., creative writing and instruction following), existing studies typically regard them as “non-reasoning” scenarios, thereby overlooking the latent value of reasoning capabilities. This raises a key question: Can strengthening reasoning improve performance in open-ended tasks? To address this, we explore the transfer of the RLVR paradigm to the open domain. Yet, since RLVR fundamentally relies on verifiers that presuppose the existence of standard answers, it cannot be directly applied to open-ended tasks. To overcome this challenge, we introduce Verifiable Multiple-Choice Reformulation (VMR), a novel training strategy that restructures open-ended data into verifiable multiple-choice formats, enabling effective training even in the absence of explicit ground truth. Experimental results on multiple benchmarks validate the effectiveness of our method in improving LLM performance on open-ended tasks. Notably, across eight open-ended benchmarks, our VMR-based training delivers an average gain of 5.99 points over the baseline. Code will be released upon acceptance to facilitate reproducibility.", "tldr": "", "keywords": ["Reinforcement Learning with Verifiable Rewards", "Reasoning Capabilities", "Open-ended Tasks", "Verifiable Multiple-Choice"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/23c903286c49f98bd8ef4c2d6cd277327c6ba173.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper extends Reinforcement Learning with Verifiable Rewards (RLVR) to open-ended tasks (e.g., creative writing, instruction following) via Verifiable Multiple-Choice Reformulation (VMR). RLVR originally excels in STEM tasks with clear ground truths but fails in open-ended ones. VMR restructures open-ended data into multiple-choice formats (one chosen, one rejected response) with random order to ensure verifiability. Experiments on 8 benchmarks show VMR-based RLVR outperforms baselines, with a 5.99-point average gain, enhancing LLM reasoning and performance, even surpassing some 32B-scale models."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Unlike RLVR’s reliance on explicit ground truths, VMR transforms free-form data into verifiable multiple-choice pairs. It enables rule-based rewards without ambiguous evaluations, solving RLVR’s inapplicability to open-ended scenarios.\n\n2. Across 8 benchmarks, it achieves a 5.99-point average gain over the base model, with standout gains in creative writing. It even outperforms larger 32B-scale models, proving its efficiency in enhancing LLM capabilities.\n\n3. Random response ordering avoids positional bias. Compared to Baseline II (same data without VMR), it still gains, showing improvements stem from VMR’s design, not just data scale, ensuring reliable training."}, "weaknesses": {"value": "1. The method proposed in this paper solves the verification problem in open domains to a certain extent, but it faces significant issues in practical application. It seems that promoting this method to mathematical reasoning would require extremely high costs. The entire method relies on two candidate answers, and the verifier matches answers A and B with the ground truth (GT) option. How can this method be applied to mathematical reasoning where there is a unique GT? Is it necessary to forcibly construct an incorrect answer and then have the verifier make a judgment? This seems unreasonable and redundant.\n\n2. An ideal experimental setup should involve training separately using RM-based datasets and VMR-based datasets with the same queries. In the current experimental setup, the method \"combines RM-based and VMR-based datasets in equal proportion. RM-based queries are scored by the reward model, while VMR triples are verified using rule-based reward functions.\" This makes it impossible to decouple the roles of the reward model and the verifier, and I have doubts about the reliability of the experimental results.\n\n3. The paper does not disclose the training equipment and time. Training a 14B-scale model with the training parameters described in Section 3 will incur extremely high costs. It remains questionable whether the cost-benefit ratio is sufficient to justify the promotion of this technology.\n\n4. In the bar chart of Figure 1, some numbers overlap with each other."}, "questions": {"value": "Please refer to the Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "gzOLk7sbxk", "forum": "uZxyvmN72d", "replyto": "uZxyvmN72d", "signatures": ["ICLR.cc/2026/Conference/Submission18388/Reviewer_fDB3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18388/Reviewer_fDB3"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18388/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761579671636, "cdate": 1761579671636, "tmdate": 1762928097103, "mdate": 1762928097103, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes Verifiable Multiple-Choice Reformulation (VMR), which converts preference pairs (chosen vs. rejected responses) into verifiable binary-choice questions. A rule-based verifier then provides exact rewards (1/0) based on whether the model selects the better response."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "It is important and anticipated to extend RLVR to open-ended tasks."}, "weaknesses": {"value": "- **The papers lacks methodological novelty and the method is largely a straightforward combination of existing techniques** (e.g., RLVR, GRPO, and preference-based data formatting) without introducing significant conceptual or architectural innovation. While the VMR is a useful engineering trick, it does not constitute a fundamental advance in reinforcement learning or reasoning modeling. The method section is also overly verbose, repeating well-known formulations without sufficient focus on what truly differentiates the proposed pipeline.\n\n- The writing—particularly in the abstract and introduction—lacks focus and fails to clearly articulate the core problem, contribution, and significance. Key claims are buried in lengthy paragraphs, and the narrative does not effectively motivate why extending RLVR to open-ended tasks is non-trivial or why VMR is a principled solution.\n\n- Inadequate formatting and scholarly presentation. The paper suffers from inconsistent or incorrect formatting, including improper citation styles, titles position of tables and position of **REPRODUCIBILITY STATEMENT**. \n\n- Critical implementation details are missing. For instance: The number and type of GPUs used for training are not disclosed; Training time, memory consumption, or computational cost are omitted; Hyperparameter sensitivity or ablation studies (e.g., impact of the 1:1 RM/VMR data mix) are not provided.\n\n- The paper over-relies on LLM-as-a-judge metrics. Most benchmarks (e.g., MT-Bench, AlpacaEval) use automated LLM-based evaluators, which are known to exhibit biases. \n\n- The method is only validated on a single base model (DeepSeek-R1-Distill-Qwen-14B). It remains uncertain whether VMR’s benefits transfer to other architectures, scales, or instruction-tuned models."}, "questions": {"value": "Please see weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "wkNKaVtiRE", "forum": "uZxyvmN72d", "replyto": "uZxyvmN72d", "signatures": ["ICLR.cc/2026/Conference/Submission18388/Reviewer_mkkq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18388/Reviewer_mkkq"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18388/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761992834914, "cdate": 1761992834914, "tmdate": 1762928095376, "mdate": 1762928095376, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper tackles challenges of applying RLVR to open-ended tasks like creative writing. The authors propose a training strategy called Verifiable Multiple-Choice Reformulation (VMR). This method restructures data from open-ended tasks into a multiple-choice format, which makes it possible to verify the answer. The experiments find that the proposed VMR improves the performance or LLMs on open-ended tasks, shoing an average gain of 5.99 points over the baseline."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "* This paper tries to tackle the LLM training problem that it is not easy to do RL training with open-ended questions. This is an important question that the community tries to solve.\n* The empirical results from the proposed method seems good, with a noticeable gain comparing with the baselines. \n* The paper is clear that readers can understand most of the concepts introduced easily."}, "weaknesses": {"value": "*  The reward verifies only whether the model selected the pre-labeled preferred response, not that the response is objectively better. For the RM-based subset, line 257, the labels themselves are produced by an automated reward model (URM-LLaMA-3.1-8B). Therefore, the pipeline still inherits RM bias/noise even though the training reward is rule-based. This undercuts the claim that they avoid RM issues (line 063, in figure 2).\n* Most reported wins depend on LLM-as-judge (e.g., MTBench, AlpacaEval-2, WildBench, CreativeWriting V3, ArenaHard 2.0, CreativeWriting), which can share stylistic biases with the training signal. There’s no human eval to validate the improvement, making over-optimization to judge preferences a real risk.\n* In the experiment, the authors compare with reward model-scored RL baselines. There’s no DPO/KTO (or other RLHF methods) baseline trained on the same pairwise triples, despite those being the most obvious alternatives. Some gains could stem from the extra signal in pairwise data rather than the on-policy RL objective or the VMR prompt itself. \n* The A/B candidates come from existing datasets, not from the current policy model, which makes it skeptical if the proposed method can really improve the LLM generation quality\n* The proposed method is a form of RLHF, it's just like the actor-critic/PPO loop. The “RM-based dataset” uses open-ended queries whose rewards are assigned by a reward model (URM-LLaMA-3.1-8B). For VMR, each item has a human-labeled chosen vs rejected answer. They convert it to A/B and give a binary reward (1/0) if the policy picks the chosen one (see Figure 3 and Eq (9)). Functionally, that’s RLHF with a degenerate reward model that returns 1 for the preferred option and 0 otherwise. The policy still maximizes expected reward from human preferences via policy gradient."}, "questions": {"value": "* Though the motivation of this paper is to transform open-ended questions into verfiable ones, I wonder what is the necessity of doing so. For training LLMs with RL, is it a good and general enough solution to convert the open-ended questions?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "2b1SikuKYY", "forum": "uZxyvmN72d", "replyto": "uZxyvmN72d", "signatures": ["ICLR.cc/2026/Conference/Submission18388/Reviewer_Dh1x"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18388/Reviewer_Dh1x"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18388/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762132155473, "cdate": 1762132155473, "tmdate": 1762928094643, "mdate": 1762928094643, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper extends Reinforcement Learning with Verifiable Rewards (RLVR) from STEM domains (mathematics, programming) to open-ended tasks lacking ground-truth solutions (creative writing, instruction following). The key innovation is Verifiable Multiple-Choice Reformulation (VMR), which restructures preference data (chosen/rejected response pairs) into multiple-choice questions that can be verified using rule-based functions. For each query, the model is asked to choose between two randomly-ordered responses, and receives binary reward based on selecting the better one."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Novel extension of RLVR to open-ended domains where standard answers don't exist\n- Sound mathematical formulation connecting VMR to standard RLVR framework\n- Clear problem motivation explaining RLVR's limitation in open-ended domains\n- Addresses important gap: extending RLVR beyond STEM domains"}, "weaknesses": {"value": "- The connection between multiple-choice discrimination and open-ended generation is assumed but not justified\n- Only one base model tested (DeepSeek-R1-Distill-14B); crucial to test on other models\n- Dependency on high-quality preference data limits applicability\n- Heavy reliance on LLM-as-judge metrics which have known biases"}, "questions": {"value": "- How does VMR perform on models without built-in reasoning capabilities ?\n- Can you provide error bars or significance tests for the improvements?\n- The reasoning density improvement is quite small. Is this statistically significant?\n- How does the method perform when preference annotations disagree or are noisy?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "e71fp3gfZR", "forum": "uZxyvmN72d", "replyto": "uZxyvmN72d", "signatures": ["ICLR.cc/2026/Conference/Submission18388/Reviewer_Hi7t"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18388/Reviewer_Hi7t"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18388/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762148494490, "cdate": 1762148494490, "tmdate": 1762928093668, "mdate": 1762928093668, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}