{"id": "V99zh4LmSd", "number": 23058, "cdate": 1758338979808, "mdate": 1759896833951, "content": {"title": "OptiFluence: Scalable and Principled Design of Privacy Canaries", "abstract": "Privacy auditing has emerged as a practical tool for empirically estimating training data leakage in machine learning models (in contrast to the provable but often overly pessimistic bounds provided by a differential privacy analysis).\nA common strategy is to use membership inference attacks to detect the presence in training data of specific canaries (points designed to maximize memorization). However, existing canary designs are largely heuristic, relying on mislabeled or out-of-distribution samples.\nWe address this gap by formulating canary design as a bilevel optimization problem, where the model is trained in the inner loop and the canary is optimized in the outer loop to maximize its detectability. Building on this view, we develop OptiFluence, a scalable framework that combines three components: (i) influence-based pre-selection to identify promising  canary seeds;\nand (ii) unrolled sample optimization with memory-efficient gradient techniques. Our approach achieves remarkable empirical performance on two standard privacy auditing datasets, MNIST and CIFAR-10: optimized canaries demonstrate up to 415× higher detectability than in-distribution baselines, reaching near-perfect detection rates of 99.5% TPR at 0.1%FPR. Critically, these canaries transfer effectively across different model architectures without retraining, enabling practical third-party privacy audits. This transferability allows regulators and auditors to assess model privacy without requiring access to proprietary training infrastructure or substantial computational resources.", "tldr": "", "keywords": ["privacy auditing", "differential privacy", "optimization", "influence functions"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/207964cb110ca62e0cacb6364efdad71af260cd4.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes OptiFluence, a bilevel optimization framework for designing privacy canaries that maximize their detectability under membership inference attacks. The method integrates influence-based pre-selection and unrolled sample optimization with memory-efficient techniques. Experiments on MNIST and CIFAR-10 demonstrate strong detectability."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* The paper tackles an important problem in empirical privacy auditing, providing a more principled alternative to heuristic canary constructions.\n\n* The bilevel optimization formulation is elegant and connects privacy auditing with influence functions and gradient unrolling."}, "weaknesses": {"value": "* **Incomplete component description in the abstract.**\nThe abstract claims that OptiFluence consists of three components but describes only two. Please correct this inconsistency.\n\n* **Lack of discussion on the relationship to adversarial examples.**\nAs noted around L228–L229 and Algorithm 1, the optimization process resembles adversarial example generation.\nThe paper should explicitly discuss how the proposed canary differs from conventional adversarial samples, conceptually and in objective formulation, and clarify why existing adversarial methods cannot directly be used to generate canaries. Experimental comparisons between OptiFluence and adversarial samples are also needed.\n\n* **Missing threat-model specification.**\nThe current presentation lacks a clear statement of the auditor’s capability—whether auditing assumes black-box, gray-box, or white-box access to the model.\nA formal threat model is essential to contextualize the results and interpret the claimed transferability."}, "questions": {"value": "* **Unclear explanation of transferability.**\nWhile Section 6.2 claims strong cross-architecture transfer, the supporting evidence in Appendix C.4 (two MLPs on MNIST) is insufficient to substantiate general transferability.\nThe authors should explain why optimized canaries can transfer between architectures (e.g., shared feature space, loss geometry) and include more diverse models or quantitative analyses.\n\n* **Potential performance degradation.**\nAlgorithm 1 suggests that the canary is iteratively updated during model training. This may interfere with model convergence or degrade performance.\nThe paper should report whether incorporating such optimization affects model accuracy or training stability.\n\n* **Relation to privacy–robustness trade-off.**\nGiven that OptiFluence’s optimization resembles adversarial training, it would be valuable to evaluate or at least discuss the potential trade-off between privacy auditing effectiveness and robustness, as widely documented in the literature [1–3].\nAn experiment showing canary auditing after adversarial training would significantly strengthen the paper.\n\n[1] Zhang, Z., Zhang, L. Y., Zheng, X., Abbasi, B. H., & Hu, S. (2022). Evaluating membership inference through adversarial robustness. The Computer Journal, 65(11), 2969-2978.\n[2] Lyu, L. et al. (2022). Privacy and robustness in federated learning: Attacks and defenses. IEEE TNNLS, 35(7), 8726-8746.\n[3] He, F., Fu, S., Wang, B., & Tao, D. (2020). Robustness, privacy, and generalization of adversarial training. arXiv preprint arXiv:2012.13573."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "BfAiZXvGOZ", "forum": "V99zh4LmSd", "replyto": "V99zh4LmSd", "signatures": ["ICLR.cc/2026/Conference/Submission23058/Reviewer_t7cL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23058/Reviewer_t7cL"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission23058/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761651713168, "cdate": 1761651713168, "tmdate": 1762942495920, "mdate": 1762942495920, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work introduces OptiFluence, an optimization-based framework for conducting membership inference attacks (MIAs) against differentially private (DP) models. Unlike prior works in the central setting that often rely on sample-based canaries, OptiFluence formulates the attack as a gradient-based optimization problem in which the attacker crafts a synthetic sample to maximize their influence on the model output or loss. The authors argue that this exposes vulnerabilities in DP training not captured by existing stochastic or heuristic attacks. Experiments on standard benchmarks show that OptiFluence achieves higher attack success rates under certain scenarios."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The optimization-based formulation is well described and the approach of combining influence functions to intitialize an optimized canary is novel.\n- The attack is evaluated across a good range of datasets and privacy budgets."}, "weaknesses": {"value": "- The exact contribution over prior work that utilizes optimized canaries in the white-box or federated setting is unclear (see below).\n- Aspects of the presentation related to the specific names of proposed/baseline methods could be improved to make the experiments more easily readable (see questions below).\n- The optimization process seems to be computationally expensive. Although the authors propose an approximation denoted, ReMat+TBPTT, no experimental results demonstrate its effectiveness or runtime benefits. This makes it seem less practical than simpler alternatives (e.g., one-run or random canary methods)."}, "questions": {"value": "1. What exactly  is IF-OPT? It doesn’t seem to be clearly defined in the experiments.\n2. Could the authors provide runtime/overhead comparisons against the baselines to substantiate claims of scalability? The approximation approach ReMat+TBPTT is proposed but there seem to be no results that show why you should use it over the fully unrolled updates. There are no statements in the paper about how long this canary optimization process takes? Is this attack really practical for auditing?\n3. Given the higher computational cost, what practical advantage does OptiFluence offer over one-run or random canary insertion attacks?\n4. I would have liked to have seen a clearer ablation on the impact of using the influence function intialization vs. standard canary optimization (w/o this IF initialization) which appears to be missing from Figure 3?\n5. How does OptiFluence fundamentally differ from the optimization-based canaries proposed by [1,2]? \n\n[1] Nasr, Milad, et al. \"Tight auditing of differentially private machine learning.\" 32nd USENIX Security Symposium (USENIX Security 23). 2023.\n\n[2] Maddock, Samuel, Alexandre Sablayrolles, and Pierre Stock. \"Canife: Crafting canaries for empirical privacy measurement in federated learning.\" arXiv preprint arXiv:2210.02912 (2022)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "DW2DjfSLXz", "forum": "V99zh4LmSd", "replyto": "V99zh4LmSd", "signatures": ["ICLR.cc/2026/Conference/Submission23058/Reviewer_5uPC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23058/Reviewer_5uPC"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission23058/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761656935934, "cdate": 1761656935934, "tmdate": 1762942495715, "mdate": 1762942495715, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper claims that existing privacy canaries, like mislabeled or out-of-distribution (OOD) points, are ad hoc and ineffective. It proposes to replace these guesses with a \"principled\" bilevel optimization framework. The method, OptiFluence, first finds a promising \"seed\" point from the real data using influence functions (IF-Init) and then uses computationally expensive unrolled optimization (ReMat+TBPTT) to fine-tune the sample's pixels for maximum detectability."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The core idea is sound. Moving from \"guessing\" a canary to \"optimizing\" one is a logical step.\n2. The results are undeniable. Table 1 shows that optimized canaries are 415x more detectable than standard ones on CIFAR-10.\n3. The transferability result is the paper's strongest practical contribution."}, "weaknesses": {"value": "1. Calling this \"scalable\" in the title is a serious overstatement. The method is built on unrolled optimization, which is notoriously memory- and compute-intensive. The experiments are confined to MNIST and CIFAR-10. This will not scale to any model we actually care about auditing (e.g., LLMs).\n2. Only report TPR @ Low FPR; other metrics such as AUC should also be considered.\n3. The baseline of MIA is kind of outdated. There are more recent and powerful MIA attacks such as \"Zarifzadeh, Sajjad, Philippe Liu, and Reza Shokri. \"Low-cost high-power membership inference attacks.\" Proceedings of the 41st International Conference on Machine Learning. 2024.\"\n4. The entire optimization objective is to maximize the LiRA \"hinge\" score. The canaries are overfit to this specific MIA. More MIA attacks should be considered."}, "questions": {"value": "1. The \"scalable\" claim is tested on CIFAR-10. What is the actual wall-clock time and VRAM cost?  How can you claim this is feasible for large-scale models?\n2. For Table 2, what is the performance of DP-SGD? \n3. Does your proposed method still work for other MIA?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "qtWeDdBQ58", "forum": "V99zh4LmSd", "replyto": "V99zh4LmSd", "signatures": ["ICLR.cc/2026/Conference/Submission23058/Reviewer_5zJV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23058/Reviewer_5zJV"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission23058/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761875866071, "cdate": 1761875866071, "tmdate": 1762942495482, "mdate": 1762942495482, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces OptiFluence, which the authors claim is a state of the art privacy canary generation method via a bilevel optimization program that maximizes the likelihood ratio for membership inference by first initializing the canary based on its influence on other samples and then performing an efficient (in compute and memory) gradient-based optimization to fine-tune these samples to maximize the likelihood ratio. They also introduce methods to make their canary optimization efficient in memory and compute by unrolling model updates and checkpointing the computational graph, or even truncating the gradient propagation."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "**[S1]** Very well-motivated and concretely described methodology, with an attention to detail to practical concerns like compute and memory costs, yielding a practical design that vastly outperforms baselines, which is outstanding.\n\n**[S2]** Use of influence functions to initialize canary is very well motivated and grounded in existing research, and its utility firmly corroborated by ablation studies.\n\n**[S3]** Speaking of which, all the components of the OptiFluence method are covered and ablated in the ablation study section, which very clearly shows each component’s significance. Put another way, I think this is a very well executed ablation study section. In addition, figure 3 provides a good overview of how all the components come together to yield strong canaries (high TPR at very low FPR) as compared to other (ablated) variants.\n\n**[S4]** Good takeaways, viz. pointing out the limitations of mislabeling for canary generation, illustrating how initializing with influence functions provides a more effective and principled approach.\n\n**[S5]** Transferability of generated canaries is a huge positive and contributes to efficient auditing practices.\n\n**[S6]** Auditing (with and without DP-SGD) is well done, with strong choices of auditing methods and well-executed DP-SGD training with a Renyi DP based accountant.\n\n**[S7]** The authors provide an anonymized link to the code and relevant hyperparameters in the appendix, aiding in reproducibility of their results."}, "weaknesses": {"value": "**[W1]** Not a serious weakness/dealbreaker, but it would be desirable to see results on more involved datasets than CIFAR-10 and MNIST. These datasets are popular classic datasets, so to speak, but it would be interesting to see if these results generalize to much larger datasets or datasets with many more classes than 10 (viz. CIFAR-100), more interesting sample distributions, or (this next part is not needed, so the authors can safely ignore this, but it would be appealing) other modalities than image datasets.\n\n**[W2]** Seeing as how attack success (unsurprisingly) degrades for low values of $\\varepsilon$ for DP-SGD auditing, could the authors please add experiments on lower values of $\\varepsilon$ (viz. 1 and <1)? While these values may yield lower utility of the model, theoretically they are desirable (especially <1) and it would be useful to see how Optifluence (and its baselines) perform in this regime."}, "questions": {"value": "**[Q1]** Can you address W1 and add results on more datasets in different regimes (more classes, samples, different distributions)?\n\n**[Q2]** Can you investigate the efficacy of Optifluence and its baselines in low $\\varepsilon$ (high privacy) regimes for DP-SGD auditing?\n\n**[Q3]** Update: The other reviewers rightly point out the need to justify and corroborate the efficiency of unrolled updates in your paradigm with empirical evidence (runtime and memory used) and on more involved/expensive settings than CIFAR-10 and MNIST. Can the authors please address that? This is *key to me maintaining my current score*."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "CL6lxc1rUE", "forum": "V99zh4LmSd", "replyto": "V99zh4LmSd", "signatures": ["ICLR.cc/2026/Conference/Submission23058/Reviewer_mvjG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23058/Reviewer_mvjG"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission23058/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761924546152, "cdate": 1761924546152, "tmdate": 1762958248693, "mdate": 1762958248693, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a framework for constructing privacy canaries—artificial samples used to audit data leakage in machine learning models. Unlike prior methods that rely on mislabeled or out-of-distribution samples, OptiFluence formulates canary design as a bilevel optimization problem that maximizes the likelihood-ratio statistic used in membership inference attacks, effectively identifying samples that most alter the model’s behavior when included in training. The framework combines two key components: IF-Init, which uses influence functions to pre-select rare, highly self-influential samples likely to be memorized, and Unrolled-Opt, which refines these candidates by differentiating through the training process using memory-efficient techniques such as rematerialization and truncated backpropagation through time (TBPTT). Experiments on MNIST and CIFAR-10 demonstrate that OptiFluence achieves near-perfect detectability (up to 99.8% TPR at 0.1% FPR), outperforming baselines by up to 415×."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed OptiFluence pipeline combines influence-based initialization (IF-Init) with unrolled optimization enhanced by rematerialization and truncated backpropagation (ReMat+TBPTT) for scalability.\n\n2. Achieves near-perfect canary detectability (up to 99.8% TPR at 0.1% FPR) and up to 415× improvement over heuristic baselines on MNIST and CIFAR-10.\n\n3. Optimized canaries generalize well across architectures (e.g., ResNet-9 → ResNet-50), enabling efficient third-party or regulatory auditing without model retraining.\n\n4. Includes detailed ablation studies, comparisons to prior methods (e.g., metagradient-based optimization), and evaluations under DP-SGD training.\n\n5. The paper is well-structured, with a clear presentation of motivation, methodology, and results."}, "weaknesses": {"value": "1. The files at the anonymous link do not open. Please either include a zip file with the source code and scripts in the supplementary material or update the link to ensure the files are accessible.\n\n2. The central idea—to optimize the log-likelihood ratio via a bilevel objective—is elegant but remains largely heuristic. The paper argues that maximizing the difference in logits between models trained with and without the canary approximates the true likelihood-ratio test (Equation 5), yet provides no formal proof that this surrogate objective is consistent or unbiased. Without theoretical guarantees or approximation bounds, it is unclear whether the optimized canary truly maximizes detectability in general or only within the specific experimental setup.\n\n3.  The bilevel objective requires differentiating through the entire training trajectory, but the paper does not discuss convergence, stability, or variance of this optimization—particularly when truncated backpropagation and rematerialization are used. The claim in Section 6.3 that unrolled optimization yields “exact gradients” appears overstated, since ReMat+TBPTT introduces gradient truncation and therefore only provides approximate updates. It would strengthen the paper to quantify how this approximation impacts final canary detectability.\n\n4.  While the paper references differential privacy definitions and ε-bounds (Equation 2), it never formally connects the empirical detectability metric (TPR@FPR) to theoretical privacy parameters ε or δ. The framework is therefore empirical rather than analytical, and the paper should make this distinction explicit.\n\n5.  Because OptiFluence directly maximizes the LiRA hinge-based likelihood-ratio score, the optimized canaries may overfit to this particular attack formulation. The paper does not evaluate the canaries under alternative membership inference metrics (e.g., confidence-, entropy-, or loss-based scores), leaving open the question of whether detectability generalizes to unseen auditing methods.\n\n6. The reported transferability of canaries across architectures (e.g., ResNet-9 → ResNet-50) is intriguing but lacks theoretical explanation. The paper attributes it qualitatively to shared representation geometry, yet provides no analysis of why optimized samples remain highly distinguishable under different model dynamics. This weakens the claim that OptiFluence supports “third-party audits without retraining.”\n\n7. Figures 4 and 6 show that optimized canaries—particularly on CIFAR-10—often appear visually unnatural or out-of-distribution. This raises the possibility that their detectability stems from atypical low-level statistics rather than genuine memorization.\n\n8. The method involves repeated model retraining with unrolled optimization, rematerialization, and truncated backpropagation—all computationally demanding procedures. However, the paper does not report runtime, GPU memory usage, or total training cost. Without this information, it is difficult to assess whether the framework is truly scalable beyond small benchmark datasets.\n\nMinor comments:\n\n1. The acronym ERM (Empirical Risk Minimization) is used without definition and should be introduced upon first mention."}, "questions": {"value": "1.  The anonymous code link provided in the submission does not open. Could you please share a working repository or include a zip file in the supplementary material to ensure full reproducibility? \n\n2. Could you provide a more rigorous justification for treating the logit difference (Equation 5) as a valid surrogate for the likelihood-ratio statistic? Specifically, under what assumptions does maximizing this surrogate guarantee improved membership distinguishability, and can any theoretical bound or consistency argument be established?\n\n3. The paper claims that unrolled optimization provides “exact gradients,” yet the use of truncated backpropagation and rematerialization implies an approximation. Could you quantify how this truncation affects the final canary detectability? For instance, how does TPR@FPR vary as the truncation window K changes?\n\n4. What measures were taken to ensure optimization stability across seeds and models? Do different initialization points (e.g., influence-selected seeds vs. random) lead to consistent canary detectability, or is the outcome highly variable?\n\n5. Since the framework is inspired by differential privacy but ultimately empirical, can you clarify how the metric (TPR@FPR) relates to formal ε or δ values? Is there any attempt to estimate lower bounds on ε or compare to DP auditing baselines that produce numeric privacy budgets?\n\n6. The optimization directly targets the LiRA hinge-based statistic. Would the optimized canaries remain highly detectable under alternative membership inference attacks (e.g., confidence-, entropy-, or loss-based)? Have you evaluated cross-auditor robustness?\n\n7. The transferability of optimized canaries across architectures is one of the key selling points of the paper. Can you provide a theoretical or empirical explanation for why canaries optimized on ResNet-9 remain highly detectable on ResNet-50 or WideResNet? Is this phenomenon architecture-dependent or data-dependent?\n\n8.  Some optimized canaries, particularly in CIFAR-10, appear visually unnatural or off-manifold. Have you attempted to quantify the degree of deviation from the data distribution (e.g., via FID, nearest-neighbor distance, or classifier confidence)? Could detectability be driven by such distributional shifts rather than true memorization?\n9.  The paper emphasizes scalability, yet unrolled optimization and rematerialization are computationally heavy. Could you please report the runtime, GPU memory footprint, and training cost for the CIFAR-10 experiments? How would the approach scale to larger datasets or transformer architectures?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "khvXour6xt", "forum": "V99zh4LmSd", "replyto": "V99zh4LmSd", "signatures": ["ICLR.cc/2026/Conference/Submission23058/Reviewer_VkF8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission23058/Reviewer_VkF8"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission23058/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761985256093, "cdate": 1761985256093, "tmdate": 1762942493770, "mdate": 1762942493770, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}