{"id": "VaFqN9dnCa", "number": 13565, "cdate": 1758219273984, "mdate": 1762954061475, "content": {"title": "Beyond Turing: Topological Closure as a Foundation for Cognitive Computation", "abstract": "Classical models of computation, epitomized by the Turing machine, are grounded\nin \\emph{enumeration}: syntactic manipulation of discrete symbols according to\nformal rules. While powerful, such systems are intrinsically vulnerable to\nGödelian incompleteness and Turing undecidability, since truth and meaning are\nsought through potentially endless symbolic rewriting. We propose an\nalternative foundation for non-enumerative computation based on\n\\emph{topological closure} of semantic structures. In this view, cognition operates by promoting\ntransient fragments into closed cycles, where $\\partial^2=0$ ensures that only\ninvariants persist. This shift reframes computation from \\emph{syntax} to\n\\emph{structure}: memory and reasoning arise not by enumerating all possibilities,\nbut by stabilizing relational invariants that survive perturbations and\ngeneralize across contexts. We formalize this principle through the\ndot–cycle dichotomy: dots or trivial cycles ($H_0$) serve as high-entropy scaffolds for\nexploration, while nontrivial cycles ($H_1$ and higher) encode low-entropy invariants\nthat persist as memory. Extending this perspective, we show how\nMemory-Amortized Inference (MAI) implements an anti-enumerative principle by storing\nhomological equivalence classes rather than symbolic traces, yielding robust\ngeneralization, energy efficiency, and structural completeness beyond\nTuring-style models. We conclude that \\emph{topological closure} provides a\nunifying framework for perception, memory, and action, and a candidate\nfoundation for cognitive computation that transcends the limits of enumeration.", "tldr": "", "keywords": ["Cognitive computation; topological closure; cycle formation; memory-amortized inference; order invariance"], "primary_area": "learning theory", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/6bb674a0fcf4b9975db7ebab20505f8081a90e6f.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper claims to propose a new theoretical framework for understanding computation and cognition beyond the classical Turing paradigm. It introduces several high-level principles about cognition and perception, followed by a shift into a purportedly mathematical formalization involving concepts such as “boundary operators” and “topological transitions.”"}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "- The paper is ambitious in scope, attempting to bridge cognitive science, philosophy of computation, and mathematical modeling.\n\n- The motivation — rethinking computation in light of cognitive dynamics — is potentially interesting and aligns with interdisciplinary goals."}, "weaknesses": {"value": "The paper is extremely difficult to follow. The exposition mixes vague cognitive slogans with partially formalized mathematics, without properly defining key terms or notations (e.g., “boundary operator” appears without prior introduction).\n\nTheorems and claims are presented in a hybrid style that combines mathematical language with informal cognitive interpretations, making it unclear whether they are meant as formal results or conceptual metaphors.\n\nThe conceptual framing of cognition and computation is very general and abstract, with little empirical or computational grounding.\n\nThe paper’s style and content will likely be intelligible only to a small subset of readers already sharing the authors’ conceptual framework; for the broader ICLR audience, it lacks clarity, accessibility, and demonstrable contribution."}, "questions": {"value": "1. Could you clarify how you see this work fitting within the ICLR community? The paper’s focus appears primarily conceptual and philosophical, with limited computational or empirical grounding. It is not clear whether the intended contribution is theoretical (mathematical), cognitive-scientific, or computational.\n\n2. Do you envision any practical implications or experimental predictions that could make the framework relevant to machine learning or neural computation?\n\n3. Would a different venue—for instance, one oriented toward philosophy of computation or mathematical cognition—better suit the goals of this work?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "dNtpy9P4tn", "forum": "VaFqN9dnCa", "replyto": "VaFqN9dnCa", "signatures": ["ICLR.cc/2026/Conference/Submission13565/Reviewer_eTHf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13565/Reviewer_eTHf"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13565/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761219366486, "cdate": 1761219366486, "tmdate": 1762924162793, "mdate": 1762924162793, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "J9JWwyEJJ5", "forum": "VaFqN9dnCa", "replyto": "VaFqN9dnCa", "signatures": ["ICLR.cc/2026/Conference/Submission13565/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13565/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762954060503, "cdate": 1762954060503, "tmdate": 1762954060503, "mdate": 1762954060503, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors try to propose that topological closure is a unified framework for cognitive computation that is better than Turing machine."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The authors claim that the cycle is all you need."}, "weaknesses": {"value": "This paper very hard to read.\n\nThe current submitted draft is a mishmash and contains many misconceptions and inconsistencies, e.g., “computation is grounded in enumeration”, “computation is the syntactic manipulation of discrete symbols”.  \n\n “Deep learning architectures … inherit enumerative character: generalization emerges by statistical interpolation over enumerated training examples” – it is still not clear whether deep learning systems can indeed perform generalization. Gödel’s incompleteness theorem is only about incompleteness.\n\n Memory is better understood as the ability to re-enter and traverse latent cycles in the neural state space. I understand there, memory simulates the working-memory, not the long-term memory. \n\n“Cognition is not tape-based symbol manipulation but the promotion of transient fragments into closed cycles” – Symbol manipulation is the syntactic operations to realise the state-transition within the semantic world. The authors completely neglected the semantics behind the syntactic operations.  \n\n“To operationalize this picture in cognition, we adopt the Context–Content Uncertainty Principle\n(CCUP) Li (2025a)”. This reference is noted as “under review”. \n \nAll \\cite{} shall be replaced with \\citep{}."}, "questions": {"value": "Can all syntactic manipulation be reduced to enumeration? What is “enumeration”?  “enumeration can never guarantee closure” What is “closure”? How is it related with completeness? What are “Residual boundaries” and “open fragments”?  What failures are called “distributional failures”? What is “topological closure”? \n\nPhilosophically, if we distinguish fiat boundary from bona fide boundary, can your boundary operator be applied for both?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "lDAf6IVFyW", "forum": "VaFqN9dnCa", "replyto": "VaFqN9dnCa", "signatures": ["ICLR.cc/2026/Conference/Submission13565/Reviewer_vVJR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13565/Reviewer_vVJR"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13565/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761651228043, "cdate": 1761651228043, "tmdate": 1762924162310, "mdate": 1762924162310, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper argues against the classical Turing model of computation, and instead argues for an alternative foundation for cognition based on the notion of \"topological closure\", which is the idea that cycles rather than symbolic enumeration better capture the nature of memory, reasoning and intelligence. Using concepts from algebraic topology (such as homology and boundary operators), the authors develop a metaphorical and mathematical framing outlining this idea."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "The paper raises potentially thought-provoking questions about the structural foundations of cognition."}, "weaknesses": {"value": "This paper does not seem like the best fit for ICLR. It doesn't include any machine learning experiments or any theoretical treatments of machine learning systems.\n\n1. The paper is much too abstract and speculative. The text reads more like a philosophical essay.\n\n2. There is no formal learning problem or setting to say anything concrete. The theorems and proofs  (while I'm not sure whether they are correct) study abstract mathematical objects without instantiating any particular learning setting. It is unclear how to operationalize the definitions and results into something for machine learning. No empirical content or actionable theoretical proposal.\n\n4. The paper doesn't engage with machine learning literature in any meaningful way.\n\n5. There is no discussion about how to apply the framework or any consideration of its limitations."}, "questions": {"value": "Questions:\n- Is this a philosophical or position paper? If so, it may be more relevant in venues that accept position papers and also consider more foundational questions on cognition.\n- If the goal is to influence machine learning thinking, can you make clearer connections to current practice or identify concrete research directions? Could the authors clarify the connection between their framework and current machine learning practice or research?\n- What would be a minimal working example that demonstrates the practical relevance of your framework to machine learning?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "D51stTJ4ks", "forum": "VaFqN9dnCa", "replyto": "VaFqN9dnCa", "signatures": ["ICLR.cc/2026/Conference/Submission13565/Reviewer_WHiK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13565/Reviewer_WHiK"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13565/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989197601, "cdate": 1761989197601, "tmdate": 1762924161312, "mdate": 1762924161312, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}