{"id": "VEm1LJla2b", "number": 17116, "cdate": 1758272394265, "mdate": 1759897195951, "content": {"title": "Collaborative Deterministic–Probabilistic Forecasting for Diverse Spatiotemporal Systems", "abstract": "Probabilistic forecasting is crucial for real-world spatiotemporal systems, such as climate, energy, and urban environments, where quantifying uncertainty is essential for informed, risk-aware decision-making. While diffusion models have shown promise in capturing complex data distributions, their application to spatiotemporal forecasting remains limited due to complex spatiotemporal dynamics and high computational demands. we propose \\textbf{CoST}, a general forecasting framework that \\underline{\\textbf{Co}}llaborates deterministic and diffusion models for diverse \\underline{\\textbf{S}}patio\\underline{\\textbf{T}}emporal systems.\nCoST formulates a mean-residual decomposition strategy: it leverages a powerful deterministic model to capture the conditional mean and a lightweight diffusion model to learn residual uncertainties. This collaborative formulation simplifies learning objectives, improves accuracy and efficiency, and generalizes across diverse spatiotemporal systems. To address spatial heterogeneity, we further design a scale-aware diffusion mechanism to guide the diffusion process. Extensive experiments across ten real-world datasets from climate, energy, communication, and urban systems show that CoST achieves 25\\% performance gains over state-of-the-art baselines, while significantly reducing computational cost. Code and datasets are available at: \\url{https://anonymous.4open.science/r/CoST_17116}.", "tldr": "We propose a collaborative approach that combines a deterministic model and a diffusion model, leveraging their complementary strengths for probabilistic forecasting.", "keywords": ["Spatiotemporal forecasting", "probabilistic forecasting", "diffusion models"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/8a7e8f965af20bad4e74603332aab6852e6d6997.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes CoST, a hybrid framework that combines deterministic and diffusion-based probabilistic forecasting for spatiotemporal systems. Using a mean–residual decomposition and scale-aware diffusion, CoST improves both accuracy and uncertainty estimation, achieving state-of-the-art performance with lower computational cost across multiple real-world datasets.\n\nThe authors use several new datasets as backbones and compare their method with recent approaches, but I noticed that some of these datasets are not open-sourced. It is recommended to include results on publicly available datasets.\n\nThe paper should also provide more qualitative comparisons, especially with published works, to show how the predicted distributions differ.\n\nThe authors need to clarify how their motivation differs from that of TMDM and what the core contribution of this paper truly is.\n\nApart from introducing FFT, what are the other architectural differences from TMDM?\n\nSince QICE has already been widely applied in probabilistic time series forecasting, it does not need to occupy so much space in the paper."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "see summary"}, "weaknesses": {"value": "see summary"}, "questions": {"value": "see summary"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "is5Kvs8Dd9", "forum": "VEm1LJla2b", "replyto": "VEm1LJla2b", "signatures": ["ICLR.cc/2026/Conference/Submission17116/Reviewer_itWV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17116/Reviewer_itWV"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17116/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760784409081, "cdate": 1760784409081, "tmdate": 1762927116029, "mdate": 1762927116029, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes **CoST**, a collaborative framework that first learns the **conditional mean** with a strong deterministic backbone and then models the **residual** with a lightweight diffusion model."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- **S1** The overall design is solid and well-structured. The “deterministic mean + diffusion residual” idea is clearly laid out with intuitive motivation and a concrete algorithmic implementation.  \n- **S2** Broad experimental coverage (ten datasets) with improvements in both probabilistic and point metrics; the paper also claims efficiency benefits."}, "weaknesses": {"value": "- **W1** One of the claimed core contributions—the Mean-Residual Decomposition Framework—appears to be highly similar to the approach proposed by Li et al. (ICLR 2025) [1].A lthough the authors emphasize that their work targets spatiotemporal data, the design of combining a deterministic model with a diffusion model does not exhibit substantial differences from the prior work. Hence, the novelty of this contribution is questionable.\n\n- **W2** The paper lacks quantitative evidence to support its analysis of the characteristics of deterministic and uncertain components (such as residuals) in spatiotemporal data.\n\n- **W3** In the residual component construction stage (Eq. 9), components with magnitudes below $0.1×A_{max}$ are treated as residuals. The constant 0.1 should be considered a hyperparameter; however, the paper does not include a sensitivity analysis regarding this parameter. This omission is important because the choice of this threshold may affect the model’s transferability across different data domains.\n\n[1]. Li, Q., Zhang, Z., Yao, L., Li, Z., Zhong, T., & Zhang, Y. (2025). Diffusion-based decoupled deterministic and uncertain framework for probabilistic multivariate time series forecasting. In The Thirteenth International Conference on Learning Representations."}, "questions": {"value": "- **Q1** From the motivation perspective, this work appears to be an extension of the decoupling deterministic and uncertain components idea in D3U [1], moving from temporal systems to spatiotemporal systems. Could the authors further elaborate on the key distinctions between CoST and D3U in this regard?\n\n- **Q2** It is recommended that the authors include a sensitivity analysis for the hyperparameter mentioned in Weakness-3 and provide empirical guidance on how to set this parameter effectively.\n\n[1]. Li, Q., Zhang, Z., Yao, L., Li, Z., Zhong, T., & Zhang, Y. (2025). Diffusion-based decoupled deterministic and uncertain framework for probabilistic multivariate time series forecasting. In The Thirteenth International Conference on Learning Representations."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ZELsXxNqdg", "forum": "VEm1LJla2b", "replyto": "VEm1LJla2b", "signatures": ["ICLR.cc/2026/Conference/Submission17116/Reviewer_HJmL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17116/Reviewer_HJmL"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17116/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761633601035, "cdate": 1761633601035, "tmdate": 1762927115688, "mdate": 1762927115688, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a forecasting framework called CoST, which integrates deterministic and diffusion models to handle diverse spatiotemporal systems. CoST employs a mean–residual decomposition strategy, where a deterministic model predicts the conditional mean, and a diffusion model captures the residual uncertainties. Extensive experiments demonstrate that CoST outperforms state-of-the-art baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The authors provide a solid theoretical proof supporting the rationality of the proposed mean–residual decomposition strategy.\n\n2.  Extensive experiments convincingly demonstrate the effectiveness of the proposed model.\n\n3. The figures are clearly presented and easy to understand."}, "weaknesses": {"value": "1. The authors identify three challenges in the introduction. However, the introduction does not clearly explain how CoST addresses each of them individually.\n2. Equations 10 and 11 lack sufficient explanation of their underlying motivation. Moreover, the parameters $p$ and $P$ are not explicitly defined.\n3. Although this paper focuses on spatiotemporal prediction tasks, CoST does not explicitly demonstrate how it captures spatial correlations. Furthermore, the ablation study omits a variant that enforces identical variance across all locations.\n4. Since pre-trained existing models are used to predict the mean, evaluating prediction performance using MAE and RMSE is not appropriate. This setup is equivalent to directly using the outputs of the existing models, which prevents a fair assessment of CoST's effectiveness.\n5. The paper does not specify which deterministic model CoST employs in Tables 1 and 2."}, "questions": {"value": "See Weaknesses 1–4 for details. In addition, many existing methods also employ a similar mean–residual decomposition strategy. What are the fundamental differences between CoST and these existing approaches?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "jPMBuAzK1n", "forum": "VEm1LJla2b", "replyto": "VEm1LJla2b", "signatures": ["ICLR.cc/2026/Conference/Submission17116/Reviewer_Z8Ba"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17116/Reviewer_Z8Ba"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17116/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761887357603, "cdate": 1761887357603, "tmdate": 1762927115203, "mdate": 1762927115203, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}