{"id": "VJAqqtVXfD", "number": 16824, "cdate": 1758269117109, "mdate": 1759897217140, "content": {"title": "Solving the 2-norm k-hyperplane clustering problem via multi-norm formulations", "abstract": "We tackle the 2-norm (Euclidean) k-Hyperplane Clustering problem (k-HC2), which asks for finding k hyperplanes that minimize the sum of squared 2-norm (Euclidean) distances between each point and its closest hyperplane. We solve the problem to global optimality via spatial branch-and-bound techniques (SBB) by strengthening a mixed integer quadratically-constrained quadratic programming formulation with constraints that arise when formulating the problem in p-norms with p ̸= 2. In particular, we show that, for every (appropriately scaled) p ∈ N ∪ {∞}, one obtains a variant of k-HC2 whose optimal solutions yield lower bounds within a multiplicative approximation factor. We focus on the case of polyhedral norms where p = 1, ∞ (which admit a disjunctive-programming reformulation), and prove that strengthening the original formulation by including, on top of the original 2-norm constraints, the constraints of one of the polyhedral-norms leads to an SBB method where nonzero lower bounds are obtained in a linear (as opposed to exponential) number of SBB nodes. Experimentally, we show that our strengthened formulations lead to speedups from 41 to 1.5 orders of magnitude, drastically improving the problem’s solvability to global optimality.", "tldr": "", "keywords": ["optimization; spatial branch-and-bound"], "primary_area": "optimization", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/1102a50fa6d57a6064b4f1ce6b6d6d746e51fc6b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper focuses on improving spatial branch-and-bound (SBB) algorithms for optimally solving the 2-norm k-hyperplane clustering $k$-$HC_2$ problem, which seeks to choose k hyperplanes in a way that minimize the squared norm distance between each point and its nearest hyperplane.\n\nThe paper first considers a generalized objective $k$-$HC_{(p,c)}$ that considers the $p$-norm and a scaling constant $c$ in the constraints, and proves that optimal solution for  $k$-$HC_{(q,c')}$ for a careful choice of $c$ provides an optimal solution for $k$-$HC_{(p,c)}$. These bounds can be used specifically for the purpose of finding problems that approximate $k$-$HC_{(2,2)}$ = $k$-$HC_{2}$. The paper then focuses especially on approximations that are obtained for $k$-$HC_{2}$ in terms of $k$-$HC_{(\\infty,1)}$ and $k$-$HC_{(1,1/\\sqrt{n})}$. They then show how this leads to a strengthened formulation for  $k$-$HC_{2}$, which has a faster solution using SBB techniques. In particular, Section 4 proves that only a linear number of nodes in the branch-and-bound is needed to get a non-zero global lower bound for the new formulation, whereas an exponential number of nodes are needed to get a non-zero global lower bound for a basic formulation.\n\nThe paper shows in numerical experiments that the new approach leads to faster solve times in practice."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The topic of the paper is interesting and well-motivated from previous research.\n\nThe mathematical contributions of the paper is non-trivial; the technical contribution of the paper is quite high. \n\nEven though the paper is proving a large number of non-trivial technical results, the presentation is very good and explains the main ideas and components (and how they fit together) very well. The approach makes sense at a high level, and the paper does a good job presenting enough technical detail in the main text while knowing what to push to the appendix.\n\nThe technical approach leads to concrete improvements in numerical experiments."}, "weaknesses": {"value": "There were a couple places where the technical details were a little unclear and could have been explained a bit better:\n\nLemma 2 seems written somewhat informally and I do not follow what it is saying. In particular, it states that imposing a certain inequality \"coincides with accounting for each point to hyperplane distance as ...\". I don't understand precise meaning of the wording \"coincides with accounting for\", and hence I do not follow the meaning or significance of this lemma.\n\nIt's also not that clear how Lemma 2 is used in the main results. It's clear how Lemma 3 and Theorem 2 together produce the useful bound in corollary 2, but what role does Lemma 2 play in all this? \n\nFigures 1 and 2 could use a bit more explanation, e.g., in the caption. At first something seemed backwards, because the text explained how the feasible region of a (q,c) problem with $q = 1, \\infty$ and $c = 1, 1/\\sqrt{n}$ contains the feasible region for $p = 2, c = 1$, but this appeared opposite to the pictures where a circle contained a red diamond and green square. It did not take me long to realize that this is because the feasible region is everything that lies *outside* these colored shapes, but it would have made things a lot clearer a lot quicker to note this explicitly, rather than just stating these are illustrations of certain feasible regions. Also, in the captions, shouldn't you write 2 instead of n in $\\mathbb{R}^n$?\n\nThis is minor, but there are also some typos to fix:\n\n* lemma 1: coincide Also ---> add missing period\n* line 072: \"d_p intrinsically\" --> missing the word \"is\"?\n* line 055: \"nonzero global lower bounds is\" --> bound is or bounds are"}, "questions": {"value": "Can you clarify the meaning of Lemma 2 and it's purpose?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "4U0GNJQy6U", "forum": "VJAqqtVXfD", "replyto": "VJAqqtVXfD", "signatures": ["ICLR.cc/2026/Conference/Submission16824/Reviewer_RjaT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16824/Reviewer_RjaT"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761295975515, "cdate": 1761295975515, "tmdate": 1762926851774, "mdate": 1762926851774, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors give a spatial branch-and-bound (SBB) method to solve the k-hyperplane clustering problem (k-HC2), which minimizes the sum of squared Euclidean distances from points to their nearest hyperplane. By updating the MI-QCQP formulation with constraints from alternative p-norms (especially polyhedral norms like p = 1, $\\infty$), they show that these additions improve SBB efficiency, reducing the number of nodes needed for nonzero lower bounds from exponential to linear under mild assumptions. Empirical results confirm speedups on the two listed datasets."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The k-Hyperplane Clustering problem (k-HC2) is a fundamental problem in classical machine learning. Addressing the k-HC2 problem using the a MI-QCQP formulation with constraints would be of interest to the community, particularly in the context of subspace clustering.\n\n2. The main contribution of this work lies in using a multi-norm approach to estimate the lower bound for the objective value of k-HC_{2,1}, as compared to using a single polyhedral norm. In this way, the authors enable earlier pruning in the SBB procedure. Furthermore, under specific assumptions (as shown in Proposition 4), the authors provide theoretical guarantees for the use of two scaled polyhedral-norm constraints in the k-HC(2,1) formulation.\n\n3. The proposed algorithm shows empirical speedups on datasets."}, "weaknesses": {"value": "1. The paper does not discuss prior research in subspace clustering, which also aims to identify k subspaces that minimize the sum of squared Euclidean distances between each data point and its closest subspace [1][2][3]. \n\n2. The idea of using polyhedral norms and the SBB methods for k-HC2 problem has already been explored in several prior works (e.g., Dhyani and Liberti (2008), Amaldi & Coniglio (2013)). While this paper introduces a modification by incorporating multiple norm constraints($\\ell_1$-norm and $\\ell_{\\infty}$-norm) for approximation purposes, the contribution may be viewed as incremental.\n\n3. The problem remains computationally challenging for large-scale instances, and the paper does not clearly specify the time complexity of the proposed algorithm.\n\nReference:\n\n[1]. Rademacher L, Vempala S, Wang G. Matrix approximation and projective clustering via iterative sampling[C]. Proceedings of the seventeenth annual ACM-SIAM symposium on Discrete algorithm, 2006, Pages 1117 - 1126.\n\n[2]. Sohler, Christian, and David P. Woodruff. Strong coresets for k-median and subspace approximation: Goodbye dimension. 2018 IEEE 59th Annual Symposium on Foundations of Computer Science. IEEE, 2018.\n \n[3]. Eiben, Eduard, et al. EPTAS for k-means clustering of affine subspaces. Proceedings of the 2021 ACM-SIAM Symposium on Discrete Algorithms, 2021."}, "questions": {"value": "1. How does the proposed method compare to existing subspace clustering approaches [2-3] in terms of formulation and performance?\n\n2. What is the time complexity of the proposed algorithm, and how does it scale with data size?\n\n3. What are the practical applications of the k-HC² algorithm, and in which domains does it offer clear advantages?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "MWdT55CukS", "forum": "VJAqqtVXfD", "replyto": "VJAqqtVXfD", "signatures": ["ICLR.cc/2026/Conference/Submission16824/Reviewer_mEub"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16824/Reviewer_mEub"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761932253277, "cdate": 1761932253277, "tmdate": 1762926851468, "mdate": 1762926851468, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces a method to solve the k-Hyperplane Clustering problem in the 2-norm ($k-HC_2$) to global optimality using spatial branch-and-bound (SBB). The approach strengthens the classical mixed-integer quadratically constrained quadratic programming (MI-QCQP) formulation by incorporating constraints from polyhedral norm variants $(p = 1, \\infty)$. The authors show that including ∞-norm constraints allows the SBB method to obtain a nonzero lower bound in O(nk) nodes, compared to $\\Omega(2^{k(n−1)})$ nodes for the baseline. Experiments on synthetic datasets report speedups of 8–41 times, improving the number of instances solved to global optimality."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. Theoretical analysis proves that adding polyhedral norm constraints reduces the number of SBB nodes required to obtain a nonzero lower bound from exponential to polynomial.\n2. The method is evaluated on two synthetic testbeds (Low-dim and High-dim) with statistical tests (Wilcoxon signed-rank) confirming significant speedups.\n3. Clear MI-QCQP and MILP formulations are provided for the polyhedral norm constraints.\n4. The multi-norm relaxation framework is general and may be applied to other problems with nonconvex norm constraints."}, "weaknesses": {"value": "1. Experiments are limited to small-scale instances (up to m = 30, n = 5, k = 5) and use synthetically generated data with a specific noise model.\n2. The theoretical advantage of $\\infty$-norm constraints assumes branching occurs first on the binary variables of the polyhedral norm formulation; performance under default branching strategies is not tested.\n3. The analysis focuses only on the number of nodes to the first nonzero bound, not the total tree size or gap closure.\n4. No comparison with specialized heuristics or state-of-the-art approximate methods is provided.\n5. Validation is limited to synthetic data; real-world applicability is not assessed.\n6. The method requires solving complex MI-QCQPs, which may not scale to very large instances.\n7. There is also no analysis of the trade-off between solution quality and computation time for practical use.\n8. The paper does not provide guidance on selecting which polyhedral norm constraints to include for best performance."}, "questions": {"value": "1. How does the method scale with the number of data points m, given that the assignment problem may become the bottleneck?\n2. Can the authors provide wall-clock time profiles and total node counts (not just medians) to better characterize tree size and convergence?\n3. How robust are the speedups under solver-default branching rules and parameters?\n4. Why does the multi-norm formulation perform worse than the individual $\\infty$-norm formulation in some cases?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "isTqlFO6oH", "forum": "VJAqqtVXfD", "replyto": "VJAqqtVXfD", "signatures": ["ICLR.cc/2026/Conference/Submission16824/Reviewer_oow2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16824/Reviewer_oow2"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16824/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762043190571, "cdate": 1762043190571, "tmdate": 1762926851174, "mdate": 1762926851174, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}