{"id": "VqinBcJSsK", "number": 15724, "cdate": 1758254363135, "mdate": 1759897286251, "content": {"title": "M-learner: A Flexible And Powerful Framework To Study Heterogeneous Treatment Effect In Mediation Model", "abstract": "We propose a novel method, termed the M-learner, for estimating heterogeneous\nindirect effects and identifying relevant subgroups within a mediation framework.\nThe procedure comprises four key steps. First, we compute individual-level con-\nditional average indirect treatment effect. Second, we construct a distance ma-\ntrix based on pairwise differences. Third, we apply t-SNE to project this ma-\ntrix into a low-dimensional Euclidean space, followed by K-means clustering\nto identify subgroup structures. Finally, we calibrate and refine the clusters us-\ning a threshold-based procedure to determine the optimal configuration. This\nis the first method capable of revealing the complex relationships among X, M,\nand Y within mediation analysis while effectively controlling the Type I error\nrate. Experimental results validate the robustness and effectiveness of the pro-\nposed framework. Application to the real-world Jobs II dataset highlights the\nbroad adaptability and potential applicability of our method. Code is available at\nhttps://anonymous.4open.science/r/M-learner-C4BB.", "tldr": "We propose a novel method, termed the M-learner, for estimating heterogeneous indirect treatment effects and identifying relevant subgroups within a mediation framework.", "keywords": ["causal inference", "causal decision making", "mediation analysis", "randomized clinical trial"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/97e510939b2834911462f54e8d91ff481a60bb16.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This study proposes a method to estimate the natural indirect effect, focusing on a conditional estimation to then assess an analysis of the heterogeneity of this effect, depending on the covariates. The authors then propose a heuristic to derive interpretable subgroups of observations that share a similar indirect effect, to identify subgroups that most benefit the treatment."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The authors address an interesting question, with many practical implications, including the use of surrogate outcomes in clinical trials (in which case the surrogate outcome is the mediator). The authors also propose an end-to-end framework for analysis, which is always interesting to illustrate that the use case they propose is feasible."}, "weaknesses": {"value": "The propose approach is not compared to any baseline approach. A lot of steps are very empirical, and they make sense in an applicative setting, but most steps will not have a theoretical grounding. In that case, an extensive empirical analysis, and comparison to alternative choices is needed, much stronger than the one proposed in this study."}, "questions": {"value": "- a lot of existing mediation analysis estimators are proposed. In their implementation, most of them actually estimates conditional effects, that are then averaged over the individuals to provide average effects. The justification to develop a new estimation method is not clear, and a comparison to existing methods is absolutely necessary, even if those approaches are not explicitely framed to estimate the CAITE, they do in practice. It would be absolutely key to the strength of this study to add comparisons to those methods.\n- Similarly, there are numerous works exploring the question of subgroups identification (or quantification of the effect heterogeneity) for the treatment effect not in the frame of mediation. Those would constitute a lot of baseline approaches to mention and compare the results to (one of them is Sverdrup, Erik, Maria Petukhova, and Stefan Wager. \"Estimating treatment effect heterogeneity in Psychiatry: A review and tutorial with causal forests.\" International Journal of Methods in Psychiatric Research 34.2 (2025): e70015.)\n- the authors claim that a possible application would be to have surrogate markers not to wait for the final outcome of the study to occur. Are there any guarantees that the sugroups for the indirect effect are the optimal subgroups for the total effect? is there an assumption regarding this aspect in your work?\n- there are a number of minor formatting issues, with a lot of missing spaces around citations (l. 37, 52, 169, 170, 370...), l.186 there is an opened quote sign with the rest of the test on the line after\n- there seems to be a missing condition in equation 1, about the intersection of U^{ITE}_i and U^{ITE}_j\n- in Figure 5, the caption refers to the variable econ_hard, but I d'ont see it in the tree. It is really hard to read the figure to actually interprete the type of individuals in the two subtype, so that is a shame for an interpretable result. Improvement of this figure would be welcome.\n\nThe work of providing an extensive comparison to the existing approaches for the first two points is really important, and is probably hard to fit within the rebuttal phase, hence my rating."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "7IsHac37GU", "forum": "VqinBcJSsK", "replyto": "VqinBcJSsK", "signatures": ["ICLR.cc/2026/Conference/Submission15724/Reviewer_drzE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15724/Reviewer_drzE"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15724/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761475747644, "cdate": 1761475747644, "tmdate": 1762925968866, "mdate": 1762925968866, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes M-learner, a machine learning–based framework for estimating heterogeneous indirect treatment effects within mediation analysis. The method estimates individual Conditional Average Indirect Treatment Effects (CAITE), constructs pairwise distances, applies t-SNE and K-means clustering to identify subgroups, and uses a likelihood ratio–based calibration (pleaf) to control Type I error. Experiments on synthetic data under multiple heterogeneity scenarios and a real-world JOBS II dataset demonstrate that M-learner can effectively detect valid subgroups and maintain statistical control."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper addresses an important and underexplored problem—estimating heterogeneous indirect treatment effects in mediation analysis.\n\n2. The proposed M-learner framework is conceptually clear and integrates machine learning flexibility with statistical inference for subgroup discovery.\n\n3. The method provides an explicit mechanism (via pleaf) to control Type I error, which is promising. \n\n4. The framework is model-agnostic, allowing the use of different base learners such as Random Forests and XGBoost, enhancing its general applicability."}, "weaknesses": {"value": "1. The method relies on the random treatment assignment assumption and is therefore limited to RCT data, reducing applicability to observational studies.\n\n2. The consistency theorem is presented without a rigorous proof or asymptotic error analysis, making the theoretical foundation somewhat weak.\n\n3. The t-SNE + K-means clustering step introduces randomness and hyperparameter sensitivity, which may affect subgroup stability and reproducibility.\n\n4. The calibration procedure based on p_leaf lacks detailed justification and description, however this is quite important for the readability of this paper.\n\n5. The comparison with the BART-based method (Ting & Linero, 2025) in the appendix is limited and does not provide comprehensive quantitative evaluation."}, "questions": {"value": "The following is my questions and concerns:\n\n1. The introduction primarily reviews the HTE literature, with insufficient discussion on the definition and challenges (such as identification and estimation biases) of heterogeneous mediation effects.\n\n2. It's unclear why the existing methods can not be adapted to mediation settings by modeling the mediator as part of covariates or outcome mechanisms, and then by stratification to analyse? For example, taking the mediator as the outcome variable.\n\n3. Selecting valid mediator variable is quite important for this work. It's unclear in the intro or method section if the mediator is pre-defined or known? If no, how to identify a valid mediator? If valid mediator is known, existing HTEs methods can be directly adapted to mediator setting with replacing the definition of outcome variable.\n\n4. The decomposition TTE=ITE+DTE mplicitly assumes additive effects; how does the method handle potential interaction between direct and indirect pathways?\n\n5. The main limitation of the proposed M-Learner framework is that it relies on the assumption of random treatment assignment, making it applicable only to randomized controlled trial (RCT) data. In most real-world observational studies, treatment assignment is confounded with covariates or unobserved factors, violating this assumption and potentially biasing the estimation of CAITE and subgroup identification. Since the method lacks confounding adjustment mechanisms (e.g., propensity weighting or doubly robust estimation), its identifiability and validity cannot be guaranteed beyond RCT settings.\n\n6. Furthermore, Assumption 3 (mediator ignorability) is particularly strong and generally unverifiable even under randomization, since unmeasured mediator–outcome confounders often exist even in RCT.\n\n7. Eq (2) and (3) are not clearly stated. What is $\\eta(x)$ and $k(x)$? what do they represent in a mediation model?\n\n8. In theorem 2.1, the transition from the integral expression to $g_1^Y(x,g_1^M)-g_1^Y(x,g_0^M)$ is non-trivial and seems to assume linear or mean-value properties that may not hold.\n\n9. Since CAITE is scalar, why not cluster directly on τ^\\hat (e.g., 1D k-means or optimal thresholding) instead of t-SNE+K-means?\n\n10. the selection of final subtype classification is not clear. what does the each leaf of decision tree actually mean? What does p_leaf represent? Why construct a decision tree to model the clustering results? Why using the minimal p_leaf as the final results? All theses issues are not clearly stated, making the methodology hard to read. The paper should clearly state the process of how to model M by decision tree (eq 4 and 5) and how to use the test to select the final subtype.\n\n11. The setting of the experiment is really unclear and confusing. For example in table 1, why report the X(1) and X(2)? They are the ground truth?\n\n12. why the comparison with existing heterogeneous mediation methods (e.g., BART-based Ting & Linero, 2025 and more) is not reported in the main body?Furthermore, The comparison with the BART-based model presented in the appendix is not sufficiently comprehensive. The authors should provide more empirical evaluation adopting the same setting and experiment design as the ones in main body."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8oqIBHaT7y", "forum": "VqinBcJSsK", "replyto": "VqinBcJSsK", "signatures": ["ICLR.cc/2026/Conference/Submission15724/Reviewer_XjGn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15724/Reviewer_XjGn"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15724/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761663086255, "cdate": 1761663086255, "tmdate": 1762925968505, "mdate": 1762925968505, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new framework, called the M-learner, designed to estimate heterogeneous indirect and total treatment effects and to identify subgroups with similar mediation patterns. The proposed method first estimates conditional average indirect and total treatment effects for each individual, and then, it constructs a pairwise distance matrix capturing heterogeneity among these effects. Next, it applies t-SNE to project the distance matrix into a low-dimensional space and performs K-means clustering to detect subgroup structures. Finally, it refines the clusters through a threshold-based calibration to determine the optimal grouping. In this way, the method offers a way to uncover complex interdependencies among covariates, mediators, and outcomes within mediation analysis while purportedly maintaining control over Type I error. Although the topic, heterogeneous mediation effects, is of potential interest, this submission does not offer sufficient originality, rigor, or theoretical contribution to merit publication at ICLR."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The proposed method offers a practical pipeline for mediation heterogeneity. Clear, modular steps make it easy to implement and plug into existing learners, enabling subgroup discovery focused on indirect (mediated) effects.\n-  Simulations and the JOBS II case illustrate how the method can flag groups where the mediator is (or isn’t) operative, suggesting use for interim monitoring or targeted interventions in trials."}, "weaknesses": {"value": "1. My main hesitation is the fact that The proposed method is primarily a pipeline of existing techniques (e.g., standard causal mediation decomposition, off-the-shelf machine learning estimators, t-SNE projection, and K-means clustering), with limited theoretical depth and weak empirical validation. The 'M-learner' seems just a combination of known components: basic causal mediation model, CAITE estimation, t-SNE projection, and K-means clustering. Given that there is no new causal identification result, the algorithm’s novelty is rather superficial.\n\n2.  There is no formal analysis of consistency, convergence, or error bounds for the discovered heterogeneous subgroups, despite prior top-tier work on related problems providing strong guarantees.\n\n3. The work does not engage with modern causal learning theory, e.g., semiparametric efficiency, double robustness, orthogonalization, or debiasing. Moreover, references to recent methods (R-learner, DR-learner, T-learner, etc.) are mentioned yet not properly contrasted. There is no clear argument why this framework improves over them or why mediation heterogeneity cannot be addressed by existing meta learner extensions.\n\n4. Methodological choices seems arbitrary. I believe the use of t-SNE for identifying causal subgroups is methodologically inappropriate; it distorts global distances and cannot guarantee meaningful subgroup structure. Also, 'Calibration via p-leaf' is ill-defined and lacks statistical justification. At the very least, the authors provide sound argument over these choices.\n\n5. The paper is verbose and repetitive, mixing conceptual explanation with implementation details."}, "questions": {"value": "Could you provide a convincing, point-by-point response to the critiques above?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "9nd2TWkIFE", "forum": "VqinBcJSsK", "replyto": "VqinBcJSsK", "signatures": ["ICLR.cc/2026/Conference/Submission15724/Reviewer_4JSb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15724/Reviewer_4JSb"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15724/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761912714310, "cdate": 1761912714310, "tmdate": 1762925968114, "mdate": 1762925968114, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this article, an estimation method for indirect under a mediation framework. The procedure comprises four key steps. \nIn addition to estimating mediated heterogeneity, an approach for identifying subgroups is proposed. \nSimulation and empirical studies are provided."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The paper is well-motivated."}, "weaknesses": {"value": "1. The paper requires substantial revision to provide more rigorous validation of its underlying assumptions. Assumptions 3 and 4, in particular, lack sufficient substantiation. In practice, the precise identification of mediators remains elusive, and the method's reliance on numerous unobserved elements renders its applicability questionable. Furthermore, the data-driven approach to subgroup identification appears fundamentally weak, as the paper conspicuously neglects recent advances in semi-parametric efficient methodologies.\n\n2. The paper needs to be clear about how the type I and type II errors are controlled. I cannot find the evidence other than numerical studies, which can be easily manipulated, and theoretical justification are needed if the claim remains in the paper."}, "questions": {"value": "- Please see **Weakness**."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "cZElTwfQWF", "forum": "VqinBcJSsK", "replyto": "VqinBcJSsK", "signatures": ["ICLR.cc/2026/Conference/Submission15724/Reviewer_Zc3W"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15724/Reviewer_Zc3W"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15724/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762159095788, "cdate": 1762159095788, "tmdate": 1762925967586, "mdate": 1762925967586, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}