{"id": "VtN1z92lvu", "number": 16515, "cdate": 1758265484567, "mdate": 1759897235911, "content": {"title": "Decision Aggregation under Quantal Response", "abstract": "The effectiveness of collective decision-making is often challenged by the bounded rationality and inherent stochasticity of individual agents. We investigate this by analyzing how to aggregate decisions from $n$ experts, each receiving a private signal about an unknown state. Assuming signals are conditionally independent and identically distributed, we depart from the fully rational paradigm and model expert behavior using quantal response—a stochastic choice model capturing bounded rationality. Within a minimax regret framework, we show that majority voting is the optimal robust aggregator when individual rationality falls below a certain threshold. Interestingly, such groups can outperform perfectly rational agents, as their decision randomness encodes weak but informative signals lost in deterministic behavior. We validate these findings using large language models (LLMs), which naturally exhibit quantal response via their temperature parameter. Aggregating moderately stochastic LLM outputs significantly improves accuracy on complex reasoning tasks, highlighting bounded rationality not as a limitation, but as a potential strength in collective intelligence.", "tldr": "", "keywords": ["aggregation", "quantal response", "bounded rationality", "large language models"], "primary_area": "probabilistic methods (Bayesian methods, variational inference, sampling, UQ, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d7e444fd7c617ae7d5ef8d79c26b85d657576e12.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper examines information aggregation under bounded rationality. A decision maker gathers reports from agents receiving noisy signals about a ground truth. Instead of sincere voting, agents follow a quantal response modeled by a logistic link between their posterior and report. The authors show that (1) majority voting with an optimal threshold minimizes regret, and (2) with more agents, quantal responders can outperform sincere ones. Experiments further confirm that (1) large language models exhibit quantal response behavior via temperature, and (2) the theoretical results hold empirically."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The paper offers a valuable contribution to the information aggregation literature by applying a rational framework to analyze boundedly rational agents. The results are both elegant and insightful, providing a simple yet positive perspective on a complex problem. The experimental findings are also convincing."}, "weaknesses": {"value": "I am not fully convinced by the second main result (bounded rational advantage). The idea behind it is not as surprising as it may seem. Quantal response preserves randomness even when rational (I'd rather call sincere) agents become deterministic. This randomness helps the majority vote to operate processes like the Condorcet Jury Theorem, constructing another form of informative voting (voting as their signal suggests) and reaching the ground truth with high probability.\n\nThe thing is, this observation is based on the assumption that agents vote sincerely. Personally, I don't quite buy this assumption. On the simplicity side, conducting a Bayesian update and maximizing expected utility is not an easy task for voters who don't really know Bayesian statistics. On the rational side, sincere voting is not necessarily a Nash Equilibrium [Austen-Smith and Banks, 1996; Han et. al, 2023]. Consequently, I am curious to see if the same result extends to various settings. Nevertheless, I am overall positive about this paper. \n\nAusten-Smith D, Banks J S. Information aggregation, rationality, and the Condorcet jury theorem[J]. American Political Science Review, 1996, 90(1): 34-45.\nHan Q, Schoenebeck G, Tao B, et al. The Wisdom of Strategic Voting[C]//Proceedings of the 24th ACM Conference on Economics and Computation. 2023: 885-905.\n\nP.S. You might want to update some of the references, whose status seems out-of-date."}, "questions": {"value": "1. How do you justify sincere voting?\n2. Do the same results extend to various settings?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Popf0XiYG6", "forum": "VtN1z92lvu", "replyto": "VtN1z92lvu", "signatures": ["ICLR.cc/2026/Conference/Submission16515/Reviewer_eia5"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16515/Reviewer_eia5"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16515/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761796892434, "cdate": 1761796892434, "tmdate": 1762926604182, "mdate": 1762926604182, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents theoretic results on how decisions are aggregated under uncertainty while quantal response is considered. The main theorem is in 3.1, which proves that (1) if the rational parameter is bounded under a threshold, then majority voting is the optimal aggregation rule and (2) the group collective decision can be benefited from bounded rationality of individuals."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The technical contribution is sound. The results are quite interesting."}, "weaknesses": {"value": "It is not very clear why LLMs are generally considered as quantal best responder"}, "questions": {"value": "The theoretical results in this paper generally look great and insightful. However, I wonder the authors could comment more about why LLMs are considered quantal best responder, as section 4.1 only concerns on one domain. Also, is here every LLM considered to have the same \\lambda?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6hhwkz0yHT", "forum": "VtN1z92lvu", "replyto": "VtN1z92lvu", "signatures": ["ICLR.cc/2026/Conference/Submission16515/Reviewer_shYv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16515/Reviewer_shYv"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16515/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761804885538, "cdate": 1761804885538, "tmdate": 1762926603675, "mdate": 1762926603675, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work shows that when experts make rational, stochastic decisions (modeled by quantal response), majority voting optimally aggregates their judgments under minimax regret. Surprisingly, such partially random groups can outperform perfectly rational agents, as their randomness preserves informative variation. Experiments with LLMs confirm that aggregating moderately stochastic outputs improves reasoning, revealing bounded rationality as a strength in collective intelligence."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. Theoretical results: the authors proved interesting theoretical results showing that bounded rationality can outperform perfect rationality;\n2. Interesting experiments: the authors leverage LLMs as conditional independent agents, which provides a scenario where the condition of the theoretical results can be easily satisfied."}, "weaknesses": {"value": "1. It seems not straightforward to calculate g(n) in the main theorem. Appendix A2 provides a plot of g(n), but mostly observations. May provide more insight on why g(n) = g(n-1) for even n's. \n2. (minor) the authors refer to Fig 5 in line 340, but Fig 5 is in the appendix. Better refer to both the appendix section and the figure."}, "questions": {"value": "See above"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "weOw2nMjk5", "forum": "VtN1z92lvu", "replyto": "VtN1z92lvu", "signatures": ["ICLR.cc/2026/Conference/Submission16515/Reviewer_vc8K"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16515/Reviewer_vc8K"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16515/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762577977934, "cdate": 1762577977934, "tmdate": 1762926603367, "mdate": 1762926603367, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}