{"id": "vxlTrWwY4y", "number": 22826, "cdate": 1758335910333, "mdate": 1759896844319, "content": {"title": "High-accuracy and dimension-free sampling with diffusions", "abstract": "Diffusion models have shown remarkable empirical success in sampling from rich multi-modal distributions. Their inference relies on solving a certain differential equation initialized at pure noise. However, this differential equation cannot be solved in closed form, and its resolution via discretization typically requires many small iterations to produce \\emph{high-quality} samples. More precisely, prior works have shown that the iteration complexity of discretization methods for diffusion models scales polynomially in the ambient dimension and the inverse accuracy $1/\\varepsilon$. In this work, we propose a new solver for diffusion models relying on the collocation method~\\cite{lee2018algorithmic}, and we prove that its iteration complexity scales \\emph{logarithmically} in $1/\\varepsilon$, and does not depend explicitly on the ambient dimension. More precisely, the dimension affects the complexity of our solver through the \\emph{effective radius} of the support of the target distribution only. Our solver constitutes the first \"high-accuracy\" diffusion-based sampler that only uses approximate access to the scores of the data distribution.", "tldr": "", "keywords": ["diffusion models", "high-accuracy sampling", "picard iteration", "low-degree polynomials", "probability flow ODE"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2eed28a634e736c69cbb1f97552c57c075ddc765.pdf", "supplementary_material": "/attachment/9c861808cac23ba619e8cd9855ad668882de3a0f.pdf"}, "replies": [{"content": {"summary": {"value": "This paper introduces a new diffusion-based sampling algorithm that achieves high accuracy (logarithmic dependence on error tolerance ($1/\\epsilon$)). \nThe authors adapt the collocation method to diffusion models, showing that the score function’s time evolution along the probability flow ODE can be approximated by a low-degree polynomial. This enables long, stable integration steps without dimension-dependent error growth.\nUnder mild assumptions (bounded-support distribution convolved with Gaussian noise), they prove that their sampler reaches total variation distance $\\epsilon$ from the target in\n$(R/\\sigma)^2 \\log(1/\\epsilon)$\niterations, where $R$ is the effective radius and $\\sigma$ the noise level.\nThe authors claim that this is the first diffusion sampler with polylogarithmic dependence on ($1/\\epsilon$) and dimension-free complexity. Theoretical guarantees are supported by rigorous convergence proofs and extensions to Wasserstein and TV metrics."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* **Theoretical novelty:** Provides the first high-accuracy, dimension-free complexity bound for diffusion sampling.\n* **Elegant mathematical analysis:** Derives explicit bounds on higher-order time derivatives of the score, enabling low-degree polynomial approximation.\n* **Clarity of assumptions:** The “bounded plus noise” assumption is realistic and aligns with practical diffusion model setups.\n* **Practical relevance:** Insights into discretization stability and polynomial convergence are directly relevant to improving real-world diffusion solvers."}, "weaknesses": {"value": "* **Strong assumptions:** Requires sub-exponential tails for score estimation error.\n* **No empirical validation:** Results are purely theoretical; no experiments confirm practical speedups or quality gains.\n* **Restricted generality:** The framework may not apply cleanly to unbounded or heavy-tailed data distributions common in real applications.\n* **Method complexity:** Implementation of the collocation solver may be nontrivial compared to standard discretization schemes."}, "questions": {"value": "- How sensitive is the convergence rate to violations of the sub-exponential error assumption in practice?\n- Does the method maintain stability when applied to very high-dimensional or multimodal image data distributions?\n- Could similar dimension-free guarantees hold under weaker moment conditions rather than bounded support?\n- Are there empirical results planned to validate these theoretical claims on benchmark diffusion models?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "8c94OjrOK1", "forum": "vxlTrWwY4y", "replyto": "vxlTrWwY4y", "signatures": ["ICLR.cc/2026/Conference/Submission22826/Reviewer_r9Fo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22826/Reviewer_r9Fo"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22826/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761503923970, "cdate": 1761503923970, "tmdate": 1762942401943, "mdate": 1762942401943, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work introduces a new diffusion model solver based on the collocation method. The proposed solver achieves logarithmic scaling in inverse accuracy and avoids explicit dependence on dimensionality. It is the first high-accuracy diffusion-based sampler that operates with only approximate score information."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "(1) The paper proposes a new solver based on the collocation method for diffusion models. A delicate design will lead to high-accuracy sampling.\n\n(2) It proves that a polynomial iteration complexity on $1/\\epsilon$, where $\\epsilon$ is the sampling accuracy.\n\n(3) The paper provides a detailed theoretical analysis."}, "weaknesses": {"value": "(1) The introduction of collocation methods contains much ambiguity. For example, “ by polynomial interpolation”, in my understanding, polynomial interpolation first determines where it takes values ($c_i$), then we can find corresponding polynomials. The argument first finding a polynomial basis, then selecting nodes satisfying the equations, seems weird.\n\n(2) Many definitions of norms are not specified in this paper. For example, Lemma 8, did I miss where the $||\\cdot||_ {p,\\infty}$ is defined? In lemma 9, $||y-\\tilde{y} ||$, what is the norm here? Then in Theorem 10, the norm becomes $||\\cdot ||_{\\infty}$. Should it be the same as that in Lemma 8? I recommend that the readers write a section in the main text, including all the notations used.\n\n(3) Theorem 10: the result mixes different $\\delta$, one is the error of initialization distribution, another is the probability (at least $1-\\delta$).\n\n(4) The proof of the paper is very hard to read. The technical lemmas, for example, Lemma 6, look horrible. Could you provide a proof sketch of the main theorem? It should discuss how the technical lemmas are applied and why they are necessary. \n\n(5) What is $\\epsilon_{sc}$ in Cor 14? In Theorem 14, why you require $\\epsilon_{err} \\ge \\epsilon$, instead of $<$?\n\n(6) Line 1257, Lemma ??? is not exhibited.\n\n(7) The paper misses some important related work, e.g., [1][2].\n\n[1] Unified Convergence Analysis for Score-Based Diffusion Models with Deterministic Samplers ICLR Li et al.2024\n\n[2] Convergence analysis of probability flow ode for score-based generative models Huang et al. 2024"}, "questions": {"value": "The contribution of this paper is more to apply the collocation method (a numerical method) to the ODE analysis of diffusion models, rather than proposing something specific to diffusion. Do you try to implement the algorithm in practice? How will it behave?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PK5HID4ZrK", "forum": "vxlTrWwY4y", "replyto": "vxlTrWwY4y", "signatures": ["ICLR.cc/2026/Conference/Submission22826/Reviewer_Z2pA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22826/Reviewer_Z2pA"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22826/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761695840469, "cdate": 1761695840469, "tmdate": 1762942401669, "mdate": 1762942401669, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "In this paper, the authors introduce a new parallel sampler based on the colocation method [1] for diffusion models on Euclidean state spaces. The main contribution of the paper is to show a convergence bound that the iteration complexity scales logarithmically with the inverse accuracy (compared to polynomial for non-parallel samplers) and does not depend on the ambient dimension for a class of target distributions. The interest of the authors for the polylogarithmic dependency with respect to the inverse accuracy stems from the similar picture which exists for sampling where Metropolis-based correction can achieve poly-logarithmic (wrt the inverse accuracy) iteration complexity.\n\n[1] Lee et al. -- Algorithmic theory of ODEs and sampling from well-conditioned logconcave densities"}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "* The paper is well-written. I think the discussion and clarification regarding the high-accuracy situation in classical statistical sampling is useful for the readers. I could follow the paper with ease. \n\n* The results are new and as far as I know the use of the colocation method [1] in diffusion models is novel. \n\n[1] Lee et al. -- Algorithmic theory of ODEs and sampling from well-conditioned logconcave densities"}, "weaknesses": {"value": "* Assumption 1 seems extremely strong. I think the authors should discuss more the impact of this assumption. Especially with regards to the works of [1,2] which have weaker assumptions on the target distribution (I do understand that the samplers and results are different in those papers but I think it is important to consider the potential limitations of Assumption 1). It seems that it would be well discussed in the context of the manifold hypothesis. \n\n* I believe that the related work section is a bit misleading. In particular I would have expected more discussion around the work of [5] which is a parallel method also exhibiting iteration complexity with poly-logarithmic dependency in the inverse of the accuracy. It also heavily relies on a parallel sampler. I am aware of the comment of the authors \"Finally, we note that the collocation method (see Section 2.3) has been studied in the context of diffusions, but primarily as a way to parallelize the steps of the sampler Anari et al. (2023); Gupta\net al. (2024); Chen et al. (2024a), but not using low-degree polynomial approximation.\" This comment in my opinion tames the claims made in the introduction. Further clarification and comparison is required.\n\n* There exists further work improving the dependency of the iteration complexity from linear with respect to the inverse accuracy. In particular, in [6] for instance the authors show bounds of the order of $O(1/\\varepsilon^{1/K})$ where $K$ is the order of the samplers (see also the references therein). \n\n* I do understand that this is a theoretical paper but given that the authors introduce a new algorithm it would be great if they could illustrate the methodology in low dimensional settings at least. \n\n[1] Conforti et al. (2023) -- KL Convergence Guarantees for Score diffusion models under minimal data assumptions\n\n[2] Benton et al. (2023) -- Nearly d-Linear Convergence Bounds for Diffusion Models via Stochastic Localization\n\n[3] De Bortoli et al. (2022) -- Convergence of denoising diffusion models under the manifold hypothesis\n\n[4] Azangulov et al. (2024) -- Convergence of diffusion models under the manifold hypothesis in high-dimensions\n\n[5] Gupta et al. (2024) -- Faster Diffusion Sampling with Randomized Midpoints: Sequential and Parallel\n\n[6] Li et al. (2025) -- Faster Diffusion Models via Higher-Order Approximation"}, "questions": {"value": "* The authors only discuss the ODE case, what about the SDE one? The introduction of stochasticity is very useful in practice. \n\n* Assumption 4 is very strong. Could you discuss this assumption and refer to other papers which might use a similar assumptions (if they exist?). \n\n* I haven't put this concern in the Weaknesses section because it might simply be that I misunderstood part of the paper. Something that is unclear to me is the number of calls required to the model. It seems to me that the number of calls to the model in the Picard iteration is $DN$. Then in the whole diffusion sampler we use $n$ iterations resulting in $NDn$ (by the way there is a typo in Algorithm 2, line2, $k=q$ should be $k=0$). Is $D=d$? I am having trouble understanding the difference between these two quantities. If that is indeed the case then if we require $d$ calls to the model then the method is **highly** impractical in high dimension.\n\n* I am a bit confused as to what is relevant to the \"parallel\" part of the sampler. In [1] for instance multiple steps are denoised during the Picard iterations. It doesn't seem to be the case here for me. Could you clarify? \n\n* Could the method be applied to provide convergence bounds  for algorithms leveraging other parallel procedures such as speculative sampling [2]?\n\n* Some lemmas do not compile in the supplementary material\n\n[1] Shih et al. (2023) -- Parallel Sampling of Diffusion Models\n\n[2] De Bortoli et al. (2025) -- Accelerated Diffusion Models via Speculative Sampling"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "S2JKvkUZDe", "forum": "vxlTrWwY4y", "replyto": "vxlTrWwY4y", "signatures": ["ICLR.cc/2026/Conference/Submission22826/Reviewer_htQS"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22826/Reviewer_htQS"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22826/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761910520413, "cdate": 1761910520413, "tmdate": 1762942401408, "mdate": 1762942401408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a new solver of diffusion models based on the collocation method to solve ODE, and proves that its sampling complexity is logarithmically in $1/\\epsilon$ for $\\epsilon$ error. This complexity is improved over  that of the classical diffusion samplers. The paper provides theoretical construction of the proposed sampler and relevant proofs. The key assumption relies on some smoothness property of the score function, which allows a low-degree polynomial approximation. This approximation motivates the use of collocation ODE solver, which has exponential convergence in small time windows. Overall, the sampler is proven to have polylogarithmically complexity."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper is well-written and easy-to-follow.\n\n- This work seems to be the first analysis to give a polylog-complexity diffusion sampler."}, "weaknesses": {"value": "The contribution of this work is primarily theoretical and the practical implication is not clear. The proposed sampler appears to be a mathematical construction rather than a practical algorithm, as it relies on a polynomial approximation of the score function that is not tractable in real diffusion inference settings. In this sense, the current title and abstract may be somewhat misleading, as they somewhat suggest the existence of an actual sampler rather than a theoretical construction."}, "questions": {"value": "- What is the “aforementioned Gaussian mixture setting” mentioned in the last paragraph of page 2?\n\n- Algorithm 2 line 2, \"for k=q,...,n-1,n\", what is q?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "dmVYWPnlY4", "forum": "vxlTrWwY4y", "replyto": "vxlTrWwY4y", "signatures": ["ICLR.cc/2026/Conference/Submission22826/Reviewer_Ppqb"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22826/Reviewer_Ppqb"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22826/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762143744116, "cdate": 1762143744116, "tmdate": 1762942400742, "mdate": 1762942400742, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}