{"id": "W6gbWvvovB", "number": 16454, "cdate": 1758264731317, "mdate": 1763723688912, "content": {"title": "OD$^3$: Optimization-free Dataset Distillation for Object Detection", "abstract": "Training large neural networks on large-scale datasets requires substantial computational resources, particularly for dense prediction tasks such as object detection. Although dataset distillation (DD) has been proposed to alleviate these demands by synthesizing compact datasets from larger ones, most existing work focuses solely on image classification, leaving the more complex detection setting largely unexplored. In this paper, we introduce OD$^3$, a novel optimization-free data distillation framework specifically designed for object detection. Our approach involves two stages: first, a candidate selection process in which object instances are iteratively placed in synthesized images based on their suitable locations, and second, a candidate screening process using a pre-trained observer model to remove low-confidence objects. We perform our data synthesis framework on MS COCO and PASCAL VOC, two popular detection datasets, with compression ratios ranging from 0.25% to 5%. Compared to the prior solely existing dataset distillation method on detection and conventional core set selection methods, OD$^3$ delivers superior accuracy, establishes new state-of-the-art results, surpassing prior best method by more than 14% on COCO mAP$_{50}$ at a compression ratio of 1.0%. The code is in the supplementary material.", "tldr": "We introduce OD³, a novel optimization-free data distillation framework specifically designed for object detection.", "keywords": ["dataset distillation", "object detection", "data-centric framework", "efficient machine learning"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/2ef763e072eb91452ecd15afb7d73763650e8dc8.pdf", "supplementary_material": "/attachment/74520a875a8350690d421f8f373f89d4f63a99fe.zip"}, "replies": [{"content": {"summary": {"value": "OD3 is an optimization-free dataset distillation framework for object detection that synthesizes compact datasets by iteratively placing and screening object instances using a pre-trained observer model. It achieves state-of-the-art performance, surpassing prior methods by over 14% in mAP50 on COCO at 1% compression ratio."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.OD3 achieves strong performance with clear speed advantages—dataset synthesis on COCO takes ~4.7 hours on a single GPU, significantly faster than optimization-based alternatives.\n\n2.The SA-DCE component provides a practical way to retain contextual cues for small objects, offering a useful insight for dataset distillation in detection."}, "weaknesses": {"value": "1. The synthesis relies on instance copy-pasting, leading to a domain gap between synthetic and real images that may limit generalization.\n\n2. The method depends on a pre-trained observer model; if this model is biased (e.g., performs poorly on certain categories), it may filter out valid instances and introduce distillation bias.\n\n3. Performance at higher compression ratios (e.g., 5%，10%，20%，100%) is not explored, leaving the scalability and upper performance bound unclear.\n\n4. Backgrounds are randomly sampled from the original dataset, which can create semantically implausible scenes (e.g., indoor objects placed on outdoor backgrounds)."}, "questions": {"value": "In Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FR8Tg6ErUP", "forum": "W6gbWvvovB", "replyto": "W6gbWvvovB", "signatures": ["ICLR.cc/2026/Conference/Submission16454/Reviewer_NPmv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16454/Reviewer_NPmv"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16454/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761877613423, "cdate": 1761877613423, "tmdate": 1762926564427, "mdate": 1762926564427, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes OD³, an optimization-free framework for dataset distillation in object detection. The method synthesizes a compact dataset by strategically selecting and placing object instances from the original dataset onto blank canvases and then screening them using a pre-trained observer model."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "The proposed \"optimization-free\" paradigm, which employs a rule-based placement and screening strategy, enables extremely fast dataset synthesis and significantly reduces the computational overhead of the distillation process itself."}, "weaknesses": {"value": "1. The screening module directly removes objects deemed low-confidence by the observer model. However, these low-confidence objects could precisely be the \"hard examples\"—such as rare categories, heavily occluded, or unusually shaped objects—that are crucial for training a robust detector.\n﻿\n2. The final optimization objective does not account for inter-class balance and intra-class diversity, both of which are critical for the object detection task. The current metrics for Information Density (Φ) and Diversity (N) are too coarse and may lead to a distilled dataset that is biased towards dominant or easy-to-detect classes.\n\n﻿3.  The core of the method involves placing objects randomly on a canvas with only an overlap ratio as a constraint. This ignores the spatial layout relationships, relative scales, and co-occurrence contexts of objects in the real world. Consequently, the synthesized images may lack semantic realism, which could limit the detector's ability to learn high-level contextual reasoning."}, "questions": {"value": "see Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "rMrZahFUC2", "forum": "W6gbWvvovB", "replyto": "W6gbWvvovB", "signatures": ["ICLR.cc/2026/Conference/Submission16454/Reviewer_AKz7"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16454/Reviewer_AKz7"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16454/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761880128374, "cdate": 1761880128374, "tmdate": 1762926563761, "mdate": 1762926563761, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces $\\text{OD}^3$ (Optimization-free Dataset Distillation for Detection), a novel framework explicitly designed to address the unique challenge of synthesizing small, high-fidelity datasets for object detection, a task more complex than image classification due to its spatial and semantic demands. $\\text{OD}^3$ leverages a training-free, two-stage process—candidate selection followed by screening using a pre-trained \"observer\" model—to strategically reconstruct diverse, labeled training images without complex optimization. Evaluations on MS COCO and PASCAL VOC demonstrate that $\\text{OD}^3$ effectively achieves significant dataset size reduction (up to $99.75\\%$) while successfully maintaining the accuracy of object detection models."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This framework employs a clever two-stage design that combines iterative candidate selection with pre-trained observer model filtering. This approach avoids the complex and time-consuming optimization processes typical of traditional DD methods, making the dataset distillation process more efficient, straightforward, and easier to deploy.\n\n2. $\\text{OD}^3$ achieves extremely high compression ratios (up to 99.75%) on MS COCO and PASCAL VOC while maintaining the accuracy of trained models, providing an efficient solution for saving computational and data resources when training object detectors."}, "weaknesses": {"value": "1. The second contribution in the introduction extends the concept of dataset distillation from the relatively well-explored domain of image classification to the more challenging task of object detection. This has already been achieved by DCOD.\n2. Both DCOD and OD3 experience substantial performance degradation compared to their uncompressed counterparts. At compression rates of 5% or even 10%, it remains unclear how much additional compression would be necessary to approach the performance of the uncompressed models."}, "questions": {"value": "1. Tables 1 and 2 should include upper bounds to illustrate the potential for improvement in existing methods within the field of DD for object detection.\n2. Table 4 indicates that the best results are obtained when the observer and target detectors share the same architecture. Employing higher-performance detectors does not enhance the distillation effect. Therefore, it would be insightful to compare the performance of student models that also adopt DETR or other transformer-based architectures—that is, models of similar design."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eyZx6TRMLD", "forum": "W6gbWvvovB", "replyto": "W6gbWvvovB", "signatures": ["ICLR.cc/2026/Conference/Submission16454/Reviewer_B2qG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16454/Reviewer_B2qG"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16454/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761904958195, "cdate": 1761904958195, "tmdate": 1762926563314, "mdate": 1762926563314, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}