{"id": "W8Pzzxn4hm", "number": 19942, "cdate": 1758300831868, "mdate": 1763389641479, "content": {"title": "Differentiable Cluster Discovery in Temporal Graphs", "abstract": "Existing temporal graph clustering methods suffer from poor optimization dynamics due to reliance on heuristically initialized cluster assignment distribution without considering the dynamic nature of the evolving graph. The target cluster assignment distribution often conflicts with evolving temporal representations, leading to oscillatory gradients and unstable convergence. Motivated by the need for differentiable and adaptive clustering in dynamic settings, we propose $\\textbf{TGRAIL}$ ($\\textbf{T}$emporal $\\textbf{Gr}$aph $\\textbf{A}$lignment and $\\textbf{I}$ndex $\\textbf{L}$earning), a novel framework for temporal graph clustering based on Gumbel–Softmax sampling. TGRAIL enables discrete cluster assignments while maintaining gradient flow. To ensure stable training, we formulate the clustering objective as an expectation over Monte Carlo samples and show that this estimator is both unbiased and variance-reduced. Furthermore, we incorporate a temporal consistency loss to preserve the order of interactions across time. Extensive experiments on six real-world temporal graph datasets demonstrate that our approach consistently outperforms state-of-the-art baselines, achieving higher clustering accuracy and robustness. Our results validate the effectiveness of jointly optimizing temporal dynamics and discrete cluster assignments in evolving graphs.", "tldr": "We propose a differentiable cluster assignment framework for temporal graph.", "keywords": ["Temporal Graph", "Clustering", "Gumbel Softmax"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/8d03095a6da8fc1cfbf801337ea6237ea0db6283.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes TGRAIL, a temporal graph clustering framework based on Gumbel-Softmax sampling that enables discrete cluster assignment while preserving differentiability. The method jointly learns node embeddings and cluster centroids through a Monte Carlo expectation of the clustering loss, and introduces a temporal consistency loss to encourage alignment across timestamps. The authors provide theoretical guarantees on gradient variance and convergence, and evaluate the approach on six temporal graph datasets, reporting improvements over several static and temporal baselines."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper tackles a relevant and challenging problem by enabling discrete cluster assignment in dynamic graphs through Gumbel-Softmax reparameterization. This allows joint learning of node embeddings and cluster centroids in a fully differentiable manner, addressing optimization instability in prior approaches. Theoretical analysis supports the proposed estimator with variance bounds and a convergence guarantee, and the method maintains linear scalability with respect to the number of temporal interactions. Empirical evaluation on several real-world datasets demonstrates consistent performance gains competitors."}, "weaknesses": {"value": "While the paper provides a technically sound method for differentiable temporal clustering, several important aspects limit the strength of the empirical and methodological claims.  \n1) The evaluation setup relies on static semantic node labels as ground-truth clusters, which does not necessarily reflect temporal community structure and risks turning the task into temporal node classification rather than clustering. \n2) The datasets used contain primarily static features, despite the problem formulation assuming time-dependent node attributes; this mismatch weakens the applicability of the method to settings where features genuinely evolve.  \n3) Although the paper emphasizes “clustering coherence” and “temporal alignment,” these concepts remain informal and lack associated metrics or analyses to demonstrate that the model preserves meaningful dynamic community patterns.  \n4) Baseline selection excludes classical dynamic community detection approaches from network science, where temporal clustering has been extensively studied, resulting in an incomplete view of comparative performance.   \n5) The empirical analysis does not explore the evolution of clusters over time nor scalability beyond the provided datasets, leaving open whether the method meaningfully captures dynamic community behavior or maintains its claimed efficiency at larger scales."}, "questions": {"value": "1) Since ground-truth labels are static and do not reflect temporal community evolution, how do the reported metrics validate the model’s ability to discover dynamically changing clusters rather than performing temporal node classification?\n\n\n2) Most datasets used provide static or minimal node attributes, yet Problem 2.1 assumes time-dependent features. Could you clarify this inconsistency and specify the actual features used in each dataset (e.g., SCHOOL)? If features are missing, what initialization is applied?\n\n\n3) Could you formally define “clustering coherence” and “temporal alignment,” and provide quantitative evaluations showing that TGRAIL achieves these properties in practice?\n\n\n4) Can you justify the absence of dynamic community detection baselines from network science (e.g., evolutionary modularity, dynamic SBM, Louvain)? Which characteristics of TGRAIL differentiate it from such models?\n\n\n\n5) The proposed method’s stability relies on temperature annealing and Monte-Carlo sampling. Could you include ablations or sensitivity analyses for these hyperparameters to demonstrate robustness?\n\n\n6) Given the strong claims of linear scalability, would you consider adding synthetic experiments to empirically validate runtime and memory efficiency as the graph size and timestamps increase?\n\n\n7) The dataset presentation lacks detail, making reproduction difficult. Could you enhance the appendix 11 with dataset feature descriptions, preprocessing steps, and cluster count selection rationale?\n\n\n8) It would strengthen the claim of performing temporal clustering rather than temporal node classification to analyze how communities evolve under TGRAIL. For instance, visualizing cluster dynamics over time (e.g., community size changes, node transitions between clusters, formation or dissolution of communities) would help demonstrate that the method captures meaningful structural evolution rather than merely predicting static labels. Could you include such an analysis or provide evidence that TGRAIL discovers temporally coherent community trajectories?\n\n\n9) There are instances where claims of interpretability are associated with graph clustering methods. Could you clarify what interpretability TGRAIL provides and how users would benefit from cluster assignments?\n\n\n10) Could you increase the size of the labels/titles, etc, of figures?\n\n\n11) Are there specific reasons for not releasing the official code? Making it publicly available would greatly improve the usability of the proposed method"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "GoFMp39R8I", "forum": "W8Pzzxn4hm", "replyto": "W8Pzzxn4hm", "signatures": ["ICLR.cc/2026/Conference/Submission19942/Reviewer_9XS3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19942/Reviewer_9XS3"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19942/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761555285507, "cdate": 1761555285507, "tmdate": 1762932106425, "mdate": 1762932106425, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes TGRAIL, a differentiable framework for temporal graph clustering based on Gumbel–Softmax reparameterization, enabling end-to-end learning of discrete cluster assignments with temporal consistency. It replaces traditional t-distribution–based soft assignments with a Monte Carlo Gumbel estimator to stabilize gradients and align cluster evolution with dynamic node embeddings."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper unifies discrete clustering and temporal embedding learning.\n﻿\n- Theoretical analysis is provided.\n﻿\n- Comprehensive experiments on multiple real-world temporal graph datasets demonstrate performance improvements."}, "weaknesses": {"value": "- The proposed temporal-consistency loss builds on existing Hawkes-process–based similarity modeling but lacks detailed ablation to show its standalone contribution.\n﻿\n- The complexity analysis is largely theoretical; practical runtime and GPU utilization comparisons with baselines are not quantitatively reported.\n﻿\n- The framework depends on multiple hyperparameters , yet sensitivity studies are minimal.\n﻿\n- Some sections of the manuscript exhibit a very uniform writing style and phrasing patterns that may suggest the use of AI-assisted writing tools. \n﻿\n- The baseline methods used for comparison are outdated. The authors must update the experimental section with stronger and more recent baselines to validate the claimed advantages."}, "questions": {"value": "Please see the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "WgIpB6DL8N", "forum": "W8Pzzxn4hm", "replyto": "W8Pzzxn4hm", "signatures": ["ICLR.cc/2026/Conference/Submission19942/Reviewer_BjKs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19942/Reviewer_BjKs"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19942/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761840347428, "cdate": 1761840347428, "tmdate": 1762932105393, "mdate": 1762932105393, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces TGRAIL, a novel framework for clustering nodes in temporal graphs. Unlike traditional methods, which struggle to account for the evolving nature of graphs, TGRAIL employs Gumbel-Softmax sampling to allow for differentiable clustering that adapts to dynamic temporal representations. The paper demonstrates that this approach results in more stable training and improved clustering accuracy, with experiments showing superior performance across several real-world temporal graph datasets compared to existing methods."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. TGRAIL introduces a differentiable clustering mechanism that can adapt to the temporal evolution of graphs, offering a clear improvement over static and post-hoc clustering methods\n2. The authors conduct extensive experiments across six diverse real-world temporal graph datasets, demonstrating that TGRAIL consistently outperforms state-of-the-art methods, showing strong empirical evidence of its effectiveness.\n3. The paper provides a rigorous theoretical analysis, including unbiased gradient estimation and convergence theorems, which ensures the soundness of the proposed approach and guarantees stable training dynamics."}, "weaknesses": {"value": "1. The motivation section needs a clearer explanation; the significance of clustering techniques in temporal graphs does not seem obvious. What are the real-world application scenarios?\n2. How was the number of clusters K chosen in this paper? If K is fixed, will it affect its adaptability in dynamic environments, thus contradicting the dynamic adaptability of the temporal graphs itself?\n3. The font in the image is too small to read, as shown in Figure 4."}, "questions": {"value": "How was the number of clusters K chosen in this paper? If K is fixed, will it affect its adaptability in dynamic environments, thus contradicting the dynamic adaptability of the temporal graphs itself?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "aYfbHNSYka", "forum": "W8Pzzxn4hm", "replyto": "W8Pzzxn4hm", "signatures": ["ICLR.cc/2026/Conference/Submission19942/Reviewer_ss9m"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19942/Reviewer_ss9m"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19942/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762790372935, "cdate": 1762790372935, "tmdate": 1762932104357, "mdate": 1762932104357, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}