{"id": "WBuiuZWk6d", "number": 17315, "cdate": 1758274635810, "mdate": 1759897182840, "content": {"title": "PepCompass: Navigating Peptide Embedding Spaces Using Riemannian Geometry", "abstract": "Antimicrobial peptide discovery is challenged by the astronomical size of peptide space and the relative scarcity of active peptides. Generative models provide continuous latent ``maps'' of peptide space, but conventionally ignore decoder-induced geometry and rely on flat Euclidean metrics, rendering exploration and optimization distorted and inefficient.\nPrior manifold-based remedies assume fixed intrinsic dimensionality, which critically fails in practice for peptide data. Here, we introduce **PepCompass**, a geometry-aware framework for peptide exploration and optimization. At its core, we define a **Union of $\\kappa$-Stable Riemannian Manifolds** \\$\\mathbb{M}^{\\kappa}\\$, a family of decoder-induced manifolds that captures local  geometry while ensuring computational stability. We propose two local exploration methods: **Second-Order Riemannian Brownian Efficient Sampling**, which provides a convergent second-order approximation to Riemannian Brownian motion, and **Mutation Enumeration in Tangent Space**, which reinterprets tangent directions as discrete amino-acid substitutions. Combining these yields Local Enumeration Bayesian Optimization (**LE-BO**), an efficient algorithm for local activity optimization. Finally, we introduce  Potential-minimizing Geodesic Search (**PoGS**), which interpolates between prototype embeddings along property-enriched geodesics, biasing discovery toward seeds, i.e. peptides with favorable activity. *In-vitro* validation confirms the effectiveness of PepCompass: PoGS yields four novel  seeds, and subsequent optimization with LE-BO discovers 25 highly active peptides with broad-spectrum activity, including against resistant bacterial strains. These results demonstrate that geometry-informed exploration provides a powerful new paradigm for antimicrobial peptide design.", "tldr": "PepCompass is a geometry-aware framework that leverages manifold-based exploration and optimization to efficiently design antimicrobial peptides, yielding multiple novel and highly active candidates effective against resistant bacteria.", "keywords": ["union of manifolds", "peptide optimization", "riemannian geometry", "geodesics", "tangent space", "mutation"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b1dbea97364798ea5d69f0437ae994e6308d5fd2.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces \"PepCompass\", a novel framework for navigating the latent spaces of generative models for peptide design. The core contribution is a geometry-aware approach that addresses the limitations of standard Euclidean exploration. The authors first define a \"Union of κ-Stable Riemannian Manifolds\" to model the latent space more faithfully, accounting for varying local dimensionality. They then propose two key methods for exploration: SORBES, a second-order approximation of Riemannian Brownian motion for local sampling, and MUTANG, which interprets tangent directions as discrete amino-acid mutations. These are combined into a Local Enumeration Bayesian Optimization (LE-BO) algorithm. For global exploration, they introduce Potential-minimizing Geodesic Search (PoGS), which finds promising \"seed\" peptides by interpolating between prototypes along property-enriched geodesics. The method is validated with impressive wet-lab results, reporting a 100% success rate in generating active antimicrobial peptides (AMPs)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Novelty and Technical Depth: The paper makes significant contributions at the intersection of geometric deep learning and biological sequence design. The formulation of the κ-stable manifold union is a principled and elegant solution to the problem of varying intrinsic dimensionality in latent spaces. The SORBES algorithm, with its second-order correction and associated convergence theorem, represents a substantial advance over naive first-order random walks.\n\nComprehensive Methodology: The framework is well-rounded, offering tools for both global exploration (PoGS) and local optimization (LE-BO). The MUTANG method is particularly clever, bridging the gap between continuous latent geometry and discrete sequence space in an interpretable way.\n\nCompelling Empirical Validation: The most striking strength is the successful in vitro validation. Achieving a 100% success rate (29/29 peptides active) and discovering 25 highly active, broad-spectrum AMPs against multidrug-resistant strains is a powerful demonstration of the method's real-world utility. This goes far beyond the typical computational benchmarks in the field.\n\nRigorous Ablations: The paper includes thorough ablation studies for LE-BO, clearly demonstrating the individual contributions of the Riemannian walk (SORBES) and the tangent-space mutations (MUTANG)."}, "weaknesses": {"value": "1. Reproducibility and Presentation of Wet-Lab Experiments: The presentation of the experimental results is confusing and lacks critical details, which undermines an otherwise stellar validation.\n\n1.1 Missing Sequences: All peptide sequences are not listed in the main text or the appendices. This is a major omission for a paper centered on peptide design, as it prevents replication, analysis, and a proper understanding of the generated molecules.\n\n1.2 Incomplete Results: Figure 9 shows only 6-7 analogs per seed family, but the text states 25 analogs were generated for each seed. It is unclear how these 25 are distributed across the seeds and why only a subset is visualized. A complete table of all analog peptides and their MIC values against all 19 strains is essential.\n\n1.3 Justification for Bacterial Panel: The optimization objective targeted E. coli activity (a Gram-negative bacterium). However, the validation panel includes 14 Gram-negative and 5 Gram-positive strains. The rationale for this broader panel is not well-explained. The results in Figure 8 show that performance on Gram-positive bacteria is poor and, in many cases, worse than the prototypes. This suggests that the optimization successfully specialized for Gram-negative activity, but the authors should explicitly discuss this point and the implications of this specificity.\n\n2. Computational Complexity: While the paper mentions the computational efficiency of LE-BO compared to other Bayesian optimization methods, the cost of computing the κ-stable manifolds, SVDs, and second-order corrections for SORBES is non-trivial. A more detailed discussion of the computational budget and scaling would be helpful for practitioners."}, "questions": {"value": "1. Where are the sequences for all wet-lab validated peptides? Please provide them in a table, along with their full MIC profiles against all tested strains.\n\n2. Please clarify the discrepancy between the 25 generated analogs and the subset shown in Figures 8 and 9. Are the shown analogs the best-performing ones? If so, state this clearly. Presenting only a curated subset can be misleading.\n\n3. The optimization targeted E. coli, yet validation included Gram-positive strains. Could you please discuss the rationale for this choice and explicitly address the observation that Gram-positive activity did not improve (and often degraded) during optimization? Does this indicate a potential trade-off or specialization effect?\n\n4. The PoGS potential function is a distilled model from APEX. How sensitive are the discovered seeds to the accuracy of this surrogate model? A brief analysis of the correlation between the predicted potential and the final wet-lab MIC would strengthen this section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "TU4N7AYaoY", "forum": "WBuiuZWk6d", "replyto": "WBuiuZWk6d", "signatures": ["ICLR.cc/2026/Conference/Submission17315/Reviewer_i34e"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17315/Reviewer_i34e"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17315/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761469082804, "cdate": 1761469082804, "tmdate": 1762927246873, "mdate": 1762927246873, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces PepCompass, a geometry-aware framework for peptide design that leverages Riemannian manifold learning to navigate and optimize peptide embedding spaces. By modeling latent peptide representations as a Union of κ-Stable Riemannian Manifolds, the authors develop three key components: SORBES (a second-order Riemannian Brownian sampler), MUTANG (mutation enumeration in tangent space), and LE-BO/PoGS (local–global Bayesian optimization via potential-minimizing geodesics). The approach enables interpretable and geometry-consistent exploration of peptide space, achieving superior computational and 100% experimental success in antimicrobial peptide discovery. Overall, the work bridges geometric machine learning and biological sequence optimization, offering a mathematically grounded and experimentally validated paradigm for controllable peptide generation."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper presents a novel and well-structured framework that integrates Riemannian geometry with peptide generative modeling. Its algorithms—SORBES, MUTANG, and LE-BO/PoGS—enable interpretable and geometry-consistent peptide optimization, validated both computationally and experimentally with exceptional success rates. The combination of solid mathematical formulation and real-world biological validation makes the contribution both original and impactful."}, "weaknesses": {"value": "While mathematically elegant, the work’s biological justification for adopting Riemannian geometry remains limited, and some algorithmic components (e.g., κ-stability, second-order correction) lack clear ablation evidence. The framework’s complexity and computational overhead may hinder broader applicability, and its generalization beyond antimicrobial peptides is not yet demonstrated."}, "questions": {"value": "1. How does the proposed Riemannian structure correlate with biologically meaningful properties—e.g., do high-curvature regions correspond to specific physicochemical or functional transitions in peptides?\n\n2. What is the computational scalability of SORBES and LE-BO when applied to longer peptide sequences or larger embedding dimensions?\n\n3. How sensitive is PoGS to the choice of property potential (Φ)? Could it incorporate multiple objectives, such as stability or toxicity, simultaneously?\n\n4. Has PepCompass been tested beyond antimicrobial peptide design (e.g., anticancer or cell-penetrating peptides) to assess its generalizability?\n\n5. How does the Bayesian component in LE-BO handle uncertainty from noisy or biased property predictors, and does it improve robustness in real-world peptide screening?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "0qQqDGJYig", "forum": "WBuiuZWk6d", "replyto": "WBuiuZWk6d", "signatures": ["ICLR.cc/2026/Conference/Submission17315/Reviewer_szgr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17315/Reviewer_szgr"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17315/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761882305269, "cdate": 1761882305269, "tmdate": 1762927246591, "mdate": 1762927246591, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors proposed PepCompass, a geometry-aware framework for exploring and optimizing antimicrobial peptide (AMP) space. The authors argue that flat Euclidean latent spaces distort distances because they ignore decoder-induced geometry. They formalize a Union of κ-Stable Riemannian Manifolds to capture locally valid geometry and numerical stability, then design two local exploration tools and integrate them into LE-BO, a local-enumeration Bayesian optimization loop. For global search, they introduce PoGS, a potential-minimizing geodesic interpolation biased by predicted antimicrobial activity. The approach reports strong in silico results against diverse baselines and in vitro validation: four PoGS seeds showed activity and LE-BO produced 25/25 highly active peptides across multiple strains, including MDR isolates."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "The paper motivates why decoder-induced geometry matters and why a single manifold is insufficient, introducing a principled union of κ-stable manifolds with an SVD-based construction to ensure full-rank pullback metrics locally. This directly addresses rank-deficiency in realistic peptide decoders. SORBES includes a second-order correction (Christoffel term) and a convergence guarantee to stopped Riemannian Brownian motion on the κ-stable chart (Theorem 1). A practical finite-difference variant (SORBES-SE) with adaptive steps is also provided. MUTANG turns tangent directions into concrete amino-acid substitutions and enumerates local neighborhoods in sequence space—bridging continuous geometry and discrete edits. LE-BO leverages local enumeration rather than latent Euclidean kernels, with ROBOT-style diversity for exploration. PoGS adds a property-aware geodesic objective that yields more seeds/wells than straight interpolation."}, "weaknesses": {"value": "The paper itself notes a limitation—using Euclidean distance on decoder logits as the ambient metric for PoGS; while the authors argue it’s a stable first-order surrogate, alternative metrics might better match biochemical structure or synthesis constraints. A sensitivity analysis to this metric would strengthen claims.  While SORBES-SE mitigates cost, repeatedly estimating κ-stable charts, Christoffel terms (even indirectly), and re-encoding during LOCALENUMERATION could be heavy for large-scale campaigns; clearer runtime/memory profiling beyond the remark that other BO baselines were too slow would help assess deployment trade-offs.Many gains depend on the chosen property predictor (e.g., APEX MIC regressor) and seed selection from PoGS. More detail on robustness to different oracles, calibration under domain shift, and ablations on κ/α thresholds would help generalize the conclusions."}, "questions": {"value": "1. You motivate unions of manifolds by decoder rank deficiency. Could you quantify how often and how severely the rank drops across the latent space of your trained peptide models, and how this correlates with optimization failure modes under Euclidean search? \n2. Beyond antimicrobial activity, what other peptide properties (e.g., hemolysis, proteolytic stability, solubility) most benefit from geometry-aware exploration, and why would Euclidean search be particularly misleading for them?\n3. In Table 2, LE-BO dominates most baselines. Which single design decision (SORBES vs. MUTANG vs. ROBOT diversity) contributed most to the gains, according to your ablations, and is that consistent across different seeds?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "NA"}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "U4qIzLJJ9n", "forum": "WBuiuZWk6d", "replyto": "WBuiuZWk6d", "signatures": ["ICLR.cc/2026/Conference/Submission17315/Reviewer_Dec6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17315/Reviewer_Dec6"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17315/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966986750, "cdate": 1761966986750, "tmdate": 1762927246248, "mdate": 1762927246248, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}