{"id": "wD55MXF6xr", "number": 18842, "cdate": 1758291321232, "mdate": 1759897078351, "content": {"title": "DyME: Dynamic Multi-Concept Erasure in Diffusion Models with Bi-Level Orthogonal LoRA Adaptation", "abstract": "Text-to-image diffusion models (DMs) inadvertently reproduce copyrighted styles and protected visual concepts, raising legal and ethical concerns. Concept erasure has emerged as a safeguard, aiming to selectively suppress such concepts through fine-tuning. However, existing methods do not scale to practical settings where providers must erase multiple and possibly conflicting concepts. The core bottleneck is their reliance on static erasure: a single checkpoint is fine-tuned to remove all target concepts, regardless of the actual erasure needs at inference. This rigid design mismatches real-world usage, where requests vary per generation, leading to degraded erasure success and reduced fidelity for non-target content. We propose DyME, an on-demand erasure framework that trains lightweight, concept-specific LoRA adapters and dynamically composes only those needed at inference. This modular design enables flexible multi-concept erasure, but naive composition causes interference among adapters, especially when many or semantically related concepts are suppressed. To overcome this, we introduce bi-level orthogonality constraints at both the feature and parameter levels, disentangling representation shifts and enforcing orthogonal adapter subspaces. We further develop ErasureBench-H, a new hierarchical benchmark with brand–series–character structure, enabling principled evaluation across semantic granularities and erasure set sizes. Experiments on ErasureBench-H and standard datasets (e.g., CIFAR-100, Imagenette) demonstrate that DyME consistently outperforms state-of-the-art baselines, achieving higher multi-concept erasure fidelity with minimal collateral degradation.", "tldr": "", "keywords": ["Concept Erasure", "Multi-concept", "Diffusion Models", "LoRA"], "primary_area": "alignment, fairness, safety, privacy, and societal considerations", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/ea14895e49c0db7c9eb1dbefceb504505050c59b.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes a dynamic concept erasure framework for multi-concept unlearning. The proposed framework first learns concept-specific LoRA for each concept. Then the framework learns to dynamically compose the LoRAs corresponding to the target concepts during inference. The experiments are conducted on various commonly used benchmarks. In addition, this paper also proposes an ErasureBench-H benchmark for more comprehensive multi-concept evaluation."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Multi-concept erasure is crucial for real-world trustworthy generative AI deployments.\n2. The proposed method is reasonable to handle the dynamic scenarios during inference.\n3. The overall paper is easy to follow."}, "weaknesses": {"value": "1. The proposed framework applies LoRA adapters to encode the specific concepts. However, in the real-world multi-concept erasure setting, the number of concepts would be large. It would cause the memory issues that the users cannot store such a large amount of adapters.\n2. Step 3 of the proposed method requires the framework to first train all concept LoRAs jointly. However, in real-world scenarios, it is possible that the user wants to add novel concepts beyond the training set. It will require re-training once novel concepts appear, which might not be practical. \n3. While this paper enforces each concept to be non-overlapping, it remains hard to handle the rephrased prompts that would cause robustness issues, allowing attackers to easily recover the concept by paraphrasing the target prompts."}, "questions": {"value": "1. This paper contains no qualitative visualization in the main paper. It would be beneficial to demonstrate the visualization for concept erasure on a large number of multiple concepts (e.g., 5 or more concepts)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "egPtl1qZBV", "forum": "wD55MXF6xr", "replyto": "wD55MXF6xr", "signatures": ["ICLR.cc/2026/Conference/Submission18842/Reviewer_SrNi"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18842/Reviewer_SrNi"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18842/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761062266296, "cdate": 1761062266296, "tmdate": 1762930811238, "mdate": 1762930811238, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes DYME, a dynamic multi-concept erasure framework for text-to-image diffusion models that allows on-demand suppression of copyrighted or sensitive concepts. Instead of static fine-tuning, DYME trains lightweight, concept-specific LoRA adapters and dynamically composes only those needed at inference. To mitigate interference among multiple erased concepts, it introduces bi-level orthogonality constraints at both the feature and parameter levels. The authors also present ERASUREBENCH-H, a hierarchical benchmark reflecting real-world brand–series–character relationships. Extensive experiments on CIFAR-100, Imagenette, and ERASUREBENCH-H show that DYME achieves superior erasure fidelity and utility preservation compared to prior static approaches, effectively scaling to large and overlapping concept sets."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper introduces a new concept erasure setting, where multiple target concepts can be erased simultaneously during inference, reflecting more realistic real-world scenarios.\n2. It proposes bi-level orthogonality constraints, which effectively enable the stable composition of multiple concept-specific LoRA modules at inference without interference.\n3. The paper presents ERASUREBENCH-H, a hierarchical and semantically structured benchmark that enables comprehensive and realistic evaluation of multi-concept erasure performance"}, "weaknesses": {"value": "1. In Figure 1, the performance of MACE appears inconsistent with its original paper, where it successfully erased 100 concepts (e.g., 100 celebrities) while maintaining high harmonic accuracy. Here, only up to 20 concepts are erased, and the results for MACE seem unexpectedly poor. This might be due to differences in the CIFAR-100 setting, where protected concepts may not have been properly included in the retention set. The authors are encouraged to revisit their reproduction settings. In addition, SPM should be categorized under Dynamic Erasure (DE), as described in Section 3.3 of its paper.\n2. In line 73, the claim that static approaches “reduce diversity and degrade fidelity” lacks supporting evidence. In contrast, MACE demonstrates good fidelity preservation even under multi-concept erasure, which contradicts this statement.\n3. In the Introduction, the paper does not clearly define the difference between static erasure paradigm and dynamic erasure paradigm, even though these are the core concepts that underpin the paper’s motivation. This omission makes it difficult for readers to fully grasp the main idea.\n4. The major concern lies in the motivation of the proposed task setup. The authors emphasize that the weakness of static erasure lies in its inability to dynamically select concepts during inference, while all concepts are erased during training. However, the fundamental goal of concept erasure is to permanently remove target semantics from the model parameters without affecting others. The proposed dynamic erasure is unrealistic in white-box settings (e.g., Stable Diffusion), since LoRA adapters are external and not merged into model weights — an attacker could easily bypass DYME by modifying the inference code directly.\n5. Although the proposed method might have value in black-box deployment, similar behavior could be achieved with simpler mechanisms. Since DYME selects LoRA modules based on keyword matching, a trivial baseline could simply detect forbidden keywords in prompts and return a blank or noisy image otherwise generating normally, achieving equivalent or even better results (i.e., AccEE = 0 and unchanged AccUP).\n6. The proposed Dynamic Composition at Inference (Sec. 4.2) relies on explicit keyword matching, which fails to address implicit concepts, such as those in the I2P benchmark [1]. Handling NSFW or implicit concepts is a critical aspect of practical concept erasure that this method does not consider.\n7. In line 106, the paper claims “this is the first work to systematically investigate multi-concept erasure scalability in diffusion models,” but prior studies such as [2, 3] have already discussed similar topics.\n8. In line 241, the symbol j is undefined.\n9. In Equation (3), the loss formulation seems to encourage opposite directions (cosine similarity = –1) rather than orthogonality (cosine similarity = 0), which contradicts the intended behavior.\n10. The experimental comparisons include only SPM and MACE (both CVPR 2024). More recent and relevant baselines with similar motivations are missing and should be added for completeness.\n11. The experiments in Section 5.2 only cover up to 20 erased concepts, while MACE has demonstrated the ability to erase 100 concepts. Although the dynamic approach may scale better, expanding the number of erased conceptswould strengthen the motivation and claims.\n12. The ERASUREBENCH-H benchmark lacks sufficient detail and description in the main text; it is hard to understand its structure and usage without referring to the appendix.\n13. In Table 4 (Config 1), it is unclear why AccUP remains 70.50 after removing LoRA-C. This inconsistency needs clarification or additional explanation.\n\n\n\n[1] Safe Latent Diffusion: Mitigating Inappropriate Degeneration in Diffusion Models, CVPR23\n\n[2] Localized Concept Erasure for Text-to-Image Diffusion Models Using Training-Free Gated Low-Rank Adaptation, CVPR25\n\n[3] Erasing Concept Combination from Text-to-Image Diffusion Model, ICLR25"}, "questions": {"value": "See the weakness aprt."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "3989nYMCOD", "forum": "wD55MXF6xr", "replyto": "wD55MXF6xr", "signatures": ["ICLR.cc/2026/Conference/Submission18842/Reviewer_QDp2"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18842/Reviewer_QDp2"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18842/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761144807845, "cdate": 1761144807845, "tmdate": 1762930810846, "mdate": 1762930810846, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper investigates dynamic multi-concept erasure by pretraining LoRA adapters and composing the required concepts at inference. To mitigate crosstalk among LoRA modules, the authors propose Bi-Level Orthogonal Constraints that minimize overlap in LoRA-induced representation shifts and enforce orthogonality in the parameter space. Experimental evaluation employs a CLIP-based classifier to assess both erasure effectiveness and utility preservation. The results indicate that the proposed method maintains the original utility while achieving the lowest accuracy for the erased concepts."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Unlike existing concept erasure methods, this paper focuses on dynamic, on-demand multi-concept erasure, enabling separate LoRA adapters to be combined dynamically at inference time.\n2. The paper is well-structured and clearly written. The proposed DyME can mitigate LoRA crosstalk."}, "weaknesses": {"value": "1. For the motivation, this paper addresses the dynamic combination of trained concept-specific LoRA modules to enable flexible concept erasure in diffusion models. It specifically tackles scenarios where certain concepts may need to be removed from existing LoRA sets. However, the proposed method is limited in that it can add one new concept at a time, potentially requiring retraining across all LoRA modules. The approach’s scalability is restricted if it cannot seamlessly incorporate new concepts without retraining.\n\n2. For the evaluation metrics, the authors adopt a CLIP-based classifier to assess erasure effectiveness and utility preservation. However, existing works typically employ the CLIP score for erasure effectiveness and FID for utility preservation. It remains unclear what advantages the CLIP-based classifier provides over these established metrics. Moreover, LoRA-based weight modifications inevitably affect untargeted concept generation, even if only minimally. Yet, the results measured by $Acc_{UP}$ suggest that the method fully preserves the original performance on untargeted concepts. Therefore, $Acc_{UP}$ alone may not sufficiently capture potential degradation in untargeted concept generation.\n\n3. As the number of erased concepts increases, the difficulty of training LoRA correspondingly rises. Therefore, it remains unclear whether the proposed method can still perform effectively when dealing with a larger set of concepts to erase."}, "questions": {"value": "1. How flexible is the system in incorporating new concepts after initial training?\n2. Can the authors clarify whether DyME remains effective when erasing a large number of concepts?\n3. What is the rationale for choosing this particular evaluation metric?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "IzZ2TDuBoL", "forum": "wD55MXF6xr", "replyto": "wD55MXF6xr", "signatures": ["ICLR.cc/2026/Conference/Submission18842/Reviewer_akRp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18842/Reviewer_akRp"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18842/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761856998120, "cdate": 1761856998120, "tmdate": 1762930810483, "mdate": 1762930810483, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents DYME, a modular and scalable framework for dynamic multi, concept erasure in text, to, image diffusion models. Instead of retraining or editing a model for each new erasure request, DYME trains one lightweight LoRA adapter per concept and dynamically composes relevant adapters during inference. To handle interference among multiple adapters, the authors introduce a bi, level orthogonality mechanism consisting of (1) an input, aware orthogonality constraint on induced representation shifts and (2) an input, agnostic parameter, space regularizer derived from a theoretical sufficient condition (Theorem 1). The paper also contributes ERASUREBENCH, H, a hierarchical benchmark organized into brand–series–character levels. Experiments on CIFAR, 100, Imagenette, and ERASUREBENCH, H demonstrate improved erasure efficacy and reduced interference compared to prior static erasure baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Addresses real, world dynamic takedown scenarios where multiple concept erasures must coexist flexibly.\n2. Per, concept LoRA adapters make updates lightweight and composable.\n3. Provides a theoretically backed mechanism to reduce interference among multiple LoRAs.\n4. ERASUREBENCH, H offers a structured and hierarchical testbed for compositional erasure.\n5. Empirical results: Demonstrate consistent gains across datasets and include several informative ablations."}, "weaknesses": {"value": "1. Missing comparison to contemporaneous SOTA (e.g., Receler).\nThe work omits comparisons with key 2025 approaches that address similar problems. This omission weakens claims of novelty and superiority. A direct experimental or analytical comparison with Receler and other strong 2025 methods should be added. \n\n2. Theorem 1 vs implementation inconsistency.\nThe theorem assumes q and k are frozen while LoRA updates only v/o, yet the implementation adapts q/k/v/o. The authors should either align the implementation with the theorem’s assumptions or extend the theoretical justification accordingly. \n\n3. Scalability and cost reporting.\nWith hundreds of unit concepts, training one LoRA per concept can be computationally expensive. The paper should report adapter size, total storage, per, adapter training time, and inference latency when composing many adapters. \n\n4. Baseline fairness.\nStatic baselines were restricted to small erasure scopes due to collapse; stronger tuning or staged training might alleviate this. A justification or expanded baseline study is required."}, "questions": {"value": "Questions*\n1. Why is Receler (and other 2025 SOTA methods) not compared? If unavailable, can you provide a reasoned analysis or reimplementation?\n2. Do you freeze q/k during LoRA training? If not, how does Theorem 1 apply in practice?\n3. What are the per, adapter parameter counts, total storage, training time, and inference latency at different composition sizes?\n4. How were static baselines tuned, and are there hyperparameter settings that allow them to scale further?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "HWrrCGbzq5", "forum": "wD55MXF6xr", "replyto": "wD55MXF6xr", "signatures": ["ICLR.cc/2026/Conference/Submission18842/Reviewer_HdpA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18842/Reviewer_HdpA"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18842/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762451558399, "cdate": 1762451558399, "tmdate": 1762930809765, "mdate": 1762930809765, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}