{"id": "wFttcDu6Fr", "number": 1919, "cdate": 1756965781967, "mdate": 1759898178531, "content": {"title": "On the Universality and Complexity of GNN for Solving Second-order Cone Programs", "abstract": "Graph Neural Networks (GNNs) have demonstrated both empirical efficiency and universal expressivity for solving constrained optimization problems such as linear and quadratic programming. However, extending this paradigm to more general convex problems with universality guarantees, particularly Second-Order Cone Programs (SOCPs), remains largely unexplored.\nWe address this challenge by proposing a novel graph representation that captures the inherent structure of conic constraints. We then establish a key universality theorem: *there exist GNNs that can provably approximate essential SOCP properties, including instance feasibility and optimal solutions*. We further derive the sample complexity for GNN generalization based on Rademacher complexity, filling an important gap for Weisfeiler-Lehman-based GNNs in learning-to-optimize paradigms.\nOur results provide a rigorous foundation linking GNN expressivity and generalization power to conic optimization structure, opening new avenues for scalable, data-driven SOCP solvers. The approach extends naturally to $p$-order cone programming for any $p \\geq 1$ while preserving universal expressivity and requiring no structural modifications to the GNN architecture. Numerical experiments on randomly generated SOCPs and real-world power grid problems demonstrate the effectiveness of our approach, achieving superior prediction accuracy with significantly fewer parameters than fully connected neural networks.", "tldr": "Graph neural networks can provably solve second-order cone programs.", "keywords": ["graph neural network", "second order cone programming", "learning to optimize", "Weisfeiler-Lehman test", "sample complexity"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a962822a599dee4a06efaef0978d2335f9081941.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposed a way to encode SOCP problems with graphs, which is an important extension of LP, QP, QCQP problems. The authors designed a message passing scheme on top. Besides, the separation power of WL on such graphs as well as generalization bounds are established. The empirical results also exhibited the sigfinicance of the work."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The problem is well motivated. SOCP is an important extension of LP, QCQP, and this work is an important milestone towards more general convex cones. \n- The paper is well written and easy to read. \n- The design of the graph encoding for SOCP problems make a lot of sense, and faithfully encode all the information of an SOCP problem.\n- The theoretical results are well established."}, "weaknesses": {"value": "- I think the separation power of WL on SOCP is also an important point and should be mentioned in the main paper as well. \n- The notations of graph nodes are a bit confusing, they are inconsistent in section 4.1 and figure 2. \n- I understand there might be lack of baselines, but FCNN baseline is a bit too trivial."}, "questions": {"value": "- What are the hardwares for comparing solving time of SOCP-GNN and MOSEK solver? It seems that the GNN has constant solving time with the growth of the instance size, so I guess it is on GPU. Did you also run MOSEK on GPU? If not that is not fare comparison.\n- It is mentioned in the appendix that extending the work to more general $p$ cone only requires encoding $p$ parameter in the graph. It is plausible in the perspective of WL test, but does it hurt the generalization performance? For example, will there be such a family of problems, where different $p$ leads to the same solution?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "MiCejo4CFm", "forum": "wFttcDu6Fr", "replyto": "wFttcDu6Fr", "signatures": ["ICLR.cc/2026/Conference/Submission1919/Reviewer_c5JN"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1919/Reviewer_c5JN"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1919/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761564752904, "cdate": 1761564752904, "tmdate": 1762915954193, "mdate": 1762915954193, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The author proposed a novel graph representation for SOCPs, that is a major class of convex optimization problems. Based on this representation, the author proposed a GNN structure called SOCP-GNN, that is simple enough to be effective. Additionally, the author analyzed the representation power and generalization capability of SOCP-GNN. Finally, the author provided the results a series of experiments to validate the proposed framework."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 2}, "strengths": {"value": "- The new graph representation extends to SOCP problems, which is more general than previously considered LP, QP, and QCQPs. And on the representation, the proposed structure is simple enough, while having enough representation power to express the inherent structure of SOCP instances.\n- The author provides a framework for analyzing the generalization capability of SOCP-GNN or other structures with representation power guarantee established by WL-test and relevant tool(i.e. Lusin's theorem and Generalized Stone-Weierstrass Theorem)."}, "weaknesses": {"value": "- The previous representation on QCQPs **benefits from sparsity** to get better MP complexity and the SOCP-GNN(when applied on equivalent reformulated QCQPs) benefits from **the constraints being low-rank**. The author claimed that the proposed structure is less complex when used on equivalent reformulated convex QCQPs, but there is no argument about relation between sparsity of the original QCQP instance and the complexity of the reformulated instance.\n- SOCPs do not cover **general** QCQPs, since only convex QCQPs can be directly reformulated to equivalent SOCPs, and SOCPs reformulated to special non-convex QCQPs (since the special combination of non-convex quadratic constraints and linear constraint makes it **implicitly convex** to be solved in polynomial time). So there is not too much improvement with respect to general non-convex QCQPs."}, "questions": {"value": "- In the comparison of node complexity and MP complexity, the ranks of the cone constraints are denoted by $k_{i} $instead of $r_{i}$. $r_{i}$ is used to denote the rank of quadratic constraints, but here we are not discussing quadratic constraints."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "aeSTEN3GXv", "forum": "wFttcDu6Fr", "replyto": "wFttcDu6Fr", "signatures": ["ICLR.cc/2026/Conference/Submission1919/Reviewer_tMNV"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1919/Reviewer_tMNV"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission1919/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761737502213, "cdate": 1761737502213, "tmdate": 1762915953742, "mdate": 1762915953742, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The present manuscript addresses the solution of Second-Order Cone Programs (SOCPs) by means of Graph Neural Networks, specifically designed to process the variables-constraints graph arising from such problems, with a lightweight implementation that is competitive in terms of computational complexity.\nThe authors provide universal approximation results and generalization bounds for the proposed model, and evaluate their model against  traditional SOCP solvers."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "The literature review is accurate and broad, and the related work is addressed (almost) properly. \nThe theoretical results are meaningful and derived with deep rigorousness (the Appendix has been checked). \nAll the needed mathematical concepts are clearly introduced and explained, and intuitive readings of the theoretical results are provided. \nThe experimental evaluation on synthetic data is well set and well conducted."}, "weaknesses": {"value": "Major concerns:\n- The literature review on VC dimension for GNNs is not complete, please check [1];\n- at line 306, a Lipschitz assumption on GNN is stated; although, as noted by the authors, this is frequent in theoretical analysis of generalization capabilities of GNNs, I don't think that such property has been properly addressed when switching to the experimental framework;\n- a similar concern arises about connecting the generalization bound with the experiments, i.e.  there are not connections between Theorem 2 and the experiments in Section 7;\n- lastly, even if this paper is a proof of concept, the authors propose a benchmarking over AC-OPF solvers; in this case, I think that a comparison with actual deep learning OPF solvers is needed.\n\nMinor concerns:\n- line 104, \"specially\" -> \"specifically\"\n- line 128, \"representations\" -> \"representation\"\n- line 1845-1847: \"Lipshitz\" -> \"Lipschitz\"\n\n[1] D’Inverno, G. A., Bianchini, M., & Scarselli, F. (2025). VC dimension of Graph Neural Networks with Pfaffian activation functions. Neural Networks, 182, 106924."}, "questions": {"value": "- I would suggest the authors to revise the literature over generalization results for GNNs, as suggested above;\n- I would suggest the authors make explicit connections between the experimental validation and the theoretical results;\n- Lastly, I would strongly encourage the authors to insert a (possibly) fair comparison with deep learning-based OPF solvers."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "gZcMF7V4rk", "forum": "wFttcDu6Fr", "replyto": "wFttcDu6Fr", "signatures": ["ICLR.cc/2026/Conference/Submission1919/Reviewer_wvA8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1919/Reviewer_wvA8"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission1919/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761753757195, "cdate": 1761753757195, "tmdate": 1762915952808, "mdate": 1762915952808, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This ICLR submission proposes a graph representation and Graph Neural Network (GNN) architecture, termed SOCP-GNN, for solving Second-Order Cone Programs (SOCPs). The graph representation has variable, polyhedral, minor conic, and major conic nodes, enabling message-passing GNNs to predict key properties like feasibility and optimal solutions. They prove universal approximation capabilities using Weisfeiler-Lehman-based expressivity and derive sample complexity bounds via Rademacher complexity for generalization. The approach generalizes to p-order cone programs and demonstrates empirical superiority on synthetic SOCPs and real-world power grid problems, using fewer parameters than fully connected networks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper is in general well written, and the main results are easy to follow.\n\n2. The paper provides the generalization analysis beyond WL-test-based GNN analysis, deriving sample complexity bounds via Rademacher complexity."}, "weaknesses": {"value": "The WL-test-based universal approximation analysis is not completely new; it uses ideas from (Chen et al., 2022b), as the authors explicitly noted."}, "questions": {"value": "Is it possible to add quadratic terms in the objective function, as in (Wu et al., 2024; Chen et al., 2024b)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "xzegwHqq5N", "forum": "wFttcDu6Fr", "replyto": "wFttcDu6Fr", "signatures": ["ICLR.cc/2026/Conference/Submission1919/Reviewer_5AzP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1919/Reviewer_5AzP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission1919/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761981777903, "cdate": 1761981777903, "tmdate": 1762915952446, "mdate": 1762915952446, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}