{"id": "wkVsKDnl4s", "number": 21988, "cdate": 1758324384675, "mdate": 1759896892233, "content": {"title": "HighClass: Efficient Metagenomic Classification via Quality-Aware Token Mapping and Sparsified Indexing", "abstract": "Metagenomic classification requires both high accuracy and computational efficiency to process the exponentially growing volume of sequencing data. We present *HighClass*, a novel classification framework that fundamentally transforms the computational paradigm through variable-length token indexing, quality-aware scoring, and learned sparsification.\n\nOur key innovation replaces alignment operations with hash-based token mapping, achieving $O(|\\mathcal{T}|)$ complexity while maintaining competitive accuracy. We establish rigorous theoretical foundations: (1) generalization bounds proving $O(\\sqrt{V|\\mathcal{Y}|/n})$ convergence for vocabulary size $V$ and $|\\mathcal{Y}|$ taxa; (2) concentration inequalities under exponential $\\alpha$-mixing with explicit dependency factors; (3) consistency guarantees for maximum likelihood classification under identifiability conditions.\n\nHighClass achieves 85.1% F1 on CAMI II—within 1.5% of state-of-the-art—while delivering $4.2\\times$ speedup and 68% memory reduction. Variable-length tokens provide 6.8 percentage points improvement over fixed k-mers through superior pattern capture. Quality-aware scoring with learned sensitivity $q_{\\text{sens}} = 1.8$ optimally weights sequencing evidence. Gradient-based sparsification retains 32% of genomic regions while preserving 94% accuracy.\n\nBeyond empirical gains, our work establishes the first comprehensive theory of token-based genomic classification, providing uniform convergence guarantees and explicit characterization of dependency effects through $\\alpha$-mixing analysis. These results transform sequence classification from heuristic approaches to principled methods with provable guarantees.", "tldr": "", "keywords": ["Metagenomics", "Taxonomic Classification", "Computational Biology", "Bioinformatics", "Sequence Analysis", "Quality-Aware Tokenization", "High-Throughput Sequencing"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/56eab464c3f34d99c06d9e3ab41dc98bdcd4dddf.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper addresses the metagenomics classification problem, where the goal is to assign short DNA fragments (known as reads) to taxonomic categories such as species, family, or class. Instead of relying on computationally expensive sequence alignment techniques, the authors propose a hash-based token mapping framework that aims to achieve an improved trade-off between computational efficiency and classification performance. The approach is evaluated on the CAMI II dataset and demonstrates higher throughput than baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The proposed approach shows improved throughput compared to alignment-based baselines.\n- The inclusion of a theoretical analysis is valuable for providing deeper insights into model behavior and guarantees."}, "weaknesses": {"value": "- The presentation and organization of the paper are not good. Especially for readers unfamiliar with the metagenomics classification problem,  it is difficult to follow the paper.\n- The paper provides a limited novelty. The proposed approach mainly relies on MetaTrinity, with some modifications (e.g., hash-based mapping).\n- Although the authors emphasize that the theoretical analysis is a major contribution of the work, it is discussed in the appendix and presented incompletely. \n- The experiments are limited to the CAMI II dataset. The baseline method performs better in accuracy than the proposed one (though slower).\n- The paper omits and insufficiently discusses key related methods. \n- The appendix is incomplete."}, "questions": {"value": "- Several key baselines, including Metalign and MetaTrinity, are missing from Tables 2 and 4. Could the authors explain why they were omitted?\n- The paper does not specify how the proposed approach handles reads that originate from unknown taxa, i.e., organisms absent from the reference database. Could the authors clarify this behavior for assessing the robustness and applicability of the method in realistic scenarios?\n- The description of hyperparameter tuning is vague. Section M.3 mentions a sensitivity analysis, but no corresponding results or experiments are provided. Could the authors elaborate on how hyperparameters were selected and provide supporting experimental evidence?\n- The discussion of related work should be expanded to include key methods such as MetaCache-GPU, MetaBinG2. In addition, the baseline methods, MEGAN, and Metalign, should be cited.\n- In the appendix, several sections (F.1–F.3, M.5, M.7) are empty, and references between Propositions and proofs are mismatched (e.g., Proposition 4 vs. Proposition 20). The proofs of Theorems 9, 22, and 23 are not provided. \n- The paper would benefit from a concise explanation of basic biological terminology such as reads, taxa, and reference databases so that readers without a genomics background can better follow the motivation.\n- The writing quality and style suggest that parts of the manuscript might have been generated by a language model. If this is the case, the authors should thoroughly revise the manuscript for clarity. The motivation and the presentation of the problem should be improved as well."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Y2VIkLBPZd", "forum": "wkVsKDnl4s", "replyto": "wkVsKDnl4s", "signatures": ["ICLR.cc/2026/Conference/Submission21988/Reviewer_tfiW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21988/Reviewer_tfiW"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission21988/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761469543269, "cdate": 1761469543269, "tmdate": 1762942009807, "mdate": 1762942009807, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper supposedly describes a novel classification framework hat seeks to replace alignment with hash-based token mapping. This is supposed to be supported by theoretical results for why this approach reduces computational complexity without loss of accuracy.\n\nThis paper is seemingly the creation of an LLM. Potential indicators of this are:\n\n1. Section 5.4.1 is empty.\n2. The discussion of results in 5.4.2 makes no reference to the included tables.\n3. At multiple places, improvements are described using \"percentage points\" instead of simply using \"%\".\n4. QA-Token is reference at multiple points throughout this paper but this reference is unavailable; the corresponding citation refers to a completely different manuscript."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "N/A"}, "weaknesses": {"value": "N/A"}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["Yes, Other reasons (please specify below)"]}, "details_of_ethics_concerns": {"value": "This paper seems to be generated by an LLM or edited heavily with an LLM."}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "XdvIxgPT5E", "forum": "wkVsKDnl4s", "replyto": "wkVsKDnl4s", "signatures": ["ICLR.cc/2026/Conference/Submission21988/Reviewer_PeJr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21988/Reviewer_PeJr"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission21988/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761949613336, "cdate": 1761949613336, "tmdate": 1762942009562, "mdate": 1762942009562, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes HighClass, a metagenomic read classifier that replaces seed-and-extend alignment with hash-based mapping of variable-length, quality-aware tokens and a sparsified inverted index. Algorithmically, it (i) uses a 32k-token QA-BPE-seq vocabulary to extract variable-length tokens, (ii) scores taxa with a quality-weighted log-likelihood, and (iii) prunes the reference with gradient-based sparsification (32% regions retained). Theoretically, it presents uniform convergence bounds $O(\\sqrt{V|Y|/n})$, α-mixing concentration for dependent tokens with an explicit variance-inflation factor, and consistency of the maximum-likelihood classifier under identifiability. Empirically, on CAMI II, it reports 85.1% F1 (within 1.5% of state-of-the-art method) with 4.2× speedup and 68% memory reduction (6.8 GB index), plus ablations attributing +6.8 pp to variable-length tokens and +1.9 pp to quality weighting."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. Significance. Demonstrating 4.2× speed with near-SOTA accuracy and 68% memory reduction moves the Pareto frontier and has practical impact for real-time clinical diagnostics and large-scale monitoring scenarios."}, "weaknesses": {"value": "1. The paper mentioned that they enabled the applications of HighClass in edge deployment. However, the 6.8GB memory requirement for deployment mentioned in the paper is not ideal for edge devices.\n2. The paper has more than 9 pages for the main text, which is against the policy.\n3. Section 5.4.1 is completely missing.\n4. The paper cited the paper: From noise to signal: Enabling foundation-model pretraining on noisy, real-world corpora via quality-aware tokenization with full author list and the source as ArXiv. However, I cannot find it on ArXiv but also an anonymous submission to ICLR 2026, which is very concerning."}, "questions": {"value": "1. What is the empirical curve of accuracy/runtime/memory vs. vocabulary size (e.g., 8k/16k/32k/64k)?\n2. Were sparsification masks trained on the same references used for evaluation?\n3. Does line 307 have a typo?\n4. Why is 5.4.1 missing?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "ntI5ZEeNTZ", "forum": "wkVsKDnl4s", "replyto": "wkVsKDnl4s", "signatures": ["ICLR.cc/2026/Conference/Submission21988/Reviewer_kPUY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21988/Reviewer_kPUY"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission21988/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761984354937, "cdate": 1761984354937, "tmdate": 1762942009314, "mdate": 1762942009314, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces HighClass, a metagenomic classifier combining variable-length quality-aware tokens, hash-based mapping, and sparsified indexing. It claims to provide both a new theoretical framework for token dependencies and strong empirical efficiency gains."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "N/A"}, "weaknesses": {"value": "1) The “theory” mostly restates standard learning theory with ad hoc constants. The claimed “first comprehensive theory” is not substantiated. \n\n2) Made-up references: arXiv:2406.08251 actually corresponds to a completely different paper (Light-induced fictitious magnetic fields for quantum storage in cold atomic ensembles at https://arxiv.org/pdf/2406.08251), different from the cited one.\n\n3) Some sections are even empty (5.4.1, F1, F2, F3, M7)."}, "questions": {"value": "The citation:\n\n*Arvid E. Gollwitzer, Paridhi Latawa, David de Gruijl, Deepak A. Subramanian, and Giovanni Traverso. From noise to signal: Enabling foundation-model pretraining on noisy, real-world corpora via quality-aware tokenization. arXiv preprint arXiv:2406.08251, 2025.*\n\nappears fabricated, as the DOI refers to an unrelated paper: Light-induced fictitious magnetic fields for quantum storage in cold atomic ensembles at https://arxiv.org/pdf/2406.08251. **Could the authors explain how this reference was produced and justify its inclusion?**"}, "flag_for_ethics_review": {"value": ["Yes, Other reasons (please specify below)"]}, "details_of_ethics_concerns": {"value": "Initially, I found the writing style unusual (some sections even empty and vague theorems), which encouraged me to check the references (there are 19). I noticed the following cited paper:\n\nArvid E. Gollwitzer, Paridhi Latawa, David de Gruijl, Deepak A. Subramanian, and Giovanni Traverso. From noise to signal: Enabling foundation-model pretraining on noisy, real-world corpora via quality-aware tokenization. arXiv preprint arXiv:2406.08251, 2025.\n\nHowever, arXiv:2406.08251 actually corresponds to a completely different paper (Light-induced fictitious magnetic fields for quantum storage in cold atomic ensembles at https://arxiv.org/pdf/2406.08251). I also noticed that the cited paper, which is submitted to ICLR this year (https://openreview.net/pdf?id=UDvXiEngkX), exhibits the same writing style and structure, including ambiguous references (e.g., Ming Yu et al. Direct advantage policy optimization. arXiv preprint, 2025, and Xiaowei Yue et al. Value-augmented policy optimization. arXiv preprint, 2025)."}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "muC40VtAKo", "forum": "wkVsKDnl4s", "replyto": "wkVsKDnl4s", "signatures": ["ICLR.cc/2026/Conference/Submission21988/Reviewer_Xkac"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission21988/Reviewer_Xkac"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission21988/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761989419482, "cdate": 1761989419482, "tmdate": 1762942009070, "mdate": 1762942009070, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}