{"id": "wkWwXiw4Vb", "number": 6194, "cdate": 1757957734104, "mdate": 1759897930589, "content": {"title": "Learning from Mixed-Quality Data via Exploration-Guided Cognitive Manifolds", "abstract": "Data-driven learning paradigms typically require massive amounts of high-quality data to learn reliable decision models. In safety-critical domains, the cost of obtaining high-quality labeled data often exceeds practical budgets, while abundant low-quality data from routine operations remains unutilized. This creates a paradox: systems are data-rich but knowledge-poor, as traditional methods require extensive preprocessing that often removes valuable information. We introduce a learning framework that constructs cognitive manifolds to represent the system's evolving understanding, enabling principled utilization of mixed-quality data. Rather than filtering out imperfect data or treating all data equally, our approach dynamically evaluates each data point's potential contribution based on the learner's current cognitive state. We formalize this through exploration measures that capture the model's understanding uncertainty, enabling it to identify when low-quality data can fill knowledge gaps versus when it would introduce harmful noise. The framework transforms the traditional data quality problem into a cognitive matching problem: aligning data characteristics with the learner's current knowledge needs. Through this cognitive manifold representation, even highly noisy data becomes valuable during early learning stages when any information reduces uncertainty, while the same data is appropriately ignored once the model develops robust understanding. Experiments on multi-objective optimization tasks with mixed-quality data demonstrate that our approach extracts 3.6% more actionable knowledge from the same datasets compared to quality-filtering baselines, while maintaining the strict constraint satisfaction required in safety-critical applications.", "tldr": "", "keywords": ["Energy management systems", "satellite battery arrays", "cognition-driven adaptive learning", "limited data learning", "multi-objective optimization", "hard constraint guarantees", "aerospace engineering", "dynamic policy regulation"], "primary_area": "reinforcement learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/b757d582d7340caa4ca586b5d2721f67542f2b9f.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper addresses the challenge of learning control policies for satellite battery management systems from mixed-quality data. The authors propose an \"exploration-guided cognitive manifold\" framework that dynamically weights data samples based on the learner's current \"exploration degree\" - a metric combining state novelty, policy uncertainty, and temporal progression. The framework includes adaptive data utilization, mixed regularization with behavioral cloning and physics constraints, and an exploration-aware Actor-Critic algorithm. Experiments on simulated satellite environments show modest improvements over baseline methods."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper tackles a practically relevant problem - satellite systems do face challenges with data quality and scarcity. The motivation is clear and the application domain is important for aerospace engineering.\n\n2. The experimental setup considers multiple data quality levels and includes relevant baselines from both online and offline RL. The authors attempt to incorporate domain-specific constraints like orbital periodicity and temperature fluctuations.\n\n3. The writing includes detailed mathematical formulations and the overall presentation is comprehensive, covering multiple aspects of the proposed system."}, "weaknesses": {"value": "1. The core contribution appears to be repackaging existing concepts rather than introducing genuinely novel ideas. The \"exploration degree\" is essentially uncertainty-based weighting, combining epistemic uncertainty, aleatoric uncertainty, and time-based annealing - all well-established concepts in active learning and curriculum learning literature. The paper doesn't adequately distinguish its contribution from this existing work.\n\n2. The theoretical analysis is weak. The convergence proof (Eq. 20) merely states asymptotic convergence without proof. The sample complexity bound appears to be a standard result with minor modifications. There's no formal characterization of when this approach would outperform simpler alternatives, nor any theoretical justification for why the three-component exploration degree formulation is optimal or even necessary.\n\n3. The paper is unnecessarily complex and verbose. Terms like \"cognitive manifolds\" and \"exploration-guided cognitive matching\" obfuscate rather than clarify. The same ideas could be expressed much more simply. The paper reads more like a technical report trying to impress with complexity rather than a scientific contribution with clear innovations."}, "questions": {"value": "1. How does the approach differ fundamentally from uncertainty-weighted importance sampling or curriculum learning methods that already exist in the literature?\n\n2. Why not compare against robust optimization methods or distributionally robust RL approaches that are specifically designed for handling data quality issues?\n\n3. Can you provide ablation studies showing the individual contribution of each component? What happens if you just use the exploration degree for data weighting without the complex regularization framework?\n\n4. The experimental improvements are very small. Have you conducted statistical significance tests to ensure these aren't within noise?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "svQeTemru9", "forum": "wkWwXiw4Vb", "replyto": "wkWwXiw4Vb", "signatures": ["ICLR.cc/2026/Conference/Submission6194/Reviewer_Zq44"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6194/Reviewer_Zq44"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission6194/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761727081150, "cdate": 1761727081150, "tmdate": 1762918537482, "mdate": 1762918537482, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes an exploration-guided framework for learning from mixed-quality data in satellite multi-battery management. It introduces an exploration score combining state novelty, policy uncertainty, and a temporal schedule. It then uses the score to weight data and to blend three regularizers (behavior cloning, adversarial/value-guided, and physics constraints). Experiments on a custom satellite simulator with four “quality” datasets report gains over PPO/TD3/SAC/BC/CQL on power-tracking accuracy and energy efficiency."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. Learning from mixed-quality data with safety constraints is in general an important problem across all domains.\n\n2. This work builds an end-to-end solution customized for the battery management systems use case."}, "weaknesses": {"value": "1. “Cognitive manifold” remains a rhetorical term that only appears in the title and abstract, and there's no concrete manifold construction, geometry, or representation learning objective defined beyond a scalar exploration score.\n\n2. The paper refers to “state novelty,” “policy/understanding uncertainty,” and a system's “degree of understanding,” but does not provide concrete estimators or algorithms to compute them.\n\n3. The “theoretical properties” section states sample-complexity and constraint-satisfaction expressions without assumptions, theorems, or proofs.\n\n4. The application scope is very narrow. All experiments and most of the narrative are specialized to the satellite multi-battery systems, with no public safety/offline RL benchmarks.\n\n5. The related work under-covers core ML on offline/safe/robust RL, data quality/valuation for RL, and exploration under uncertainty."}, "questions": {"value": "None."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "RhX4ZdcA5E", "forum": "wkWwXiw4Vb", "replyto": "wkWwXiw4Vb", "signatures": ["ICLR.cc/2026/Conference/Submission6194/Reviewer_XgQt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6194/Reviewer_XgQt"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission6194/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761870211551, "cdate": 1761870211551, "tmdate": 1762918536977, "mdate": 1762918536977, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This work addresses the problem of effective data selection in settings with large quantities of low quality data, where it is specifically motivated by the example of battery management in satellites. They introduce a framework constructing cognitive manifolds to learn the understanding of the training model to be used for efficient data allocation suited for the current cognitive state. They present their approach as an exploration problem to capture the models uncertainty and select additional data based off of this. They additionally present experimental results on simulated data demonstrating an improvement over baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The problem of how to effectively prepare data from low quality sources for effective model training is well motivated, and the idea of framing this problem as being state-dependent is compelling.\n2. The paper is very well written and enjoyable to read. Specifically, the figures are very impressive.\n3. The empirical results demonstrating a more graceful decline in performance compared to baseline methods as data quality declines is compelling."}, "weaknesses": {"value": "1. One stylistic concern is that this paper seems too specific to the example of satellite battery management. For people not knowledgeable in this specific domain, it is not very clear that this approach can generalize to the many others that suffer from this low quality data problem. In the abstract, the paper aims to present a method to address all safety critical domains, but the set up in section 3 is localized just to their motivating example.\n2. The definition of exploration degree in equation (7) is vague and it is unclear what specific statistics denote the novelty of the state, diversity of policy outputs, and the stage characteristics of the learning process. Are these quantities defined or learned?\n3. The learnable weight function in (9) is critical to the proposed approach, yet there is no indication of how this value is trained?\n4. The work only presents results on synthetic data, where results on real world data seem necessary as the work is posed as having significant practical value."}, "questions": {"value": "1. This work seems very similar to many others works in offline RL that consider data reweighting such as [1,2,3,4]. Can you expand on how your work is novel compared to these?\n2. How is E_state, E_policy and E_temporal defined in eq (7)?\n3. How is the weight function learned?\n\n\n[1] Uncertainty-Aware Instance Reweighting for Off-Policy Learning\n[2] Conservative and Adaptive Penalty for Model-Based Safe Reinforcement Learning\n[3] Uncertainty Weighted Actor-Critic for Offline Reinforcement Learning\n[4] Uncertainty-based offline reinforcement learning with diversified q-ensemble"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "MjSE5cJE7e", "forum": "wkWwXiw4Vb", "replyto": "wkWwXiw4Vb", "signatures": ["ICLR.cc/2026/Conference/Submission6194/Reviewer_ZV9h"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission6194/Reviewer_ZV9h"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission6194/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761885561096, "cdate": 1761885561096, "tmdate": 1762918536398, "mdate": 1762918536398, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}