{"id": "wM7uVwV1Za", "number": 12079, "cdate": 1758205559329, "mdate": 1759897535414, "content": {"title": "T-GINEE: A Tensor-Based Multi-Graph Representation Learning", "abstract": "While traditional network analysis focuses on single-layer networks, real-world systems often exhibit multiple types of relationships simultaneously, forming multilayer networks. However, existing multilayer network analysis methods typically assume complete node correspondences across layers, which is unrealistic in practice. Furthermore, these methods either treat different layers independently or simply aggregate them, failing to capture complex interdependencies between layers. To address these challenges, we propose T-GINEE (Tensor-based Generalized Multilayer-graph Estimating Equation), a statistical regularization framework that combines tensor-based generalized estimating equations with task-specific loss to explicitly model cross-network correlations. The key technical innovations include: (1) A CP tensor decomposition approach that captures structural dependencies through shared latent factors; (2) A generalized estimating equation framework that models inter-layer correlations through working covariance matrices; (3) A flexible link function design that accommodates various network characteristics, including sparsity. Our theoretical analysis establishes consistency and asymptotic normality of T-GINEE under mild regularity conditions. Extensive experiments on both synthetic and real-world datasets validate the effectiveness of T-GINEE and its practicality for analyzing partially aligned multilayer networks. The code is available in the supplementary material for reproducibility.", "tldr": "", "keywords": ["multilayer networks", "tensor decomposition", "generalized estimating equations", "network analysis", "cross-layer dependencies", "partial alignment", "statistical regularization"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/7a4254db7973ff0c8d494fc2b2fceb51678bc786.pdf", "supplementary_material": "/attachment/f2975af82f84b6a05443592c6ae28b2cdb1005e8.zip"}, "replies": [{"content": {"summary": {"value": "This paper introduces T-GINEE, a tensor-based generalized estimating equation framework for multilayer graph representation learning. By combining CP tensor decomposition with generalized estimating equations, the authors try to establish consistency and asymptotic normality under certain conditions. The authors also conduct experiments on synthetic and real-world networks to validate its effectiveness."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. The authors provide some related work on network embedding and multilayer graph analysis.\n\n2.  The authors attempt to provide a mathematical proof for their method (although it may not necessarily be correct).\n\n 3.  The authors conduct simulation and real-world data experiments, comparing their method with existing approaches."}, "weaknesses": {"value": "1.  The paper emphasizes the contribution of theoretical guarantees, However, the theorem and proof seem to be problematic. For instance, in Theorem 3.2, the assumption $(n + M)R = o(n^{1/3})$ is impossible, as $M,R$ are positive integers. Moreover, there appear to be errors in the proof. Some steps seem to be incorrect or not sufficiently justified.  See also question 6,7,8,9.\n\n\n2. Many notations are not clearly defined, such as the notation in (1), type of norm being used in (10), and $U_{i,j,m}$ in Line 357, which makes the paper hard to follow.\n\n 3.  The authors do not specify how to estimate Equation (3), or Equation (18) in the appendix. The estimation procedure does not seem trivial, and the authors should present an algorithm for solving these equations, along with a detailed analysis of its computational complexity.\n \n4. The paper is the lack of rigor in the formulation of the assumptions. See my question 1, 2 and 4.\n \n5. The numerical simulation setup is unclear, and the description of the prediction task is missing.  \n\n \n6. There are numerous typos throughout the manuscript. For example, in Line 259, the letter $F$ should be a subscript."}, "questions": {"value": "1. The authors should provide a more rigorous formulation of their assumptions, rather than relying on imprecise language like \"sufficiently slowly\". In addition, Assumption 2 includes the statement that \"The dimension $(n + M)R$ grows sufficiently slowly with $n$\", but it is unclear how this condition holds, especially considering that $(n + M)R$ appears to be greater than $n$. Further clarification or a more detailed justification is needed. \n\n2. The authors should provide a thorough discussion on the identifiability.\n\n3. It is unclear whether $A_{i,j,\\cdot}$ are independent for different pairs $(i,j)$.\n\n4. In Line 143, the authors define $A$ as a 0-1 variable. Then the term $ (A_{i,j,\\cdot} - P_{i,j,\\cdot}(\\Theta_0)) $ in Assumption 5 appears to be bounded, which leads to sub-Gaussian. A clearer explanation of this aspect would contribute to the rigor of the theoretical analysis.\n\n5. The paper would benefit from additional motivation. Specifically, it is not clear why the parameter $\\Theta$ is assumed to admit a tensor decomposition.  Adding more  motivation would enhance the practical contributions of the work.\n\n\n6. There seems to be an issue with Line 813. In Line 806, the authors claim that for each $(i,j)$, the term (I denoted below as $F_{ij}$) is of order $n^{-1/2}$. By Line 802, we have $\\|D(\\gamma)-D(\\gamma_0)\\| = \\sum_{i \\le j} F_{ij}$. However, since there are at least $n$ such terms $F_{ij}$ (because $(n+M)R \\ge n$), it is not clear that $\\|D(\\gamma)-D(\\gamma_0)\\|$ remains of order $n^{-1/2}$.\n\n7. In Line 837, the author claims that $R_n = o(n^{1/2})$. This claim requires a more thorough mathematical proof, as it is not self-evident.\n\n\n 8. Line 855 seems to be incorrect, as the result stated there does not follow directly from Line 852.\n \n 9. In Line 878, the authors claim that the term is $o_p(n^{1/2})$, whereas in Line 879 the corresponding expression is $O_p(n^{1/2})$. This discrepancy should be clarified."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "k6NmVk6QF4", "forum": "wM7uVwV1Za", "replyto": "wM7uVwV1Za", "signatures": ["ICLR.cc/2026/Conference/Submission12079/Reviewer_XH5T"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12079/Reviewer_XH5T"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12079/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761319999115, "cdate": 1761319999115, "tmdate": 1762923052331, "mdate": 1762923052331, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a novel multilayer graph representation learning framework, T-GINEE, which combines tensor decomposition (CP decomposition) with generalized estimating equations (GEE) to explicitly capture cross-network dependencies. The core contribution of T-GINEE lies in its theoretical establishment of embedding consistency and asymptotic normality, providing robust statistical guarantees and addressing the limitations of existing methods in handling multilayer graphs. Experimental results demonstrate that T-GINEE achieves strong performance in multilayer network embedding tasks, particularly on both synthetic and real-world datasets."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper proposes a theoretically grounded framework for multilayer graph representation learning through careful mathematical derivation, and demonstrates its superiority in capturing higher-order structures and modeling cross-layer dependencies through comprehensive experiments on both synthetic and real-world datasets; the paper is well-structured and clearly organized, and it explicitly points out potential extensions to dynamic graph settings, providing a clear direction for future research."}, "weaknesses": {"value": "1.\tAlthough this paper combines CP tensor decomposition with the generalized estimating equations (GEE) framework for multilayer network representation learning and demonstrates good performance in experiments, the overall novelty of the method is limited. The core theoretical tools used in the paper—CP decomposition and GEE—are both well-established methods. The authors mainly focus on combining and engineering these existing techniques within their model, lacking substantive improvements to the theory or algorithm itself.\n2.\tThe high computational complexity resulting from combining tensor decomposition with covariance estimation limits the scalability and practicality of the model on very large."}, "questions": {"value": "In Figure 2(b), it can be observed that across different embedding dimensions, the AUC scores consistently increase as the regularization weight grows. Does this suggest that the regularization term plays a dominant, or even decisive, role in determining the model’s performance?\n\nWhat is the advantage of the combination between CP decomposition and GEE?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "no"}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "2g8r7wbYnx", "forum": "wM7uVwV1Za", "replyto": "wM7uVwV1Za", "signatures": ["ICLR.cc/2026/Conference/Submission12079/Reviewer_jtuF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12079/Reviewer_jtuF"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12079/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761913302426, "cdate": 1761913302426, "tmdate": 1762923051817, "mdate": 1762923051817, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the problem of learning low-dimensional representations from multilayer graphs with incomplete node alignment and complex inter-layer dependencies. The authors propose T-GINEE that integrates CP tensor decomposition with Generalized Estimating Equations (GEE) to model structural dependencies and cross-layer correlations. The method features a flexible link function to accommodate different network sparsity structures and offers theoretical guarantees including consistency and asymptotic normality. While the proposed framework is technically sound and innovative, certain limitations remain in terms of practical applicability, scalability, and comparison depth."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper makes a substantial contribution by introducing a tensor-based GEE formulation, rigorously addressing inter-layer correlations. \n2. T-GINEE significantly outperforms baseline methods across multiple benchmarks."}, "weaknesses": {"value": "1. The paper lacks empirical evaluation on large-scale multilayer graphs (e.g., with millions of nodes). The computational cost scales linearly with embedding size (Fig. 2c), but quadratically in the number of node pairs, which can be prohibitive in practice.\n2. Recent GNN-based multilayer models should be considered for fairer comparison.\n3. No analysis is presented on downstream tasks such as node classification or community detection, which are important for validating representation utility."}, "questions": {"value": "1. How does T-GINEE handle heterogeneous node sets when node alignment across layers is partial or noisy? Is any pre-alignment or matching assumed?\n2. Given that the estimation uses CP decomposition, which is known to suffer from non-uniqueness, how is stability ensured in practice? Is there any regularization or initialization strategy to avoid poor local minima?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "8n7WRBH4nS", "forum": "wM7uVwV1Za", "replyto": "wM7uVwV1Za", "signatures": ["ICLR.cc/2026/Conference/Submission12079/Reviewer_jVAX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12079/Reviewer_jVAX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12079/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762054885198, "cdate": 1762054885198, "tmdate": 1762923051227, "mdate": 1762923051227, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents T-GINEE, a framework for representation learning on multilayer networks with partially aligned and non-identical entity correspondences. The method combines symmetric CP tensor decomposition with generalized estimating equations (GEE) to capture inter-layer correlations through working covariance matrices and flexible link functions. Theoretical guarantees on estimator consistency and asymptotic normality are provided under standard regularity conditions. Comprehensive experiments on synthetic and real-world datasets demonstrate superior predictive performance, supported by ablations, statistical analysis, and open-sourced code."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "S1. A well-motivated integration of CP decomposition and GEE that rigorously models inter-layer dependencies, supported by theoretical results uncommon in graph representation learning.\n\nS2. Strong empirical validation across multiple domains (social, biological, trade), showing consistent improvements over a wide range of baselines.\n\nS3. The paper is clearly written, with a well-organized structure and reproducible experimental setup."}, "weaknesses": {"value": "W1. Theoretical results rely on restrictive assumptions (boundedness, smoothness, low-rank growth) whose practical effects are not empirically tested; robustness to high-dimensional or ill-conditioned settings remains unclear.\n\nW2. The framework is limited to (generalized) linear tensor models and does not explore integration with deep or attention-based architectures, which could enhance flexibility and expressivity.\n\nW3. While performance metrics are strong, the experiments lack sensitivity analyses under sparsity, misalignment, and noise—key challenges for real-world multi-graph learning."}, "questions": {"value": "Q1. How robust is T-GINEE to assumption violations such as rank mis-specification, high collinearity, or sparsity?\n\nQ2. What are the computational or algorithmic barriers to scaling T-GINEE beyond n,M>10^3?\n\nQ3. To what extent do the current experiments capture partial alignment rather than full alignment? Please clarify the dataset statistics or discuss practical extensions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "DEOSIvUzfN", "forum": "wM7uVwV1Za", "replyto": "wM7uVwV1Za", "signatures": ["ICLR.cc/2026/Conference/Submission12079/Reviewer_xP5w"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12079/Reviewer_xP5w"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12079/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762152315203, "cdate": 1762152315203, "tmdate": 1762923050688, "mdate": 1762923050688, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}