{"id": "wnFbqvUJ6D", "number": 5825, "cdate": 1757937822881, "mdate": 1759897951146, "content": {"title": "Multi-View Causal Discovery without Non-Gaussianity: Identifiability and Algorithms", "abstract": "Causal discovery is a difficult problem that typically relies on strong assumptions on the data-generating model, such as non-Gaussianity. In practice, many modern applications provide multiple related views of the same system, which has rarely been considered for causal discovery. Here, we leverage this multi-view structure to achieve causal discovery with weak assumptions. We propose a multi-view linear Structural Equation Model (SEM) that extends the well-known framework of non-Gaussian disturbances by alternatively leveraging correlation over views. We prove the identifiability of the model for acyclic SEMs. Subsequently, we propose several multi-view causal discovery algorithms, inspired by single-view algorithms (DirectLiNGAM, PairwiseLiNGAM, and ICA-LiNGAM). The new methods are validated through simulations and applications on neuroimaging data, where they enable the estimation of causal graphs between brain regions.", "tldr": "", "keywords": ["Causal discovery", "Independent component analysis", "Non-Gaussianity", "Multiview data", "Second-order statistics"], "primary_area": "causal reasoning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d13376208b4f6a2536aa00ab98404f7810b2ab59.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes a new framework for causal discovery that eliminates the need for the conventional assumption of non-Gaussianity and instead exploits a multi-view data structure to ensure identifiability of causal relations. Traditional approaches generally assume a single view, where it is theoretically impossible to determine causal direction from data without strong additional assumptions. One of the most prominent models, LiNGAM, achieves identifiability by assuming non-Gaussian, independent disturbances. The proposed model, LiMVAM (Linear Multi-View Acyclic Model), is a linear structural equation model (SEM) that handles multiple related data views jointly. The authors show that identifiability can be guaranteed by leveraging second-order statistics (SOS), the covariances across views, without relying on higher-order statistics. Specifically, they prove that if (i) each variable pair is correlated in at least some views, (ii) the correlation patterns are not identical across views, and (iii) the overall graph formed by all views is connected, then both the causal ordering and the coefficient matrices are identifiable using SOS alone. Based on this theory, the paper proposes three new algorithms, PairwiseLiMVAM, DirectLiMVAM, and ICA-LiMVAM, which can be interpreted as multi-view extensions of existing LiNGAM-based methods. In particular, ICA-LiMVAM generalizes ICA-LiNGAM as a special case. Through simulations under both Gaussian and non-Gaussian settings, PairwiseLiMVAM and DirectLiMVAM achieve higher accuracy and faster computation than prior approaches such as ICA-LiNGAM and Multi-Group DirectLiNGAM. Applications to brain-imaging (MEG/fMRI) data further demonstrate that the proposed methods recover physiologically plausible causal relationships."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "This paper makes an important theoretical contribution by formalizing the general intuition that performing multiple instances of statistical causal discovery can enhance estimation robustness. Under a multi-view formulation, the authors provide a clear set of assumptions and a rigorous logical development showing that causal ordering can be uniquely identified using only second-order statistics (SOS)—without relying on the conventional non-Gaussianity assumption. To the best of my knowledge, this is the first work to demonstrate such identifiability purely from SOS. The paper is clearly written and well structured: the connection to the well-known LiNGAM model is carefully explained, and the mathematical exposition is detailed and persuasive. The demonstration that ICA-LiMVAM generalizes ICA-LiNGAM as a special case further clarifies the positioning of the proposed approach.\n\nThe simulation experiments are well designed and convincingly show that the proposed methods perform as predicted under the stated assumptions. Moreover, experiments on real MEG and fMRI datasets demonstrate that the approach is not only theoretically sound but also practically useful.\n\nBy leveraging multiple views rather than imposing unrealistic distributional assumptions, the proposed framework provides a promising and potentially high-impact direction for improving the robustness of statistical causal discovery in realistic settings."}, "weaknesses": {"value": "In practical data analysis, it may be difficult to ensure that the assumptions of cross-view correlation and diversity are satisfied. In particular, Assumption 1 requires that for each pair of variables, (i) the correlation is non-zero in at least some views, and (ii) the correlation structures across views are not perfectly proportional. However, in high-dimensional real-world datasets, many variable pairs often exhibit near-zero correlations (i.e., near independence), providing little informative variation, while other groups of variables may be dominated by common latent factors, resulting in nearly identical correlation structures across views. A deeper discussion of how frequently such situations may arise in practice, and how they might be detected or mitigated, would substantially strengthen the paper and improve the practical applicability of the proposed method.\n\nAlthough this point could also be framed as an opportunity rather than a limitation, one intriguing extension would be to actively generate multiple views, for example, via bootstrap resampling, and apply the proposed framework to enhance the robustness of statistical causal discovery. Such an idea could even lead to new approaches for evaluating the reliability or confidence of inferred causal relations, a problem that has long been challenging. Discussing these possible directions would make the paper’s impact and future potential even greater."}, "questions": {"value": "- In practical datasets, how likely is it that the assumptions of cross-view correlation and diversity are violated? Could the authors provide a deeper discussion on how frequently such violations might occur in real-world settings, and what strategies could be used to detect or avoid such situations?\n\n- Would it be possible to actively generate multiple views, for example, through bootstrap resampling, and apply the proposed method to substantially enhance the robustness of statistical causal discovery? Could this idea potentially evolve into a new approach for assessing the reliability or confidence of estimated causal relationships?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "91xImu12iD", "forum": "wnFbqvUJ6D", "replyto": "wnFbqvUJ6D", "signatures": ["ICLR.cc/2026/Conference/Submission5825/Reviewer_vvkn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5825/Reviewer_vvkn"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission5825/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761391657620, "cdate": 1761391657620, "tmdate": 1762918285916, "mdate": 1762918285916, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces a multi-view linear SEM (LiMVAM) for causal discovery that exploits correlations across views to obtain identifiability and scalable algorithms without requiring non-Gaussian noise. Two SOS-only, residual-recursive procedures, PairwiseLiMVAM (likelihood-ratio with closed-form LR) and DirectLiMVAM (cross-covariance Frobenius criterion), recover a shared causal ordering and then estimate per-view coefficients with joint FGLS. A complementary “shared-disturbance” formulation (with per-view scalings) connects LiMVAM to Shared ICA, yielding identifiability even when some disturbances are Gaussian. Conceptually, LiMVAM generalizes multi-environment/non-stationary ideas by treating environments as “views” and using diversity of second-order structure to replace classical non-Gaussianity assumptions."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "a. The multi-view setting is both common and important. This paper extends two single-view causal-discovery algorithms to the multi-view case and removes the need for non-Gaussian noise assumptions.\n\nb. The estimators are fast and straightforward: closed-form likelihood-ratio and cross-covariance tests within a recursive-residual scheme, followed by joint FGLS for edge weights, essentially no tuning required.\n\nc. The real-world experiments are good, including MEG/fMRI case studies with cross-subject stability checks that support the practical value of the approach."}, "weaknesses": {"value": "a. The contribution is close to existing multi-environment/multi-domain lines. Several works also target identification of linear systems in multi-view or multi-domain settings but are not discussed. For example, [1] addresses causal structure learning for linear relations without relying on non-Gaussian noise or inter-view correlation; [2] studies identification under heterogeneous/noise-variance shifts across domains; and invariance-based approaches such as [3] provide a related lens on leveraging distributional stability across environments. A clearer positioning relative to these would sharpen the paper’s novelty claims.\n\nb. In sections 4.2–4.4, many key conditions and results deferred to the appendix. It would improve readability and verifiability to promote the central statements to the main text as formal theorems/definitions (with precise assumptions), leaving proofs and extended discussion to the appendix.\n\nc. In synthetic experiments, multi-environment baselines beyond LiNGAM-style variants are limited.\n\n\n[1] Ghassami A E, et al. Multi-domain causal structure learning in linear systems[J]. Advances in neural information processing systems, 2018, 31.\n\n[2] Adams J, et al. Identification of partially observed linear causal models: Graphical conditions for the non-gaussian and heterogeneous cases[J]. Advances in Neural Information Processing Systems, 2021, 34: 22822-22833.\n\n[3] Peters J, et al. Causal inference by using invariant prediction: identification and confidence intervals[J]. Journal of the Royal Statistical Society Series B: Statistical Methodology, 2016, 78(5): 947-1012."}, "questions": {"value": "a. Lines 96–100: the partial-ordering example is unclear. If the adjacency/structural matrix is the zero matrix, the DAG has no edges, so all variables are mutually independent; in that case there is no informative partial order beyond the trivial one?\n\nb. On the assumption that views must be correlated, does this imply a shared latent factor across views?\n\nc. Theorems 1–2: if each view’s coefficient matrix $B^i$ is identifiable, why is an additional assumption needed to recover the causal ordering $P$? Is $B^i$ identified only up to a common permutation of variables (leaving the topological order ambiguous), or is $B^i$ in Theorems 1–2 different from the structural matrix in Eq. (3)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "5qdyBDqda1", "forum": "wnFbqvUJ6D", "replyto": "wnFbqvUJ6D", "signatures": ["ICLR.cc/2026/Conference/Submission5825/Reviewer_WBtZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5825/Reviewer_WBtZ"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission5825/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761523182999, "cdate": 1761523182999, "tmdate": 1762918285439, "mdate": 1762918285439, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles the formidable challenge of uncovering causal structure from observational data by capitalizing on multi-view architectures, wherein multiple correlated datasets (or \"views\") share an underlying causal dependency system. Transcending the conventional prerequisite of non-Gaussianity for reliable identifiability (as is characteristic of LiNGAM), the authors propose an innovative multi-view linear SEM framework.This framework achieves identifiability under substantially less stringent assumptions by exclusively utilizing heterogeneous Second-Order Statistics (SOS) across the distinct views. The study furnishes rigorous theoretical guarantees of identifiability, devises streamlined multi-view extensions of established algorithms (DirectLiNGAM, PairwiseLiNGAM, and an ICA-based approach), and empirically validates and benchmarks these methodologies on both synthetic and large-scale neuroimaging datasets."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- The paper delivers a significant contribution by establishing the identifiability of linear SEMs using only second-order statistics, eliminating the reliance on non-Gaussianity\n- The generalization of DirectLiNGAM and PairwiseLiNGAM to the multi-view setting is addressed in a thoughtful manner, yielding novel fast SOS-based algorithms. Additionally, the adaptation of ICA-LiNGAM methodology to accommodate multi-view shared disturbances is conceptually elegant.\n- The paper is well-organized and clearly written."}, "weaknesses": {"value": "- What is the difference between Ghassami[1] and Perry[2] in this paper?\n\n- In Section 3, It would be better that the assumption, \"All adjacency matrices ${B}_i$ share the same causal ordering\" be explicitly highlighted (or formal definition).\n\n- The definitions of some superscripts and subscripts in the text are easily confusing. For example, in Equation (8) of Section 4.5, which represents different views, the superscripts $i$ and $i'$ hinder readability. \n\n- In Section C.2，Why is matrix $B$ in the form of $diag(cov(x^1,y^1),...,cov(x^m,y^m))$?\n\n- The paper only conducted limited baseline comparisons, without benchmarking against recently emerged causal discovery methods.\n\n\n\n\n## References\n> 1、AmirEmad Ghassami, Negar Kiyavash, Biwei Huang, and Kun Zhang. 2018. Multi-domain causal structure learning in linear systems. In Proceedings of the 32nd International Conference on Neural Information Processing Systems (NIPS'18). Curran Associates Inc., Red Hook, NY, USA, 6269–6279.\n\n> 2、Ronan Perry, Julius von Kügelgen, and Bernhard Schölkopf. 2022. Causal discovery in heterogeneous environments under the sparse mechanism shift hypothesis. In Proceedings of the 36th International Conference on Neural Information Processing Systems (NIPS '22). Curran Associates Inc., Red Hook, NY, USA, Article 792, 10904–10917."}, "questions": {"value": "See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "tV6Q4jFceU", "forum": "wnFbqvUJ6D", "replyto": "wnFbqvUJ6D", "signatures": ["ICLR.cc/2026/Conference/Submission5825/Reviewer_KaQA"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5825/Reviewer_KaQA"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission5825/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761793406826, "cdate": 1761793406826, "tmdate": 1762918285123, "mdate": 1762918285123, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This article addresses the challenging problem of causal discovery, which traditionally relies on strong assumptions like non-Gaussianity. The authors introduce a novel approach that leverages multi-view data."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "This article addresses the challenging problem of causal discovery, which traditionally relies on strong assumptions like non-Gaussianity. The authors introduce a novel approach that leverages multi-view data."}, "weaknesses": {"value": "I have a concern regarding the step in the identifiability proof where independence is concluded from the vanishing covariances. As is well-known, vanishing covariance does not generally imply independence. Since the proof seems to leverage this implication, its validity depends critically on the underlying distributional assumptions. Please clarify how the non-Gaussianity of the disturbances, potentially via the framework of the Darmois–Skitovich theorem, guarantees that this implication holds in the proposed multi-view model. A more detailed explanation in the manuscript would be essential. The second order of statistics may not be sufficient for the estimation."}, "questions": {"value": "See above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "bVWAN67EIa", "forum": "wnFbqvUJ6D", "replyto": "wnFbqvUJ6D", "signatures": ["ICLR.cc/2026/Conference/Submission5825/Reviewer_ayyF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission5825/Reviewer_ayyF"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission5825/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761990650459, "cdate": 1761990650459, "tmdate": 1762918284694, "mdate": 1762918284694, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}