{"id": "WQsaxpFutF", "number": 12910, "cdate": 1758211547540, "mdate": 1759897477446, "content": {"title": "Challenges in Non-Polymeric Crystal Structure Prediction: Why a Geometric, Permutation-Invariant Loss is Needed", "abstract": "Crystalline structure prediction is an essential prerequisite for designing materials with targeted properties, yet it is still an open challenge in materials design and drug discovery. Despite recent advances in computational materials science, accurately predicting three-dimensional non-polymeric crystal structures remains elusive. In this work, we focus on the molecular assembly problem, where a set $\\mathcal{S}$ of identical rigid molecules is packed to form a crystalline structure. Such a simplified formulation provides a useful approximation to the actual problem. However, while recent state-of-the-art methods have increasingly adopted sophisticated techniques, the underlying learning objective remains ill-posed. We propose a better formulation that introduces a loss function capturing key geometric molecular properties while ensuring permutation invariance over $\\mathcal{S}$. Remarkably, we demonstrate that within this framework, a simple regression model already outperforms prior approaches, including flow matching techniques, on the COD-Cluster17 benchmark, a curated non-polymeric subset of the Crystallography Open Database (COD).", "tldr": "", "keywords": ["material design", "crystal structure prediction", "flow matching", "geometric loss"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/170ee70eca324cd905c04b1295542ed867140091.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes a permutation-invariant loss for molecular assembly in organic molecular crystals and evaluates it on the COD-Cluster17 dataset."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "It addresses crystal structure prediction for organic crystals -- an important but underexplored area in AI for materials."}, "weaknesses": {"value": "**1. Benchmark limitations**\n- The COD-Cluster17 dataset appears suboptimal for molecular assembly prediction. Here,  $\\mathcal{S}\\_{\\text{initial}}$ is generated by random rigid transformations (translation, rotation, inversion) of $\\mathcal{S}\\_{\\text{final}}$, which does not reflect any physically meaningful relationship between the two states. This raises questions about the validity of the task as a proxy for realistic molecular assembly.\n- While the authors claim that the COD-Cluster17 is the only available dataset for this problem, the Open Molecular Crystals 2025 (OMC25), released a few months earlier, offers a more phyiscally grounded setup where $\\mathcal{S}\\_{\\text{initial}}$ is relaxed to $\\mathcal{S}\\_{\\text{final}}$ using DFT. Using the OMC25 dataset would strengthen the work's credibility. \n\n**2. Limited physical motivation for permutation-invariant loss**\n- The authors state that there is “no specific reason” to associate the i-th initial molecule with the i-th final one, motivating the use of a permutation-invariant objective. However, in realistic molecular dynamics, these relationships are not arbitrary -- initial and final configurations are correlated through the system’s energy landscape and relaxation trajectory.\n\n**3. Ambiguous experimental design**\n- The ablation experiments combine two different conditions -- (a) non-permutation-invariant loss with flow matching vs. (b) permutation-invariant loss with regression. Since both the loss type and the learning scheme change, it is difficult to isolate the effect of the permutation-invariant loss itself. \n- Additionally, the evaluation metrics (PM) are unconventional in CSP; using a widely accepted (e.g., pymatgen's structure matcher) would help ensure consistency and credibility of the work."}, "questions": {"value": "1. Have the authors considered the limitations of the COD-Cluster17 dataset and the potential advantages of using a more physically meaningful dataset, such as OMC25?\n2. Have the authors accounted for the physical correlation between the initial and final molecular configurations, which may challenge the assumption of full permutation invariance?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "rNfLR19yss", "forum": "WQsaxpFutF", "replyto": "WQsaxpFutF", "signatures": ["ICLR.cc/2026/Conference/Submission12910/Reviewer_kjBr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12910/Reviewer_kjBr"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12910/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761542122436, "cdate": 1761542122436, "tmdate": 1762923685840, "mdate": 1762923685840, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper revisits the task of non-polymeric crystal structure prediction (CSP), where a finite set of identical rigid molecules must be assembled into a periodic crystalline arrangement.\nInstead of proposing a new model architecture, the authors focus on the definition of the learning objective. They argue that existing diffusion and flow-matching-based methods (e.g., DiffCSP, AssembleFlow) rely on ill-posed coordinate losses that violate two fundamental physical properties of crystals:\n- Rigid-body nature of molecules; and\n- Permutation invariance among equivalent molecular units in a crystal.\n\nTo address this, the paper introduces a physics-grounded, permutation-invariant objective, based on rigid-body RMSD and a differentiable Sinkhorn matching formulation.\nThe resulting method, SinkFast, keeps the same SE(3)-equivariant GNN architecture as AssembleFlow, but trains via simple regression with this new loss. On the COD-Cluster17 benchmark, SinkFast surpasses prior flow-matching and diffusion models both in accuracy (lower PM scores) and efficiency (≈ 50× faster inference)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- The paper provides a well-motivated critique of current molecular-assembly objectives and demonstrates that physically inconsistent loss functions can limit progress in CSP. The proposed formulation restores physical and geometric consistency (rigid-body, SE(3), and permutation invariance).\n- Applying differentiable Sinkhorn matching to enforce permutation invariance is mathematically sound, simple to implement, and computationally efficient.\n- Despite minimal architectural change, the method consistently outperforms more sophisticated baselines (AssembleFlow, CrystalFlow-LERP, DiffCSP) on COD-Cluster17, highlighting that objective design matters more than network complexity.\n- The approach reduces training time by ≈ 40× compared to flow matching, needs no hyperparameter tuning for translation–rotation weighting, and the authors provide an open implementation.\n- The paper correctly points out conceptual flaws in the COD-Cluster17 benchmark (lack of PBCs and space-group labels), which clarifies why current generative models struggle to generalize."}, "weaknesses": {"value": "- The main innovation lies in the loss formulation, not in modeling or algorithmic design. The use of Sinkhorn optimal transport and RMSD-based rigid-body losses has appeared in related areas (protein docking, point-cloud alignment, object registration). Thus, the conceptual leap for the ML community may appear limited.\n\n- The paper does not formally justify why the proposed loss leads to better optimization properties or generalization, beyond empirical observation. A discussion of gradient behavior or convergence under permutation relaxation would strengthen the contribution.\n\n- Evaluation is restricted to a single dataset (COD-Cluster17). The method’s robustness on periodic systems (with space groups or PBCs) or polymeric crystals remains untested.\n\n- As acknowledged by the authors, predicted molecular orientations are still inaccurate. This suggests that the new loss mainly improves positional matching rather than full SE(3) consistency.\n\n- Since the method essentially performs one-step regression, it is unclear how it can be extended to generative tasks (sampling novel crystals) that diffusion/flow frameworks target."}, "questions": {"value": "- How sensitive is SinkFast to the regularization coefficient in the Sinkhorn relaxation? Is there a trade-off between permutation smoothness and convergence stability?\n- Could the geometric loss L$_{Geom}$ be combined with the permutation-invariant RMSD loss in a multi-objective setting?\nIf so, does it further improve orientation prediction?\n- Given that the COD-Cluster17 dataset lacks periodic boundary conditions, how would the authors adapt the method to fully periodic crystals (e.g., by including space-group symmetry operators)?\n- The results indicate that flow matching offers limited benefit under proper loss design.\nDo the authors believe flow-based generative models are fundamentally ill-suited for CSP, or merely poorly optimized for rigid-body systems?\n- Can the proposed physically-grounded RMSD loss be generalized to coarse-grained polymer systems or multi-molecule assemblies where internal deformation matters?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "lrgTOtRt73", "forum": "WQsaxpFutF", "replyto": "WQsaxpFutF", "signatures": ["ICLR.cc/2026/Conference/Submission12910/Reviewer_uiSW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12910/Reviewer_uiSW"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12910/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761664052481, "cdate": 1761664052481, "tmdate": 1762923685495, "mdate": 1762923685495, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper diagnoses that current crystal prediction models use flawed, non-permutation-invariant objectives. It introduces a physically-grounded RMSD loss with a differentiable Sinkhorn assignment, which correctly handles molecular equivalence. A simple regression model trained with this new loss outperforms complex flow-matching baselines, demonstrating a 40x+ speedup and proving that the learning objective can be more important than model complexity."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Good diagnosis of the ill-posed, non-permutation-invariant objective as a fundamental flaw in prior work.\n\n2. The proposed solution (rigid-body RMSD loss + Sinkhorn assignment) is an elegant, model-agnostic, and physically-principled fix.\n\n3. The experimental results are striking: a 40x+ speedup while achieving SOTA performance strongly validates the paper's thesis."}, "weaknesses": {"value": "1.  The paper's novelty and workload are limited. The core contribution is the combination of existing techniques (rigid-body RMSD, Sinkhorn) with a reused baseline architecture.\n\n2. This incremental innovation is insufficient to solve the task's core challenges. The method still fails to predict accurate molecular orientations and produces physically implausible structures, indicating a significant gap remains before practical application. \n\n3. The validation is limited to a simplified, non-periodic benchmark (COD-Cluster17), which lacks core crystallographic constraints."}, "questions": {"value": "1. To decouple contributions, what is the performance of the complex AssembleFlow model when trained with your superior $\\mathcal{L}_{RMSD}^*$ loss?\n\n2. The 42x training speedup is a key claim, but flow matching trains by sampling a single time step t, not by iterating all 50 steps (which is only for inference). Can you provide a detailed cost breakdown of the training step (e.g., data interpolation, time embedding) that accounts for this massive 42x overhead compared to simple regression?\n\n3. Why does the new physics-grounded loss still fail to improve rotational prediction? Does this imply an architectural limitation?\n\n4. How would this Sinkhorn assignment framework generalize to a fully periodic system where molecules have infinite translational images?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "8v59gnmh0O", "forum": "WQsaxpFutF", "replyto": "WQsaxpFutF", "signatures": ["ICLR.cc/2026/Conference/Submission12910/Reviewer_Kj9q"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12910/Reviewer_Kj9q"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12910/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761921171069, "cdate": 1761921171069, "tmdate": 1762923685157, "mdate": 1762923685157, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper revisits the problem of non-polymeric crystal structure prediction, where multiple identical molecular components must be assembled into a coherent crystal packing.\nThe authors argue that existing training objectives and evaluation metrics are ill-posed because they assume fixed molecule indices and separate translation and rotation losses that ignore physical symmetries. To address this, they propose a permutation-invariant formulation using differentiable Sinkhorn assignment and introduce physically grounded losses—the rigid-body loss $L_\\text{RMSD}$ and the relative-geometry loss $L_\\text{GEOM}$. Empirical results on the COD-Cluster17 dataset show that these objectives yield comparable or improved performance over tuned flow-matching baselines with simpler, faster training."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. **Metric analysis for indistinguishable components**:  The paper provides a valuable exploration of what constitutes a meaningful metric in systems containing identical molecules (non-polymeric crystals).\nBy analyzing permutation-invariant evaluation schemes ($\\text{PM}$ vs. $\\text{PM}^\\ast$ ), the work clarifies why conventional metrics fail to reflect true structural equivalence.\n\n2. **Re-examination of conventional design choices**: Rather than scaling model complexity, the authors challenge the formulation itself—questioning common practices in flow-matching objectives and ad-hoc loss weighting. Their analysis is problem-oriented and encourages the community to ground objective design in the physics of molecular assembly rather than in architectural novelty.\n\n3. **Physically interpretable and efficient formulation**: The proposed losses $𝐿_\\text{RMSD}$ and $L_\\text{Geom}$ capture rigid-body and pairwise-geometric invariances, respectively, leading to a training setup that is both physically interpretable and computationally efficient. Each term is tied to an intuitive physical transformation—rigid motion or relative molecular arrangement—making the overall formulation easier to reason about. In addition, the explanations and derivations provided in the appendix are clear and well-documented, which should help readers from related areas (e.g., molecular modeling or geometric learning) understand the formulation without requiring extensive background knowledge. Overall, the insight that a well-posed objective can reduce unnecessary modeling complexity is conveyed in a straightforward and accessible way."}, "weaknesses": {"value": "1. **Marginal empirical improvement** : Although the proposed objectives are conceptually sound, the quantitative gains over existing loss (e.g., $L_\\text{ML}$) are minimal. Thus, while the formulation is cleaner, it is not yet clear that it delivers significantly better performance.\n2. **Limited dataset diversity** : All experiments are restricted to COD-Cluster17. Validation on other crystal datasets with different space groups or asymmetric units would strengthen claims of general applicability.\n3. **Overstated general message**: The philosophical conclusion that “proper objective definition simplifies and accelerates learning” is appealing but somewhat broad; empirical evidence remains narrow."}, "questions": {"value": "1. **Model backbone comparison** (1.1)Is the backbone architecture used in SinkFast identical or nearly identical to that of AssembleFlow? (1.2) If so, does SinkFast essentially correspond to training the same model with a permutation-invariant loss (Sinkhorn matching) instead of a flow-matching objective? (1.3) If not, could you report the pure performance of your architecture design? (ex. SinkFast with $L_{\\text{ML}}$).\n\n2. **Applicability of Sinkhorn matching to AssembleFlow** (2.1) Would it be possible to train AssembleFlow itself with a Sinkhorn-based permutation-invariant loss? (2.2) According to the authors, does such a modification yield any improvement, or is it redundant within a flow-matching setup?\n\n3. **Extension to inorganic CSP (e.g., DiffCSP)**: Could a Sinkhorn-based matching loss be applied to inorganic crystal prediction models such as DiffCSP?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "VqxYng9Fu1", "forum": "WQsaxpFutF", "replyto": "WQsaxpFutF", "signatures": ["ICLR.cc/2026/Conference/Submission12910/Reviewer_Bc8u"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12910/Reviewer_Bc8u"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission12910/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761930127124, "cdate": 1761930127124, "tmdate": 1762923684522, "mdate": 1762923684522, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}