{"id": "wr3J8niaos", "number": 8458, "cdate": 1758084584593, "mdate": 1759897782731, "content": {"title": "DyRo-MCTS: A Robust Monte Carlo Tree Search Approach to Dynamic Job Shop Scheduling", "abstract": "Dynamic job shop scheduling, a fundamental combinatorial optimisation problem in various industrial sectors, poses substantial challenges for effective scheduling due to frequent disruptions caused by the arrival of new jobs. State-of-the-art methods employ machine learning to learn scheduling policies offline, enabling rapid responses to dynamic events. However, these offline policies are often imperfect, necessitating the use of planning techniques such as Monte Carlo Tree Search (MCTS) to improve performance at online decision time. The unpredictability of new job arrivals complicates online planning, as decisions based on incomplete problem information are vulnerable to disturbances. To address this issue, we propose the Dynamic Robust MCTS (DyRo-MCTS) approach, which integrates action robustness estimation into MCTS. DyRo-MCTS guides the production environment toward states that not only yield good scheduling outcomes but are also easily adaptable to future job arrivals. Extensive experiments show that DyRo-MCTS significantly improves the performance of offline-learned policies with negligible additional online planning time. Moreover, DyRo-MCTS consistently outperforms vanilla MCTS across various scheduling scenarios. Further analysis reveals that its ability to make robust scheduling decisions leads to long-term, sustainable performance gains under disturbances.", "tldr": "This paper proposes a robust Monte Carlo Tree Search approach for online planning in dynamic job shop scheduling, where the unpredictability of new job arrivals prevents the use of complete problem information during planning.", "keywords": ["Dynamic Job Shop Scheduling", "Monte Carlo Tree Search", "Combinatorial Optimisation", "Genetic Programming", "Reinforcement Learning"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/27f1f20e6cd6c0bfae6735efcae2097762ae6c98.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper proposes DyRo-MCTS, a robust Monte Carlo Tree Search framework for dynamic job shop scheduling (DJSS). It aims to improve online scheduling decisions under uncertain job arrivals by incorporating an action robustness estimation term into the MCTS tree policy. The method estimates robustness through machine idle-time distributions and introduces a DyRo-UCT formula balancing exploitation, exploration, and robustness. Experiments show that DyRo-MCTS improves upon both offline-learned scheduling policies (from DRL and GP) and vanilla MCTS with minimal added computation."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "The paper addresses a practical and important problem—robust online planning in dynamic scheduling—by extending MCTS with a simple, interpretable robustness measure. The formulation is clear and methodologically consistent."}, "weaknesses": {"value": "The novelty of DyRo-MCTS is limited. Integrating a robustness term into MCTS, while intuitively reasonable, constitutes an incremental extension of existing robust scheduling and MCTS formulations. Prior reinforcement learning and online planning studies have already aimed to handle incomplete or uncertain job information, yet related work comparisons are not sufficiently comprehensive. The experiments focus mainly on comparing against vanilla MCTS and lack evaluation against other modern online planning or robust RL approaches. Claims about negligible computation overhead are not quantitatively analyzed beyond MCTS iteration scaling, and no ablation or complexity analysis supports this."}, "questions": {"value": "The study claims to handle online planning under incomplete information, but why are comparisons with other online or robust RL-based planners absent?\n\nThe method states minimal computational cost increase—where is the quantitative evidence or runtime breakdown to substantiate this?\n\nHow does DyRo-MCTS differ conceptually from prior robust MCTS or uncertainty-aware planning approaches?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "PAfsEB4x9F", "forum": "wr3J8niaos", "replyto": "wr3J8niaos", "signatures": ["ICLR.cc/2026/Conference/Submission8458/Reviewer_hkab"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8458/Reviewer_hkab"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8458/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761832837262, "cdate": 1761832837262, "tmdate": 1762920342322, "mdate": 1762920342322, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper augments MCTS for dynamic JSS (with new job arrivals) by adding a robustness score based on integrated idleness to better control weighted tardiness. An offline policy supplies action priors, and partial tree reuse is used to keep per-decision latency low."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The robustness term captures a practical scheduling intuition—discouraging early idle time—that is relevant when arrivals are uncertain and the objective is (weighted) tardiness.\n\nThe method needs minimal additional online planning time."}, "weaknesses": {"value": "The robustness score is heuristic and domain-dependent; there is no theoretical link to optimality or selection consistency.\n\nCoverage of scenario diversity is limited; the paper lacks analysis across varied WIP levels and machine counts.\n\nThe description of tree reuse in a dynamic environment (e.g., around line 248) is insufficient. It is unclear what statistics are retained/reset and whether reuse was actually enabled in experiments."}, "questions": {"value": "1. Do you have a theoretical justification for reusing nodes when the state changes due to new arrivals? Is carrying over statistics from prior rollouts purely pragmatic? What exactly is retained (Q-values, visit counts, priors, normalization ranges), and what is reset?\n2. For the first 1,000 arrivals, are the schedules identical across “w/o online planning”, “vanilla MCTS”, and “DyRo-MCTS”?\n3. What is the typical number of jobs considered per decision during MCTS? Also, can you report results for settings with ≥100 concurrent jobs (WIP level) and ≥10 machines?\n4. With 100 MCTS iterations and non-parallel rollouts, you report that MCTS takes around 0.021 seconds per decision. Are GP (Chen et al., 2025) and DRL (Liu et al., 2023) dispatchers in a similar decision time?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "wQf3ZXsTtY", "forum": "wr3J8niaos", "replyto": "wr3J8niaos", "signatures": ["ICLR.cc/2026/Conference/Submission8458/Reviewer_F8EK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8458/Reviewer_F8EK"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8458/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761870140510, "cdate": 1761870140510, "tmdate": 1762920341973, "mdate": 1762920341973, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper studies a dynamic job shop scheduling problem (with dynamically arriving jobs), and proposes a monte carlo tree search (MCTS) method for online planning. The proposed method DyRo-MCTS integrates action robustness estimation in the tree policy of MCTS. In the experiments, the authors show the DyRo-MCTS outperforms a vanilla MCTS and improves the performance of several offline learned policies."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tPromising performance compared to offline policies and vanilla MCTS\n\n2.\tGood analysis for parameter sensitivity"}, "weaknesses": {"value": "1.\tThe authors review some MCTS applications in scheduling and note that mentioned ones are designed for static JSS. The proposed method differs from those for the targeted dynamic JSS. However, there are existing work on MCTS for dynamic JSSP that the authors may overlook such as [1-6]:\n\n[1] Li, Kexin, et al. \"An effective MCTS-based algorithm for minimizing makespan in dynamic flexible job shop scheduling problem.\" Computers & Industrial Engineering 155 (2021): 107211.\n\n[2] Saqlain, M., S. Ali, and J. Y. Lee. \"A Monte-Carlo tree search algorithm for the flexible job-shop scheduling in manufacturing systems.\" Flexible Services and Manufacturing Journal 35.2 (2023): 548-571.\n\n[3] He, Zhou, et al. \"Enhanced Monte‐Carlo tree search for dynamic flexible job shop scheduling with transportation time constraints.\" Expert Systems 42.2 (2025): e13727.\n\n[4] Kim, Duyeon, and Hyun-Jung Kim. \"Monte Carlo tree search-based algorithm for dynamic job shop scheduling with automated guided vehicles.\" 2022 Winter Simulation Conference (WSC). IEEE, 2022.\n\n[5] Cheng, Yuxia, et al. \"Smart DAG tasks scheduling between trusted and untrusted entities using the MCTS method.\" Sustainability 11.7 (2019): 1826.\n\n[6] Li, Weiguan, Jialun Li, and Weigang Wu. \"A dynamic scheduling algorithm with time varying resource constraints in colocation data centers.\" 2022 13th International Conference on Information and Communication Systems (ICICS). IEEE, 2022.\n\n2. The key contribution of the work is to re-define the exploitation term with the weighted sum of action value and robustness, which brings a limited contribution, given that applying MCTS for dynamic scheduling is not new. \n\n3. In addition, the weighted term looks similar to RAVE [7] and other variants of UCT formula:\n\n[7] Gelly, Sylvain, and David Silver. \"Combining online and offline knowledge in UCT.\" Proceedings of the 24th international conference on Machine learning. 2007. \n\n4. Experiments only compare with offline policies.  Including classic online methods for dynamic scheduling are needed. It is not clear for the DRL baseline, whether the greedy or sampling strategy is used during inference."}, "questions": {"value": "1.\tWhy does DyRo-MCTS allow jobs to be delayed, whereas MCTS does not?\n\n2.\tWhat is the setting (UCT terms?) of vanilla MCTS?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "qJyFMGSXGA", "forum": "wr3J8niaos", "replyto": "wr3J8niaos", "signatures": ["ICLR.cc/2026/Conference/Submission8458/Reviewer_M7jB"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8458/Reviewer_M7jB"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8458/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761999200250, "cdate": 1761999200250, "tmdate": 1762920341523, "mdate": 1762920341523, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes to modify MCTS for the dynamic JSSP so as to improve robustness of the decisions. The robustness is defined as the early idleness of jobs and MCTS combines the usual Q value with robustness. Experiments show that the approach is beneficial and performs better than MCTS with different playout policies."}, "soundness": {"value": 4}, "presentation": {"value": 4}, "contribution": {"value": 4}, "strengths": {"value": "A novel MCTS algorithm for dynamic JSSP\nThe contribution is clear\nGood experimental results"}, "weaknesses": {"value": "No comparison to other Monte Carlo Search algorithms than PUCT."}, "questions": {"value": "When combining with GP do you use the GP policy as the prior in the PUCT formula?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "jZMtbohOMx", "forum": "wr3J8niaos", "replyto": "wr3J8niaos", "signatures": ["ICLR.cc/2026/Conference/Submission8458/Reviewer_YbgJ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8458/Reviewer_YbgJ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8458/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762017700811, "cdate": 1762017700811, "tmdate": 1762920340969, "mdate": 1762920340969, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}