{"id": "XKLPlnfZzM", "number": 24911, "cdate": 1758361832896, "mdate": 1759896742691, "content": {"title": "Learning to Deaggregate: Large-scale Trajectory Generation with Spatial Priors", "abstract": "Generating realistic large-scale trajectories is essential for applications in urban mobility and transportation, yet current generative models either do not offer any controllability or rely on strong sample-specific conditioning. We introduce the Temporal Deaggregation Diffusion Model (TDDM), a hierarchical framework that first represents mobility using spatial priors, which are marginal distributions over geographical occupancy, and then deaggregates them into trajectories. This separation enables generation without sample-specific conditions, supporting transfer to new regions. To support evaluation, we build a benchmark across three cities spanning different continents (Beijing, Porto, San Francisco), with standardized metrics for fidelity and distributional coverage. Across all datasets, TDDM improves trajectory fidelity and coverage over leading baselines, and demonstrates stable performance when applied to unseen cities. By explicitly decoupling spatial allocation from temporal realization, our work highlights the role of spatial occupancy priors in enabling scalable and generalizable trajectory generation.", "tldr": "", "keywords": ["trajectory generation", "deaggregation", "spatial priors", "urban mobility", "diffusion models"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/45dfd52680bd33c4ae1547c0110e64cbc9ce177f.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes TDDM (Temporal Deaggregation Diffusion Model), a novel diffusion-based framework for large-scale, unconditional, and generalizable trajectory generation.\n\nInstead of directly modeling trajectories, TDDM decouples the task into: 1) a spatial occupancy prior H, representing aggregated mobility intensity, and 2) a temporal diffusion model, which learns local motion dynamics in normalized regional coordinates.\n\nA canonicalization module performs similarity transformations (translation–rotation–scaling) to map diverse city regions into a shared local coordinate frame, allowing parameter reuse and cross-city generalization.\nThe spatial prior is represented as a marginal heatmap token sequence conditioning the diffusion model, enabling spatial control while reducing overfitting risks associated with individual trajectory conditioning.\n\nExperiments on three real-world GPS datasets (Beijing, Porto, San Francisco) show consistent improvements over GAN-, VAE-, and prior diffusion-based baselines in distribution alignment (KL, JS), fidelity (Pattern score), and generalization (TSTR).\n\nThe paper includes extensive evaluations, ablation studies, and ethical considerations, and commits to code/data release."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1.\tOriginality:\nThis paper introduces a new decomposition paradigm for trajectory generation (spatial prior + temporal diffusion). The idea of canonicalized spatial conditioning is practically useful for generalization.\n\n2.\tTechnical Quality:\nThe probabilistic formulation is solid; diffusion-based denoising is well implemented. Ablations and quantitative results support the core claims.\n\n3.\tSignificance:\nThis paper addresses a key challenge in human mobility modeling: privacy-constrained data scarcity and cross-domain transfer. TDDM consistently outperforms competing methods across three geographically diverse cities and multiple fidelity metrics, highlighting its strong potential for large-scale synthetic data generation and cross-domain transfer applications.\n\n4.\tClarity:\nLogical flow and clean architecture diagrams aid understanding; mathematical expressions are readable. Well organized supplementary materials include datasets, training details, and comparisons."}, "weaknesses": {"value": "1.\tIntra-city generalization result unexplained:\nThe near-identical results between 25% and 100% training coverage raise concerns of metric insensitivity or sampling bias. The paper should clarify region selection and provide repeated trials or visualizations.\n\n2.\tLack of physical validity evaluation:\nGenerated trajectories are not checked against road networks or obstacles. Thus, “realism” is only statistical, not geometric.\n\n3.\tAblation incompleteness:\nCanonicalization ablation is coarse (all-or-nothing). Intermediate analyses (e.g., removing only rotation/scale) could strengthen causal claims."}, "questions": {"value": "1.\tHow is the 25% subset of intra-city regions selected? Randomly or by spatial clustering? Were multiple subsets tested to ensure robustness?\n\n2.\tHow sensitive are results to the spatial prior resolution (grid size of H)?\n\n3.\tCross-city results are averaged, but the detailed results should be added.\n\n4.\tWhat about the analysis of failure cases (e.g., Porto→SF length error 0.193)?\n\n5.\tCould the authors provide a temporal similarity metric (e.g., DTW, speed KL) to complement spatial fidelity?\n\n6.\tThe paper uses 8-layer Transformers with 500 diffusion steps. As city coverage grows, token count may scale quadratically. Please report per-trajectory inference time (GPU ms) and peak memory.\n\n7.\tWould TDDM generalize to cities with different traffic rules (e.g., left-hand driving in London/Tokyo)?\n\n8.\tWould integrating road network constraints (e.g., via map-based priors) further improve trajectory realism?\n\n9.\tWould integrating more realistic temporal features (e.g., speed, POI) further improve trajectory realism?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "3AVY5gNmQF", "forum": "XKLPlnfZzM", "replyto": "XKLPlnfZzM", "signatures": ["ICLR.cc/2026/Conference/Submission24911/Reviewer_YR6q"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24911/Reviewer_YR6q"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission24911/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761491924397, "cdate": 1761491924397, "tmdate": 1762943241714, "mdate": 1762943241714, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper tackles large-scale trajectory generation when real data are scarce and must generalize to new regions or cities. It introduces the Temporal Deaggregation Diffusion Model (TDDM), which separates “where people appear” from “how they move”: a spatial marginal prior guides a conditional diffusion model that reconstructs realistic time-evolving paths. Space is tiled into fixed-shape subregions and canonicalized via simple similarity transforms so one model can share parameters across different areas; generation becomes a mixture over regions, each conditioned on its local prior and then mapped back to global coordinates. A Transformer denoiser attends jointly to trajectory tokens, prior-map tokens, and diffusion-step tokens so spatial structure can inform every reverse step. Across standardized evaluations on Beijing (Geolife), Porto, and SF Bay (Cabspotting) with uniform preprocessing and diverse metrics, TDDM consistently improves distributional alignment and proportionality, matches or exceeds geometric realism, and shows stronger cross-region and cross-city robustness than GAN/VAE and diffusion baselines."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Original factorization of trajectory generation into a spatial prior (“where”) and temporal diffusion (“how”), avoiding sample-level conditioning.\n\n2. Simple yet powerful region tiling with similarity transforms enables parameter sharing and cross-city generalization.\n\n3. Thorough evaluation across three datasets with unified preprocessing, diverse metrics, and GAN/diffusion baselines.\n\n4. Clear ablations isolating the impact of the spatial prior and region size trade-offs.\n\n5. Practical significance for data-limited urban mobility, more controllable, scalable, and distribution-faithful synthesis."}, "weaknesses": {"value": "1. Strong reliance on the quality of the spatial prior; robustness to sparse or biased priors is underexplored.\n\n2. Preprocessing (1 Hz resampling + map-matching) may leak road constraints; limited analysis of training without map-matching.\n\n3. Canonicalization via a single similarity transform can distort highly anisotropic geographies; no comparison to learned equivariance or multiscale warps.\n\n4. Cross-city transfer still degrades path-length statistics; no targeted remedy (e.g., length regularization/domain adaptation).\n\n5. Diffusion sampling cost and scaling to long trajectories or multi-agent settings are not addressed.\n\n6. Privacy is acknowledged but lacks concrete DP mechanisms or re-identification audits."}, "questions": {"value": "1. The preprocessing applies map-matching; could this leak road-network constraints into the training signal and inflate performance? Please report an ablation with (i) no map-matching and (ii) a weak-matching variant, and quantify each step’s contribution relative to the model itself.\n\n2. To demonstrate that the model truly exploits the spatial prior H, could the authors provide attention heatmaps or attribution analyses showing interactions between H tokens and trajectory tokens? \n\n3. How can the proposed method TDDM be applied to some concrete downstream tasks, like traffic assignment load, congestion proxy, routing robustness?\n\n4. How does TDDM compare to a simpler pipeline, like an unconditional diffusion generator followed by post-hoc spatial reweighting to match the marginal prior H? This comparison would isolate the benefit of injecting the prior during denoising versus applying it after generation."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "pOUIHAgonu", "forum": "XKLPlnfZzM", "replyto": "XKLPlnfZzM", "signatures": ["ICLR.cc/2026/Conference/Submission24911/Reviewer_L1Qa"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24911/Reviewer_L1Qa"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission24911/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761693869532, "cdate": 1761693869532, "tmdate": 1762943241516, "mdate": 1762943241516, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles the problem of trajectory generation by introducing TDDM, a hierarchical framework that leverages spatial priors to represent mobility and subsequently deaggregates them into trajectories. Experiments demonstrate the superiority of TDDM over existing baseline methods."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "S1. This paper investigates the trajectory generation, which seems interesting and practical in real life. \n\nS2. The paper proposes a hierarchical generative framework that separates spatial priors from temporal dynamics for large-scale trajectory generation.\n\nS3. Experiments demonstrate that the proposed model achieves improvements in trajectory fidelity and spatial coverage compared with baselines."}, "weaknesses": {"value": "W1. Novelty: While the paper proposes a hierarchical framework for trajectory generation by separating spatial priors and temporal dynamics, the overall model design is rather straightforward, and the novelty appears limited.\n\nW2. Datasets: The experiments rely solely on taxi trajectory data, which restricts the generalizability of the findings. It is recommended to include additional domains to demonstrate robustness.\n\nW3. Complexity Analysis: The paper lacks a discussion of the model’s time and space complexity.\n\nW4. Efficiency Analysis: Reporting times comparison with baselines would strengthen the experimental evaluation."}, "questions": {"value": "Q1: Some figures (e.g., Figure 2) are not referenced in the text, which affects.\n\nQ2: Would it be more logical to place the overview part at the beginning of the methodology rather than at the end?\n\nQ3: In Section 3, several equations are difficult to follow due to missing definitions—e.g., what does D represent?\n\nQ4: Algorithms 1 and 2 are mentioned but not explained or discussed, making it hard for readers to understand their roles.\n\nQ5: Please enlarge the text in Figure 3 to improve legibility.\n\nQ6: Would it be better to move page 10 to the appendix, given the 9-page main body limit?\n\nQ7: More details on the experimental setup (e.g., server) would enhance reproducibility.\n\nQ8: Tables 1 and 2 are missing bottom borders—please fix for consistency.\n\nQ9: There is only one subsection labeled “Section 3.1”. Should this be merged into Section 3, or are other subsections missing?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PpfKCJCKfk", "forum": "XKLPlnfZzM", "replyto": "XKLPlnfZzM", "signatures": ["ICLR.cc/2026/Conference/Submission24911/Reviewer_9NEn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24911/Reviewer_9NEn"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission24911/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761965113359, "cdate": 1761965113359, "tmdate": 1762943241329, "mdate": 1762943241329, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces the Temporal Deaggregation Diffusion Model (TDDM), a hierarchical framework for generating large-scale, realistic trajectories. The core contribution is the factorization of the generation process: 1. The model first learns a **spatial prior**, $H$, which represents the marginal probability distribution of geographic occupancy. 2.  A conditional diffusion model then \"deaggregates\" this spatial prior, learning $p(x|H)$ to generate full temporal trajectories ($x$) that are consistent with the given spatial distribution.\nTo achieve out-of-distribution (OOD) generalization to new geographical regions, the authors propose a canonicalization technique. This method applies similarity transformations to normalize local spatial regions, allowing the diffusion model to learn spatio-temporal dynamics that are invariant to specific locations or orientations. The authors validate their method on a new benchmark of three large-scale datasets, demonstrating strong performance in both fidelity and OOD generalization compared to existing baselines."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The primary strength of this paper is its novel problem formulation. The factorization of trajectory generation into a spatial prior $p(H)$ and a conditional temporal dynamic $p(x|H)$ is an interesting idea. This deaggregation framework provides a natural mechanism for controllability (by manipulating $H$) and OOD generalization.\n\n2. The paper directly tackles a major weakness of most trajectory generation models: being overfit to a specific city or road network. \n\n3. The authors have constructed a new, large-scale benchmark from three diverse cities (Beijing, Porto, San Francisco) to test their claims. The quantitative results show a clear improvement over the chosen baselines, particularly in the challenging OOD \"city-to-city\" generalization experiments."}, "weaknesses": {"value": "1.  The paper's claim to novelty in controllable generation and OOD generalization is weakened by the omission of several recent and highly relevant works. The current baselines (e.g., TimeGAN, DiffTraj) are not the state-of-the-art in controllable, topology-aware trajectory generation [1] [2]. The core idea of generating data to match a pre-defined utility (in this case, the spatial prior $H$) also shares conceptual similarities with prior work on utility-preserving generation, such as [3], which should be compared.\n\n[1] Cola: Cross-city mobility transformer for human trajectory simulation, the Web Conferece 2024\n[2] Controltraj: Controllable trajectory generation with topology-constrained diffusion model, KDD 24\n[3] Generating mobility trajectories with retained data utility, KDD 2021\n\n2. The OOD experiment, as designed, is insufficient to prove the effectiveness of the proposed techniques. The experiment involves fine-tuning on 25% of the target city's data. This is a very large amount of data for a \"transfer\" task. True OOD generalization should ideally be tested in a zero-shot setting, or at most a few-shot setting (e.g., 1-5% of data). Based on experience with human mobility generation, a standard generative model without any special transfer-learning design could likely achieve strong performance when fine-tuned on 20-25% of the data. Therefore, this experiment fails to demonstrate that the proposed canonicalization method offers any significant advantage over a simple, standard fine-tuning procedure. It cannot be used to validate the paper's central claims of OOD generalization.\n\n3. A core premise of the paper that temporal dynamics (e.g., turning behavior, speed on a straight road) are universal and can be disentangled from the spatial context ($H$) via canonicalization, is a strong and largely unproven assumption. The experiments do not sufficiently rule out a simpler alternative hypothesis: that the model is simply learning a sophisticated \"path-tracing\" function. In this scenario, the OOD performance would be driven almost entirely by the quality of the provided target spatial prior $H$, rather than by the model successfully learning and transferring any truly \"invariant\" temporal dynamics.\n\n4. The methodological novelty of the model architecture itself is limited. The core components, namely a Transformer backbone and a standard DDPM-style denoising loss, are a straightforward application of existing, well-established techniques in the field."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "Imq6LCnLx6", "forum": "XKLPlnfZzM", "replyto": "XKLPlnfZzM", "signatures": ["ICLR.cc/2026/Conference/Submission24911/Reviewer_WVTu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission24911/Reviewer_WVTu"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission24911/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762101844648, "cdate": 1762101844648, "tmdate": 1762943241048, "mdate": 1762943241048, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}