{"id": "xLIH04TAT4", "number": 405, "cdate": 1756738348998, "mdate": 1759898262807, "content": {"title": "AOT*: Efficient Synthesis Planning via LLM-Empowered AND-OR Tree Search", "abstract": "Retrosynthesis planning enables the discovery of viable synthetic routes for target molecules, playing a crucial role in domains like drug discovery and materials design.\nMulti-step retrosynthetic planning remains computationally challenging due to exponential search spaces and inference costs. \nWhile Large Language Models (LLMs) demonstrate chemical reasoning capabilities, their application to synthesis planning faces constraints on efficiency and cost.\nTo address these challenges, we introduce AOT*, a framework that transforms retrosynthetic planning by integrating LLM-generated chemical synthesis pathways with systematic AND-OR tree search.\nTo this end, AOT* atomically maps the generated complete synthesis routes onto AND-OR tree components, with a mathematically sound design of reward assignment strategy and retrieval-based context engineering, thus enabling LLMs to efficiently navigate in the chemical space.\nExperimental evaluation on multiple synthesis benchmarks demonstrates that AOT* achieves SOTA performance with significantly improved search efficiency. \nAOT* exhibits competitive solve rates using 3-5× fewer iterations than existing LLM-based approaches, with the performance advantage becoming more pronounced on complex molecular targets.\nOur code is available at https://anonymous.4open.science/r/AOTstar-31FD/.", "tldr": "", "keywords": ["Retrosynthesis Planning", "AND-OR Tree Search"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a33be3d77e5eabc96a16c9df659bd383dade87ba.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "# Overview\n\nThis paper introduces AOT*, a framework that integrates large language models (LLMs) with an AND–OR tree search for multi-step retrosynthetic planning. The reported results appear promising—AOT* achieves strong performance and efficiency improvements across several benchmarks.\n\nHowever, the manuscript is difficult to follow, even for readers familiar with the retrosynthesis planning literature. The paper reads more like a results report or implementation summary than a coherent research contribution. For example, the abstract claim that AOT* “transforms retrosynthetic planning by integrating LLM-generated synthesis pathways with systematic AND–OR tree search,” but this statement is not well explained in the paper. After reading both the Introduction and Methods sections, it remains unclear what is actually new, what specific problem the method solves (now just retrosynthesis planning).\n\nOverall, I find it difficult to fairly evaluate the contribution of AOT* due to its poor presentation."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "* AOT* achieves top or near-top solve rates across multiple benchmarks and search budgets, outperforming both classical search (MCTS-based) and recent LLM-based baselines.\n* The method shows stable efficiency and cost advantages across diverse LLMs (e.g., GPT-4o, DeepSeek-V3, Claude-Sonnet, Gemini-2.5), demonstrating robustness and practical applicability."}, "weaknesses": {"value": "**1. Ambiguous statement of contributions.**\nThe paper’s listed “threefold contributions” in introduction are ambiguous. Only the first point, which introduces AOT* as a framework that integrates LLM-generated synthesis pathways with an AND–OR tree search, corresponds to a methodological contribution, but even this part is described at a high level without clearly defining what is technically new about the integration.\nThe other two points mainly emphasize performance gains and robustness across models, which are valuable but do not substitute for a clear methodological innovation. As a result, it is difficult for readers to precisely identify what aspect of the proposed framework is novel or how it differs in substance from existing LLM-guided retrosynthesis or tree-search methods.\n\n**2. The introduction is overly abstract and lacks concrete grounding.**\nThe introduction presents the motivation and claimed innovation in highly abstract terms, making it difficult for readers to understand the actual problem being solved or the mechanism behind the proposed approach. For instance, the authors write that\n```\nHowever, extending these successes to practical multi-step synthesis planning remains challenging\ndue to the computational expense of LLM inference, limited search efficiency with constrained\niteration budgets, and the difficulty of incorporating chemical knowledge into the search process\neffectively... The key innovation of AOT* lies in its systematic\nintegration of pathway-level LLM generation with AND-OR tree search, where complete synthesis\nroutes are atomically mapped to tree structures, enabling efficient exploration through intermediate\nreuse and structural memory that reduces search complexity while preserving the strategic coherence\nof generated pathways.\n```\nWhile this description sounds ambitious, it remains conceptually vague. It is not explained how integrating pathway-level generation with an AND–OR tree concretely alleviates the high inference cost of LLMs, improves search efficiency under budget constraints, or incorporates chemical knowledge more effectively. As a result, the introduction fails to establish a coherent causal link between the stated limitations and the proposed framework, leaving readers uncertain about the true novelty or mechanism of AOT*.\n\n**3. Missing ablation on core methodological components.**\nAlthough the paper includes ablation analyses on hyperparameter sensitivity and RAG sample–token trade-offs, these studies focus mainly on parameter tuning rather than validating the contribution of the proposed algorithmic components. The reader cannot tell which parts of AOT* are responsible for the reported performance gains.\nThere is no ablation or comparison that isolates the impact of the key design elements that are claimed to be new — for example, the pathway-to-tree mapping, the UCB-based exploration scheme, or the composite reward formulation. Without such experiments, it is difficult to assess whether these components introduce genuine novelty or if the improvements stem primarily from stronger LLMs and prompt engineering."}, "questions": {"value": "1. Can you define what is the \"LLM-generated chemical synthesis pathways\" mentioned in the abstract?\n2. What is the key challenge?\n3.  Which parts of the method are new in the paper? How these parts deal with the challenge?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hUxg9g9dhf", "forum": "xLIH04TAT4", "replyto": "xLIH04TAT4", "signatures": ["ICLR.cc/2026/Conference/Submission405/Reviewer_ZZ8L"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission405/Reviewer_ZZ8L"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission405/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761709119393, "cdate": 1761709119393, "tmdate": 1762915512534, "mdate": 1762915512534, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces AOT*, a framework designed to enhance the efficiency of multi-step retrosynthesis planning. The core contribution is the integration of Large Language Models (LLMs) with a systematic AND-OR tree search. The method utilizes an LLM to generate complete, multi-step synthesis routes for a given molecule. These entire pathways are then atomically mapped onto the AND-OR tree structure, which enables systematic exploration and the crucial reuse of common intermediates across different proposed routes. Experimental results demonstrate that AOT* achieves state-of-the-art solve rates with a 3-5x improvement in search efficiency compared to contemporary LLM-based approaches that rely on evolutionary search."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "- The paper's main strength lies in its clever combination of the holistic planning capabilities of LLMs with the rigorous, memory-efficient search of a classical AND-OR tree. This hybrid approach effectively leverages the strengths of both components.\n- The 3-5x reduction in search iterations required to find a solution is a substantial and practical contribution. The framework's inherent ability to reuse intermediates directly addresses a key source of inefficiency in unstructured search methods.\n- The experiments are exceptionally thorough. The validation of the framework's effectiveness across 11 different LLMs convincingly demonstrates that the algorithmic gains are model-agnostic. The detailed ablation studies and difficulty-stratified analyses further solidify the paper's claims."}, "weaknesses": {"value": "- The framework's performance may be fundamentally tied to the quality of the initial LLM-generated pathways. The paper could benefit from a more detailed analysis of the search algorithm's behavior and recovery mechanisms when the LLM produces a high rate of invalid or low-quality routes.\n- The reliance on a template-based reaction validator ensures chemical correctness but also constrains the search to known chemical transformations. This limits the potential for discovering entirely novel synthetic pathways not covered by the template database.\n- The \"complete pathway generation\" strategy is effective on the tested benchmarks, but its scalability to targets requiring exceptionally long synthetic sequences (e.g., >15-20 steps) is not fully explored. The quality of a single, coherent generation from an LLM might degrade for such long planning horizons."}, "questions": {"value": "- Have you considered an alternative expansion strategy where the LLM generates shorter, fixed-length sub-pathways (e.g., 3-5 steps) instead of a \"complete\" route? Could this offer a better balance between LLM's strategic guidance and the search algorithm's flexibility for more complex targets?\n- Could you provide statistics on the raw output from the LLM? Specifically, what is the typical success rate and step number of pathways passing the template-based validation? This would offer a clearer insight into the generation quality and the workload handled by the validation and search components.\n- Regarding the Retrieval-Augmented Generation (RAG) component, the current approach retrieves the most similar synthesis examples. Have you investigated the impact of retrieving a more diverse set of examples (e.g., using different reaction types, even if Tanimoto similarity is slightly lower) to potentially expose the LLM to a broader range of strategic disconnections?\n- The paper compellingly demonstrates superior iteration efficiency. However, an \"iteration\" in AOT* (involving a computationally expensive LLM API call) and an iteration in the baseline methods (e.g., a single forward pass of a smaller model) likely represent vastly different amounts of wall-clock time. To provide a more direct comparison of overall computational efficiency:\n  - Could the authors report the average time per iteration for AOT* and the key baselines, along with the specifications of the computational platform (CPU/GPU) used?\n  - Furthermore, to make a fairer comparison, have you considered running an experiment under a fixed computation budget? For instance, allowing the baseline methods to run for a significantly higher number of iterations such that their total computation cost matches that of AOT* (e.g., at N=100), and then comparing the final solve rates. This would offer a crucial perspective on which approach is more effective given the same amount of computation cost. For the computation budget, it could be measured in monetary terms, assuming all methods are run on standardized machines rented from a cloud provider (e.g., AWS, Azure, GCP), with either CPU or GPU instances as required. The total cost would be the sum of the machine rental fee (runtime multiplied by the instance price) and, for the LLM-based methods, the total cost of the API calls."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "dkZbsoYF1Y", "forum": "xLIH04TAT4", "replyto": "xLIH04TAT4", "signatures": ["ICLR.cc/2026/Conference/Submission405/Reviewer_f8dE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission405/Reviewer_f8dE"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission405/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761768868754, "cdate": 1761768868754, "tmdate": 1762915512395, "mdate": 1762915512395, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces AOT*, a novel framework designed to enhance the efficiency of multi-step retrosynthesis planning by leveraging the chemical reasoning capabilities of Large Language Models (LLMs). AOT integrates LLM-generated complete synthesis pathways with a systematic AND-OR tree search."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "According to the authors, the advantages are: SOTA on multiple synthesis benchmarks Performance; Computational efficiency (lower complexity) comparing to existing LLM-based approaches; Capability for complex molecular targets; Can be combined to any general LLM.\n\nThe paper is well written and I really like the figures. The innovative formulation of the problem is clearly delivered: it atomically maps the LLM-generated complete synthesis routes onto AND-OR tree components."}, "weaknesses": {"value": "I am so sorry, I am not an expert in this area."}, "questions": {"value": "I understand that this task is intrinsically hard. May I ask if this method generates complicated chemicals that inspire research?\n\nMy understanding is that the LLM is not trained on chemical data but only on language data. What is the intuition that LLM transfers its knowledge to such a different area, without finetuning?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "YvHEsgCv84", "forum": "xLIH04TAT4", "replyto": "xLIH04TAT4", "signatures": ["ICLR.cc/2026/Conference/Submission405/Reviewer_6pLX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission405/Reviewer_6pLX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission405/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761891467994, "cdate": 1761891467994, "tmdate": 1762915512034, "mdate": 1762915512034, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Authors propose a framework to use LLMS for synthesis planning. The key contribution from the paper is the mapping from a synthetic plan into a structured AND-OR representation. In this framework, LLMS are used only at the generation stage for applying single step transformations, this is then mapped into the AND-OR structured and expansions are selected using UCB criteria. \nThey use several techniques like RAG to improve performance and tun thorough evaluations on multiple public benchmarks."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Good and thorough evaluation on multiple benchmarks showing that this method can overperform other baselines in the literature. A lot of ablations that show the individual contibution of each component."}, "weaknesses": {"value": "As I understand, the method relies on the LLMs to generate the molecule smiles and thus the chemical tranformations. This makes it a template free method and brings the question of what is the chemical validity of the proposed reactions. \nThe authors should discuss some specific examples and explore if the proposed reactions are chemically sensible. \nThere's also severals ways of doing this in large benchmark-scale as well:\nUse atom-mapping tools or reaction analysis tools to discover if the proposed reactions are valid or not, or analize what reaction types are proposed?\n\n- The use of RAG always bring the question of data leakage. This is a sensible topic that was not discussed on the paper. Given how much a performance gain RAG brings, even with only one sample, it makes sense to further study the reasons behind such a performance boost. Two possible ideas are:\n1. Randomize the reactions given to the LLM, and measure performance. By doing this, authors could prove that the data being given as part of the RAG is indeed useful, and the boost is not due to some artifact of prompting. \n2. A more controlled variation of this would be to fix the retrieved samples to the same set. This converts RAG into in-context learning and it works also as a good ablation.\n\n-Analyze the overlap between the datasets being used for retrival, and the molecules and reactions in the benchmark. \n- Use out of distribution examples and analyze then manually, showing actual molecular depictions so that it becomes more transparent for readers if the chemistry actually makes sense, beyond simple solve rates."}, "questions": {"value": "See the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eYaVZL2BhT", "forum": "xLIH04TAT4", "replyto": "xLIH04TAT4", "signatures": ["ICLR.cc/2026/Conference/Submission405/Reviewer_tQzg"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission405/Reviewer_tQzg"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission405/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762122294878, "cdate": 1762122294878, "tmdate": 1762915511846, "mdate": 1762915511846, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "General Response (1/3)"}, "comment": {"value": "We sincerely thank all reviewers for their time and insightful feedback. We are encouraged that reviewers found our experimental evaluation to be \"good and thorough\" (tQzg, f8dE), our problem formulation \"innovative\" (6pLX), and our efficiency gains \"substantial and practical\" (f8dE). We have carefully considered all comments and believe they will help us significantly improve the clarity and impact of our paper.\n\nWe will first address some central themes and common questions raised by the reviewers, including clarifying our core contributions, addressing a key misunderstanding about chemical validation, and discussing the unique challenges of multi-step synthesis planning.\n\n**1. Core Contribution: Bridging LLM Reasoning with Systematic Search**\n\nSeveral reviewers (notably ZZ8L and f8dE) asked for a clearer articulation of our core technical novelty. We apologize if this was not sufficiently clear and would like to re-emphasize it here.\n\n**The long-standing challenge** in multi-step retrosynthesis is the combinatorial explosion of the search space. Traditional search methods build the synthesis plan one step at a time, which is methodical but lacks strategic foresight. Recent LLM-based planners (e.g., LLM-Syn-Planner) leverage the remarkable chemical reasoning of LLMs to generate *entire* synthesis pathways at once. However, they typically use unstructured search methods like evolutionary algorithms. This approach is inefficient because it treats each candidate pathway in isolation, failing to learn from common sub-problems. It repeatedly re-discovers routes to common chemical intermediates, wasting expensive LLM inference calls.\n\n**Our key innovation and contribution** is a framework that resolves this tension. AOT* is the first to synergistically integrate **holistic, multi-step pathway generation** from LLMs with the **systematic, memory-based exploration** of a classical AND-OR tree search. The novelty lies in the **atomic mapping** of entire, coherent synthesis plans generated by the LLM onto the tree structure.\n\nThis is fundamentally different from prior work:\n\n- Unlike traditional methods (e.g., Retro*) that use a neural network as a simple one-step predictor, we use the LLM for its strategic, multi-step planning capability.\n- Unlike other LLM planners (e.g., LLM-Syn-Planner), we don't discard the rich structural information of the search space. The AND-OR tree acts as a \"memory\", allowing AOT* to **cache and reuse successful routes** (i.e., solved intermediates) across all explored branches.\n\nThis hybrid approach directly addresses the core challenge: it leverages the LLM's chemical intelligence to make large, strategic leaps in the search space, while the tree structure ensures the search is systematic, avoids redundant work, and efficiently builds upon past discoveries. This synergy is the engine behind the 3-5x efficiency gains we demonstrate.\n\n**2. A Critical Clarification: Ensuring Chemical Validity**\n\nReviewer **tQzg** raised a crucial point about the chemical validity of the reactions, operating under the assumption that our method was \"template free.\" We apologize for the confusion and would like to clarify this critical point: **Our framework is not template-free.**\n\nAs detailed in Section 3.3.1 and Appendix B.1.4, every single reaction in an LLM-generated pathway undergoes a rigorous **template-based validation process**. We match each proposed transformation against a database of over 270,000 known reaction templates derived from the USPTO dataset. A reaction is only accepted and added to the AND-OR tree if it corresponds to a known, valid *chemical transformation*. This grounding step is essential to our method; it constrains the LLM's creativity to the space of established chemistry, preventing hallucinated or chemically invalid steps and ensuring the final synthesis plans are sound."}}, "id": "zXjQbsehl4", "forum": "xLIH04TAT4", "replyto": "xLIH04TAT4", "signatures": ["ICLR.cc/2026/Conference/Submission405/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission405/Authors"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission405/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763322735912, "cdate": 1763322735912, "tmdate": 1763322928613, "mdate": 1763322928613, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}