{"id": "XLLGiqbUQR", "number": 12658, "cdate": 1758209337459, "mdate": 1759897495590, "content": {"title": "Lightweight MSA Design Advances Protein Folding From Evolutionary Embeddings", "abstract": "Protein structure prediction often hinges on multiple sequence alignments (MSAs), which underperform on low-homology and orphan proteins. We introduce PLAME, a lightweight MSA design framework that leverages evolutionary embeddings from pretrained protein language models to generate MSAs that better support downstream folding. PLAME couples these embeddings with a conservation–diversity loss that balances agreement on conserved positions with coverage of plausible sequence variation. Beyond generation, we develop (i) an MSA selection strategy to filter high-quality candidates and (ii) a sequence-quality metric that is complementary to depth-based measures and predictive of folding gains.\nOn AlphaFold2 low-homology/orphan benchmarks, PLAME delivers state-of-the-art improvements in structure accuracy (e.g., lDDT/TM-score), with consistent gains when paired with AlphaFold3. Ablations isolate the benefits of the selection strategy, and case studies elucidate how MSA characteristics shape AlphaFold confidence and error modes. Finally, we show PLAME functions as a lightweight adapter, enabling ESMFold to approach AlphaFold2-level accuracy while retaining ESMFold-like inference speed. PLAME thus provides a practical path to high-quality folding for proteins lacking strong evolutionary neighbors.", "tldr": "", "keywords": ["Deep learning", "MSA generation", "Protein structure prediction", "Protein language model"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/190d38544abbfbce39e7f8fab6683f18740c338e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes PLAME, a lightweight framework for synthetic multiple sequence alignment (MSA) generation to improve protein structure prediction when few natural homologs are available.\nPLAME encodes each query sequence using ESM-2 embeddings and then autoregressively generates virtual MSAs in the embedding space.\nThe model is trained with a conservation–diversity loss that balances fidelity and entropy, and a filtering module, HiFiAD, selects high-fidelity alignments based on BLOSUM recovery and diversity thresholds.\n\nThe generated MSAs are fed into AlphaFold2 and AlphaFold3.\nOn curated low-homology benchmarks, the method shows moderate improvements in pLDDT, GDT, and TM-scores over baselines such as EvoDiff, MSAGPT, and DHR, while being computationally efficient.\nThe authors present PLAME as a lightweight adapter narrowing the gap between ESMFold and AF2-level accuracy."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. Addresses an important limitation: lack of MSAs for low-homology proteins.\n\n1. Introduces a clear conservation–diversity objective and a simple selection module (HiFiAD).\n\n1. Evaluated on multiple structure predictors and standard benchmarks.\n\n1. Offers practical computational efficiency compared with traditional MSA search.\n\n1. Provides some transparency through ablations and limitations discussion."}, "weaknesses": {"value": "1. Methodological risk — unverified AI-generated data (major).\n   PLAME uses embeddings from a pre-trained model (ESM-2) as the only source of evolutionary signal.\n   These are AI-generated, unvalidated representations but are treated as if they contained true biological information.\n   This undermines methodological soundness and risks propagating training-set biases.\n\n1. Experimental results show that PLAME does not always outperform baselines; in several targets, accuracy decreases.\n   This suggests that the ESM-2 embeddings may introduce noise that confuses downstream folding rather than improving it.\n\n1. The authors do not report co-evolutionary metrics (e.g., contact precision, MI) to confirm that synthetic MSAs carry meaningful structure information.\n\n1. Missing confidence intervals, random-seed reporting, and code-release details.\n\n1. Efficiency claims are based on a single example; full end-to-end runtime is not provided."}, "questions": {"value": "1. How do the authors justify this model-on-model design from a biological perspective? Is it scientifically reliable to use unverified embeddings from one AI model as evolutionary data for another?\n\n1. What evidence demonstrates that ESM-2 embeddings capture genuine evolutionary couplings rather than statistical priors learned from UniRef50?\n\n1. Have you tried replacing ESM-2 with random or untrained protein language models to evaluate whether the observed gains arise from real biological information or simply from the modeling bias of ESM-2?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "aFKmKKHHKL", "forum": "XLLGiqbUQR", "replyto": "XLLGiqbUQR", "signatures": ["ICLR.cc/2026/Conference/Submission12658/Reviewer_vcZG"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12658/Reviewer_vcZG"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission12658/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761747997555, "cdate": 1761747997555, "tmdate": 1762923498469, "mdate": 1762923498469, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Protein structure prediction heavily relies on evolutionary information from multiple sequence alignment (MSA). However, traditional MSA methods underperform in low-homology and orphan proteins due to insufficient evolutionary signals. This limitation restricts structural biology applications in drug design and functional studies, particularly when dealing with proteins lacking clear evolutionary neighbors. Current approaches face two critical challenges: First, supervised bias, methods trained on existing MSA databases tend to favor highly homologous families, making them unsuitable for low-homology and orphan proteins. Second, weak alignment-folding correlation, the lack of lightweight metrics to directly link MSA characteristics with folding outcomes results in generated targets that may not effectively improve structural accuracy. Additionally, high computational costs and limited generalizability hinder further optimization.\nThis study proposes a lightweight multiple sequence alignment (MSA) framework, PLAME, which leverages pre-trained protein language models with evolutionary embeddings to generate high-quality MSA. This approach significantly improves structural prediction accuracy for low-homology and orphan proteins."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1.This study addresses MSA design, a crucial aspect of protein structure prediction. The research demonstrates thorough motivation, theoretical analysis, and comprehensive experiments, with the paper presenting a well-founded and complete work.\n2.The experimental results shows superior performance on multiple tasks and baseline models.\nWeakness"}, "weaknesses": {"value": "1.The proposed combined loss function is well theoretically motivated, however, it still lacks ablation study on different loss functions, since it is a proposed method in your study.\n2.Similarly, I wonder the effectiveness of the MSA selection module. It would be better to include more ablation study."}, "questions": {"value": "Please refer to the weakness part."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "C6QNoQievO", "forum": "XLLGiqbUQR", "replyto": "XLLGiqbUQR", "signatures": ["ICLR.cc/2026/Conference/Submission12658/Reviewer_NpBv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12658/Reviewer_NpBv"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission12658/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761807463707, "cdate": 1761807463707, "tmdate": 1762923498162, "mdate": 1762923498162, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes an MSA design framework to generate MSAs that better support downstream folding, especially low-homology or orphan proteins. The core idea is to produce sequences that trade off conservation (agreeing with strongly conserved positions) and diversity (covering plausible variation), controlled by a conservation-diversity loss operating on PLM embeddings by a base MSA Transformer. Experiment results show that PLAME can produce MSAs that improve downstream folding performance compared to Alphafold2."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper addresses an important problem of improving MSAs for low homology cases. \n\n2. The proposed conservation–diversity objective is both intuitive and theoretically justified."}, "weaknesses": {"value": "1.  The notations are not clear.\n\n  (1) The meaning for different dimensions in $ \\mathbf{H}_\\mathrm{enc} $ is not given (except $N$ has been introduced before in L135). \n\n  (2) Eq (5) does not specify which one was encoded from $\\mathbf{H}_r$. \n\n  (3) Which two axes are permuted in $\\mathbf{X}_\\mathrm{dec} ^\\top $ ?\n\n  (4) MSAs were denoted by $ \\mathbf{M} $ in L135, while in L238, they were denoted by $M={m_1, \\cdots, m_n}$.\n\n2. The rationale of the proposed MSA selection method is not sufficiently justified. The current Section 2.4 describes what HiFiAD does, but not why it makes sense and how it differs from previous selection methods. In addition, the efficacy claim of HiFiAD needs more evidence. Only results with HiFiAD are reported (Table 2). The baseline for only EvoDiff/MSAGPT/DHR is missing.  Details for similarity-based methods (Top/Down-Rec) are missing.\n\n3. The sensitivity of the conservation-diversity tradeoff in Eq. (14) is unknown.\n\n4. Comparison to standard MSA pipelines. The paper should show head-to-head results on the same folding stack when fed (1) raw database MSA, (2) database MSA augmented with PLAME sequences, and (3) PLAME-only MSA for low-homology targets."}, "questions": {"value": "Please refer to the weakness section for my questions."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "VlBg0Saj5j", "forum": "XLLGiqbUQR", "replyto": "XLLGiqbUQR", "signatures": ["ICLR.cc/2026/Conference/Submission12658/Reviewer_n8Yd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission12658/Reviewer_n8Yd"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission12658/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762036241717, "cdate": 1762036241717, "tmdate": 1762923497888, "mdate": 1762923497888, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}