{"id": "xmlbDYVkWJ", "number": 20390, "cdate": 1758305433547, "mdate": 1759896980152, "content": {"title": "Scalable Generative Modeling of Protein Ligand Trajectories via Graph Neural Diffusion Networks", "abstract": "Modeling protein–ligand dynamics over long timescales is essential for drug discovery yet remains challenging in large biomolecular systems. We propose HemePLM-Diffuse, a generative framework that combines Graph Neural Networks, cross-attention, and diffusion models to simulate protein–ligand interactions with atomic-level fidelity. The method employs SE(3)-invariant graph representations to preserve molecular geometry and a time-aware cross-attention mechanism to capture context-dependent interactions between proteins and ligands. A diffusion-based generative process models stochastic motion, enabling trajectory forecasting and ligand fragment inpainting.HemePLM-Diffuse scales efficiently to systems exceeding 10,000 atoms while maintaining structural accuracy. On the 3CQV HEME system, it surpasses leading methods, including TorchMD-Net, MDGen, and Uni-Mol, in trajectory prediction and transition path sampling . By integrating geometry-aware graph learning with generative diffusion, HemePLM-Diffuse provides a scalable alternative to molecular dynamics, advancing data-driven approaches for drug design and protein function analysis.", "tldr": "A scalable generative framework combining protein language models and diffusion models to simulate protein-ligand dynamics in large biomolecular systems.", "keywords": ["Protein–ligand dynamics", "Drug discovery", "Graph Neural Networks", "Cross-attention", "Diffusion models", "SE(3)-invariance", "Generative modeling", "Molecular simulation", "Trajectory prediction", "Transition path sampling"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/23f0b817274548ea9b516b5a1e016406a02259db.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper presents HemePLM-Diffuse, a scalable generative framework for protein–ligand dynamics simulation that integrates SE(3)-invariant graph neural networks, time-aware cross-attention, and diffusion-based generative modeling.\n\nThe model represents proteins and ligands as bipartite SE(3)-equivariant graphs and learns to denoise molecular configurations through a diffusion process. A time-indexed cross-attention mechanism captures bidirectional interactions between protein residues and ligand atoms.\n\nThis architecture supports trajectory forecasting, transition path sampling, and ligand fragment inpainting, treating molecular dynamics as a “generative video” in 3D."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "Combines geometric GNNs, temporal attention, and diffusion into a single differentiable framework for large-scale molecular trajectory generation.\n\nThe idea of unifying multiple downstream tasks, such as trajectory continuation, path sampling, and ligand fragment inpainting, is generally refreshing, though more details are needed for readers to fully understand them."}, "weaknesses": {"value": "The main issue with the paper lies in its poor presentation quality, with inconsistent spacing between characters and symbols, duplicated related work sections, and missing technical details on the downstream applications (trajectory continuation, path sampling, and ligand fragment inpainting), making it difficult to follow.\n\nMoreover, the related work discussion is incomplete: while the authors mention MDGen and AI2BMD, many other relevant deep learning–based approaches are omitted, resulting in an unbalanced and shallow literature review."}, "questions": {"value": "NA"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "lFVORVBVQ2", "forum": "xmlbDYVkWJ", "replyto": "xmlbDYVkWJ", "signatures": ["ICLR.cc/2026/Conference/Submission20390/Reviewer_ddcf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20390/Reviewer_ddcf"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20390/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761030901996, "cdate": 1761030901996, "tmdate": 1762933838771, "mdate": 1762933838771, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes HemePLM-Diffuse, a protein–ligand trajectory generator that combines an SE(3)-invariant GNN, a time-aware cross-attention module between protein and ligand nodes, and a diffusion process trained on MD trajectories. Claimed capabilities include forecasting trajectories, transition-path sampling, and ligand-fragment inpainting, with scale “beyond 10,000 atoms.” Results are summarized on a small collection (Ethanol, Alanine, Chignolin) and a HEME–protein (3CQV) case, with scatter plots of predicted vs. true energy/forces and brief baseline mentions (TorchMD-Net, MDGen, Uni-Mol)."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The paper addresses the important and challenging problem of accelerating molecular dynamics simulations for large-scale protein-ligand systems. The high-level idea of combining equivariant GNNs with generative diffusion models is a relevant and active area of research for this problem."}, "weaknesses": {"value": "The paper's entire premise is the \"Generative Modeling of Protein Ligand Trajectories.\" However, the results section (Section 5) provides zero evidence of this capability.\n\nAll figures (Figs 2-5) and metrics (Sec 5.1, 5.6) are exclusively for static energy and force prediction, not dynamics or trajectories.\n\nThere are no trajectory plots, no RMSD-over-time analysis, no free energy surface comparisons, and no validation of transition paths.\n\nThe model's claimed ability to perform \"trajectory forecasting\" and \"ligand fragment inpainting\" (Sec 5.7) is asserted without any supporting data, plots, or metrics.\n\nClaims of outperforming baselines like MDGen and Uni-Mol (Sec 5.8) are made without a single comparative metric or table.\n\nThe paper's claims on its key \"scalability\" contribution are completely incoherent.\n\nThe paper demonstrates a severe lack of care. Section 2 (\"Related Work\") and Section 3 (\"Related Work\") are identical, verbatim copies of each other. This is a disqualifying error on its own.\n\nContradictory and Poorly Reported Results: The few results that are presented are internally inconsistent."}, "questions": {"value": "This paper requires a major overhaul. Given the fundamental issues, I ask the authors to sincerely revise their work for a future submission, as this manuscript is not ready for publication at this conference."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "VV9kzRbRM4", "forum": "xmlbDYVkWJ", "replyto": "xmlbDYVkWJ", "signatures": ["ICLR.cc/2026/Conference/Submission20390/Reviewer_DH2H"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20390/Reviewer_DH2H"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20390/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761701671185, "cdate": 1761701671185, "tmdate": 1762933838294, "mdate": 1762933838294, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper clearly points out the challenges molecular dynamics (MD) simulations face when dealing with large biomolecular systems and long biological timescales. It proposes a novel generative framework called HemePLM-Diffuse, which extends the MDGen architecture to handle larger and more complex biomolecular systems. The model achieves promising performance in predicting the system’s energies and force fields."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "1. The motivation is  rational.\n2. The work extends the MDGen architecture to handle larger and more complex biomolecular systems."}, "weaknesses": {"value": "1. The paper claims to surpass leading methods, including TorchMD-Net, MDGen, and Uni-Mol, in trajectory prediction and transition path sampling. However, it does not provide clear or quantitative comparative results to substantiate this claim.\n2. The paper has significant writing issues. Section 4 is logically disorganized, and the first two paragraphs of Section 4.1 are highly repetitive. The core contribution of the model is not clearly emphasized, and the authors fail to properly explain how the energy and force estimations are obtained.\n3. The numerical results reported in Sections 5.1 and 5.6 are completely inconsistent, making it impossible to assess the validity of the model.\n4. The paper repeatedly emphasizes that the proposed model is specifically designed for large-scale systems and can be extended to systems with more than 10,000 atoms. However, all the quantitative and visual results are based on very small molecules. There is no evidence in the manuscript to support its central claim of scalability."}, "questions": {"value": "The same as Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "LVRxK54jMH", "forum": "xmlbDYVkWJ", "replyto": "xmlbDYVkWJ", "signatures": ["ICLR.cc/2026/Conference/Submission20390/Reviewer_YJXo"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20390/Reviewer_YJXo"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20390/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761819418602, "cdate": 1761819418602, "tmdate": 1762933837894, "mdate": 1762933837894, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper purports to describe a generative model for protein-ligand trajectories. What is actually presented are minimal results on an energy/force prediction discriminative model."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "Scalable generative modeling of protein ligand trajectories is an important problem."}, "weaknesses": {"value": "The claims of this paper are not supported by the results, many of which are absent or underspecified.  It seems that what was trained was a model to predict energies and forces (Fig 1).  Minimal results (10 ligands) are provided.  Training data, model architecture, and training algorithms are all underspecified.  There are issues with the flow and writing of the paper (e.g. the related work section is duplicated).  \n\nThis work is not ready for publication."}, "questions": {"value": "How does the model described in Figure 1 achieve the stated goals of the paper of performing trajectory generation?  What is the training data? How is the Pearson correlation between predicted and reference trajectories calculated?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "vv7AjrVTxu", "forum": "xmlbDYVkWJ", "replyto": "xmlbDYVkWJ", "signatures": ["ICLR.cc/2026/Conference/Submission20390/Reviewer_TuVt"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20390/Reviewer_TuVt"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20390/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761921602314, "cdate": 1761921602314, "tmdate": 1762933837333, "mdate": 1762933837333, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}