{"id": "XNYPgC5NoM", "number": 20863, "cdate": 1758311107374, "mdate": 1759896954733, "content": {"title": "Convergence dynamics of Agent-to-Agent Interactions with Misaligned objectives", "abstract": "We develop a theoretical framework for agent-to-agent interactions in multi-agent scenarios. We consider the setup in which two language model based agents perform iterative gradient updates toward their respective objectives in-context, using the output of the other agent as input. We characterize the generation dynamics associated with the interaction when the agents have misaligned objectives, and show that this results in a biased equilibrium where neither agent reaches its target - with the residual errors predictable from the objective gap and the geometry induced by the prompt of each agent. We establish the conditions for asymmetric convergence and provide an algorithm that provably achieves an adversarial result, producing one-sided success. Experiments with trained transformer models as well as GPT$5$ for the task of in-context linear regression validate the theory. Our framework presents a setup to study, predict, and defend multi-agent systems; explicitly linking prompt design and interaction setup to stability, bias, and robustness.", "tldr": "", "keywords": ["Agent-to-Agent dynamics", "Multi-agents", "White-box attack", "Convergence Dynamics"], "primary_area": "learning theory", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/f74aff907e3237f219b58ee279da0530aa55cbe0.pdf", "supplementary_material": "/attachment/6fc699c6f81b1f147e520cd1761c7e5c2eedcd45.zip"}, "replies": [{"content": {"summary": {"value": "This paper presents a theoretical framework to analyze the interaction dynamics between two language model-based agents.  It models the agent-to-agent interaction as an alternating optimization process, where each agent performs an in-context gradient update towards its own, potentially misaligned, objective.  The authors provide a formal characterization of the convergence dynamics, showing that misaligned objectives result in a biased equilibrium where neither agent fully achieves its goal.  The framework predicts these residual errors based on the objective gap and the geometry induced by each agent's prompt.  Furthermore, the paper establishes the conditions for asymmetric convergence and proposes a constructive, white-box adversarial attack that allows one agent to achieve its objective while forcing the other to retain a persistent error.  These theoretical results are validated with experiments on in-context linear regression tasks using both trained transformer models and GPT-5."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper offers a clean and analytically grounded model of in-context optimization between interacting agents.\n\n2. The theoretical results (Propositions 1–3) are mathematically sound and provide clear geometric intuition for asymmetric convergence.\n\n3. The analysis extends the “transformers-as-optimizers” view to a two-agent setting, which is conceptually novel and well aligned with the learning theory track."}, "weaknesses": {"value": "1. The paper’s core theory assumes transformers implement in-context gradient-like updates (the “transformers-as-optimizers” view) and then analyzes coupled update dynamics under that assumption. However, the GPT-5 experiments do not test emergent in-context optimization — they prompt the model with the explicit gradient formula and treat GPT-5 as an arithmetic oracle. This weakens the experimental link to the paper’s foundational claim: the GPT-5 results demonstrate correct formula execution, not that modern LLMs naturally realize the assumed optimizer dynamics.\n\n2. Figure 3 reports attack success rates using thresholds ε₁ and ε₂, but the manuscript never specifies these threshold values or how they were chosen. Without concrete ε values (or sensitivity analysis), the reported percentages are uninterpretable and non-reproducible: it is impossible to judge whether “85% success” reflects algorithmic failure modes, threshold arbitrariness, or genuine instability in the dynamics.\n\n3. Algorithm 1 relies on a carefully aligned eigen-spike construction, but the experiments do not compare this design to simpler baselines (e.g., misaligned anisotropy, scalar scaling of S_U, or random high-anisotropy prompts).  As presented, it is unclear whether the geometric construction is uniquely required for one-sided convergence or merely one of many ways to produce non-symmetric outcomes."}, "questions": {"value": "1. The theoretical analysis assumes each agent performs a linear gradient-like update, following the LSA approximation. How robust are the main results, especially Proposition 1 and Corollary 2, when the agent dynamics include moderate nonlinearities or higher-layer effects? It would be valuable to see whether asymmetric convergence still appears under more realistic conditions.\n\n2. Proposition 2 and Corollary 3 rely on exact equalities such as ((I - \\eta S_U)S_W \\Delta = 0). In practice, these conditions can only be approximately met. How sensitive is the observed asymmetric convergence to small violations of this condition? Do the effects decay smoothly, or is the phenomenon brittle?\n\n3. In the GPT-5 setup, the model is prompted with the exact gradient formula, so it is effectively executing a prescribed computation rather than demonstrating emergent optimization. Could you test a variant where GPT-5 infers the update rule from examples without seeing the explicit formula?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "5C7gTwtrtz", "forum": "XNYPgC5NoM", "replyto": "XNYPgC5NoM", "signatures": ["ICLR.cc/2026/Conference/Submission20863/Reviewer_dPdy"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20863/Reviewer_dPdy"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission20863/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760600745689, "cdate": 1760600745689, "tmdate": 1762937148643, "mdate": 1762937148643, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper theoretically studies agent-to-agent interactions, based on the in-context linear regression task, where both agents are driven by llm and may have misaligned objectives. The authors extend the previous work and formulation on single agent, during the interaction, agents take turns to conduct approximately linear gradient updates towards their own goal using the output of each other as context or input. Utilizing fixed point theory and spectral analysis, the authors analyze how the prompt design and objective difference contribute to the biased equilibrium. They also identify conditions that lead to asymmetric convergence where only one side of the agent reaches its goal, and design a white-box attack algorithm accordingly. Experiments with pretrained single-layered linear self-attention transformer and gpt5 demonstrate the theoretical results and provides insights on understanding llm-based multi-agent systems."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "First of all, the authors identify an important and timely problem in the field of multi-agent systems (MAS) involving large language models (LLMs). The unpredictability of LLM driven MAS and their occasional under performance compared to single-agent systems highlight the need for a deeper understanding of agent interactions. The paper's focus on characterizing agent-to-agent interactions and the analysis regarding the internal state updates is novel and addresses a gap in the literature. \n\nThe theoretical analysis is rigorous and well-supported by mathematical proofs. The inclusion of both LSA and gpt5 agents in the experiments strengthens the credibility of the results. Furthermore, it is nice that the authors link findings on asymmetric conditions to adversarial prompt design and white-box attacks, demonstrating the potential for malicious exploitation and also opens up important discussions on LLM safety. \n\nRegarding the presentation, the paper is well-written and clearly structured. The authors provide comprehensive explanations of the theoretical framework and detailed derivations of key results. Detailed explanation after key results allows readers to easily follow and understand the findings."}, "weaknesses": {"value": "The paper discusses white-box attacks but does not delve into potential defenses. It would be beneficial to add a short discussion regarding the strategies for eliminating or mitigating these attacks. Addressing these concerns would provide a more comprehensive understanding of the security implications and offer practical solutions for securing multi-agent systems.\n\nAt the end of section 3, the suggestion to design a common goal for multi-LLMs is quite intuitive. It would be a lot better if the authors could further investigate this idea to provide more valuable insights and practical guidance. For example, they could explore specific techniques for aligning objectives or designing prompts that promote collaboration. This would enhance the paper's contribution to the development of effective multi-agent systems."}, "questions": {"value": "- In section 3, we can derive the plateau levels if given u* and w*. But, if we already know u* w*, what is the point of using multiple llm agents to interact and find the solution?\n\n- In Figure 3, it seems that the victim error in LSA-trained agents are high enough, while the attacker’s error is quite low, then, how come the attack success rate is lower than that in GPT5? If this is correct, what are the possible causes? Is it due to differences in model complexity, training data, or other factors? A deeper analysis would enhance the understanding of the results.\n\n- The white-box attack may cause safety issues, are there any solutions or defense approaches? How to secure the multi-agent system or make them more robust? Further, can we derive some insights on what kind of work is suitable for MAS instead of single-agent from this paper?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "QK03fQwlHU", "forum": "XNYPgC5NoM", "replyto": "XNYPgC5NoM", "signatures": ["ICLR.cc/2026/Conference/Submission20863/Reviewer_d9dT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20863/Reviewer_d9dT"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission20863/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761743513868, "cdate": 1761743513868, "tmdate": 1762937122944, "mdate": 1762937122944, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper investigates the convergence behavior of two large language model (LLM) agents that perform alternating in-context gradient updates under misaligned objectives, aiming to uncover bias propagation and stability issues in multi-agent interactions. The challenge lies in the strong coupling and low interpretability of multi-agent systems, which make it difficult to mechanistically describe how agents influence each other during in-context updates. The authors model each agent as a linear self-attention (LSA) network that executes gradient descent, formalize their interaction, and derive closed-form and spectral results for the convergence error. They further find that when objective misalignment and prompt-geometry anisotropy coexist, the system exhibits an asymmetric convergence phenomenon. The paper proposes a white-box adversarial prompt design algorithm and validates the “attacker converges, victim fails” behavior on both LSA and GPT-5-mini models. Overall, the paper is well structured with complete and detailed derivations; the direction is promising, though the experimental setup remains somewhat simplified and idealized."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper is the first to model multi-agent LLM interaction as an alternating in-context gradient optimization system, providing a mathematical formulation of inter-agent updates and a computable basis for analyzing bias propagation and convergence stability.\n2. The mathematical derivations are complete and logically clear, with consistent notation, explicit assumptions, and boundary conditions; the appendix provides supplementary derivation details that enhance verifiability.\n3. The proposed dynamical analysis framework is broadly applicable beyond dual-agent settings—it can extend to multi-agent alignment, model coordination, and optimization-based safety studies, offering a general theoretical tool for future work."}, "weaknesses": {"value": "1. The experiments are conducted only on a synthetic linear-regression task, without testing agent interaction in realistic language scenarios such as reasoning, writing, or code generation. This limits the explanatory power of the results for real-world multi-agent LLM collaboration.\n2. The study relies on the assumption that LLM inference is equivalent to in-context gradient descent; while analytically convenient, this assumption is not strictly true for real LLM reasoning and may weaken the practical relevance of the conclusions.\n3. Although the paper formally defines prompt geometry, it lacks intuitive examples or visualizations that would help readers understand how the proposed geometric structure corresponds to actual prompt design and model behavior.\n4. The writing still needs polishing: the main text frequently refers to GPT-5 while the experiments actually use GPT-5-mini, which should be clarified; moreover, the link in Appendix 7.3 is broken."}, "questions": {"value": "1. Is there sufficient empirical or theoretical evidence for treating LLM inference as in-context gradient descent? Does this assumption still hold on nonlinear tasks?\n2. Given the large difference between the LSA model and real LLM architectures, how do the authors evaluate the impact of this simplification on the reliability of their conclusions?\n3. Could the authors provide a case study of a large-model experiment?\n4. How does “prompt geometry” correspond to linguistic structures? Could the authors give a few simple examples?\n5. Could the paper include a more complex experimental scenario, such as realistic multi-agent cooperation (text co-writing, code generation, etc.)?\n6. Do the authors plan to release the LSA experiment code or a minimal reproducible example?\n7. If the attacker only has black-box access to the victim, is there an approximate attack strategy?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "rN38dJNFCJ", "forum": "XNYPgC5NoM", "replyto": "XNYPgC5NoM", "signatures": ["ICLR.cc/2026/Conference/Submission20863/Reviewer_KEzn"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20863/Reviewer_KEzn"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission20863/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761924927699, "cdate": 1761924927699, "tmdate": 1762937088408, "mdate": 1762937088408, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper studies the dynamics of two single-layer transformers with linear self-attention (LSA agents) alternately performing in-context gradient descent toward their own objectives. Theoretical analysis show they fall in different regime depending on different configurations of the misaligned objectives. Experiments on two LLMs doing in-context gradient descent validates the theoretical results."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "This paper shows an interesting angle to study agent-to-agent interactions through in-context gradient descents of LSAs. The theoretical results show that misaligned objective correspond to different behavior. The experiment also generalizes it to LLMs (GPT5) that validates the theoretical analysis. The paper is well-written."}, "weaknesses": {"value": "* Investigating multi-LLM-agents interactions is an important and emerging problem. Although this paper offers an interesting perspective, it builds on oversimplified settings that is not obvious to generalize easily. I appreciate the authors ackoknledging this in the conclusion: \"move beyond controlled linear tasks and examine these mechanisms directly in large-scale LLMs.\" However, I believe this is should be an important point and worth discussing in more detail.  \n* There is some degree of over-claiming: the abstract reads like the theory is developed for generic LLMs, while the theory is actually developed for LSAs."}, "questions": {"value": "* Line 276: \"These results suggest a concrete prompt-design principle for multi-agent systems...\" Can the authors be more concrete about what specific results suggest these concrete prompt-design principles, and how? \n* This paper suggests (e.g., from Proposition 1 or Figure 1) that the multi-agent system has non-zero error w.r.t. to each agent's respective objective. This seems to imply that there is not benefit of using a multi-agent system. In the LSA in-context gradient descent setting, are there circumstances where the multi-agent system can be more beneficial than using each agent separately?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "vfm0RGBO2b", "forum": "XNYPgC5NoM", "replyto": "XNYPgC5NoM", "signatures": ["ICLR.cc/2026/Conference/Submission20863/Reviewer_HbCZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission20863/Reviewer_HbCZ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission20863/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762071471800, "cdate": 1762071471800, "tmdate": 1762937063587, "mdate": 1762937063587, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}