{"id": "y0KyBu5gfz", "number": 13603, "cdate": 1758219721564, "mdate": 1759897425407, "content": {"title": "VideoGameBench: Can Vision-Language Models complete popular video games?", "abstract": "Vision-language models (VLMs) have achieved strong results on coding and math benchmarks that are challenging for humans, yet their ability to perform tasks that come naturally to humans--such as perception, spatial navigation, and memory management--remains understudied. Video games are crafted to be intuitive for humans to learn and master by leveraging innate inductive biases, making them an ideal testbed for evaluating such capabilities in VLMs. To this end, we introduce VideoGameBench, a benchmark consisting of 10 popular video games from the 1990s that VLMs directly interact with in real-time. VideoGameBench challenges models to complete entire games with access to only raw visual inputs and a high-level description of objectives and controls, a significant departure from existing setups that rely on game-specific scaffolding and auxiliary information. We keep three of the games secret to encourage solutions that generalize to unseen environments. Our experiments show that frontier vision-language models struggle to progress beyond the beginning of each game. We find inference latency to be a major limitation of frontier models in the real-time setting; therefore, we introduce VideoGameBench Lite, a setting where the game pauses while waiting for the LM's next action. The best performing models, Gemini 2.5 Pro and Claude 3.7 Sonnet, complete only 0.48% of VideoGameBench and 1.6% of VideoGameBench Lite. We hope that the formalization of the human skills mentioned above into a benchmark motivates progress in these research directions.", "tldr": "We introduce VideoGameBench, a benchmark which challenges vision-language models to complete, in real-time, a suite of 20 different popular video games from both hand-held consoles and PC.", "keywords": ["benchmark", "video games", "vision-language models", "agent"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0547eade5fc04fd0a67c7d4ab3318f0f51a5efe4.pdf", "supplementary_material": "/attachment/c4c5184abe381948da73c3a17f26b1dc234a5347.zip"}, "replies": [{"content": {"summary": {"value": "The paper presents a benchmark for Vision Language Models on a variety of popular video games from the 90s. Most current models get 0% performance on basically every single task with this setup."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The benchmark is very cool, and the engineering and effort that must have gone behind making this are surely impressive. The paper is well written and easy to follow."}, "weaknesses": {"value": "One of my main criticisms for this paper is that a benchmark were all the current models score 0% on basically every single task is not an interesting benchmark. This surely makes the benchmark future-proof, but the amount of insights it can provide now compared to existing benchmarks with more fine-grained progression systems is lacking. Without a more fine-grained progression system, or easier games where current VLMs can get some amount of performance, the benchmark can offer limited insights compared to what has already been shown in related work, regardless of how cool it is.\n\nI am not sure this benchmark is asking the right questions. Do we expect VLMs to be the right format/models for these games? I fully get the reason to test VLM on games requiring reasoning, but a good chunk of these games mostly require accurate perception-to-muscle memory and fast reflexes for humans to perform well, skills that we are likely decades away from unlocking in general purpose multimodal language models. Perhaps Vision-Language-Action (VLA) models, more akin to what is being developed for robotics are the better test target for this benchmark. Or perhaps something more similar to SIMA [SIMA Team, 2024], (which I think would deserve a citation in this paper) would be more appropriate for video games. Or perhaps, the subset of video games chosen for the benchmark should be reconsidered based on what models are being tested. \n\nThe latency part of this benchmark (full version, not lite) also feels strange, as latency on most of these models is inherently dependent on the GPU being used and/or current server traffic for proprietary models, so a big variable is very much out of your control. At that point you are really benchmarking the quality of the provided service at that point in time and not necessarily the quality of the models themselves. I’m sure with a proper set up and the right amount of compute you could run most present-day models in real time with no latency problems, but this is obviously difficult to achieve if you are not the provider yourself. What happens if in the future you change the GPUs you're running with, or if the API you are using is undergoing more/less traffic?\n\nBenchmarks for LLM/VLMs on games are inherently high-variance. One seed is unfortunately not enough.\n\nIn the current state, this benchmark, while extremely cool and impressive in its own right, seems to be missing a target (the right type of foundation model to be tested) and a purpose (what new questions is it trying to answer? What new insights is it providing?)"}, "questions": {"value": "1. Why weren’t easier games added to get a more fine-grained average progression?\n2. What new insights is this benchmark providing in its current state?\n3. Why are VLMs the right target for this benchmark and not VLAs? \n4. Using only a frame every 0.5 seconds doesn't seem enough for many of these games. Have other frame rates been tested?\n4. Why is latency an important factor here, given that it’s something out of your control for most of the close-source models? What GPUs did you use to test open-source models? How do you account for changes in latency of close-source models APIs?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "3q6APAHk6i", "forum": "y0KyBu5gfz", "replyto": "y0KyBu5gfz", "signatures": ["ICLR.cc/2026/Conference/Submission13603/Reviewer_2JDe"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13603/Reviewer_2JDe"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission13603/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761505140186, "cdate": 1761505140186, "tmdate": 1762924188022, "mdate": 1762924188022, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces VideoGameBench, a benchmark for evaluating vision-language models (VLMs) on 23 curated 1990s video games (split into dev/test sets, including 3 secret games) from Game Boy and MS-DOS platforms. Unlike existing benchmarks, it requires VLMs to complete full games in real time using only raw visual inputs and high-level objectives/controls (no game-specific scaffolding or auxiliary tools). The authors also propose VideoGameBench Lite, a variant that pauses the game during model inference to mitigate latency issues."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper addresses a critical underexplored gap: evaluating VLMs on full, unmodified real-world tasks (1990s video games) that require integrated human-like abilities (perception, memory, real-time decision-making). Prior benchmarks rely on simplified grid worlds, text-only games, or game-specific tools (e.g., Gemini Plays Pokemon used pathfinding hints), making VideoGameBench a novel \"no crutches\" evaluation.\n2. The benchmark construction is rigorous: it supports multiple emulators (PyBoy, DOSBox), standardizes action interfaces (keyboard/mouse/controller), and uses human-verified checkpoints scraped from walkthroughs. The automated progress-tracking via perceptual hashing is well-validated (e.g., tuning Hamming distance thresholds per game) and avoids subjective manual scoring.\n3. The work highlights critical limitations of state-of-the-art VLMs in real-world, dynamic environments—limitations that matter for downstream applications (e.g., robotics, autonomous systems). For example, the \"knowing-doing gap\" and poor memory management are not captured by math/coding benchmarks but are essential for embodied AI.\n4. VideoGameBench provides a standardized, scalable testbed to drive progress in VLM generalization and real-time reasoning. By focusing on 1990s games (with well-documented mechanics and walkthroughs), it avoids copyright or accessibility barriers of modern games while retaining complexity."}, "weaknesses": {"value": "1. The benchmark focuses exclusively on 1990s 2D/3D games (Game Boy, MS-DOS), excluding modern game mechanics (e.g., open-world exploration, multiplayer, touch controls) or other classic platforms (e.g., NES, Sega Genesis). This narrows the generalizability of results—VLMs may fail differently on games with distinct interaction paradigms (e.g., point-and-click adventures vs. real-time strategy).\n2. There is no human baseline for the full benchmark—only confirmation that humans can complete practice games and first checkpoints. A human performance metric (e.g., average completion percentage, time to checkpoint) would better contextualize VLM failure."}, "questions": {"value": "1. The paper mentions that \"0% score does not imply no progress\"—but how much incremental progress (e.g., moving 1 tile, interacting with 1 object) do models typically make? Providing finer-grained scores for all games (not just Table 10–11) would better illustrate model capabilities.\n2. Did you test if VLMs perform better with game-specific prompts beyond basic controls/objectives (e.g., hints about common mechanics like \"jump to avoid enemies\")? If not, could prompt engineering reduce the \"knowing-doing gap\"?\n3. More model results are needed to include. This paper only provides 7 VLMs."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "2MnZWDrE5Y", "forum": "y0KyBu5gfz", "replyto": "y0KyBu5gfz", "signatures": ["ICLR.cc/2026/Conference/Submission13603/Reviewer_93zX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13603/Reviewer_93zX"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission13603/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761965552683, "cdate": 1761965552683, "tmdate": 1762924187675, "mdate": 1762924187675, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "Evaluate whether vision-language models (VLMs) can perform human-like embodied reasoning by playing full video games from the 1990s using only visual input and minimal instructions. Experiments show all models fail to exceed the start of any game."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Challenging environments and strict train/test split are well-needed.\n- Use of perceptual hash to estimate game completion is interesting."}, "weaknesses": {"value": "- Many similar benchmarks already exist, as the author's have cited. \n- Evaluation scope narrow: experiments limited to a handful of VLMs; no systematic scaling or modality ablation."}, "questions": {"value": "- Can the author's correlate and report perceptual hash with some ground truth measure of the progress in a game, i.e. using the walkthrough videos?\n- Additionally, how does perceptual hash perform for games where progression is not entirely linear? E.g. The Legend of Zelda. \n- Given the diverse skills required for each game, could the games be categorised such that the benchmark measures multiple discrete capabilities of models?"}, "flag_for_ethics_review": {"value": ["Yes, Legal compliance (e.g., GDPR, copyright, terms of use, web crawling policies)"]}, "details_of_ethics_concerns": {"value": "While the use of open-source emulators (e.g., PyBoy) is legal, most of the referenced games remain under copyright protection. The author's briefly address this, however do not clarify on what the benchmark itself distributes. In practice, reproducing the experiments would require accessing copyrighted ROMs, which cannot be legally distributed. Therefore, I am a bit concerned about the legality of this work."}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "nylyf5M9bX", "forum": "y0KyBu5gfz", "replyto": "y0KyBu5gfz", "signatures": ["ICLR.cc/2026/Conference/Submission13603/Reviewer_PQJm"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13603/Reviewer_PQJm"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission13603/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761999965802, "cdate": 1761999965802, "tmdate": 1762924187384, "mdate": 1762924187384, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "# Summary  \nThis paper introduces **VideoGameBench**, a multimodal, interactive benchmark encompassing 23 classic video games (10 for testing, 13 for development) across Game Boy and MS-DOS platforms. It adopts a stringent ruleset requiring \"raw pixels + only control/objective descriptions\". Complementary components include **VideoGameBench Lite** (where the game pauses during agent inference) and an automated **checkpoint-hashing** method for progress measurement—this method leverages frame data from YouTube walkthroughs to quantify completion. Frontier vision-language models (VLMs) achieve extremely low completion rates: the top-performing models reach approximately 0.48% on the full benchmark and 1.6% on VideoGameBench Lite. Additionally, simple auxiliary \"practice games\" reveal critical deficits in VLMs’ mouse control, dragging precision, and basic navigation abilities.  \n\n\n# Strengths  \n1. **Clear problem framing and motivation**: The paper persuasively argues that current VLMs poorly capture human-centric inductive biases (e.g., perception, spatial navigation, memory management)—capabilities that come naturally to humans. It further justifies real-world video games as a intuitive, ecologically valid testbed for evaluating these understudied skills.  \n2. **Rigorous ruleset**: The constraint of \"no visual overlays, no access to internal game state, and minimal hints\" cleanly isolates VLMs’ core visual understanding and action-sequencing abilities. This design discourages over-reliance on bespoke toolchains or game-specific workarounds, ensuring evaluations reflect generalizable capabilities.  \n3. **Turn-based ablation (VideoGameBench Lite)**: This variant effectively decouples reasoning performance from inference latency. It clearly demonstrates that even without real-time response pressure, VLMs still struggle to progress—highlighting fundamental limitations in reasoning rather than just timing constraints.  \n4. **Automated progress tracking**: The perceptual-hashing pipeline provides a practical, replay-agnostic approach to coarse-grained scoring. By grounding checkpoints in publicly available walkthroughs, it ensures consistency and reproducibility across different model evaluations.  \n5. **Broad coverage across genres and I/O modalities**: The benchmark spans diverse game mechanics (controller-based for Game Boy vs. mouse/keyboard for MS-DOS), spatial dimensions (2D and 3D), and genres (action, RPG, strategy, puzzle, racing). This breadth enables comprehensive assessment of VLMs’ adaptability to varied interactive tasks.  \n\n\n# Weaknesses  \n1. **Discussion of checkpoints as performance metrics**: While using checkpoints as a performance metric is intuitively reasonable, results in Table 2 show that most models score 0% on the majority of games. This excessively high benchmark difficulty makes it difficult to reflect models’ true capabilities and leads to a lack of discriminative power between different VLMs. Supplementing the checkpoint system with more granular, phased metrics to capture incremental model progress would significantly enhance the benchmark’s general applicability.  \n2. **Mechanistic failure analysis**: The identified failure modes (e.g., the \"knowing-doing gap\") are descriptive but lack mechanistic depth. For instance, the paper does not address: Is the knowing-doing gap caused by VLMs’ inability to map visual perception to action sequences, limitations in context window size (e.g., forgetting prior actions), or poor spatial coordinate mapping? Without such mechanistic insights, the paper provides limited guidance for targeted model improvement.  \n\n\n# Questions  \nQ1: Can the authors supplement the benchmark with phased, granular metrics to better capture incremental model capabilities? Doing so would address the current lack of discriminative power and further enhance the benchmark’s general applicability (targeting Weakness 1).  \nQ2: Can the authors conduct a more mechanistic analysis of the identified failure modes? For example, disentangling whether deficits stem from visual perception-action mapping, context window constraints, or spatial reasoning limitations would provide critical insights for model development (targeting Weakness 2)."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "See Summary"}, "weaknesses": {"value": "See Summary"}, "questions": {"value": "See Summary"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Eo2dQHGgb1", "forum": "y0KyBu5gfz", "replyto": "y0KyBu5gfz", "signatures": ["ICLR.cc/2026/Conference/Submission13603/Reviewer_Lkc1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission13603/Reviewer_Lkc1"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission13603/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762908365168, "cdate": 1762908365168, "tmdate": 1762924186455, "mdate": 1762924186455, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}