{"id": "y5rLR9xZpn", "number": 25645, "cdate": 1758369904360, "mdate": 1763695326152, "content": {"title": "Quantum-Inspired Image Encodings for Financial Time-Series Forecasting", "abstract": "This study proposes a quantum-inspired methodology that transforms time-series data into complex-valued image representations for prediction. Unlike classical encodings such as the Gramian Angular Field (GAF), Recurrence Plot (RP), and Markov Transition Field (MTF), which rely on additive pairwise relations, our approach embeds both probabilistic amplitudes and dynamic phase information. Observations are first mapped into quantum amplitudes via Gaussian soft encoding, and local temporal structures are incorporated through phase-function encoding, allowing interference effects that reveal volatility, cumulative imbalances, and phase shifts hidden to classical methods. Building on this foundation, we extend GAF, RP, and MTF into their quantum analogues—Q-GAF, Q-RP, and Q-MTF—producing complex-valued images suitable for CNN-based forecasting. Empirical analysis on the S&P 500 and Russell 3000 indices shows that these quantum-inspired encodings substantially improve predictive accuracy. Our contributions are both methodological and empirical: we present a novel representation framework for financial time series and demonstrate that quantum-inspired image encodings capture richer dynamics and previously undetectable patterns, with implications for forecasting and risk modeling.", "tldr": "We propose quantum state–based image encodings for time series that capture both probabilistic amplitudes and dynamic phases, yielding superior forecasting performance over classical methods.", "keywords": ["Time-series Classification", "Image Encoding", "Quantum Physics", "Convolutional Neural Networks (CNN)", "Financial Forecasting"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/6c811a881347448ec8bb614191ea5deae32423ae.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper introduces a novel \"quantum-inspired\" framework for financial time-series forecasting. The core idea is to encode one-dimensional time-series data into two-dimensional, complex-valued image representations, which are then fed into a Convolutional Neural Network (CNN) for prediction. Specifically, the authors extend classical image-encoding methods like Gramian Angular Fields (GAF), Recurrence Plots (RP), and Markov Transition Fields (MTF) into their \"quantum analogues\" (Q-GAF, Q-RP, and Q-MTF) by incorporating probabilistic amplitudes and dynamic phase information borrowed from the mathematics of quantum mechanics. The primary contribution is methodological: creating a richer representation space that can capture complex dynamics missed by traditional methods, supported by empirical evidence of its effectiveness."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "Applying the mathematical formalism of quantum mechanics to feature engineering for financial time series is a highly creative and interesting approach. It moves beyond conventional real-valued representations, offering new possibilities for capturing latent data structures, such as volatility and phase dynamics, by leveraging complex-valued spaces.\n\nThe paper presents an extensive empirical study on two major equity indices. The proposed quantum-inspired models consistently outperform their classical counterparts in terms of both predictive accuracy and average win rate, providing strong initial evidence for the practical utility of the framework."}, "weaknesses": {"value": "This paper fails to provide the necessary background for non-specialists and fails to offer a clear, reproducible algorithm for specialists. This makes the paper's contribution difficult to evaluate and seriously compromises its quality as a rigorous scientific publication. \n\nThe paper successfully maps time-series data points to probability amplitudes and phases but lacks a deep theoretical justification for why this specific analogy is appropriate and superior.\n\nThe experiments effectively demonstrate the superiority of the proposed methods over their direct classical counterparts. However, to establish the true value and novelty of this encoding framework, it must be benchmarked against a broader set of state-of-the-art time-series forecasting models."}, "questions": {"value": "See weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Sk6xnJfQG3", "forum": "y5rLR9xZpn", "replyto": "y5rLR9xZpn", "signatures": ["ICLR.cc/2026/Conference/Submission25645/Reviewer_6Coq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25645/Reviewer_6Coq"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission25645/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761917948385, "cdate": 1761917948385, "tmdate": 1762943502084, "mdate": 1762943502084, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "5Km01dgpji", "forum": "y5rLR9xZpn", "replyto": "y5rLR9xZpn", "signatures": ["ICLR.cc/2026/Conference/Submission25645/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission25645/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763695325248, "cdate": 1763695325248, "tmdate": 1763695325248, "mdate": 1763695325248, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a quantum-inspired method for financial time series that transforms one-dimensional signals into two-dimensional images for forecasting. This transformation also enables classical encodings to suit CNN-based forecaster. Using five-minute U.S. equity data, such as S&P 500 and Russell 3000, over 2009–2025, the authors report higher classification accuracy and win rates relative to classical encodings."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The amplitude–phase formalism extends classical image encodings and may capture salient features of financial time series.\n\n- The paper addresses the limitations of classical encodings by lifting them into the complex domain.\n\n- On the reported tasks and CNN architecture, quantum-inspired encodings deliver consistent accuracy and win-rate improvements over classical counterparts."}, "weaknesses": {"value": "- The paper claims that the phase-function encoding reflects cumulative imbalance and volatility, but do not empirically verify this.\n\n- Classification accuracy and “win rate” reported in the paper are not directly connected to monetizable alpha. Without this evaluation, it is unclear whether the accuracy uplift converts into practical use.\n\n- Key hyperparameter choices lack sensitivity analyses."}, "questions": {"value": "- Can you report critical finance metrics (e.g., IC, Rank IC, and Sharpe ratio) from portfolio backtests?\n\n- How sensitive are results to hyperparameters, such as k?\n\n- Do the phase functions measurably capture cumulative imbalance and volatility?\n\n- How does the method perform in tests beyond 2009-2025?\n\n- Can the quantum-inspired method generalize to other assets (e.g., individual equities, commodity futures, FX)?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "qL2dY6YRcx", "forum": "y5rLR9xZpn", "replyto": "y5rLR9xZpn", "signatures": ["ICLR.cc/2026/Conference/Submission25645/Reviewer_Jsfq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25645/Reviewer_Jsfq"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission25645/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761918990216, "cdate": 1761918990216, "tmdate": 1762943501881, "mdate": 1762943501881, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes a quantum-inspired representation learning framework for financial time-series forecasting. It maps 1D normalized observations into probabilistic amplitudes and injects local temporal structure through phase-function encoding. The proposed approach outperforms the other baselines on two financial datasets."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The quantum-inspired representation of time series is novel, introducing some unexplored features that seem useful in time series forecasting.\n    \n- The proposed approach achieves solid improvements compared to classical image encodings in experiments.\n    \n- The approach works with standard CNN-based models, suggesting that advanced CNN approaches could be explored to further enhance time series forecasting."}, "weaknesses": {"value": "- This paper does not compare the image encoding-based methods to those without image encodings.\n    \n- Despite its effectiveness, results rely on a single CNN backbone. There is no investigation across diverse forecasting models.\n    \n- Ablation study is needed to confirm the effectiveness of each component in the proposed approach."}, "questions": {"value": "- Can you compare the image encoding-based approaches to non-image baselines?\n    \n- Do the performance gains of quantum encodings hold for other forecasters, such as Transformer-based models?\n    \n- How do you interpret the features captured by the two components in the model?\n    \n- How do you determine the hyperparameter $k$? Do model performance totally degrade using other settings?\n    \n- What’s the complexity (or runtime) compared to baselines?\n    \n\nA small typo: Citation formatting at line 045 is incorrect."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "Be9tZIuwG1", "forum": "y5rLR9xZpn", "replyto": "y5rLR9xZpn", "signatures": ["ICLR.cc/2026/Conference/Submission25645/Reviewer_zuHu"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission25645/Reviewer_zuHu"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission25645/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761990595270, "cdate": 1761990595270, "tmdate": 1762943501617, "mdate": 1762943501617, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}