{"id": "Y7phfABIZH", "number": 1917, "cdate": 1756965589506, "mdate": 1759898178699, "content": {"title": "Decoupling Global Structure and Local Refinement: Blueprint-Guided Scroll Generation with Direct Preference Optimization", "abstract": "Existing methods for generating long scroll images, often fail to maintain global structural and stylistic consistency, resulting in artifacts like content repetition. To address this, we propose the Dual-Resolution Scroll Generation with Preference Optimization (DRSPO) framework. Our approach decouples global composition from local refinement by first generating a low-resolution (LR) blueprint to establish a coherent overall structure. This LR blueprint then guides a high-resolution (HR) feature to render fine-grained details. We further enhance generation quality by incorporating Direct Preference Optimization (DPO) at both stages, and we introduce a novel theoretical adaptation to apply preference tuning directly to the region-based generation process. Experimental results demonstrate that our method produces high-quality long scroll images with reasonable global structure and fine-grained details.", "tldr": "", "keywords": ["Long Scroll Generation", "Preference-Optimization", "Text-to-Image Generation"], "primary_area": "generative models", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c2b53fe5b5b7f3e8f4ed7f3848fcfbb66029aff2.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper addresses the task of generating long images using diffusion models.\nIt proposes a two-stage method: generating a low-resolution (LR) \"blueprint\" image, upsampling this blueprint into a high-resolution (HR) image. A key component is fine-tuning the models using Direct Preference Optimization (DPO). The proposed method (DRSPO) demonstrates superior results compared to previous methods like MultiDiffusion and SyncDiffusion."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "This appears to be the first work to apply DPO to enhance the quality of long scroll image generation."}, "weaknesses": {"value": "- I think the task of generating long scroll images is a somewhat solved problem. However, the paper compares its method only against relatively weak baselines.\n\n- We may generate directly with state-of-the-art models like FLUX.1-dev (which is mentioned in the paper) or, generate a 512x2048 image with a FLUX or Stable Diffusion 3.5 and then using an off-the-shelf super-resolution model (e.g., ESRGAN). This alternative pipeline might produce comparable or even superior results.\n\n- The validity of the evaluation metrics (HPS v2, PickScore, CLIP Score) is questionable, as these off-the-shelf models may not be reliable for evaluating long (1024x4096), non-square images."}, "questions": {"value": "While FLUX is included in the quantitative results (Table 1), it is notably absent from all qualitative comparisons. What is the actual qualitative performance of FLUX on this task?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FCpA5kBxHP", "forum": "Y7phfABIZH", "replyto": "Y7phfABIZH", "signatures": ["ICLR.cc/2026/Conference/Submission1917/Reviewer_nmw8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1917/Reviewer_nmw8"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission1917/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761624955535, "cdate": 1761624955535, "tmdate": 1762915951748, "mdate": 1762915951748, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes the Dual-Resolution Scroll Generation with Preference Optimization (DRSPO) framework, which decouples global composition and local detail refinement for long scroll image generation. DRSPO first generates a low-resolution (LR) global blueprint and then produces high-resolution (HR) details based on this overall structure. By doing so, it successfully generates images that are globally coherent while maintaining fine-grained local fidelity."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "This paper's strengths are as follows.\n\n(1) By employing a low-to-high-resolution generation strategy, the method successfully achieves both global structural consistency and local detail refinement.\n\n(2) The paper improves generation quality for long scroll images by introducing Direct Preference Optimization (DPO).\n\n(3) The application of DPO to high-resolution generation is theoretically supported (though with certain approximations), and the authors explicitly discuss the limitations of these approximations, linking them to future research directions."}, "weaknesses": {"value": "This paper's weaknesses are as follows.\n\n(1) Although the model is trained using DPO that optimizes for the Aesthetic Score, the same metric is also used for evaluation, effectively leading to reward hacking. Moreover, the method’s performance on this score is worse than existing methods, raising doubts about whether the proposed approach truly improves generation quality.\n\n(2) Compared with MAD, the overall performance is similar or even inferior, despite MAD requiring no fine-tuning or DPO training. This raises concerns about the cost-effectiveness of the proposed method given its additional training overhead.\n\n(3) In Table 1, the color distinction among “1st”, “2nd”, and “3rd” is difficult to see, which reduces the readability of the results."}, "questions": {"value": "My questions about this paper are as follows.\n\n(1) Have the authors tried fine-tuning directly on long scroll images rather than adapting pretrained models?\n\n(2) How is the Aesthetic Score computed for long scroll images? Is it calculated locally and then aggregated, or is there a global evaluation?\n\n(3) From the results in Table 2, the effect of DPO seems limited. Given that DPO requires additional training cost for diffusion model fine-tuning, one would expect more significant improvements. Why does DPO seem less effective than the control in this setting?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "FAskVUzIUB", "forum": "Y7phfABIZH", "replyto": "Y7phfABIZH", "signatures": ["ICLR.cc/2026/Conference/Submission1917/Reviewer_Le7N"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1917/Reviewer_Le7N"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission1917/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761778653563, "cdate": 1761778653563, "tmdate": 1762915951570, "mdate": 1762915951570, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "- This paper propose the Dual-Resolution Scroll Generation (DRSPO) framework, which decouples the process by first creating a low-resolution blueprint for global structural coherence, then refining it with high-resolution features for local detail.\n\n- To enhance quality, we integrate Direct Preference Optimization (DPO) at both generation stages and introduce a novel theoretical adaptation for applying preference tuning to region-based generation.\n\n- Experimental results confirm that our method effectively produces high-quality long scroll images with consistent global structure and fine-grained details, overcoming issues like content repetition."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "- The paper provides formulas, ablation experiments, and visualization results, though they are not very satisfactory.\n- Compared with the FLUX model"}, "weaknesses": {"value": "The methods compared in this paper are already too outdated. Additionally, the FLUX model has not undergone specific optimization for such tasks, making the comparison unfair. In my view, this paper is not suitable for the ICLR conference. Furthermore, from the visualization results, it can be seen that the results here are not advanced, with numerous artifacts and glitches. The small images also fail to show more details clearly. Therefore, I believe this paper still requires further improvements. In particular, the method mentioned in the paper is no longer novel in the field of text-to-image generation."}, "questions": {"value": "The methods compared in this paper are already too outdated. Additionally, the FLUX model has not undergone specific optimization for such tasks, making the comparison unfair. In my view, this paper is not suitable for the ICLR conference. Furthermore, from the visualization results, it can be seen that the results here are not advanced, with numerous artifacts and glitches. The small images also fail to show more details clearly. Therefore, I believe this paper still requires further improvements."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Uec5SHtWZT", "forum": "Y7phfABIZH", "replyto": "Y7phfABIZH", "signatures": ["ICLR.cc/2026/Conference/Submission1917/Reviewer_VohU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1917/Reviewer_VohU"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission1917/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761915738093, "cdate": 1761915738093, "tmdate": 1762915950268, "mdate": 1762915950268, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper discusses an approach for generating big images similar to MultiDiffusion but guided by a low resolution image. \"Direct Preference Optimization\" is involved."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.\tThe fundamental idea looks correct – generate a low-resolution image and then diffuse at high resolution may result in larger results.\n2.\tA dataset is explicitly collected to align with the goal."}, "weaknesses": {"value": "1.\tThe idea of generating low resolution image and then diffusing again is extensively discussed even long before MultiDiffusion and similar works. This part shouldn’t be seen as a contribution of this work.\n2.\tThe DPO part is formulated with high verbosity but in essence they can be achieved as a simple target like some common score guidance like [github.com/vicgalle/stable-diffusion-aesthetic-gradients]. I also do not find Eq 13-19 as solid contributions of this work.\n3.\tThe experiments seem to compare to wrong targets. This paper is a cascaded image generator and it should at least compare to multi stage generating. For example, generate low resolution images and then diffuse it again using MultiDiffusion at some denoising level at high resolution. And also other native high resolution generators like opensource PixArt family (and even close sourced Flux pro 4k etc) as well as some other cascaded generators like stable cascade. The current MultiDiffusion results look misleading to me.\n4.\tWhy use canny image? Why not directly use low resolution image for other “upscaling” types of upscaling signals?"}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "amId4yypCd", "forum": "Y7phfABIZH", "replyto": "Y7phfABIZH", "signatures": ["ICLR.cc/2026/Conference/Submission1917/Reviewer_kSya"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission1917/Reviewer_kSya"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission1917/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761962526486, "cdate": 1761962526486, "tmdate": 1762915949952, "mdate": 1762915949952, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}