{"id": "y7SrBOHz7F", "number": 16319, "cdate": 1758263092409, "mdate": 1763572687678, "content": {"title": "NaviAgent: Bilevel Planning on Tool Navigation Graph for Large-Scale Orchestration", "abstract": "Large language models (LLMs) have recently demonstrated the ability to act as function call agents by invoking external tools, enabling them to solve tasks beyond their static knowledge. However, existing agents typically call tools step by step at a time without a global view of task structure. As tools depend on each other, this leads to error accumulation and limited scalability, particularly when scaling to thousands of tools. To address these limitations, we propose NaviAgent, a novel bilevel architecture that decouples task planning from tool execution through graph-based modeling of the tool ecosystem. At the task-planning level, the LLM-based agent decides whether to respond directly, clarify user intent, invoke a toolchain, or execute tool outputs, ensuring broad coverage of interaction scenarios independent of inter-tool complexity. At the execution level, a continuously evolving Tool World Navigation Model (TWNM) encodes structural and behavioral relations among tools, guiding the agent to generate scalable and robust invocation sequences. By incorporating feedback from real tool interactions, NaviAgent supports closed‑loop optimization of planning and execution, moving beyond tool calling toward adaptive navigation of large‑scale tool ecosystems. Experiments show that NaviAgent achieves the best task success rates across models and tasks, and integrating TWMN further boosts performance by up to 17 points on complex tasks, underscoring its key role in toolchain orchestration.", "tldr": "NaviAgent is a novel bilevel planning framework that decouples task planning from tool execution through graph-based modeling for large‑scale tool orchestration.", "keywords": ["Tool learning", "LLM", "Function Call Agent", "Bilevel Planning", "Graph Learning", "GNN"], "primary_area": "applications to computer vision, audio, language, and other modalities", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/e9110fc6feb907c9160db80d4f8e03bb574366cb.pdf", "supplementary_material": "/attachment/d15d33b93d0fb66ab28fb284b9826a3c9d8957a0.zip"}, "replies": [{"content": {"summary": {"value": "This paper presents NaviAgent, a bilevel framework for large-scale tool orchestration by LLMs. It decouples task planning (4D decision space: direct response, intent clarification, toolchain retrieval, execution) from tool execution (Tool World Navigation Model, TWNM). TWNM models tool structural/behavioral dependencies via a dynamic graph, enabling adaptive toolchain search. Closed-loop feedback optimizes planning/execution. Experiments on API-Bank/ToolBench show NaviAgent outperforms baselines in TSR, balancing efficiency/robustness ."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper proposes a novel bilevel architecture that decouples task planning from tool execution, enabling NaviAgent to handle thousands of tools without being hindered by inter-tool complexity, thus addressing scalability issues of existing agents .\n2. The Tool World Navigation Model (TWNM) dynamically encodes tool structural and behavioral dependencies, supports adaptive toolchain search/evolution, and significantly boosts performance on complex tasks by up to 17 points .\n3. It integrates a closed-loop optimization mechanism using real tool interaction feedback to refine planning and execution, enhancing robustness and adaptability to dynamic API ecosystems .\n4. For me, the strengths of this paper lie in the following aspects: it can dynamically adjust based on the difficulty level of various problems and the latest status when addressing them; it exhibits strong overall engineering feasibility; and in terms of innovation, the search strategies such as Alpha-Beta pruning can handle and prune some extreme cases, enabling rapid acquisition of effective toolchains."}, "weaknesses": {"value": "1. My biggest concern is that this paper imposes overly strong constraints on input problems. For example, if we obtain the corresponding tool invocation path through the proposed graph, can we dynamically switch to an alternative path if a problem occurs in the middle of the current path? The paper seems to lack sufficient explanation regarding how to handle such errors.\n2. When using Alpha-Beta pruning for search, the evaluation of Alpha and Beta values is crucial. For instance, if I choose a certain edge under a specific decision, how do you update the evaluation value of this decision in the global context? If only factors like tool invocation success rate and relevance are used, the accuracy of relevance evaluation needs to be very high. From this perspective, the paper’s evaluation of heuristic search seems relatively simplistic, and in some cases, it might eliminate effective tool invocation branches.\n3. How do you evaluate the dependency between two tools? The paper mentions using weights for evaluation—are these weights based solely on the historical information of the tools observed so far? If the invocation relationship between two tools changes significantly, will the tools overly rely on historical data?\n4. Does the proposed framework rely too heavily on the evaluation of tool invocation success rates? If a tool has a certain invocation success rate but delivers excellent results when it works, we might not should sacrifice its usage frequency. Alternatively, for your paper, is tool invocation speed more important compared to the overall reasoning performance?\n5. Real-world requirements are highly diverse. For a new requirement, can this framework demonstrate better tool planning capabilities compared to traditional methods like ReACT and Tool-Planner?"}, "questions": {"value": "See above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "TA2uKWPR1P", "forum": "y7SrBOHz7F", "replyto": "y7SrBOHz7F", "signatures": ["ICLR.cc/2026/Conference/Submission16319/Reviewer_JWrw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16319/Reviewer_JWrw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16319/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761645495027, "cdate": 1761645495027, "tmdate": 1762926457891, "mdate": 1762926457891, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents NaviAgent, a bilevel framework for large-scale tool orchestration by LLMs. It decouples task planning (4D decision space: direct response, intent clarification, toolchain retrieval, execution) from tool execution (Tool World Navigation Model, TWNM). TWNM models tool structural/behavioral dependencies via a dynamic graph, enabling adaptive toolchain search. Closed-loop feedback optimizes planning/execution. Experiments on API-Bank/ToolBench show NaviAgent outperforms baselines in TSR, balancing efficiency/robustness ."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper proposes a novel bilevel architecture that decouples task planning from tool execution, enabling NaviAgent to handle thousands of tools without being hindered by inter-tool complexity, thus addressing scalability issues of existing agents .\n2. The Tool World Navigation Model (TWNM) dynamically encodes tool structural and behavioral dependencies, supports adaptive toolchain search/evolution, and significantly boosts performance on complex tasks by up to 17 points .\n3. It integrates a closed-loop optimization mechanism using real tool interaction feedback to refine planning and execution, enhancing robustness and adaptability to dynamic API ecosystems .\n4. For me, the strengths of this paper lie in the following aspects: it can dynamically adjust based on the difficulty level of various problems and the latest status when addressing them; it exhibits strong overall engineering feasibility; and in terms of innovation, the search strategies such as Alpha-Beta pruning can handle and prune some extreme cases, enabling rapid acquisition of effective toolchains."}, "weaknesses": {"value": "1. My biggest concern is that this paper imposes overly strong constraints on input problems. For example, if we obtain the corresponding tool invocation path through the proposed graph, can we dynamically switch to an alternative path if a problem occurs in the middle of the current path? The paper seems to lack sufficient explanation regarding how to handle such errors.\n2. When using Alpha-Beta pruning for search, the evaluation of Alpha and Beta values is crucial. For instance, if I choose a certain edge under a specific decision, how do you update the evaluation value of this decision in the global context? If only factors like tool invocation success rate and relevance are used, the accuracy of relevance evaluation needs to be very high. From this perspective, the paper’s evaluation of heuristic search seems relatively simplistic, and in some cases, it might eliminate effective tool invocation branches.\n3. How do you evaluate the dependency between two tools? The paper mentions using weights for evaluation—are these weights based solely on the historical information of the tools observed so far? If the invocation relationship between two tools changes significantly, will the tools overly rely on historical data?\n4. Does the proposed framework rely too heavily on the evaluation of tool invocation success rates? If a tool has a certain invocation success rate but delivers excellent results when it works, we might not should sacrifice its usage frequency. Alternatively, for your paper, is tool invocation speed more important compared to the overall reasoning performance?\n5. Real-world requirements are highly diverse. For a new requirement, can this framework demonstrate better tool planning capabilities compared to traditional methods like ReACT and Tool-Planner?"}, "questions": {"value": "See above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "TA2uKWPR1P", "forum": "y7SrBOHz7F", "replyto": "y7SrBOHz7F", "signatures": ["ICLR.cc/2026/Conference/Submission16319/Reviewer_JWrw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16319/Reviewer_JWrw"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16319/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761645495027, "cdate": 1761645495027, "tmdate": 1763608042092, "mdate": 1763608042092, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper presents NaviAgent, a bilevel planning framework for tool-use agents. It separates high-level reasoning (deciding when to respond, clarify, retrieve, or execute) from low-level execution using a Tool World Navigation Model (TWNM), a dynamic graph that captures dependencies among tools. Their quantitative experiments show significant gains in task success and completion rates over baselines."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "The research problem is timely and important, given the rise of agentic LLMs\n\nThe quantitative experiments show consistent improvements over the baselines."}, "weaknesses": {"value": "1. The paper provides no qualitative or quantitative analysis of the learned graph structure; TWNM is evaluated only indirectly through overall task performance, making it difficult to see what the graph actually learns.\n\n2. The high-level decision labels (Direct Response / Clarify / Retrieve / Execute) are derived from rule-based relabeling of ToolBench and API-Bank traces with additional synthetic augmentation, rather than real human data. This raises concerns about whether the learned planner generalizes to real-world cases, particularly in the Direct Response and Clarify categories."}, "questions": {"value": "1. In Section 3.3 (L319–323), the paper mentions repeating recombination “until infeasibility,” but the stopping criterion is not defined. Could the authors clarify how termination is determined?\n\n2. How sensitive is the planner to the 4 action taxonomy? Could a different or better set of decision type help?\n\n3. The paper claims TWNM supports dynamic integration of new tools; do you have evidence for tool generalization unseen during training?\n\n4. How expensive is maintaining and updating TWNM as tool set grows?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "Ntgdj2gGrH", "forum": "y7SrBOHz7F", "replyto": "y7SrBOHz7F", "signatures": ["ICLR.cc/2026/Conference/Submission16319/Reviewer_XNiU"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16319/Reviewer_XNiU"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16319/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761953015903, "cdate": 1761953015903, "tmdate": 1762926457547, "mdate": 1762926457547, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes the NaviAgent bilevel framework, which decouples task planning and execution in LLM tool orchestration. Integrating TWNM (Tool World Navigation Model) to dynamically model tool dependencies and enable closed-loop optimization, NaviAgent outperforms baselines significantly in Task Success Rate (TSR) on the API-Bank and ToolBench datasets, achieving efficient navigation in large-scale tool ecosystems."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1.  Its architectural innovation decouples key components (planning and execution).\n2.  The  TWNM design unifies the capture of both tool structural and behavioral dependencies.\n3.  The paper have conducted comprehensive experiments cover multiple models and scenarios.\n4. The paper is well-written, featuring a clear logical structure."}, "weaknesses": {"value": "1.  There is a gap between tools in simulated and real environments. Real-world APIs are diverse and dynamic, with frequent error fixes, feature updates (e.g., new parameters added), or temporary outages. Although TWNM incorporates a dynamic graph evolution design, it relies on historical execution feedback to update the graph structure, leading to a time gap—for instance, if an API’s error is just fixed but its weight in the graph remains low, NaviAgent may still avoid using it; conversely, sudden API failures without timely pruning result in invalid calls.\n2.  Real-world APIs are extensive, and numerous tools not included in the initial graph exist, causing TWNM to fail in generating optimal toolchains."}, "questions": {"value": "please refer to Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "57DnesspGJ", "forum": "y7SrBOHz7F", "replyto": "y7SrBOHz7F", "signatures": ["ICLR.cc/2026/Conference/Submission16319/Reviewer_JzGE"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16319/Reviewer_JzGE"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16319/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761965461022, "cdate": 1761965461022, "tmdate": 1762926456990, "mdate": 1762926456990, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the challenges LLM-based agents face when orchestrating large-scale, dynamic tool ecosystems, specifically targeting issues arising from sequential, step-by-step tool invocation, such as error accumulation and inability to handle complex inter-tool dependencies. The authors propose NaviAgent, a bilevel framework that decouples high-level task planning from low-level tool execution."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- **Bilevel Decoupling:** The core architecture uniquely decouples high-level task reasoning (the four-dimensional decision space: respond, clarify, retrieve, execute) from low-level tool orchestration. This contrasts with standard ReAct-style agents that interleave reasoning and single-step execution, often leading to error accumulation in complex tasks.\n- **Evolving Tool World Navigation Model (TWNM):** Moving beyond static tool graphs, the TWNM is highly original in its integration of \"behavioral chains\" derived from actual execution traces alongside standard \"structural chains\" (API schemas). Treating inter-tool dependency discovery as a link prediction problem using Heterogeneous Graph Transformers is a sophisticated approach to a typically heuristic-heavy domain.\n- **Search Algorithms for Toolchains:** The adaptation of classic search algorithms—specifically Alpha-Beta pruning for backward search and a hybrid genetic/simulated annealing heuristic for forward search—to orchestrate entire toolchains is a creative departure from standard retrieval-augmented generation (RAG) or simple depth-first search methods."}, "weaknesses": {"value": "- **Cold-Start**: The Tool World Navigation Model (TWNM) heavily relies on \"behavioral chains, derived from historical usage data\" and \"statistical weight... reflecting empirical invocation patterns\". This creates a significant cold-start problem. The framework might underperform significantly in new domains where these rich execution traces are unavailable, yet the paper does not quantify this degradation.\n- **Justifications of Four-Dimensional Decision Space**: The high-level planner uses a fixed \"four-dimensional decision space\" (Direct Response, Intent Clarification, ToolChain Retrieval, Tool Execution). While functional, it is not clear if this specific taxonomy is optimal or necessary compared to a more flexible, LLM-driven dynamic planning approach. It risks being too rigid for edge cases that don't fit neatly into these four categories (e.g., partial execution with mid-stream replanning without full re-retrieval).\n- **No Optimization for Arguments**: For tool function calling tasks, selecting the correct function is important. But most time, LLMs usually fail at using the correct arguments for the functions."}, "questions": {"value": "See Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "JGKgFwPz4l", "forum": "y7SrBOHz7F", "replyto": "y7SrBOHz7F", "signatures": ["ICLR.cc/2026/Conference/Submission16319/Reviewer_4eEC"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16319/Reviewer_4eEC"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16319/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762011659685, "cdate": 1762011659685, "tmdate": 1762926456467, "mdate": 1762926456467, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}