{"id": "yACLq4HoKi", "number": 19502, "cdate": 1758296845794, "mdate": 1759897035537, "content": {"title": "Forecasting Diabetic Complications from Brazilian Billing Codes with Time-Aware Attention", "abstract": "Predicting severe diabetic complications from longitudinal patient traces can enable proactive care. Where multi-institutional EHR integration is impractical, standardized health-insurance claims offer broad, longitudinal coverage despite clinical sparsity. We study this setting in Brazil’s TUSS billing-code ecosystem and present a claims-only framework for forecasting complications (angiopathies, amputations, renal failure) 6–12 months ahead. TUSS codes are represented with skip-gram embeddings, and absolute timing is injected via fixed sinusoidal time embeddings added directly to event vectors; a BiLSTM with self-attention summarizes long, irregular histories. On anonymized data from ~3.9 million individuals, the model achieves an AUC of 0.907 and an Average Precision of 0.631, outperforming capacity-matched baselines. Ablations show that temporal encoding and attention are complementary, with large gains only when combined. We further observe robust transfer to a second operator and concordant blinded field validations that surfaced previously unrecognized high-risk patients. While our contribution is a methodological instantiation rather than an architectural novelty, the work offers a careful case study of claims-only prediction at a national scale, design lessons for modeling sparse transactional health data, and practical evidence for its utility in real-world risk stratification.", "tldr": "Claims-only sequences + sinusoidal time, in a BiLSTM-attention model, forecast severe diabetic complications 6–12 months ahead, transfer across health insurers, and are validated in the field.", "keywords": ["Health Insurance Claims", "Deep Learning", "Temporal Encoding", "Clinical Decision Support", "Diabetic Complications"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a5c113bc81df806e94e729fed0168f529597296c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes to improve diabetes complication prediction by combining BiLSTM with a time embedding and self attention."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "- The large dataset evaluation is good, even with the issues with it being private\n- AUROC/AP are very good metrics (not a fan of F1 for a variety of reasons, but the important stuff is there)"}, "weaknesses": {"value": "- Many missing baselines. In particular, the lack of a gradient boosted tree baseline is critical, as those are both highly performing and require minimal setup.\n- I would also like to see a logistic regression model, mainly because the claimed MLP performance is so low.\n- Lack of evaluation on a public dataset, ideally MIMIC-IV is a significant downside of this paper as it makes reproducibility more challenging\n- Incorrect grammar in various parts of the paper \"Validation/test preserves natural prevalence.\" doesn't make any sense. The writing in general needs to be improved.\n- No discussion of hyperparameter tuning? Especially learning rate, which is very important for both the proposed method and baselines\n- Absolute time as a feature should only be used when time splitting is also used for evaluation (where some years are held out for testing). Otherwise you risk severe absolute time overfitting problems. I don't think time splitting was used during evaluation?\n- Unclearn novelty, especially because sinusoidal time embeddings are pretty common. See for example EHRSHOT. The related work section in general should be more comprehensive\n- It would be good to evaluate on more tasks than just one, diabetes complications. I usually like to see a mix of acute and chronic predictions so we can better understand how a method performs in various environments.\n- Static skip-gram embeddings are not ideal for this setup, with this many patients. You should allow the embeddings to be learned as part of the training (especially since you have so many patients)."}, "questions": {"value": "See weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "dtznkvvMlZ", "forum": "yACLq4HoKi", "replyto": "yACLq4HoKi", "signatures": ["ICLR.cc/2026/Conference/Submission19502/Reviewer_Gysh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19502/Reviewer_Gysh"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19502/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761673154604, "cdate": 1761673154604, "tmdate": 1762931402340, "mdate": 1762931402340, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses predicting diabetic complications from longitudinal patient traces extracted from administrative claims in Brazil’s TUSS billing-code ecosystem, which contain irregular events, sparsity, and noise. The authors propose MedAttention, which combines BiLSTM, Self-attention pooling, and embeddings of TUSS code events and absolute time. MedAttention was evaluated on two administrative claim datasets from different operators and performed better than baselines, with absolute time embeddings and self-attention working in complementary ways."}, "soundness": {"value": 3}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "-- Large-scale analysis for predicting diabetic complications is quite a significant problem, and its importance is well-justified in the paper.\n\n-- Experimental results on multiple datasets containing 3.9 million anonymized patient records demonstrated the effectiveness of the proposed method."}, "weaknesses": {"value": "-- The proposed method may have novel points and have some practical impact, but the clarity issues are too severe to understand the method:\n* In l.157, \"6–12 months ahead\" is vague.\n* In l.159 and l.160, \"outcome\" and \"index date\" are not defined, although they look like important concepts.\n* l.160, the important definition of positive sequence is vague: \"Positive sequences end ≥180 days before the first complication.\"\n* In l.196, the description of TUSS code embeddings is not sufficient and clear enough to understand.\n* In l.201, \"date\", \"t\", \"d\", and \"i\" in the equation are not defined. Why P=10,000days?\n* In l.204, \"tuss\" is not defined.\n* In l.206, how are demographics appended?\n* Section 3.3 is hard to follow. MedAttention should be named in the main text.\n* In l.269, how is Operator 2 validation split?\n* Sections 3.6 and 4.1 are duplicated mostly.\n\n-- Paragraph started from l.130 can be moved to the Ethics statement section since it is less related to the main discussion of the paper.\n\n-- In l.154, the proxy diabetes cohort can be subjective. It is better to justify this process with a reference.\n\n-- In l.192, it is better to justify the oversampling by a reference or an ablation.\n\n-- Miner issues:\n* \\citet{} or \\citep{} should be used for citation.\n* Table 1  and Figure 3 should be described in the main text.\n* l.188, what is \"SD 17\"?\n* Tables and figures are better located at the top."}, "questions": {"value": "Please see above."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "EcTMxBPm6G", "forum": "yACLq4HoKi", "replyto": "yACLq4HoKi", "signatures": ["ICLR.cc/2026/Conference/Submission19502/Reviewer_Tkjq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19502/Reviewer_Tkjq"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19502/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761822082273, "cdate": 1761822082273, "tmdate": 1762931401948, "mdate": 1762931401948, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "ChatGPT said:This paper introduces MedAttention, a time-aware deep learning model for forecasting severe diabetic complications from large-scale Brazilian healthcare billing (TUSS) data.\nThe model combines skip-gram embeddings of medical codes, sinusoidal time embeddings, and a BiLSTM with self-attention pooling to capture long, irregular patient histories."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- The paper has significant real-world meaning, as it demonstrates strong performance on a massive national claims dataset. \n\n- Ablation study is included to support the architecture design of the model."}, "weaknesses": {"value": "- Limited methodological novelty: The model architecture largely combines existing components (skip-gram embeddings, sinusoidal time encoding, BiLSTM with attention) rather than introducing new algorithms or learning objectives.\n\n- The split of training and test set is not well-defined. The beginning of PR-curve in Fig 6 suggests strong over-fitting and data leakage."}, "questions": {"value": "See weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "COtaOenRRv", "forum": "yACLq4HoKi", "replyto": "yACLq4HoKi", "signatures": ["ICLR.cc/2026/Conference/Submission19502/Reviewer_j8Fv"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19502/Reviewer_j8Fv"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19502/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762022748690, "cdate": 1762022748690, "tmdate": 1762931401624, "mdate": 1762931401624, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}