{"id": "yeKgUkFRsF", "number": 3954, "cdate": 1757573276904, "mdate": 1759898061117, "content": {"title": "Taming the Judge: Deconflicting AI Feedback for Stable Reinforcement Learning", "abstract": "Aligning language models using LLM judge feedback offers a scalable alternative to human annotation, yet is plagued by judgment inconsistencies that destabilize reinforcement learning. While prior work has focused on judge accuracy, the critical issue of logical coherence—particularly preference cycles ($A \\succ B \\succ C \\succ A$)—has been largely unaddressed. To address this gap, this work introduces an end-to-end framework to systematically detect and resolve these inconsistencies within the reinforcement learning training loop. Our framework features two core contributions: the \\textbf{Conflict Detection Rate (CDR)}, a novel metric to quantify judgment conflicts, and \\textbf{Deconflicted Graph Rewards (DGR)}, a signal-purification framework that eliminates cycles before policy optimization. DGR constructs preference graphs from raw judgments, transforms them into conflict-free Directed Acyclic Graphs (DAGs), and generates a logically coherent reward signal compatible with any policy optimizer. Experiments confirm that our framework significantly improves training stability and model performance over strong baselines, establishing logical consistency as a crucial and now-addressable dimension of AI feedback. The code for our method is available at \\url{https://anonymous.4open.science/status/DGR-E5DA}.", "tldr": "", "keywords": ["LLM", "Reinforcement Learning from AI Feedback", "Language Model Alignment"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/a3c89da04631e8693287361ad09cbd498394f91e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The work proposes a simple yet effective method to address logical inconsistencies in RLAIF. The authors introduce the Conflict Detection Rate (CDR) metric to capture the ratio of inconsistent pairwise judge results among candidate responses. They further propose Deconflicted Graph Rewards, which leverage graph algorithms to prune inconsistent parts and provide a more reliable scoring mechanism.\n\nExperiments show performance improvements over pointwise, listwise, and other baseline approaches across GRPO and GSPO optimizers, as well as various models and prompt variations. The work also produces several interesting findings, such as the observation that more accurate prompts tend to be more logically inconsistent.\n\nThe study lacks an in-depth analysis of learning dynamics, such as how the purifier affects the number of rollouts in a group, the number of responses maintained during GRPO, and how the mean, standard deviation, and value signals evolve over training. The paper also does not quantify the additional cost introduced by the purification process, which may become significant when the number of rollouts is large.\n\nOverall, the results appear consistently better, although it would be more reassuring to rule out the influence of other confounding factors."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper tackles a highly relevant and important problem: logical inconsistencies in pairwise judge signals for RLAIF. This issue becomes especially critical in subjective tasks, where the reliability of the reward signal directly affects model performance.\n\n2. The proposed method is simple yet effective, leveraging a graph-based approach to prune inconsistent responses. The results demonstrate consistent improvements over pointwise, listwise, and other baseline approaches in RL training.\n\n3. The ablation findings are interesting and thought-provoking, such as the observation that more accurate prompts tend to exhibit greater logical inconsistency. The paper is also well organized, with a clear presentation and a coherent narrative."}, "weaknesses": {"value": "1. There is no comparison of the computational cost associated with the proposed approach. In particular, the purification step is executed on the fly during rollout generation, which likely increases the payload sent to the judge server and introduces additional latency. Quantifying this overhead would provide a clearer picture of the practical trade-offs.\n\n2. The evaluation protocol may be biased. It appears that the authors select the best checkpoint based on benchmark performance rather than using a separate validation set or validation metrics for checkpoint selection. This risks cherry-picking peak results and may overestimate the true performance.\n\n3. The study lacks an in-depth analysis of learning dynamics. For example, the paper does not report how many rollouts are removed by purification throughout training, nor how this evolves as later checkpoints tend to generate more similar quality responses. Understanding these dynamics would help demonstrate that the proposed method is the primary driver of performance improvement, which is especially important for subjective tasks."}, "questions": {"value": "• Have we analyzed how many rollouts or responses remain after the purifier step? This reduction could affect the effective sample size per group and therefore alter the rollout statistics, potentially influencing the learning dynamics.\n\n• Have we measured the Conflict Detection Rate (CDR) for pointwise vs. listwise approaches in RL rollout group to verify whether higher CDR correlates with lower improvements?\n\n• The main results are reported using prompt p1, while the ablations use prompt p5. What is the rationale behind this difference in prompt selection?\n\n• As training progresses, one would expect the model to generate rollouts of increasingly similar quality, which could lead to more rollouts being removed. Did we track how the number of retained rollouts and their statistical properties evolve throughout training?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "AOhqwFXGV8", "forum": "yeKgUkFRsF", "replyto": "yeKgUkFRsF", "signatures": ["ICLR.cc/2026/Conference/Submission3954/Reviewer_4unZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3954/Reviewer_4unZ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission3954/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761531144824, "cdate": 1761531144824, "tmdate": 1762917111702, "mdate": 1762917111702, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses inconsistency in LLM-as-a-judge feedback for preference-based RL (cycles such as $(A\\succ B\\succ C\\succ A))$. It introduces **Conflict Detection Rate (CDR)** to quantify cyclic judgments and **Deconflicted Graph Rewards (DGR)**: construct a pairwise preference graph over group size (G), remove a (near-)minimum feedback arc set to get a DAG, and compute net-win scores as advantages for GRPO/GSPO. Main claims: DGR yields more stable training and better results than pointwise/listwise/pairwise/ELO scoring. Evidence: Fig. 1 shows non-trivial conflict rates; Table 1 reports gains on Arena-Hard, MT-Bench, WritingBench; Tables 2–3 & Fig. 2 present ablations across cycle resolution, prompts, judges, and (n)."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "* **Clear problem diagnosis:** Fig. 1 quantifies non-trivial preference cycles; motivates going beyond accuracy.\n* **Modular method:** DGR is optimizer-agnostic and easy to integrate (Alg. 1).\n* **Ablations:** Table 2 shows optimal cycle resolution > random/reversal; Table 3/Fig. 2 suggest robustness across prompts/judges/(n).\n* **Practical relevance:** Improves GRPO/GSPO on multiple benchmarks (Table 1)."}, "weaknesses": {"value": "* **Missing principled baselines:** No Rank Centrality/BTL/Hodge/Kemeny comparisons [1–5]; this is central for scientific credibility.\n* **Robustness under-reported:** Peak-of-training from two runs; no mean±SD/CI or budget-normalized curves.\n* **Judge bias risk:** Sole reliance on GPT-4.1/Claude; no human study or multi-judge aggregation [7,8].\n* **Scalability unclear:** FAS step’s overhead vs. (G)/batch size not quantified; solver/heuristic choices not profiled [5,6].\n* **Potential leakage:** No explicit de-dup between training sources and evaluation sets; needs clarification."}, "questions": {"value": "1. Could you include Rank Centrality, BTL/Plackett–Luce, HodgeRank, and Kemeny/Minimum-FAS baselines under the same protocol, or explain why they are infeasible [1–5]?\n2. Could you report means±SD over at least five seeds (or 95% CIs) and provide full training curves, rather than peak-only metrics?\n3. What is the wall-clock overhead and throughput (tokens/s) of DGR as group size (G) varies (e.g., 4, 6, 8, 10, 12, 16), and how do exact vs. heuristic FAS methods compare [5,6]?\n4. Were the baselines tuned fairly under identical budgets, and can you provide the exact hyperparameters and sweeps used?\n5. Did you perform de-duplication between training corpora and Arena-Hard/MT-Bench/WritingBench, and if so, what were the procedures and counts?\n6. Can you add a small human evaluation or a multi-judge ensemble to assess and mitigate judge bias [7,8]?\n\n### References\n[1] Negahban, Sahand, Sewoong Oh, and Devavrat Shah. \"Iterative ranking from pair-wise comparisons.\" Advances in neural information processing systems 25 (2012).\n[2] Hunter, David R. \"MM algorithms for generalized Bradley-Terry models.\" The annals of statistics 32.1 (2004): 384-406.\n[3] Jiang, Xiaoye, et al. \"Statistical ranking and combinatorial Hodge theory.\" Mathematical Programming 127.1 (2011): 203-244.\n[4] Ailon, Nir, Moses Charikar, and Alantha Newman. \"Aggregating inconsistent information: ranking and clustering.\" Journal of the ACM (JACM) 55.5 (2008): 1-27.[5] Kenyon-Mathieu, Claire, and Warren Schudy. \"How to rank with few errors.\" Proceedings of the thirty-ninth annual ACM symposium on Theory of computing. 2007.\n[6] Eades, Peter, Xuemin Lin, and William F. Smyth. \"A fast and effective heuristic for the feedback arc set problem.\" Information processing letters 47.6 (1993): 319-323.\n[7] Zheng, Lianmin, et al. \"Judging llm-as-a-judge with mt-bench and chatbot arena.\" Advances in neural information processing systems 36 (2023): 46595-46623.\n[8] Chiang, Wei-Lin, et al. \"Chatbot arena: An open platform for evaluating llms by human preference.\" Forty-first International Conference on Machine Learning. 2024."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "pi3LxweUnP", "forum": "yeKgUkFRsF", "replyto": "yeKgUkFRsF", "signatures": ["ICLR.cc/2026/Conference/Submission3954/Reviewer_dZQf"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3954/Reviewer_dZQf"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission3954/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761750157013, "cdate": 1761750157013, "tmdate": 1762917111509, "mdate": 1762917111509, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces CDR, a simple measure of preference non-transitivity/circularity in a pairwise judge model, and DGR, a method to de-cycle a set of pairwise preferences and use them for RL training by converting them into point-wise reward. The paper uses the former to compare judge models & judge prompts, and uses the latter to train models on pairwise preferences labeled by judge model, receiving higher scores on most of the tested domains when compared to some baseline methods."}, "soundness": {"value": 1}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "**Clarity**: The paper is well-written and easy to follow. Method and experiment details are clearly and concisely specified; the motivation is also clear.\n\n**Significance**: Non-transitivity is an important problem especially in the case of pluralistic preferences in a population, although the authors did not study this setup specifically."}, "weaknesses": {"value": "Key weaknesses:\n1. **Strong baselines missing (DPO and RM-based preference optimization)**: There is reason to believe that classical RMs (trained with contrastive loss on pairwise preferences), as well as DPO, are a good solution to preference non-transitivity/circularity, but they are not compared against in the experiments.\n    - RMs enforce a linear order over responses (as they assign cardinal rewards to them), and their training minimizes disagreement (measured with a logistic function) with the possibly inconsistent preferences. In other words, the trained RMs de-conflicts the preferences and put them into a linear order. \n    - The same goes for DPO, which optimizes an implicit RM. \n    - Both RMs and DPO nominally relies on the B-T model, but as I have outlined above, in the regime with inconsistent preferences, they are no less theoretically sound than DGR. DGR also enforces a linear order against inconsistent preferences, with the only difference being that DGR uses an ordinal punishment for disagreement (every feedback arc in the graph counts the same), while RMs/DPO uses a cardinal punishment (a feedback arc is punished more if the reward difference between its endpoints is larger; exact amount of punishment defined by a logistic function). \n    - There is thus no theoretical reason suggesting the DGR-based method will work better than DPO or classical RMs, and, at the same time, there is no experiment empirically comparing them either.\n2. **Strong baselines missing (Nash equilibrium approaches)**: In 2023, there are solutions proposed to handle non-transitivity and other problems with preference optimization methods based on the B-T model [1]. There have, seen then, been many followup works [2,3,4]. They are not mentioned in the paper, nor compared against in the experiments.\n\nOther weaknesses:\n1. From my experience, many of the WildChat questions (e.g. user asking a text-only model to generate image) don't have much to do with model capability. This is consistent with the observation that trained model see limited performance improvement on the capability-focused evaluation in Table 1.\n2. Statistical significance is not reported, which is especially important given the small effect sizes of training.\n3. Re \"peak score achieved across all training step\": the rigorous approach would be to use a validation set to select a best step for each training approach, then compare the single best step of each training approach on a test set. Without this split, we introduces maximization bias.\n\n[1] Nash Learning from Human Feedback\n\n[2] Iterative Nash Policy Optimization: Aligning LLMs with General Preferences via No-Regret Learning\n\n[3] Online Iterative Reinforcement Learning from Human Feedback with General Preference Model\n\n[4] Improving LLM General Preference Alignment via Optimistic Online Mirror Descent"}, "questions": {"value": "1. I'd appreciate results addressing the weaknesses outlined above. \n2. On Figure 1(a): How much does the ranking change across prompts? To what extent can the ranking be an artifact of the specific prompts you choose? Also, adding confidence intervals would be helpful.\n3. On Table 1: What is the sample size for evaluation? Are the differences statistically significant? I'd be keen to see confidence intervals and/or pairwise t-tests, including baseline vs DGR, and other methods vs DGR.\n4. Re \"two independent experimental runs\": Do the performance rankings differ significantly between these two runs? If yes, it would make sense to add more runs until the aggregate stabilizes.\n\nMinor: It seems that you use \"judge model\" and \"reward model\" interchangeably in the paper, e.g., in the section heading of 4.4.2. I suggest referring to them simply as judge models, as reward models typically refer to those that give pointwise rewards, especially those trained to give logit-based rewards."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4zMs3X8F5L", "forum": "yeKgUkFRsF", "replyto": "yeKgUkFRsF", "signatures": ["ICLR.cc/2026/Conference/Submission3954/Reviewer_x3KX"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3954/Reviewer_x3KX"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission3954/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761824069356, "cdate": 1761824069356, "tmdate": 1762917111281, "mdate": 1762917111281, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper addresses the problem of logical inconsistencies, specifically preference cycles (A>B, B>C, C>A), in AI-generated feedback for Reinforcement Learning from AI Feedback (RLAIF). The authors propose a two-part framework: a Conflict Detection Rate (CDR) metric to quantify these inconsistencies, and Deconflicted Graph Rewards (DGR), a graph-theoretic method that transforms raw, conflicted pairwise judgments into a logically consistent reward signal by removing a minimal set of edges to break cycles. Experiments on benchmarks like Arena-Hard and MT-Bench show that DGR, when integrated with policy optimizers like GRPO and GSPO, outperforms baseline methods (Pointwise, Listwise, Pairwise, ELO) in training stability and final model performance."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "1. The paper correctly identifies a significant and often overlooked issue in RLAIF.\n\n2. The paper is well written and easy to understand."}, "weaknesses": {"value": "**1. Lack of theoretical justification for core methodology.**\n\nThe paper's central contribution—resolving preference cycles by deleting edges to create a Directed Acyclic Graph (DAG)—lacks sufficient theoretical grounding. The authors employ a minimum feedback arc set (FAS) approach but fail to justify why this particular graph transformation preserves the underlying \"true\" preference ordering. Crucially, there is no discussion of:\n\n- Edge deletion criteria: The paper does not explain how the algorithm chooses which specific edges to remove, nor does it provide theoretical or empirical evidence that the removed edges correspond to \"noisy\" or incorrect judgments rather than legitimate preference expressions. \n\n- Preference preservation: The authors assume that the deconflicted DAG accurately reflects the original preference system, but no analysis demonstrates that the transformation minimizes distortion of the judge's intent. Alternative conflict-resolution strategies (e.g., edge reversal or probabilistic approaches) are not sufficiently explored or theoretically compared.\n\n- Transitivity assumptions: The method implicitly assumes that acyclic preferences are inherently superior, but real-world human preferences can exhibit legitimate non-transitivities. The work does not address when cycles might reflect nuanced judgment rather than error.\n\n**2. Incomplete and insufficient baseline comparisons.**\n\nMissing learned reward model baseline: The authors compare only against rule-based scoring methods (Pointwise, Listwise, Pairwise, ELO). The most relevant and baseline, i.e., a learned reward model (e.g., Bradley-Terry model trained on the pairwise data), is absent. Such models naturally aggregate noisy preferences and can handle inconsistencies through probabilistic modeling, making them a fundamental benchmark for any preference-purification method.\n\n**3. The paper neglects recent work that addresses circele preference.**\n\nThe article lacks research on work in the same field, for example, the following papers all discuss the issue of non-transitivity:\n\n[1] A Minimaximalist Approach to Reinforcement Learning from Human Feedback\n\n[2] Self-Play Preference Optimization for Language Model Alignment\n\n[3] Distributional Preference Learning: Understanding and Accounting for Hidden Context in RLHF"}, "questions": {"value": "Same as weakness"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "X2RWhQuvuV", "forum": "yeKgUkFRsF", "replyto": "yeKgUkFRsF", "signatures": ["ICLR.cc/2026/Conference/Submission3954/Reviewer_wxgP"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission3954/Reviewer_wxgP"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission3954/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761903268070, "cdate": 1761903268070, "tmdate": 1762917110843, "mdate": 1762917110843, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}