{"id": "YjMCArLE1r", "number": 8440, "cdate": 1758083643674, "mdate": 1762958884489, "content": {"title": "R2Q: Residual Refinement Quantization for Robust 2-Bit Large Language Models", "abstract": "The dramatic growth of Large Language Models (LLMs) has been accompanied by significant computational and memory demands, driving the adoption of low-bit quantization. While 8-bit and 4-bit formats have become standard, ultra-low-bit quantization, particularly 2-bit, presents a substantial challenge due to severe accuracy degradation. To address this, we propose Residual Refinement Quantization (R2Q)—a novel 2-bit quantization strategy that decomposes the quantization process into two sequential 1-bit subproblems, enabling adaptive quantization lattice. Extensive experiments on Llama, OPT and Qwen were conducted across diverse benchmarks, including question answering, commonsense reasoning, and language modeling. The results demonstrate that R2Q consistently outperforms state-of-the-art 2-bit quantization baselines in both coarse-grained and fine-grained settings. The refinement-based design of R2Q not only  enhances quantization performance but also improves training stability and convergence under aggressive compression. Furthermore, R2Q is modular by design and can be seamlessly integrated into existing quantization-aware training (QAT) pipelines.", "tldr": "This paper proposes Residual Refinement Quantization, a plug-and-play method that decomposes 2-bit quantization into two 1-bit subproblems, enabling a flexible quantization lattice, improving gradient stability, and accelerating convergence.", "keywords": ["Large Language Models", "Quantization-Aware Training", "2-bit quantization"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/0bcc80106f337e9e3cd179b2fbbb963a275d0d50.pdf", "supplementary_material": "/attachment/97156fdd1625214107e76754a00e1881dcf63e1e.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes an activation free, 2-bit quantization-aware training (QAT) method. The quantization method consists of two steps: 1 bit coarse approximation and 1 bit residual refinement. This quantization method is effective with QAT on many benchmarks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. This paper provides a novel 2-bit quantization method that decomposes a 2-bit quantization problem into 2 1-bit quantization subproblems, which brings performance gain on final benchmarks. They further show R2Q can be used in the QAT framework.\n2. This paper touches on an interesting problem: the trade-off between the number of bits and the number of high-precision scalers given a fixed group size in group-wise quantization."}, "weaknesses": {"value": "1. R2Q would increase the inference latency in theory because it brings the addition operation compared to 2-bit Round-to-Nearest, and the authors did not provide a numerical study of by how many degrees the slow down can be. To improve this, authors can provide speed profiling results and analyze that under what circumstances the latency is acceptable or give a practical guide about the latency.\n\n2. Some benchmark improvement is meaningless because both R2Q and baseline methods are based on random guesses. For example, almost all MMLU numbers are based on random guesses, 25%, and the same for ARC-Challenge.\n\n3. R2Q claims effectiveness on QAT, which consists of pretraining and supervised fine-tuning, but experiments are limited to QAT for continual pretraining. QAT for supervised fine-tuning (given a prompt, predicting the response) remains unexplored.\n\n4. This paper does not compare R2Q to small models, which undermines the necessity of R2Q. The necessity of 2-bit QAT comes from the memory constraint of some devices. Therefore, it is natural to compare it with small models that take the same memory as quantized models. For example, a 2-bit Qwen3-8B and Qwen3-1.5B."}, "questions": {"value": "1. What teacher model did you use in the experiments? Did you use one set of synthetic data for all model training, or does each model family have its own set of synthetic data? What is the training dataset size? How many epochs did you train? Please provide these necessary experiment details.\n2. Why does LLM-QAT perform far worse than a random guess on ARC-C, only about 20%? I raise doubts about the soundness of the experiments.\n3. Do you have the results of Qwen2.5-7B or Qwen3-8B in Table 1? Qwen is an important model family, and providing results of the Qwen series would increase the soundness of the experiments.\n4. Can you compare 2-bit Qwen3-8B and Qwen3-1.5B? If 2-bit Qwen3-8B fails to match the performance of Qwen3-1.5B, R2Q is not attractive even if it outperforms other QAT baselines. I would raise my score to 6 if this concern can be addressed."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Z5fDRlY5HI", "forum": "YjMCArLE1r", "replyto": "YjMCArLE1r", "signatures": ["ICLR.cc/2026/Conference/Submission8440/Reviewer_9RB6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8440/Reviewer_9RB6"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8440/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761516067802, "cdate": 1761516067802, "tmdate": 1762920331193, "mdate": 1762920331193, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}}, "id": "8SyoL7YMyU", "forum": "YjMCArLE1r", "replyto": "YjMCArLE1r", "signatures": ["ICLR.cc/2026/Conference/Submission8440/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8440/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762958883827, "cdate": 1762958883827, "tmdate": 1762958883827, "mdate": 1762958883827, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "To address the high memory consumption of large language models, the authors propose a 2-bit quantization-aware training (QAT) method that decomposes the 2-bit quantization task into two sequential 1-bit quantization subproblems. \nFor each quantization subproblem, the quantization parameter $\\alpha$ is optimized by minimizing the quantization error. \nExperimental results demonstrate that the proposed method improves the performance of 2-bit quantized models on language understanding and modeling tasks, compared with conventional uniform bit-width QAT methods."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper provides thorough mathematical derivations to justify the selection of quantization parameters, enhancing the rigor of the proposed approach.\n2. The method is designed as a plug-and-play module, making it easily adaptable to various training loss functions and broadly applicable across different model architectures."}, "weaknesses": {"value": "1. The performance of R2Q on certain benchmarks appears limited. For instance, in Table 1 and Table 2, the 2-bit LLaMA-7B model achieves around 25% accuracy on ARC-Challenge and MMLU, which is close to random choosing. This may suggest that further optimization is needed for challenging tasks.\n2. The choice of baselines could be strengthened. For example, EfficientQAT [1], which employs a uniform bit-width QAT strategy, reports only a 5.35% performance drop on the 2-bit LLaMA2-7B model. In addition, the paper does not include comparisons with non-uniform quantization methods like QuIP# [2], which may limit the comprehensiveness of the experimental evaluation.\n3. The paper focuses primarily on model accuracy and quantization methodology, but does not provide an assessment of hardware efficiency, such as latency and throughput. Including such results would help demonstrate the practical benefits of R2Q in real-world deployment scenarios.\n4. Some notations and formulas in the paper could be presented more clearly. For example, in Equation (11), the notation for the Frobenius norm appears to be incorrect; in lines 247–248, the subscript $i$ is not properly formatted; and in Equations (13) and (15), the symbols $\\mathcal{H}(\\cdot)$ and $\\text{sign}(\\cdot)$ are used to denote the same operation. Refining these notations would improve readability and reduce potential ambiguity.\n\n[1] Chen, Mengzhao, et al. \"EfficientQAT: Efficient Quantization-Aware Training for Large Language Models.\"\n\n[2] Tseng, Albert, et al. \"QuIP$#$: Even Better LLM Quantization with Hadamard Incoherence and Lattice Codebooks.\" International Conference on Machine Learning. PMLR, 2024."}, "questions": {"value": "See weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "T6q4SXPDjv", "forum": "YjMCArLE1r", "replyto": "YjMCArLE1r", "signatures": ["ICLR.cc/2026/Conference/Submission8440/Reviewer_571J"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8440/Reviewer_571J"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8440/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761579489951, "cdate": 1761579489951, "tmdate": 1762920330587, "mdate": 1762920330587, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes R2Q (Residual Refinement Quantization), a 2-bit quantization method for large language models that decomposes the quantization problem into two sequential 1-bit subproblems.\nThe authors claim R2Q enables an adaptive quantization lattice superior to static Round-To-Nearest (RTN) approaches and can be integrated as a plug-and-play module into existing quantization-aware training (QAT) frameworks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "**1. Conceptual novelty.** The core idea of decomposing 2-bit quantization into two 1-bit subproblems with residual refinement is interesting and provides a more adaptive quantization lattice compared to existing RTN-based methods.\n\n**2. Comprehensive experimental evaluation.** The paper presents experiments across diverse benchmarks.\nThe ablation studies effectively demonstrate the contribution of the residual refinement stage.\n\n**3. Improved training stability.** The gradient stability analysis in Figure 3 convincingly shows that R2Q integration reduces gradient fluctuations and enables faster, smoother convergence compared to RTN-based approaches."}, "weaknesses": {"value": "**1. Poor performance despite QAT; weak empirical justification for 2-bit QAT usefulness.** Despite employing computationally expensive QAT, the 2-bit quantized models show severely degraded performance. \nThese substantial accuracy drops raise questions about whether 2-bit quantization with QAT is practically viable, especially when 4-bit PTQ methods like OPTQ and AWQ can achieve much smaller accuracy losses with significantly lower training costs. \nFurthermore, comparison with 2-bit VQ methods is missing—these often perform well even with PTQ alone. \nAlthough R2Q achieves fast inference, the resulting models perform too poorly to be of practical use, undermining the claimed motivation for ultra-low-bit quantization.\n\n**2. Insufficient verification for mobile/edge deployment.** Although the motivation heavily emphasizes “on-device LLMs,” the paper does not present any runtime, latency, or memory measurements on actual mobile hardware or simulated platforms. \nThe claim that R2Q preserves “matmul-free efficiency” is discussed only theoretically in Appendix E, but it is never validated on real mobile devices or even on PC-level kernels. \nAt minimum, an implementation-level validation (e.g., using a standard CUDA or CPU kernel) is necessary to demonstrate that R2Q’s binary decomposition indeed provides computational benefits. \nIf embedded-device evaluation is infeasible, the authors should at least verify that the proposed kernel achieves stable runtime performance on a single commodity GPU under realistic inference workloads. \nWithout such evidence, the claim of deployability for resource-constrained environments remains speculative.\n\n**3. Lack of scalability and architectural diversity.** \nThe experiments are limited to a small set of mid-sized models (OPT-6.7B, LLaMA-7B, and Qwen-4B/7B), leaving scalability unverified. \nThere is no evidence that R2Q generalizes to larger models such as 70B-scale LLMs, where quantization behavior often differs significantly due to wider activation distributions and heterogeneous layer norms. \nIn addition, the study omits evaluations on other architectures such as LLaMA-2, LLaMA-3, Qwen2, Mistral, and similar families, which are commonly used in the community. \nResults on mixture-of-experts (MoE) models like Mixtral would also be essential to verify robustness under sparse-activation settings. \nWithout experiments covering diverse model sizes and architectures, the paper fails to demonstrate R2Q’s scalability and general applicability beyond the tested configurations.\n\n**Misc.**\n1. The paper suffers from numerous structural and formatting issues that hinder readability:\n- Some citations are not properly written via ~\\citep{} (e.g., lines 212, 372, 373).\n- The appendix should be contained within the main manuscript after the references, following ICLR formatting rules. Placing it in a separate supplementary file disrupts readability.\n- All tables and figures should appear at the top of each page within their corresponding sections for scientific clarity and consistency.\n- There are many other structural inconsistencies throughout the manuscript, which collectively make the paper feel unpolished.\n2. The released code is incomplete and non-reproducible - only a bare train.py and a few utility files are provided without README.md, example commands, or scripts (.sh) for reproducing the results. \nWithout a runnable setup, this cannot be considered a proper code release. \nFor rebuttal, the authors should ensure a complete and validated code release to avoid rejection.\n3. From the reviewer’s viewpoint, the writing could be further improved. \nAlthough the idea itself is simple and easy to understand, the writing lacks clarity and makes it unnecessarily difficult for the reviewer to follow the core message."}, "questions": {"value": "Refer to Weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "EVESHvhatk", "forum": "YjMCArLE1r", "replyto": "YjMCArLE1r", "signatures": ["ICLR.cc/2026/Conference/Submission8440/Reviewer_6ayK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8440/Reviewer_6ayK"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8440/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761815863610, "cdate": 1761815863610, "tmdate": 1762920330198, "mdate": 1762920330198, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes R2Q, a new quantization scheme designed for ultra-low bitwidth quantization. However, the proposed method appears to be quite similar to existing quantization approaches [1, 2], and both experimental results and analyses are insufficient to demonstrate clear advantages. In my opinion, this paper requires substantial improvements before being considered in a top-tier conference."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "Unfortunately, I did not identify any notable strengths in the current version of this paper."}, "weaknesses": {"value": "* **Novelty.** The proposed method, R2Q, appears quite similar to previously published quantization schemes [1, 2]. The authors should properly cite related work and provide a detailed discussion highlighting the differences and advantages of R2Q.\n\n* **Experimental setup.** The experiments primarily use outdated and relatively small models, e.g. Llama 7B and OPT 6.7B. This makes it difficult to assess whether the proposed method can be generalized to or remain effective for more recent and larger models.\n\n* **Analysis.** Although the paper introduces a new quantization scheme, it lacks comparisons on key practical metrics, such as inference speed and memory usage against existing methods. These evaluations are critical for validating the efficiency of the approach."}, "questions": {"value": "* Could you clarify the differences between R2Q and the quantization schemes used in existing methods [1, 2]?\n\n\n**Reference**\n\n[1] Xu, Chen, et al. \"Alternating multi-bit quantization for recurrent neural networks.\" arXiv preprint arXiv:1802.00150 (2018).\n\n[2] Kwon, Se Jung, et al. \"Alphatuning: Quantization-aware parameter-efficient adaptation of large-scale pre-trained language models.\" arXiv preprint arXiv:2210.03858 (2022)."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "IZOKjR2zOc", "forum": "YjMCArLE1r", "replyto": "YjMCArLE1r", "signatures": ["ICLR.cc/2026/Conference/Submission8440/Reviewer_3Qko"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8440/Reviewer_3Qko"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission8440/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761929591471, "cdate": 1761929591471, "tmdate": 1762920329782, "mdate": 1762920329782, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}