{"id": "Ylf5t1j4Yu", "number": 10836, "cdate": 1758182949841, "mdate": 1759897625614, "content": {"title": "Case-Based Reasoning Enhances the Predictive Power of LLMs in Drug-Drug Interaction", "abstract": "Drug–drug interaction (DDI) prediction is critical for treatment safety. While large language models (LLMs) show promise in pharmaceutical tasks, their effectiveness in DDI prediction remains challenging. Inspired by the well-established clinical practice where physicians routinely reference similar historical cases to guide their decisions through case-based reasoning (CBR), we propose CBR-DDI, a novel framework that distills pharmacological patterns from historical cases to improve LLM reasoning for DDI tasks. CBR-DDI constructs a knowledge repository by leveraging LLMs to extract pharmacological insights and graph neural networks (GNNs) to model drug associations. A hybrid retrieval mechanism and two-tier knowledge-enhanced prompting allow LLMs to effectively retrieve and reuse relevant cases. We further introduce a representative sampling strategy for dynamic case refinement. Extensive experiments demonstrate that CBR-DDI achieves state-of-the-art performance, with a significant 28.7% accuracy improvement over both popular LLMs and CBR baseline, while maintaining high interpretability and flexibility.", "tldr": "We propose CBR-DDI, a novel framework that distills pharmacological patterns from historical cases to improve LLM reasoning for Drug-Drug Interaction tasks.", "keywords": ["LLM", "Drug-Drug Interaction", "Case-Based Reasoning"], "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/cd7da5c02e4ace7efcfbea83d46959e56802474a.pdf", "supplementary_material": "/attachment/6aa969f8670ff2b126e12f714ee23399a8876cea.zip"}, "replies": [{"content": {"summary": {"value": "This paper proposes CBR-DDI, a framework that distills pharmacological patterns from historical cases to improve LLM reasoning for DDI (Drug-Drug Interaction) tasks."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "Applying LLMs for drug-drug interaction prediction is interesting"}, "weaknesses": {"value": "- Data Leakage Handling: How was data leakage addressed? While the evaluation protocol confirms evaluation on new drugs, there is no guarantee that the LLM has not been trained on these new drugs. The fact that the LLM uses the drug name instead of the SMILES (Simplified Molecular-Input Line-Entry System) for generating descriptions suggests a possibility that the LLM may already possess information about the drug based on its name.\n\n- Knowledge Graph Coverage: Is it possible for test drugs to be absent from the knowledge graph? If so, how are these cases handled?\n\n- Relationship between Retrieval Accuracy and Performance (Experiment 4.3.2): What is the relationship between retrieval accuracy and the actual performance in Experiment 4.3.2? Does accurate retrieval lead to an increase in actual performance?"}, "questions": {"value": "See Weaknesses Section"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "eei0wlGMqK", "forum": "Ylf5t1j4Yu", "replyto": "Ylf5t1j4Yu", "signatures": ["ICLR.cc/2026/Conference/Submission10836/Reviewer_kDBh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10836/Reviewer_kDBh"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission10836/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761586663277, "cdate": 1761586663277, "tmdate": 1762922040237, "mdate": 1762922040237, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents CBR-DDI, an LLM-based method for predicting drug-drug interactions (DDIs). CBR-DDI uses a combination of an LLM and a GNN to incorporate drug interaction data with historical context about its use. By doing this, CBR-DDI better reflects the clinical practice of using previous cases to inform current ones. Overall, the authors have completed lots of interesting work to showcase the approach, comparing it against a suite of baseline methods and providing a case study of its success. However, it was unclear why an LLM was used at the beginning of the pipeline (and whether this was an appropriate choice) and why the authors tested their approach on new drugs. Please see below for the clarifications I would suggest."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "**Strong points:**\n- The authors benchmarked the approach against a suite of many diverse approaches. I really applaud the authors for choosing benchmarks from both graph-based and LM-based approaches.\n- Section 3.3.1: The approach here which balances semantic and structural similarity is very clever and sensible with respect to the task at hand.\n- Well done to the authors for adjusting the metrics appropriately based on the nature of each dataset (DrugBank and TWOSIDES)- it shows that the authors really familiarized their selves with the datasets.\n- For the most part, the claims made follow from the results provided.\n- DDI prediction is much less researched than other drug discovery tasks, so it is an important area of research.\n- Really nice figures."}, "weaknesses": {"value": "**Weak points**\n\n- Sections 3.2 and 3.3.2: Why use an LLM to generate drug descriptions or mechanism insights? Such descriptions are available on professionally curated databases (e.g., https://go.drugbank.com/drugs/DB00945 or https://pubchem.ncbi.nlm.nih.gov/compound/Aspirin). LLMs are infamous for hallucinations and mistakes in scientific disciplines. Thus, I would argue that this step, alone, needs to be validated before proceeding with the whole pipeline. For example, the authors ask the LLM to generate mechanistic insights, but I would suggest that you need to, somehow, verify that it can reliably generate those. Perhaps https://github.com/SuLab/DrugMechDB could help.\n- It is not entirely clear why the authors tested the approach on drug pairs between new and existing or both new drugs. In the beginning, the authors even say: “These challenges become even more pronounced when predicting interactions involving new drugs, where interaction data is typically sparse or nonexistent.” If historical context is unavailable for new drugs, then how is this a useful approach for such drug pairs?\n- A couple sentences in the introduction are difficult to understand:\n    - “However, these methods provide only triplets and are insufficient to activate the reasoning capabilities of LLMs, as surface-level drug associations alone cannot reveal their potential interactions evidently” -->\n        - The terms “surface-level” and “potential interactions” are quite vague so it’s not clear what’s meant here.\n        - It’s also not clear what it means to “activate the reasoning capabilities of LLMs”.\n        - Why are triplets not sufficient? Is there a paper that demonstrates this insufficiency?\n    - “For example, in Figure 1, the new drug pair Fosphenytoin-Diphenhydramine binds to the same gene, yet their actual interaction cannot be directly inferred.”\n        - The way this sentence is structured is confusing. The subject of the sentence is singular, but then \"their\" is used. Also, the way it's worded implies that a \"drug pair\" is one entity which binds to a gene.\n        - This sentence also seems to imply that interactions between drugs are literal, physical interactions between drugs as opposed to interferences or cumulative effects on biological systems."}, "questions": {"value": "I would ask the authors to provide some clarification or validation with respect to the above weak points.\n\n1. Can the authors please justify why the use of an LLM to generate drug functional descriptions and interaction mechanisms, as opposed to using curated resources available from databases?\n2. Can the authors either validate, experimentally, that the output of the first LLM step is reliable or correct, or justify why such validation is not necessary?\n3. Please elaborate on why testing was done on new drugs and how this fits into the use of historical context and CBR.\n4. Could the authors please clarify the above sentences in the Weaknesses section?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "lF1gAnmCsu", "forum": "Ylf5t1j4Yu", "replyto": "Ylf5t1j4Yu", "signatures": ["ICLR.cc/2026/Conference/Submission10836/Reviewer_6rWq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10836/Reviewer_6rWq"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission10836/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761844242528, "cdate": 1761844242528, "tmdate": 1762922039419, "mdate": 1762922039419, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "1.This paper proposes CBR-DDI, a framework for DDI reasoning that enhances traditional LLM-based DDI inference by incorporating CBR (Case-Based Reasoning), i.e., historical cases of drug interactions. Subsequent innovations in retrieval mechanisms and knowledge base construction are also designed to support this approach.\n \n 2.For the construction of the DDI knowledge base, unlike traditional methods that rely on knowledge graphs (entity, relation, entity), this paper not only integrates information from authoritative datasets but also incorporates \"mechanism insights\" and \"drug descriptions,\" which are inferred by the LLM based on knowledge graph information.\n\n  3.Hybrid retrieval mechanism: When performing DDI reasoning, the paper not only uses the structural similarity of drugs to retrieve interaction information from similar drugs as references but also leverages the semantic similarity of drug descriptions. These two similarity scores are weighted and combined to form a final similarity score, which is then used to select reference drugs.\n\n  4.Dual-layer knowledge enhancement: The two layers refer to knowledge from authoritative datasets (internal knowledge) and \"mechanism insights\" and \"drug descriptions\" generated by the LLM (internal knowledge). These two types of knowledge are jointly used to prompt the LLM for reasoning.Experimental results demonstrate a 28.7% improvement in accuracy compared to LLM and CBR baselines."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 4}, "strengths": {"value": "1.\tThe paper is well-structured and easy to follow, allowing readers to quickly grasp the content even without prior specialized knowledge.\n\n2.\tThe methodology is rigorous, incorporating research and refinements across multiple aspects including knowledge base construction, data retrieval, and knowledge enhancement.\n\n3.\tThe experiments are comprehensive, featuring not only comparisons with baseline models but also ablative studies evaluating the proposed method itself."}, "weaknesses": {"value": "1.\tThe paper does not consider the structural information of the drugs themselves, such as the graph structures of molecular or protein-based drugs, relying instead on textual information and interaction relationships.\n2.\tThe study does not incorporate expert evaluation to validate the practical effectiveness of the proposed method.\n3.\tBoth drug descriptions and mechanism insights rely on large language models (LLMs). During inference, the LLM needs to generate three components: drug descriptions, mechanism insights, and reasoning results, resulting in poor inference efficiency. Moreover, could errors in the three outputs generated by the LLM accumulate, leading to progressively amplified errors during the reasoning process?"}, "questions": {"value": "N/A"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "JKWJxDGG9R", "forum": "Ylf5t1j4Yu", "replyto": "Ylf5t1j4Yu", "signatures": ["ICLR.cc/2026/Conference/Submission10836/Reviewer_DEX8"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10836/Reviewer_DEX8"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission10836/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761901727384, "cdate": 1761901727384, "tmdate": 1762922038884, "mdate": 1762922038884, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles the problem of drug-drug interaction prediction. Based on a given biological knowledge graph, the method first builds a knowledge repository of previously known drug-drug interaction cases (this process is made efficient with representative sampling). At inference time, the system retrieves relevant historical cases using semantic and structural similarity. The retrieved cases are then incorporated into a prompt to a LLM that performs the final prediction. The authors evaluate their method on the DrugBank and TWOSIDES datasets and show that it improves over both graph based methods and naive LLM methods by a sizeable margin."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "- This work proposes a very effective solution for an important and impactful problem (drug drug interaction prediction)\n- The paper is clearly written and easy to follow\n- The authors run extensive ablations to study the impact of each of the components."}, "weaknesses": {"value": "- The major weakness of this work is its relevance for a machine learning conference like ICLR. The approach is elegant and outperforms baselines on that particular problem. However, there is no substantial machine learning contributions. That said the paper is really creative way to solve the drug-drug interaction problem and might better shine in a venue more focused on that particular problem.\n\n- The architecture of CBR-DDI is highly tailored to the drug drug interaction problem and it's not clear whether it could be applied easily in other contexts."}, "questions": {"value": "- Do the authors think that the approach presented here could benefit other application areas ?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "gp4PFeTIXV", "forum": "Ylf5t1j4Yu", "replyto": "Ylf5t1j4Yu", "signatures": ["ICLR.cc/2026/Conference/Submission10836/Reviewer_LiBx"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission10836/Reviewer_LiBx"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission10836/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761949147226, "cdate": 1761949147226, "tmdate": 1762922038243, "mdate": 1762922038243, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}