{"id": "YPfSfqVedI", "number": 18666, "cdate": 1758289855789, "mdate": 1759897089028, "content": {"title": "PersonaLedger: Generating Realistic Financial Transactions with Persona Conditioned LLMs and Rule Grounded Feedback", "abstract": "Strict privacy regulations limit access to real transaction data, slowing open research in financial AI. Synthetic data can bridge this gap, but existing generators do not jointly achieve behavioral diversity and logical groundedness. Rule-driven simulators rely on hand-crafted workflows and shallow stochasticity, which miss the richness of human behavior. Learning-based generators such as GANs capture correlations yet often violate hard financial constraints and still require training on private data. We introduce PersonaLedger, a generation engine that uses a large language model conditioned on rich user personas to produce diverse transaction streams, coupled with an expert configurable programmatic engine that maintains correctness. The LLM and engine interact in a closed loop: after each event, the engine updates the user state, enforces financial rules, and returns a context aware nextprompt that guides the LLM toward feasible next actions. With this engine, we create a public dataset of 30 million transactions from 23,000 users and a benchmark suite with two tasks, illiquidity classification and identity theft segmentation. PersonaLedger offers a realistic, privacy preserving resource that supports rigorous evaluation of forecasting and anomaly detection models. PersonaLedger offers the community a rich, realistic, and privacy preserving resource—complete with code, rules, and generation logs—to accelerate innovation in financial AI and enable rigorous, reproducible evaluation.", "tldr": "We propose a synthetic transactions data generation engine, and release a synthetic transactions benchmarking dataset.", "keywords": ["finance", "transactions", "benchmark", "large language model"], "primary_area": "datasets and benchmarks", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/d5c86ec77d5e10c45e09111d91db729c2e9a016e.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "The paper introduces PersonaLedger, a system designed to generate realistic financial transaction data while preserving privacy. It combines persona-conditioned large language models (LLMs) with a programmatic rule-driven engine to create transaction streams that are both diverse and compliant with real-world financial constraints. This framework allows for the generation of 30 million transactions from 23,000 users, providing a synthetic dataset that can be used for financial forecasting and anomaly detection tasks such as illiquidity classification and identity theft segmentation. The system also ensures that the generated transactions respect hard financial rules, such as income-to-spending ratios and timely payments."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Originality: The paper introduces a new approach for generating synthetic financial data by combining LLMs with a rule-based system, which ensures both diversity and logical consistency. This is an innovative step forward in financial AI research, where previous methods have struggled to balance these two aspects.\n\nQuality: The proposed system is well-designed and effectively ensures that financial transactions respect real-world constraints. The dataset is large and diverse, providing a valuable resource for future research in financial anomaly detection and forecasting.\n\nClarity: The paper is generally well-written, and the figures and tables are effective in illustrating the system’s design and the experimental results. Some sections could benefit from more detailed explanations, but overall, the clarity of the writing is good.\n\nSignificance: The contribution of the paper is significant, especially in the context of financial AI research, which often suffers from a lack of public, high-quality datasets. PersonaLedger addresses this gap by offering a publicly available dataset that is both diverse and realistic. Moreover, the introduction of the rule-grounded generation engine is a novel approach to ensuring financial consistency in synthetic data generation. However, the benchmarking tasks and their evaluation could be more rigorously compared against existing benchmarks to strengthen the paper’s claims of originality and impact."}, "weaknesses": {"value": "1 Lack of Comparative Validation: The benchmark tasks are only tested on the PersonaLedger dataset, without validation against real-world financial data or other synthetic datasets, making it unclear if the models would perform similarly in practical scenarios.\n\n2 Insufficient Quantitative Support for Claims: Claims about the dataset's \"socioeconomically realistic\" patterns lack statistical validation, such as p-values or confidence intervals, weakening their credibility.\n\n3 Unclear Merchant Name Selection: The paper does not explain how the LLM selects specific merchants (e.g., Walmart vs. Kroger), which could impact the dataset’s realism and utility for merchant-specific analysis or fraud detection.\n\n4 Static User Personas: The Personas used in the dataset are static, without temporal evolution or integration of life events (e.g., marriage, retirement), which limits the dataset’s ability to capture long-term or evolving user behaviors."}, "questions": {"value": "1 LLM Degradation Over Time: The paper mentions that LLMs may struggle with rule consistency as transaction sequences grow longer. Could you provide more detailed empirical results on how the system maintains financial accuracy in long sequences, and what steps can be taken to mitigate any degradation in performance over time?\n\n2 Handling Rare Events: How does PersonaLedger handle rare or unusual user behaviors that significantly deviate from typical patterns (e.g., sudden large expenses or life events)? Are these edge cases adequately captured, and how does the system adapt to them?\n\n3 Benchmarking Comparison: How does PersonaLedger compare to other synthetic financial datasets in terms of task difficulty and the realism of generated transactions? Could you provide a more direct comparison with other widely-used datasets for tasks like fraud detection or financial forecasting to validate the uniqueness and value of your approach?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "U2kgAYfegv", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Reviewer_p5Pj"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Reviewer_p5Pj"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761827543341, "cdate": 1761827543341, "tmdate": 1762928364373, "mdate": 1762928364373, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes PersonaLedger: using persona-conditioned LLMs to generate candidate transactions, then a programmable rule engine performs state updates and constraint verification, forming a \"generate→verify→correct→regenerate\" closed loop. Based on this engine, the authors synthesize and promise to release a dataset of approximately 30 million transactions from 23,000 users, providing two evaluation tasks: liquidity stress prediction (user-level) and identity theft segmentation (event-level), reporting Precision/Recall/F1/AUC for various baseline models under a unified protocol. The paper emphasizes reproducibility and auditability (code, rules, prompts, seeds, and generation logs)."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "Excellent work, great creativity and idea, congratulations on realizing it!\nClear methodology, closed loop: LLM ensures diversity, rule engine strictly controls accounting and calendar constraints, errors can be corrected through structured prompts.\nComplete resources: Large data scale with comprehensive fields, plus two tasks closely related to risk control/anti-fraud with a unified protocol.\nBroad baseline coverage: Compares Transformer, PatchTST, Autoformer, iTransformer, etc. under the same settings, providing a reproducible starting point."}, "weaknesses": {"value": "While the paper provides statistical analysis (Section 2.2) and benchmark tasks (Section 3), there is no systematic evaluation of whether the generated transactions are actually realistic compared to real financial data."}, "questions": {"value": "(1) You state that you will open-source the code and dataset, but I haven't seen any related links yet. If this can be confirmed, I will revise my score. \"we create a public dataset of 30 million transactions from 23,000 users and a benchmark suite with two tasks\" - I can only evaluate you based on existing materials, not just promises. I can consider revising the score when the dataset and codes are realsed.\n\n(2) Can you release some code to facilitate reproduction for reviewers and readers?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "6lWWG1Jtdq", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Reviewer_8asp"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Reviewer_8asp"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761993724571, "cdate": 1761993724571, "tmdate": 1762928363824, "mdate": 1762928363824, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Strengths And Reproducibility"}, "comment": {"value": "We sincerely appreciate the high-quality feedback from our reviewers. We are strongly encouraged by the recognition of several key aspects of our work:\n* **Dataset Value**: That our dataset is a high-quality, large-scale, and timely contribution that addresses a critical lack of public financial data.\n* **Methodology**: That our \"LLM + rule engine\" loop is an innovative and well-designed solution. We are especially grateful you noted its effectiveness in balancing generative diversity with real-world constraints, a key challenge we aimed to solve.\n* **Writing**: That the paper's motivation, structure, and clarity were effective.\n\n**Reproducibility**. We provide the full implementation of PersonaLedger, including all generation and evaluation code, in our anonymous GitHub repository: [anonymous GitHub link](https://anonymous.4open.science/r/PersonaLedger-3E5D/README.md). It includes:\n* Clear documentation for the Python environment and dependencies.\n* Step-by-step instructions to reproduce the data [generation](https://anonymous.4open.science/r/PersonaLedger-3E5D/generation/README.md) and [benchmarking](https://anonymous.4open.science/r/PersonaLedger-3E5D/evaluation/README.md).\n* Example inputs of 2000 user personas and their synthetic financial profiles: [Link](https://anonymous.4open.science/r/PersonaLedger-3E5D/generation/personas/augmented_persona/000000.json).\n* Example generation outputs showing transaction sequences and activity traces for four users: [link to outputs](https://anonymous.4open.science/r/PersonaLedger-3E5D/generation/generated_transactions/000000/000000.json).\n\nThe entire dataset (23,000 users and 30 million transactions) is generated with simple parallelization. Due to storage limitations, we uploaded the generated transactions from 1500 users [batch1](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch1.csv), [batch2](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch2.csv), [batch3](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch3.csv), [batch4](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch4.csv), [batch5](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch5.csv),. We will plan to upload the entire dataset to HuggingFace after the review process."}}, "id": "3BOg4yzxdq", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Authors"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763684097734, "cdate": 1763684097734, "tmdate": 1763684097734, "mdate": 1763684097734, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes PersonaLedger, a synthetic data generation engine that combines a persona-conditioned LLM with a rule-based programmatic controller to simulate realistic financial transaction sequences. The closed-loop design ensures that each generated transaction satisfies accounting constraints (e.g., credit limits, cash balances, due dates), while the LLM provides behavioral diversity conditioned on rich user personas derived from Nemotron-Personas. Using this system, the authors generate 30 million transactions for 23,000 users, and release two benchmark tasks: illiquidity classification and identity theft segmentation."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. Timely contribution: The lack of publicly available transaction data due to privacy restrictions is a real bottleneck in financial AI research. The proposed approach represents an ambitious and creative attempt to overcome this constraint while maintaining logical consistency.\n\n2. Interesting idea: The LLM + rule engine closed loop is very interesting. It directly addresses the brittleness of rule-based simulators and the constraint violations of purely generative models (e.g., GANs or VAEs).\n\n3. Transparency and reproducibility: The release plan, including prompts, rules, seeds, and logs, is commendable."}, "weaknesses": {"value": "1. Insufficient validation of realism: The main limitation lies in the lack of quantitative or external validation demonstrating that the generated data are truly realistic or useful proxies for real-world ledgers. Statistical diversity and rule adherence are necessary but not sufficient. Without comparison to real transaction datasets (even if at an aggregated or stylized level), it is hard to judge whether the synthetic data exhibit realistic interdependencies or temporal dynamics.\n\n2. Shallow persona grounding: The process by which financial profiles are inferred from personas (using a Llama-3.3-70B model with only seven expert-crafted examples) appears subjective and fragile. If the inferred income or credit limit deviates from plausible values, the downstream simulation could produce misleading liquidity patterns. The framework assumes personas are rich and realistic, but there is no ablation or validation showing that persona quality drives realistic behavior.\n\n3. Task design and representativeness: The two benchmark tasks, while well-defined, feel somewhat artificial and detached from genuine financial modeling challenges. For instance, “identity theft segmentation” is simulated simply by inserting another user’s transactions into a sequence — a simplistic proxy that may not reflect actual fraud dynamics. Similarly, “illiquidity classification” is driven by the system’s own liquidity rules, creating a self-referential task that may not generalize beyond this synthetic world."}, "questions": {"value": "Can practitioners or researchers genuinely trust and adopt this dataset as a benchmark? Without external calibration or interpretability analysis (e.g., correlation structures, spending autocorrelation, realistic merchant co-occurrence), does the dataset risk becoming a closed synthetic ecosystem—internally consistent but not empirically grounded?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "xbfIUfQtIA", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Reviewer_NDhW"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Reviewer_NDhW"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762100894474, "cdate": 1762100894474, "tmdate": 1762928363411, "mdate": 1762928363411, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Re: Comparison with Real-World Transaction Data."}, "comment": {"value": "We heartily agree with the reviewers that comparing our synthetic data to real-world transaction data would be an excellent evaluation method. Unfortunately, this comparison is not possible because we cannot access real transaction data, even on a small scale, due to strict privacy and security constraints. In fact, this privacy issue is the main reason that we develop the technique so that the research community can have access to the transaction data. \n\nThis barrier highlights a key difference between financial data and other fields. In areas like image generation, large public \"ground truth\" datasets (like ImageNet) are available for comparison. In finance, no such public ground truth exists. This is not a limitation unique to our work; it is a common challenge for the entire industry:\n\n* The Kaggle \"Credit Card Fraud Detection\" dataset [1] is based on real data, but all features are obscured with PCA to protect privacy. This makes a true comparison impossible.\n* The creators of the IBM synthetic dataset [2, 3] faced the same barrier. Their team was also unable to access real data for comparison and focused instead on presenting detailed statistics.\n\n**The Value of PersonaLedger.**\nThis limitation does not reduce the value of PersonaLedger. Our dataset is particularly valuable for private organizations (like banks or financial firms) that do have access to their own real data. An organization can inspect the statistical differences between our dataset and its own private data. If the differences are large, they can use our tunable modules to easily adjust the generation process. This allows them to create a large-scale synthetic dataset that closely matches the properties of their private, real-world data.\n\n[1] https://www.kaggle.com/datasets/mlg-ulb/creditcardfraud/data\n\n[2] Padhi, I., Schiff, Y., Melnyk, I., Rigotti, M., Mroueh, Y., Dognin, P., ... & Altman, E. (2021, June). Tabular transformers for modeling multivariate time series. In ICASSP 2021-2021 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) (pp. 3565-3569). IEEE.\n\n[3] Altman, E. (2021, November). Synthesizing credit card transactions. In Proceedings of the Second ACM International Conference on AI in Finance (pp. 1-9)."}}, "id": "wdDUtDh0KK", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Authors"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763684164166, "cdate": 1763684164166, "tmdate": 1763684164166, "mdate": 1763684164166, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors construct an entirely synthetic financial transaction dataset consisting of 30 million transactions from 23k users. They leverage the world knowledge inside the LLM to generate realistic spending rollouts for a diverse set of profiles which are seeded from nemotron personas."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- The framework developed to generate the data looks useful as an artifact. There is thoughtful design on the abstractions in the engine orchestrating the LLM calls. In particular, the interface for adding rules is well thought out.\n\n- The writing of the paper is very good. The authors thoroughly motivate the problem at hand, discuss issues with naive solutions, and give a very clear exposition of the structure and characteristics of the dataset release.\n\n- The data resource is of high quality. A significant amount of manual effort was used to make the data cleaner and more consistent."}, "weaknesses": {"value": "- There is a lack of concrete evaluation criteria proposed to assess the fidelity of the proposed dataset with respect to a real financial transaction dataset. Arguments of realism are mostly qualitative, or pertain to an arbitrarily picked attribute.\n\n- More evidence of the usefulness of the dataset would be appreciated. For the downstream task benchmarks, it would be good to assess whether the synthetic-benchmark-induced rankings of methods align with the ranking of methods on real tasks; alternatively if the synthetic benchmarks can identify systematic gaps in the performance of a model trained on real data; and also if the synthetic data is useful training data for the real task."}, "questions": {"value": "As the data is entirely synthetically generated, it is important to understand to what extent the resource is useful for developing models for real data. Although this appears to be a weak point of the paper, I believe overall the dataset and generation framework are valuable artifacts for the research community and recommend acceptance."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "KtdAcOKjko", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Reviewer_pyCd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Reviewer_pyCd"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Review"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763162398052, "cdate": 1763162398052, "tmdate": 1763162398052, "mdate": 1763162398052, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Re: Realism – Additional Evaluation and Comparison"}, "comment": {"value": "We appreciate the reviewers' feedback regarding the lack of in-depth realism evaluation. To address this, we discussed the fundamental difference between our PersonaLedger and the IBM synthetic transaction dataset, which is the largest available. \n\n**Comparison with IBM Synthetic Transaction Dataset.**\n\nFirst, we present short slices from both dataset:\n\nIBM:\n\nUser,Card,Year,Month,Day,Time,Amount,Use Chip,Merchant Name,Merchant City,Merchant State,Zip,MCC,Errors?,Is Fraud?\n\n0,0,2002,9,1,06:21,\\$134.09,Swipe Transaction,3527213246127876953,La Verne,CA,91750.0,5300,,No\n\n0,0,2002,9,1,06:42,\\$38.48,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,,No\n\n0,0,2002,9,2,06:22,\\$120.34,Swipe Transaction,-727612092139916043,Monterey Park,CA,91754.0,5411,,No\n\n0,0,2002,9,2,17:45,\\$128.95,Swipe Transaction,3414527459579106770,Monterey Park,CA,91754.0,5651,,No\n\n0,0,2002,9,3,06:23,\\$104.71,Swipe Transaction,5817218446178736267,La Verne,CA,91750.0,5912,,No\n\nPersonaLedger:\n\nuser_id,timestamp,merchant_name,merchant_type,card_present_or_not,amount\n\n0,2024-04-08 09:00:00,Speedway,gas_station,yes,25.92\n\n0,2024-04-08 10:30:00,Walmart,grocery_store,yes,68.15\n\n0,2024-04-09 12:00:00,Wickliffe Country Club,restaurant,yes,19.98\n\n0,2024-04-09 18:30:00,Tasty Bites,restaurant,no,24.02\n\n0,2024-04-10 00:00:00,History Channel,History Programming Subscription,no,15.0\n\n0,2024-04-10 13:00:00,The Coffee Spot,coffee_shop,yes,11.22\n\n0,2024-04-10 18:00:00,Snack Attack,convenience_store,yes,16.42\n\nThen, we discuss the fundamental improvement of PersonaLedger over IBM dataset.\n| Dimension | IBM Dataset | PersonaLedger |\n| :--- | :--- | :--- |\n| **Methodology** | **Stochastic Simulation:** Uses state machines and Gaussian sampling. | **Gen AI + Control Loop:** Uses a Persona-Conditioned LLM for proposals coupled with a rule-based engine for validation. |\n| **Source of Diversity** | **Manual Coding:** Designers must manually encode logic and transition probabilities. | **Emergent:** Behavior emerges from the LLM's world knowledge of how specific personas act. |\n| **Source of Logic** | **Ad-hoc:** Requires ad-hoc logic to ensure variables correlate (e.g., wealth vs. travel). | **Intrinsic:** The LLM automatically handles complex correlations (e.g., a \"sociable\" person visiting a \"sports bar\") without manual mapping. |\n| **Granularity of Context** | **Coarse States:** Limited to broad states like \"Home,\" \"Travel,\" \"Weekday,\" or \"Weekend\". | **Fine-Grained Narrative:** Captures daily life context (e.g., \"New Year's Day,\" \"feeling motivated\", \"meeting friends\"). |\n| **Illiquidity & Payments** | Not considered. | Explicitly models the **lifecycle of bills, interest, and cash flow** to generate realistic illiquidity states. |\n| **Tunability & Expansion** | **Difficult:** Requires writing new code/states for every new behavior or merchant type. | **Easy & Scalable:** \"Plug and play\" expansion by simply changing the text prompt (persona) or adding a Python rule class. |\n| **Explainability** | **Low:** Data is generated via math/sampling; no textual rationale exists for why a purchase occurred. | **High:** The LLM generates a \"trajectory plan\" (reasoning) explaining the user's intent before generating the transaction. |\n\n**Realism Evaluation**. We invite you to review the generated transactions [here](https://anonymous.4open.science/r/PersonaLedger-3E5D/generation/generated_transactions/000000/000000.json). This allows you to verify that the transactions and daily activities align with common sense. Please note that this is a large file. The daily activity logs are located in the second half of the file, so you will need to scroll down to view them.  We also uploaded generated sequences of 1500 users [batch1](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch1.csv), [batch2](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch2.csv), [batch3](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch3.csv), [batch4](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch4.csv), [batch5](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch5.csv) for your inspection. Feel free to raise any concern about unrealism!"}}, "id": "o6IJ5kRfun", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Authors"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763684564047, "cdate": 1763684564047, "tmdate": 1763684564047, "mdate": 1763684564047, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}, {"content": {"title": {"value": "Re: Realism – Additional Evaluation and Comparison"}, "comment": {"value": "We appreciate the reviewers' feedback regarding the lack of in-depth realism evaluation. To address this, we discussed the fundamental difference between our PersonaLedger and the IBM synthetic transaction dataset, which is the largest available. \n\n**Comparison with IBM Synthetic Transaction Dataset.**\n\nFirst, we present short slices from both dataset:\n\nIBM:\n\n| User | Card | Year | Month | Day | Time | Amount | Use Chip | Merchant Name | Merchant City | Merchant State | Zip | MCC | Errors? | Is Fraud? |\n| :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- | :--- |\n| 0 | 0 | 2002 | 9 | 1 | 06:21 | $134.09 | Swipe Transaction | 3527213246127876953 | La Verne | CA | 91750.0 | 5300 | | No |\n| 0 | 0 | 2002 | 9 | 1 | 06:42 | $38.48 | Swipe Transaction | -727612092139916043 | Monterey Park | CA | 91754.0 | 5411 | | No |\n| 0 | 0 | 2002 | 9 | 2 | 06:22 | $120.34 | Swipe Transaction | -727612092139916043 | Monterey Park | CA | 91754.0 | 5411 | | No |\n| 0 | 0 | 2002 | 9 | 2 | 17:45 | $128.95 | Swipe Transaction | 3414527459579106770 | Monterey Park | CA | 91754.0 | 5651 | | No |\n| 0 | 0 | 2002 | 9 | 3 | 06:23 | $104.71 | Swipe Transaction | 5817218446178736267 | La Verne | CA | 91750.0 | 5912 | | No |\n\nPersonaLedger:\n| user_id | timestamp | merchant_name | merchant_type | card_present_or_not | amount |\n| :--- | :--- | :--- | :--- | :--- | :--- |\n| 0 | 2024-04-08 09:00:00 | Speedway | gas_station | yes | 25.92 |\n| 0 | 2024-04-08 10:30:00 | Walmart | grocery_store | yes | 68.15 |\n| 0 | 2024-04-09 12:00:00 | Wickliffe Country Club | restaurant | yes | 19.98 |\n| 0 | 2024-04-09 18:30:00 | Tasty Bites | restaurant | no | 24.02 |\n| 0 | 2024-04-10 00:00:00 | History Channel | History Programming Subscription | no | 15.0 |\n| 0 | 2024-04-10 13:00:00 | The Coffee Spot | coffee_shop | yes | 11.22 |\n| 0 | 2024-04-10 18:00:00 | Snack Attack | convenience_store | yes | 16.42 |\n\nThen, we discuss the fundamental improvement of PersonaLedger over IBM dataset.\n| Dimension | IBM Dataset | PersonaLedger |\n| :--- | :--- | :--- |\n| **Methodology** | **Stochastic Simulation:** Uses state machines and Gaussian sampling. | **Gen AI + Control Loop:** Uses a Persona-Conditioned LLM for proposals coupled with a rule-based engine for validation. |\n| **Source of Diversity** | **Manual Coding:** Designers must manually encode logic and transition probabilities. | **Emergent:** Behavior emerges from the LLM's world knowledge of how specific personas act. |\n| **Source of Logic** | **Ad-hoc:** Requires ad-hoc logic to ensure variables correlate (e.g., wealth vs. travel). | **Intrinsic:** The LLM automatically handles complex correlations (e.g., a \"sociable\" person visiting a \"sports bar\") without manual mapping. |\n| **Granularity of Context** | **Coarse States:** Limited to broad states like \"Home,\" \"Travel,\" \"Weekday,\" or \"Weekend\". | **Fine-Grained Narrative:** Captures daily life context (e.g., \"New Year's Day,\" \"feeling motivated\", \"meeting friends\"). |\n| **Illiquidity & Payments** | Not considered. | Explicitly models the **lifecycle of bills, interest, and cash flow** to generate realistic illiquidity states. |\n| **Tunability & Expansion** | **Difficult:** Requires writing new code/states for every new behavior or merchant type. | **Easy & Scalable:** \"Plug and play\" expansion by simply changing the text prompt (persona) or adding a Python rule class. |\n| **Explainability** | **Low:** Data is generated via math/sampling; no textual rationale exists for why a purchase occurred. | **High:** The LLM generates a \"trajectory plan\" (reasoning) explaining the user's intent before generating the transaction. |\n\n**Realism Evaluation**. We invite you to review the generated transactions [here](https://anonymous.4open.science/r/PersonaLedger-3E5D/generation/generated_transactions/000000/000000.json). This allows you to verify that the transactions and daily activities align with common sense. Please note that this is a large file. The daily activity logs are located in the second half of the file, so you will need to scroll down to view them.  We also uploaded generated sequences of 1500 users [batch1](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch1.csv), [batch2](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch2.csv), [batch3](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch3.csv), [batch4](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch4.csv), [batch5](https://anonymous.4open.science/r/PersonaLedger-3E5D/sample_data/batch5.csv) for your inspection. Feel free to raise any concern about unrealism!"}}, "id": "o6IJ5kRfun", "forum": "YPfSfqVedI", "replyto": "YPfSfqVedI", "signatures": ["ICLR.cc/2026/Conference/Submission18666/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission18666/Authors"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission18666/-/Official_Comment"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763684564047, "cdate": 1763684564047, "tmdate": 1763737015185, "mdate": 1763737015185, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Comment", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}