{"id": "YQ8tUwlthw", "number": 17736, "cdate": 1758279967213, "mdate": 1759897157375, "content": {"title": "KANomaly: Fourier-KAN-based Multi-Scale Patch Mixer for Multivariate Time Series Anomaly Detection", "abstract": "Multivariate Time Series Anomaly Detection (MTSAD) is crucial for system stability in domains such as industrial monitoring, yet rare events, nonlinear dependencies, and limited labels necessitate unsupervised methods. However, existing approaches struggle to model subtle anomalies and detect diverse patterns, as they rarely integrate explicit frequency-domain representations and rely on fixed-scale analysis. To address these limitations, we propose KANomaly, a novel model inspired by Fourier-based Kolmogorov–Arnold Networks (KANs) for MTSAD. The model incorporates three key innovations: (i) Fourier basis functions embedded within the KAN architecture to capture subtle periodic and spectral anomalies; (ii) a coarse-to-fine multi-scale patching strategy that enhances detection of both point and pattern anomalies; and (iii) a Fourier-KAN Mixer that aggregates information across channel, patch, and temporal dimensions to model complex local and global interdependencies. Extensive experiments demonstrate that KANomaly consistently outperforms state-of-the-art models on multiple real-world datasets, validating the effectiveness of each component.", "tldr": "KANomaly combines Fourier-KAN with multi-scale patching to detect point and pattern anomalies, capturing frequency-aware structures across scales.", "keywords": ["Multivariate Time Series Anomaly Detection", "Kolmogorov–Arnold Networks", "Fourier Basis Functions"], "primary_area": "unsupervised, self-supervised, semi-supervised, and supervised representation learning", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/7f127f3e8c16af8c3615857b9fb124b83f27c451.pdf", "supplementary_material": "/attachment/5c92d70ecc2b084ad299b6b2ab08abc364227e0d.zip"}, "replies": [{"content": {"summary": {"value": "To address the limitations of existing MTSAD methods, such as their implicit learning of temporal and channel dependencies, insufficient utilization of frequency domain information, and challenges in capturing a wide range of short- and long-term anomalies, the authors propose Kanomaly. Kanomaly replaces the spline network in KAN with Fourier series and incorporates multi-scale patching and blending techniques, achieving state-of-the-art detection performance."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1. Clear and well-designed figures that enable readers to quickly grasp the motivation and methodological details.  \n2. Comprehensive equations that clearly convey the computational aspects of the model."}, "weaknesses": {"value": "1. All key modules have been previously explored, such as Fourier Transform in KAN (KAN-AD) [1], Patching (PatchTST) [2], and Patch Mix (TimeMixer) [3], but they lack substantial innovation.\n2. The data in the visual analysis is synthesized by TODS, not from the real data set, and the data synthesized by TODS is a single indicator, which does not match the MTS problem that the method in this article wants to solve. In addition, the basic shape of the synthetic data is a sine function, which is too easy for contemporary models. (Detailed in Questions) \n3. There is a misunderstanding of some related work, and it is ignored as a baseline method. (Detailed in Questions)"}, "questions": {"value": "1. The authors claim in section 2.2 that Kanomaly is the first KAN-based method for MTSAD. However, several prior attempts have used KAN to address MTSAD [4] [5]. Additionally, even the KAN-AD [1] method referenced by the authors includes MTSAD benchmarks. These approaches should be considered as part of the baseline.\n\n2. In Section 5.2, a visualization analysis is presented (detailed in C.1). However, this visualization is not based on actual datasets (such as SMD), but rather uses synthetic data. The training set of TODS consists of regular sine waves (as indicated in line 8 of Listing 1), which are too simple for deep models. This simplicity undermines the argument that Kanomaly can address a wide range of anomalies. Can Kanomaly handle a variety of anomalies on real datasets?\n\n3. It is worth noting that the dataset synthesized by TODS is based on UTS, which indicates that Kanomaly is capable of handling univariate tasks. From this perspective, what distinguishes MTS from UTS in terms of their unique characteristics? Furthermore, how does Kanomaly perform when applied to univariate datasets?\n\n\n\n[1] https://dl.acm.org/doi/10.1145/3746709.3746752\n\n[2] https://iclr.cc/virtual/2023/poster/10876\n\n[3] https://iclr.cc/virtual/2024/poster/19347 \n\n[4] https://link.springer.com/article/10.1007/s10489-025-06650-8\n\n[5] https://icml.cc/virtual/2025/poster/45584"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "4EbwP5nkJA", "forum": "YQ8tUwlthw", "replyto": "YQ8tUwlthw", "signatures": ["ICLR.cc/2026/Conference/Submission17736/Reviewer_PNn3"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17736/Reviewer_PNn3"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission17736/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761357022212, "cdate": 1761357022212, "tmdate": 1762927566940, "mdate": 1762927566940, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes KANomaly, an unsupervised approach for multivariate time series anomaly detection. The method is built on a Kolmogorov–Arnold Network (KAN) backbone in which learnable Fourier basis functions are incorporated to capture frequency-domain structure. The model further employs a coarse-to-fine multi-scale patching strategy to handle anomalies at both point and pattern levels, and uses a mixer-style architecture to integrate information across temporal, channel, and patch dimensions. The authors evaluate the approach on five commonly used MTSAD benchmarks and report improvements over prior methods, along with ablation studies and qualitative analyses to support the contribution."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "## Strengths\n- Architectural Innovation：Rather than simply applying KAN to multivariate time series anomaly detection, the paper tailors the architecture to characteristics of different anomaly types and temporal structures. The use of multi-scale patching and mixer-based aggregation seems well-motivated.\n- Clarity of Presentation and Visualization: The manuscript is clearly written and easy to read. The figures are detailed and informative, effectively supporting readers’ understanding of the architectural components."}, "weaknesses": {"value": "## Weaknesses\n- Limited Baseline Comparison: The related work section discusses KAN-AD, which also applies KAN to anomaly detection and demonstrates performance on multivariate settings (as reported in Table 6 and Section 4.7 of the KAN-AD paper). Including KAN-AD under its MTSAD configuration in the main experiments would strengthen the empirical claims, especially regarding the contributions of the multi-scale patching strategy and the mixer-style architecture. In addition, the experimental benchmark selection omits some widely used industrial datasets such as WADI, which would provide a more comprehensive evaluation in higher-dimensional real-world scenarios.\n- Insufficient Analysis of Results: The performance gains vary considerably across datasets in Table 1. For instance, the improvements on SMD are notably smaller compared to other datasets, yet the paper does not discuss possible reasons. This variability could highlight limitations or conditions under which the method is more or less effective, and a deeper discussion would be valuable.\n- Incomplete Ablation Studies: Since the coarse-to-fine multi-scale patching mechanism is a core contribution, additional ablations focused on patch size would be beneficial. For example, evaluating smaller patch sizes (potentially better for point anomalies) and larger ones (potentially better for pattern anomalies) would provide clearer evidence for the design choices.\n- Interpretability Claims Remain Underdeveloped: The method leverages KANs’ basis-function parameterization, suggesting potential interpretability benefits. This paper does not provide qualitative or visual analysis to show what insights the learned basis functions reveal about anomaly patterns across channels.\n- Lack of Clear Computational Cost and Parameter Analysis: Although efficiency comparisons appear in Figure 3, there is no direct computational cost / parameter-size metrics reported in the ablation models. This makes it difficult to assess the efficiency-performance trade-off of the proposed architecture."}, "questions": {"value": "## Questions\nThere are relatively few KAN-based approaches for anomaly detection, and I find the architectural extensions in this work meaningful. I would appreciate more comprehensive experimental support on following two aspects to further strengthen the contribution and clarify the model’s advantages.\n- Since the core contribution builds on the KAN architecture by introducing the multi-scale patching strategy and mixer-style design, could the authors provide experimental comparison with KAN-AD under the multivariate anomaly detection setting?  Such a comparison would help clarify how much of the observed performance gains stem from the proposed architectural modifications, beyond the benefits inherent to the KAN backbone itself.\n- Given that KAN models offer basis-function parameterization and channel-wise functional decomposition, could the authors provide either qualitative interpretability visualizations and/or quantitative analysis of computational cost (e.g., parameter counts, FLOPs, inference latency)? This would both deepen understanding of the advantages of KAN-based models in anomaly detection and help assess the practicality of the proposed design in real-world deployment."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "PVBpXUQLyX", "forum": "YQ8tUwlthw", "replyto": "YQ8tUwlthw", "signatures": ["ICLR.cc/2026/Conference/Submission17736/Reviewer_qJtT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17736/Reviewer_qJtT"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission17736/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761527867711, "cdate": 1761527867711, "tmdate": 1762927566467, "mdate": 1762927566467, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes KANomaly, a novel unsupervised multivariate time series anomaly detection model that integrates Fourier basis functions into Kolmogorov-Arnold Networks (KANs) to capture frequency-domain anomalies. The model also introduces a coarse-to-fine multi-scale patching strategy and a Fourier-KAN Mixer to capture dependencies across channel, patch, and temporal dimensions. Extensive experiments on five real-world datasets demonstrate that KANomaly outperforms 17 state-of-the-art baselines, with ablation studies confirming the contribution of each component."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "Combines Fourier analysis with KAN in a novel way for Multivariate Time Series Anomaly Detection, a direction not previously explored. The approach elegantly and rationally combines the intuitive physical interpretation of Fourier analysis—namely, its ability to capture periodicity and spectral anomalies—with the universal function-approximation power of Kolmogorov–Arnold Networks.\n\nTable 2’s ablation systematically swaps Fourier-KAN for MLP/Chebyshev/Vanilla-KAN and reverses the coarse-to-fine order, convincingly proving the current design optimal."}, "weaknesses": {"value": "The paper’s key performance comparisons rely heavily on precision, recall, and F1 scores obtained after point-adjustment, a protocol that “forgives” detection delays and fragmented predictions: as long as at least one point inside an anomalous event window is flagged, the entire event is counted as correctly detected.\n\nThe comparison with cutting-edge work is insufficient. A recent method, CATCH, is highly relevant in core idea: it also performs fine-grained, patch/band-level processing of frequency-domain information and highlights inter-channel spectral differences, overlapping significantly with KANomaly. Moreover, KANomaly does not demonstrate superior performance over CATCH."}, "questions": {"value": "The paper relies primarily on the F1 score computed under the point-adjustment strategy—a metric widely criticized for drastically inflating real-world performance. Why do the authors choose this as their central evidence?\n\nThe learnable sine/cosine bases in Fourier-KAN, the multi-scale patching strategy, and the tri-dimensional mixer undoubtedly introduce substantial computational overhead; yet the paper only offers a single-dataset, coarse comparison of training time and parameter count in Figure 3 (right).\n\nIs there any theoretical justification for choosing Fourier bases over other basis functions in the context of anomaly detection?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "SD4eFCiQtn", "forum": "YQ8tUwlthw", "replyto": "YQ8tUwlthw", "signatures": ["ICLR.cc/2026/Conference/Submission17736/Reviewer_7HXw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17736/Reviewer_7HXw"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission17736/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761532624151, "cdate": 1761532624151, "tmdate": 1762927566109, "mdate": 1762927566109, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes KANomaly, an unsupervised model for multivariate time series anomaly detection that integrates KANs with a coarse-to-fine multi-scale patching strategy and a Fourier-KAN Mixer module. The core idea is to explicitly model frequency-domain characteristics—such as periodicity shifts and spectral disturbances—through learnable Fourier basis functions within the KAN framework, which is theoretically grounded in the Kolmogorov–Arnold representation theorem. The multi-scale patching enables simultaneous detection of both short-term point anomalies and long-term pattern anomalies, while the mixer module captures complex interdependencies across channel, patch, and temporal dimensions. The authors evaluate KANomaly on five real-world benchmarks, reporting improvements over current methods."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "•\tThe integration of Fourier basis functions into KAN for MTSAD is a meaningful extension of recent KAN-based approaches, particularly as most prior KAN applications focus on forecasting rather than anomaly detection.  \n•\tComprehensive empirical validation: The paper includes extensive experiments across five standard datasets, ablation studies, efficiency analysis, and evaluation under multiple metric paradigms (point-adjusted, range-based, and affiliation-based), which strengthens the credibility of the claims.  \n•\tClear methodological pipeline: The coarse-to-fine multi-scale patching strategy combined with dimension-wise mixing (channel → patch → temporal) is well-motivated and implemented with attention to reconstruction fidelity and anomaly localization."}, "weaknesses": {"value": "- The paper asserts that “existing approaches struggle to model subtle anomalies and detect diverse patterns” because they “rarely integrate explicit frequency-domain representations,” but this claim is not rigorously supported. In fact, several recent works explicitly incorporate frequency-domain modeling for time series tasks, including anomaly detection. The authors acknowledge some of these in Related Work but fail to clearly differentiate KANomaly’s functional integration of frequency information from these predecessors. The motivation appears overstated.\n\n- The criticism that current models “struggle to detect subtle anomalies” remains qualitative and lacks concrete examples or failure cases from existing SOTA models. For instance, the paper could have included a comparative case study (e.g., on a synthetic or real anomaly where spectral features are decisive) showing that Transformer- or reconstruction-based baselines miss anomalies that KANomaly captures—thereby grounding the claimed advantage in observable behavior rather than architectural assumptions.\n\n- While the use of Fourier-KAN is central, the ablation study shows that replacing Fourier-KAN with an MLP causes performance drops—but it does not rule out whether a well-designed frequency-aware MLP (e.g., inspired by FITS or FreTS) could achieve similar gains. The contribution would be stronger if the authors clarified whether the performance gain stems from the KAN structure itself (learnable univariate functions per edge) or simply from explicit Fourier feature learning, which could potentially be implemented in other frameworks."}, "questions": {"value": "1. Could the authors clarify what constitutes “explicit functional integration” in their framework, and how KANomaly’s use of Fourier basis functions within KAN provides a qualitatively different capability compared to these prior frequency-aware models?  \n\n2. Could the authors provide further analysis or ablation (e.g., Fourier features + MLP) to isolate the contribution of the KAN structure versus the frequency representation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "dHmiZWAyO8", "forum": "YQ8tUwlthw", "replyto": "YQ8tUwlthw", "signatures": ["ICLR.cc/2026/Conference/Submission17736/Reviewer_dVHY"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission17736/Reviewer_dVHY"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission17736/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761718097195, "cdate": 1761718097195, "tmdate": 1762927565774, "mdate": 1762927565774, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}