{"id": "YVM09cKY1B", "number": 7256, "cdate": 1758013283290, "mdate": 1759897863451, "content": {"title": "Segment-Based Dynamic Programming for Optimal Binary Search Trees: A Sub-Cubic Algorithm with Hierarchical Weight Partitioning", "abstract": "Constructing optimal binary search trees under two-way comparisons is significantly more challenging than in the classical three-way model: two-way comparisons induce complex “punctured intervals” in the Dynamic Programming (DP) state space, potentially resulting in exponential sub-problem growth. In particular, the state-of-the-art algorithm for two-way comparisons runs in O\\left(n^4\\right) time, which becomes infeasible for large datasets with millions of keys. The proposed work presents a novel O\\left(n^2\\log{n^2}\\right) time algorithm for constructing optimal search trees with two-way comparisons, improving on the current best O\\left(n^4\\right) complexity. The approach introduces Hierarchical Weight Partitioning (HWP), a segment-based dynamic programming framework that partitions the weight space into hierarchical segments, enabling efficient pruning of equivalent sub-problems while preserving optimality. The algorithm leverages a multi-level segment tree data structure with adaptive threshold selection to achieve logarithmic improvements in both time and space complexity for practical instances. Experimental evaluation on synthetic and real-world datasets demonstrates 3 to 8 times speedups with up to 60% memory reduction compared to existing methods. Our work provides the first sub-cubic solution for this fundamental problem. These results impact new possibilities for efficient inference in AI systems that rely on search structures (e.g., decision-tree models or data indexes).", "tldr": "We present the first sub-cubic algorithm for optimal two-way binary search trees, using hierarchical weight partitioning to cut complexity from O(n⁴) to O(n² log² n) while achieving major speed and memory gains for large-scale AI and data systems.", "keywords": ["Optimal binary search trees", "Dynamic programming", "Hierarchical partitioning", "Algorithmic complexity", "Efficient search."], "primary_area": "optimization", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/0a554f0813bec9836af9d26b11155c676dc70b4e.pdf", "supplementary_material": "/attachment/a95a35df698360c9f1aab74a2dee2cb18341e8e2.zip"}, "replies": [{"content": {"summary": {"value": "The authors consider the problem of constructing optimal binary search trees. Given n keys $K_1, \\dots, K_n$ with weights $w_1, \\dots, w_n$ construct a binary search tree $T$ minimizing $\\sum_{j} d(K_j; T) w_j$ where $d(K_j; T)$ is the depth of $K_j$ in $T$. The full definition involves some intermediate intervals too, but I don’t think this should change the answer much (just treat them as other keys). Correctness requires that from the root, $K_j$ can be found by comparing the query with the key at the current node and proceeding down the tree, i.e. keys should be stored in order.\n\nThe authors claim a near quadratic time algorithm for computing optimal binary search trees with two way comparisons (only < and =). This is the first sub cubic algorithm for this problem.\n\nThe claimed result is strong and the problem is very interesting. Unfortunately, the paper is poorly written and seems difficult to follow, and I cannot verify the soundness of the claims. In its current state, I cannot recommend accept,\nBut I look forward to the rebuttal to clear up confusing points."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 3}, "strengths": {"value": "The problem of optimal binary search trees is natural and a fundamental algorithmic problem. A more efficient algorithm, in fact quadratic, would be very interesting."}, "weaknesses": {"value": "The algorithm overview is poorly written. Many terms are undefined. For example, what is a min_(i < b < j) query? Define a segment tree. What is opt(i, b, h)? What does h denote? What is S(i, j, h)? It is impossible to follow the proof if the notation is not defined.\n\nWhere is Theorem 1? It’s not clear to me what case a) and b) are. Similarly in the proof of Lemma 1, what is condition (II)?\n\nThe experimental section is equally inscrutable. Figure 3 caption looks like a placeholder. What are the charts comparing? There is no explanation."}, "questions": {"value": "I have a basic question: if you’re only allowed equality and < comparisons, how can any node have right children? Does this not force the tree T to only have left children? E.g. in section 5 the paper claims we can assume the root is a maximum key. Why can’t this reason be applied recursively?\n\nIf the 3-way comparison problem is lower bounded at O(n^3) (line 084) and the two-way variant is harder (line 086), how can there be a sub-cubic algorithm for the two-way variant?\n\nIn the 3-way comparison model, how would bucketing frequency by powers of 2 and then applying a Huffman encoding type algorithm perform? I suppose it must be sub-optimal given the $n^3$ lower bound, but how far off optimal will it be?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "Q2GuSfAKC6", "forum": "YVM09cKY1B", "replyto": "YVM09cKY1B", "signatures": ["ICLR.cc/2026/Conference/Submission7256/Reviewer_9shz"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7256/Reviewer_9shz"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission7256/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761799200281, "cdate": 1761799200281, "tmdate": 1762919389111, "mdate": 1762919389111, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes a new algorithm, called Hierarchical Weight Partitioning (HWP), for building optimal binary search trees (OBSTs) under two-way comparisons. Previous exact algorithms had quartic time complexity, making them impractical for large datasets. The proposed approach reduces this to sub-cubic time, specifically proportional to n squared times log squared n. The method partitions key weights into hierarchical segments, reuses dynamic programming (DP) subproblems through a multi-level segment tree, and applies adaptive thresholding to avoid redundant computation. Theoretical proofs show correctness and reduced state count, and experiments demonstrate 3 to 8 times faster runtime and about 60 percent lower memory usage than the prior best-known method. Distributed experiments show lower communication overhead and latency than the baseline algorithm."}, "soundness": {"value": 4}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "- Strong theoretical contribution: This is the first sub-cubic exact algorithm for the two-way OBST problem, improving a decades-old complexity bound.\n\n- Methodological soundness: The structural lemmas and proofs are well reasoned and consistent with prior theoretical frameworks.\n\n- Practical impact: The method shows clear runtime and memory improvements on several datasets, which supports its practical utility.\n\n- Broader relevance: The authors connect the algorithm’s implications to applications in AI systems, decision trees, and database indexing.\n\n- Implementation details: The experimental setup, including platform and datasets, is reported clearly."}, "weaknesses": {"value": "- Scale of experiments: Tests are limited to datasets with up to ten thousand keys. Larger-scale experiments would be needed to demonstrate practical scalability.\n\n- Limited baselines: Only one competing method (CGMY) is compared. Including heuristic or approximate baselines would make the empirical results more complete.\n\n- Hidden constants: While the asymptotic improvement is strong, constant factors in the time and memory complexity are not discussed.\n\n- Lack of ablation study: It is not clear how much each component (segmentation, adaptive thresholding, and multi-level segment tree) contributes to the overall gains.\n\n- Incomplete presentation: Some figures have placeholder captions, and there are minor inconsistencies in text and notation.\n\n- Reproducibility concerns: There is no mention of releasing source code, which limits verification of results."}, "questions": {"value": "- How does the adaptive thresholding perform for highly skewed weight distributions, such as power-law data?\n\n- Is there a theoretical guarantee that the adaptive step never worsens the worst-case runtime?\n\n- Could the same approach extend to k-way comparisons or alternative cost models used in other search problems?\n\n- How does the multi-level segment tree handle cache efficiency in real implementations?\n\n- How does the distributed version scale beyond eight nodes? Are there communication or synchronization limits?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "b3TFjTxMmQ", "forum": "YVM09cKY1B", "replyto": "YVM09cKY1B", "signatures": ["ICLR.cc/2026/Conference/Submission7256/Reviewer_nKKq"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7256/Reviewer_nKKq"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission7256/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761887219400, "cdate": 1761887219400, "tmdate": 1762919388804, "mdate": 1762919388804, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper investigates the long-standing problem of constructing an optimal binary search tree (OBST) under the two-way comparison model, where only the operators “$<$” and “$=$” are permitted, in contrast to the traditional three-way formulation. The authors state that the best previously known exact algorithm for this setting runs in $O(n^4)$ time, and introduce a novel approach, termed **Hierarchical Weight Partitioning (HWP)**, which is a segment-based dynamic programming framework that hierarchically partitions the weight space. The proposed method achieves a reduced complexity of $O(n^2 \\log^2 n)$ time."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The proposed method achieves a significant improvement from $O(n^4)$ to $O(n^2 \\log^2 n)$ in time. If the assumptions hold, this represents a meaningful advance in algorithmic theory for a classical problem.\n2. The problem of efficient search-tree construction under two-way comparisons has implications for decision-tree learning and learned index structures, aligning with topics of interest to the ICLR community."}, "weaknesses": {"value": "1. Although the improvement is significant, the connection between this approach and existing techniques in dynamic programming or tree optimization could be elaborated. A deeper comparison to related dynamic-programming acceleration methods would clarify the novelty.\n\n2. The presentation of the paper could be substantially improved. Several parameters and technical details are introduced without sufficient explanation. For instance, in Line 140, the term $\\min \\beta$ appears, but the variable $\\beta$ itself is not defined. In addition, Section 4.2 begins with the expression $\\min_{i < b < j} \\text{query}$, which is not clearly connected to the preceding sections or the overall algorithmic flow. Furthermore, the abstract incorrectly reports the time complexity as $O(n^2 \\log n^2)$; it should instead be written as $O(n^2 \\log^2 n)$."}, "questions": {"value": "Could the authors provide a clearer comparison between the proposed algorithm and existing methods in the literature? In addition, a concise high-level explanation of the paper’s main technical contributions would help clarify its novelty and significance."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 1}, "code_of_conduct": {"value": "Yes"}}, "id": "5sGSYZxxnW", "forum": "YVM09cKY1B", "replyto": "YVM09cKY1B", "signatures": ["ICLR.cc/2026/Conference/Submission7256/Reviewer_PKXd"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7256/Reviewer_PKXd"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission7256/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761939956366, "cdate": 1761939956366, "tmdate": 1762919388368, "mdate": 1762919388368, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a sub-cubic algorithm for building optimal binary search trees (OBSTs) with two-way comparisons. It introduces the Hierarchical Weight Partitioning (HWP) framework, which organizes key weights into hierarchical segments and merges equivalent dynamic programming states using a multi-level segment tree with adaptive thresholds, achieving a total complexity of O(n² log² n)."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 3}, "strengths": {"value": "1. The paper makes a clear theoretical breakthrough by achieving the first sub-cubic exact algorithm for the two-way optimal binary search tree (OBST) problem—reducing the known O(n⁴) complexity to O(n² log² n).\n2. The paper provides rigorous structural lemmas and proofs ensuring correctness, optimality preservation, and pruning validity. The formal complexity analysis is transparent and consistent with the algorithmic design.\n3. The algorithm’s theoretical guarantees translate into real empirical gains speedups and lower memory usage"}, "weaknesses": {"value": "1. The analysis is tightly coupled to the two-way OBST formulation. It remains unclear whether the Hierarchical Weight Partitioning (HWP) framework can generalize to other dynamic programming problems or broader classes of search structures.\n2. Some sections (e.g., recurrence formulation, segment-tree construction) are dense and difficult to follow without pseudocode or algorithmic diagrams. The paper would benefit from clearer algorithm listings and a reproducibility appendix with implementation details.\n3. The experimental section, while illustrative, is too lightweight. It lacks scaling plots, ablation studies, or large-n asymptotic validation (e.g., runtime ∝ n² log² n trends).\n\nIn my opinion, this paper delivers a meaningful theoretical breakthrough. Its mathematical arguments are sound and well-structured, and the algorithmic design is original. However, the experimental depth falls short of sufficiently supporting the theoretical claims, particularly regarding large-scale validation and asymptotic behavior. With improved exposition and more comprehensive evaluation, this work could become a strong accept for future iterations."}, "questions": {"value": "Refer to the weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "czWWnhUewS", "forum": "YVM09cKY1B", "replyto": "YVM09cKY1B", "signatures": ["ICLR.cc/2026/Conference/Submission7256/Reviewer_2JJR"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission7256/Reviewer_2JJR"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission7256/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762042079339, "cdate": 1762042079339, "tmdate": 1762919388035, "mdate": 1762919388035, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}