{"id": "z2idLjqzBe", "number": 19846, "cdate": 1758299945918, "mdate": 1759897016208, "content": {"title": "Death of the Novel(ty): Beyond N-Gram Novelty as a Metric for Textual Creativity", "abstract": "$N$-gram novelty is widely used to evaluate language models' ability to generate text outside of their training data. More recently, it has also been adopted as a metric for measuring textual creativity. However, theoretical work on creativity suggests that this approach may be inadequate, as it does not account for creativity's dual nature: novelty (how original the text is) and appropriateness (how sensical and pragmatic it is). We investigate the relationship between this notion of creativity and $n$-gram novelty through 7542 expert writer annotations ($n=26$) of novelty, pragmaticality, and sensicality via \\emph{close reading} of human and AI-generated text. We find that while $n$-gram novelty is positively associated with expert writer-judged creativity, $\\approx 91\\%$ of top-quartile expressions by $n$-gram novelty are not judged as creative, cautioning against relying on $n$-gram novelty alone. Furthermore, unlike human-written text, higher $n$-gram novelty in open-source LLMs correlates with lower pragmaticality. In an exploratory study with frontier close-source models, we additionally confirm that they are less likely to produce creative expressions than humans. Using our dataset, we test whether zero-shot, few-shot, and finetuned models are able to identify creative expressions (a positive aspect of writing) and non-pragmatic ones (a negative aspect). Overall, frontier LLMs exhibit performance much higher than random but leave room for improvement, especially struggling to identify non-pragmatic expressions. We further find that LLM-as-a-Judge novelty scores from the best-performing model were predictive of expert writer preferences.", "tldr": "Study with expert writers cautions against using n-gram novelty for creativity evaluation. Open-source LLMs tend to sound less pragmatic as n-gram novelty increases. Evaluation of close reading skills of frontier and fine-tuned LLMs.", "keywords": ["creativity", "creative writing", "evaluation", "creativity evaluation", "machine creativity", "n-gram novelty"], "primary_area": "foundation or frontier models, including LLMs", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/c1ee4b15360e6130a1d6d87b494b3dd28e964141.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper challenges the use of n-gram novelty as a sufficient metric for evaluating textual creativity in language models. The authors argue that true creativity requires both novelty (how original the text is) and appropriateness (how sensical and pragmatic it is), based on established creativity theory. Through a study with 26 expert writers annotating 7542 expressions from human and AI-generated text, they find that 91% of top-quartile expressions by n-gram novelty are not judged as creative, and that higher n-gram novelty in open-source LLMs in facts correlates with lower pragmaticality. Furthermore, they found that LLMs are less likely to produce creative expressions than humans and even struggle to identify creative expressions (a positive aspect of writing) and non-pragmatic ones (a negative aspect)."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper is well motivated, well written, and addresses an important research question on measuring creativity.\n2. The authors conduct high-quality expert annotations, recruited 26 professional writers from top MFA programs with rigorous training, achieving good inter-rater agreement (κ_free = 0.78 for novelty, 0.72 for pragmaticality)\n3. The finding is somewhat surprising: 91% of top-quartile expressions by n-gram novelty are not judged as creative by experts, highlighting the risk of over-relying on n-gram based metrics as a proxy for creativity."}, "weaknesses": {"value": "1. The scale of the study is relatively small. For example, the human text samples include only 50 passages of roughly 400 words each.\n\n2. The domain is limited to creative fiction from The New Yorker, findings may or may not generalizes to other domains such as technical writing, journalism, or poetry, where measuring creativity is also very important. \n\n3. The authors rely on Infinigram and open-source OLMo/OLMo-2 corpora to compute n-gram novelty. However, the training data of frontier models (e.g., GPT-5, Claude 4.1) are not publicly available, raising the question of whether the observed limitations of n-gram novelty metric comes from the n-gram metric itself or from an imprecise estimation of n-gram novelty due to incomplete corpus coverage."}, "questions": {"value": "What do you think it's a scalable method to measure creativity beyond n-gram metrics and expert annotation?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "QJOvdWxn2D", "forum": "z2idLjqzBe", "replyto": "z2idLjqzBe", "signatures": ["ICLR.cc/2026/Conference/Submission19846/Reviewer_Z5SQ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19846/Reviewer_Z5SQ"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission19846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761953762730, "cdate": 1761953762730, "tmdate": 1762932018579, "mdate": 1762932018579, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper declared death of n-gram as a measure of creativity, with detailed study into rare n-gram in both human & AI generated passages and painstakingly annotated dataset. Findings are cool: rare n-grams are overwhelmingly not creative. The author continue to investigate if AI can replace human in such annotations."}, "soundness": {"value": 3}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "- This is a well-motivated and complete investigation into whether n-gram can be a good metric.\n- The author conducted rigorous annotations on n-gram quality and creativity, with the annotation guideline elaborate and well defined. Annotations of the samples are really well thought and detailed. Statistical analysis are thorough.\n- The author investigated various interesting research quesitons that flows well with the ideas, including if LLM can replace human in close reading and if experts are needed to create the best annotations."}, "weaknesses": {"value": "- The scope of the work is clear but limited to New Yorker passages and n=26.\n- This result is intuitive but expected, once one understand the context. While the work is solid, its insights are not very novel by iclr standards.\n- The paper's writing can benefit from placing some details (e.g. python packages used) in appendix and devote more space to more analysis.\n- LLM as a judge's F1 performance is overly low. Some more insights would be helpful. The current statement \"it suggests it may be stemming from failure to recognize non-pragmatic expressions\" is unconvincing. \n- Similarly, finetuned pragmatic or novelty identification models perform poorly, with error bars swing to as bad as x = 0. A further invesitgation on why, or finetuning larger model might be needed."}, "questions": {"value": "Please see weakness."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "68irnf0OuA", "forum": "z2idLjqzBe", "replyto": "z2idLjqzBe", "signatures": ["ICLR.cc/2026/Conference/Submission19846/Reviewer_NcHT"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19846/Reviewer_NcHT"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission19846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761966186495, "cdate": 1761966186495, "tmdate": 1762932017851, "mdate": 1762932017851, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper re-examines n-gram novelty metrics which have been previously used as proxies for creativity. Specifically, they collect a pool of annotators to measure the creativity of llm-generated text and human gold text via close reading, finding that while n-gram novelty correlates with creativity, it also corresponds to lower pragmaticality compare to human texts. Their findings suggest defining better metrics for creativity that incorporate multiple factors."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 3}, "strengths": {"value": "* The paper is well-written and easy to follow\n* A large amount of effort went into collecting a diverse set of annotations across many annotators and passages. The definition and task for annotators are clearly defined. In general, Section 2 is strong. The experiments are designed well and a lot of thought was put into them.\n* The findings about n-gram novelty relation to creativity (human judgement) are interesting and novel. There is a lot of analysis done that goes into specific details around this behavior which are interesting, like the decreasing pragmatism. \n* A variety of models are tested"}, "weaknesses": {"value": "* Minor: Formatting on line 2 is odd \" (Handa et al., 2025) (Anthropic) and (Chatterji et al., 2025) (OpenAI)\"\n* The main study comparing human and text generation is only based only on one source - The New Yorker. While this source is high-quality, it would be nice to compare LLM/Human texts in other domains to see how well n-gram novelty findings hold.\n* Minor: The findings could be stronger by including more models to analyze (in addition to the task mentioned above). \n* A conceptual limitation is that the paper assumes creative expressions must be both sensical and pragmatically appropriate. While this is reasonable for narrative prose, some creative language intentionally violates pragmatic norms (e.g., surreal or poetic writing). Thus, the finding that high n-gram novelty often corresponds to non-pragmatic text may not be a fundamental flaw of the metric on its own."}, "questions": {"value": "* Given the findings, what is an alternative metric for creativity?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 6}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "k6n97hogK7", "forum": "z2idLjqzBe", "replyto": "z2idLjqzBe", "signatures": ["ICLR.cc/2026/Conference/Submission19846/Reviewer_rBr1"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19846/Reviewer_rBr1"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission19846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761975619108, "cdate": 1761975619108, "tmdate": 1762932017153, "mdate": 1762932017153, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper tests whether n-gram novelty is predictive of creativity. The taxonamize creativity into sensibility and pragmatically and build an expert-annotated dataset to study this (~8000 samples are annotated). They conclude n-gram novelty is not a reliable predictor of creativity and worse of higher n-gram novelty is also correlated with loss of sensicality."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "- The study between the n-gram novelty and creativity judgements from experts engenders a useful conclusion.  Sensibility vs pragmatically distinction is also very interesting; \n- The resulting corpus is substantial, providing scope for running large scale analysis for future work."}, "weaknesses": {"value": "- Deviation from layman perception of high quality creativity versus an expert perception of high quality creativity: Since the definitions of creativity are expert curated the claims in the paper seem very plausible; However, it is unclear if the authors expect these conclusions to hold with less expert audiences who perceive creative texts through less varying rubrics (some of which may include allegedly spurious factors like novel n-grams)\n\n- Conditional dependence of sensicality/pragmaticality on the length of the snippet: It is unclear if the decision of the in-context sensicality or pragmaticality can vary if additional context is provided to the annotators. I understand that this is non-trivial to ablate due to the substantial variation in the induced cognitive burden to annotators but an ablation for this even a small control experiment that maintains the stability of the judgement with varying lengths over the snippet will help confirm the legitimacy,  of especially the sensible judgements."}, "questions": {"value": "- In Ln 217, you mention that ‘Instances that were labeled as not sensical were removed to focus on cases where expressions do not make sense in the context’; Will this not alter the logical flow of the entire text ? \n- You mention in Appendix D, that the pragmaticality scores consistently know a significant negative effect with the crowd preferences - Couldn’t this be indicative of the pragmaticality definition being ill-suited/divergent from what a naive-user/lay crowd prefers ?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "JAeltl6xGA", "forum": "z2idLjqzBe", "replyto": "z2idLjqzBe", "signatures": ["ICLR.cc/2026/Conference/Submission19846/Reviewer_WN29"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission19846/Reviewer_WN29"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission19846/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762099723134, "cdate": 1762099723134, "tmdate": 1762932016607, "mdate": 1762932016607, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}