{"id": "Z5TmeKwLyx", "number": 16862, "cdate": 1758269621779, "mdate": 1763128734995, "content": {"title": "Guided Domain Solver: Structured Exploration of Domain-Specific Tasks with Large Language Models", "abstract": "This work presents a method to solve domain-specific problems by leveraging Monte Carlo Tree Search (MCTS), Knowledge Graphs and Large Language Model (LLM) agents. At the core of this approach lies a MCTS algorithm, which explores the complex solution space of a given domain in a goal-directed and sample-efficient manner. In the expansion phase of the MCTS, a domain-specific knowledge graph is incorporated to encode concepts, relationships and constraints. This structured representation enables an LLM agent to make informed decisions for the node expansion. By combining a structured search of the solution space through MCTS, a representation of domain knowledge through the knowledge graph and the generalization abilities of an LLM agent, this method can solve complex tasks in domains where both creativity and adherence to expert rules are essential. In a first step, this approach is used to solve Sokoban, a puzzle game that requires planning and creativity to place several boxes at specific targets with as few moves as possible.", "tldr": "This work utilizes Monte Carlo Tree Search with Knowledge Graphs and Large Language Models to enable sample-efficient problem solving in complex domains.", "keywords": ["Monte Carlo Tree Search", "Knowledge Graph", "Large Language Model", "agents", "planning"], "primary_area": "applications to robotics, autonomy, planning", "venue": "ICLR 2026 Conference Withdrawn Submission", "pdf": "/pdf/6b0f3c1ed8ba35ddb0fab034788f5cb18b9d7e0e.pdf", "supplementary_material": "/attachment/cc51189e9a24c8f1d182c6a9edacab3856896e94.zip"}, "replies": [{"content": {"summary": {"value": "The paper introduces a novel approach to AI planning that combines Monte Carlo Tree Search (MCTS), Knowledge Graphs (KG), and Large Language Models (LLM). The Monte Carlo Tree Search explores the solution space, which is expanded via the concepts/relationships/constraints from a domain-specific KG."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "The paper's main idea appears to be original. The presentation can be significantly improved, and so does the empirical validation. It is difficult to judge the paper's significance and impact given the relatively small, easy problem instances that it is solving."}, "weaknesses": {"value": "The paper has two main weaknesses: presentation and empirical validation.\n\nWith respect to the presentation, the four pages used in current version of Section 3 should be replaced with an illustrative running example (2-3 pages with MCST, KG, Cypher queries, LLM answers) followed by a summary of the current version of the section. All other details could be part of the appendices. For example, Fig 1 is too generic/high-level to help the reader; Figs 3 & 4 can be fully appreciated only if additional figures are added for MCST and KG.   \n\nIn terms of the empirical evaluation, it is unclear how difficult the problem instances are. The examples shown in the paper seem to have \"a floor plan\" of at most 50 cells, which is extremely small. Can GDS tackle floor plans of - say- 1K or 10K or 100K cells? How about with various \"obstacles to be removed to create a passage\" and \"tricky straights to be navigated?\" Ideally, the empirical validation should be expanded to a more comprehensive section with increasingly larger \"floor spaces\" and harder navigation problems. For example, see the [Muslea, 1997] paper below, which is also evaluated on a Shokoban-like world. \n\nMuslea, Ion. \"SINERGY: A linear planner based on genetic programming.\" In European Conference on Planning, pp. 312-324. Berlin, Heidelberg: Springer Berlin Heidelberg, 1997."}, "questions": {"value": "1. line 250 - what do you mean when you claim \"the optimal solution is always achieved in this domain\"? What guarantees the optimality of GDS's solutions? Per lines 181-183, optimality does NOT seem to be guaranteed. \n2. What happens if a problem instance has no solution? Will GDS search \"forever,\" or does it have any way detect such situations?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "3XAPyudzkc", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Reviewer_cwyx"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16862/Reviewer_cwyx"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761270573785, "cdate": 1761270573785, "tmdate": 1762926884690, "mdate": 1762926884690, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"withdrawal_confirmation": {"value": "I have read and agree with the venue's withdrawal policy on behalf of myself and my co-authors."}, "comment": {"value": "We appreciate the reviewers' efforts and feedback, which will serve as a guide for our future revisions. Therefore, we are withdrawing the paper."}}, "id": "8udmdsrIGi", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Authors"], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Withdrawal"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1763128734319, "cdate": 1763128734319, "tmdate": 1763128734319, "mdate": 1763128734319, "parentInvitations": "ICLR.cc/2026/Conference/-/Withdrawal", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper proposes an approach to solve the Sokoban game by integrating LLMs, MCTS, and a Knowledge Graph that basically maintains the current state of the game. The game is basically expanded using MCTS, where the LLM is used to select which action to perform from the child nodes of the nodes selected for expansion by the MCTS. Experiments show improved performance compared to random sampling."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "Sokoban is a nice problem to work on and integrating MCTS and LLMs to solve puzzles is interesting."}, "weaknesses": {"value": "The motivation to the paper is not clear to me. If we know the rules and dynamics of the game, why use an LLM? One can simply use classical planning to solve this problem, i.e., encode it in PDDL and run a planner. This has been done for Sokoban for many years. \nI recommend the authors to look deeper to the automated planning community’s work on this puzzle and explain how it relates to your work. They seem to solve the same problem. \nOnly solving Sokoban is, I believe, too limited for a top conference paper. \nThe baseline of random sampling is too weak."}, "questions": {"value": "1.\tWhat is a “Cypher query”? (line 84)\n2.\tWhat is the advantage of using your approach compared to classical planning for this domain?\n3.\tWhen you say that you always return optimal solutions, what is the optimality criteria you refer to? Do you mean minimal number of steps? If so, I am not convinced you can really guarantee this. Can you?\n4.\tFig. 5 shows normalized branching factor – this is a weird choice. Why not show either number of nodes expanded or solution length? Which is more common for this problem."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "KlVSwMjEwr", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Reviewer_JiUF"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16862/Reviewer_JiUF"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761862444519, "cdate": 1761862444519, "tmdate": 1762926883290, "mdate": 1762926883290, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper presents a method that combines Monte Carlo Tree Search (MCTS), Knowledge Graphs, and Large Language Models\n (LLMs). The approach uses MCTS to explore the solution space, while a domain-specific Knowledge Graph encodes domain knowledge. \n\nThe method is demonstrated on the Sokoban puzzle game, where it achieves optimal solutions by combining error-free simulation with LLM-guided expansion. Experiments show that LLM agents, when guided by the Knowledge Graph, explore fewer nodes than random baselines, indicating improved search efficiency. \n\nIt can be splitted into 4 steps: Selection (most promissing node), Expansion (extend to new node), \nSimulation (new node evaluation), Backpropagation (update nodes)."}, "soundness": {"value": 1}, "presentation": {"value": 2}, "contribution": {"value": 1}, "strengths": {"value": "Incorporation of structured domain knowledge without retraining LLMs."}, "weaknesses": {"value": "- The text needs a few improvements to justify proposed methodology, novelty, approach, contributions.  First few paragraphs were quite vague on what exactly this method is trying to solve and what is the main contributions.\n- Experiments shows improved efficiency, but the term is not formally defined. The experiments are very limited. \n- Abstract mentions 'creativity', but these are not referred again on the text, or quantified in any way.\n- Strong conclusions from limited experimentation - conclusion MCTS is efficient and targeted  based only on one set of experiments on a single domain (Sokoban).\n- Lack of baselines - there are other methods with similar approaches (combine graphs and LLMs),  yet there are no baselines added for comparison besides random. \n- Overall paper is very short, and a lot more about methodology and contributions could have been added."}, "questions": {"value": "- Your conclusions about efficiency and targeted search are based solely on Sokoban.  How do you expect the method to perform in less structured, partially observable, or continuous domains?  Have you considered or attempted any experiments outside Sokoban to support your claims of generality?\n- Why were no strong baselines included, such as other LLM+graph or LLM+search approaches?  How does your method compare to recent work?\n- How scalable is the knowledge graph construction and querying process as domain complexity grows?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "hTbI1dWrDN", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Reviewer_Vvm6"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16862/Reviewer_Vvm6"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761952607528, "cdate": 1761952607528, "tmdate": 1762926882568, "mdate": 1762926882568, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper solves domain-specific problems by leveraging MCTS, knowledge graphs, and LLM agents. An initial experiment was conducted on Sokoban to show the method helps find the solution more quickly."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "The direction of solving complex planning tasks has high potential."}, "weaknesses": {"value": "The paper is still at a preliminary stage. Here are some major suggestions to improve the work in the future:\n\nInclude other tasks, metrics, and more reasonable baselines to make the experiment solid. The authors can refer to relevant literature for some design choices.\n\nI think the paper can benefit from better motivating the method choice. Like why do you need knowledge graphs or MCTS in the first hand?"}, "questions": {"value": "See those in the weakness section."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "JmWa3n3Cew", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Reviewer_k6mZ"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16862/Reviewer_k6mZ"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761994788767, "cdate": 1761994788767, "tmdate": 1762926882047, "mdate": 1762926882047, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces an innovative framework that integrates MCTS, Knowledge Graphs, and LLMs to solve complex domain-specific problems. The approach leverages MCTS for exploration, a knowledge graph for structured domain representation, and LLM reasoning for informed decision-making during search expansion. Validated on the Sokoban puzzle game, the system achieves improved search efficiency and interpretability without retraining the LLM."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "I really like the core idea of this paper i.e. combining symbolic reasoning (MCTS and KG) with LLM-based semantic understanding. The framework bridges structured search and flexible reasoning, showing how rule-based exploration can be guided by high-level language reasoning."}, "weaknesses": {"value": "The paper feels rather rushed and incomplete. The related work section is shallow and does not sufficiently position this method within existing literature on LLM-based planning or neuro-symbolic systems. The experimental setting is narrow and limited to a single environment (Sokoban)  and the baseline comparisons are weak. Moreover, the paper lacks ablation studies to disentangle the contribution of each component (MCTS, KG, LLM)."}, "questions": {"value": "- The prompt template in Figure 3 is helpful but overly simplistic; it doesn’t show how the LLM integrates graph-based reasoning.\n- The results section contains only one plot (Figure 5) comparing normalized branching factors. There are no quantitative metrics"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 0}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "4pOghQY7hn", "forum": "Z5TmeKwLyx", "replyto": "Z5TmeKwLyx", "signatures": ["ICLR.cc/2026/Conference/Submission16862/Reviewer_613i"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission16862/Reviewer_613i"], "number": 5, "invitations": ["ICLR.cc/2026/Conference/Submission16862/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762064227337, "cdate": 1762064227337, "tmdate": 1762926881647, "mdate": 1762926881647, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": true}