{"id": "zG6QVv6wGs", "number": 15630, "cdate": 1758253366835, "mdate": 1759897293573, "content": {"title": "Dual-AN: A Hierarchical Framework Synergizes Time and Frequency Domains for Non-stationary Time Series Forecasting", "abstract": "To address the pervasive and challenging issue of non-stationarity in time series forecasting, recent research has primarily focused on time-domain normalization methods that separate non-stationary features using statistical indicators. The proposal of frequency adaptive normalization (FAN) offers a new perspective for separating non-stationary components in the frequency domain. However, existing methods remain confined to a single domain, lacking a synergistic integration of time and frequency domains. To bridge this gap, we introduce Dual-AN, a hierarchical framework that synergizes both time and frequency domains. After utilizing the Fourier transform approach to separate non-stationary factors, we propose a novel sliding window adaptive normalization (SWAN) method to eliminate the local non-stationarity in the residuals. Furthermore, we introduce the statistical prediction module (SPM) to forecast future statistics, which are used to de-normalize the outputs based on the statistics of each window. Dual-AN is a general framework that can be easily integrated into any forecasting model. We evaluate the improvement in forecasting performance of 3 different benchmark models on 8 widely-used datasets. The results show that Dual-AN demonstrates significant performance improvement, with the average prediction error MAE and MSE reduced by 15.92% and 20.72%. In comparison with other existing normalization methods, Dual-AN surpasses all existing methods and achieves state-of-the-art (SOTA) performance with an average prediction error reduction of 7.69%.", "tldr": "A Hierarchical Framework Synergizes Time and Frequency Domains for Non-stationary Time Series Forecasting", "keywords": ["Non-stationary Time Series Forecasting", "Time and Frequency Domains", "Adaptive Normalization"], "primary_area": "learning on time series and dynamical systems", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/3db28b33a02b4458475f3875756ece93e36e0c49.pdf", "supplementary_material": "/attachment/578ed5808886655ec0cbcec8085b143535b2fcc9.zip"}, "replies": [{"content": {"summary": {"value": "The paper addresses the challenge of non-stationarity in time series forecasting by proposing a dual-domain normalization framework that jointly operates in both the time and frequency domains, rather than focusing on a single one. In the time domain, the proposed SWAN module dynamically extracts non-stationary information, facilitating the separation and prediction of non-stationary factors. The SPM module further predicts future statistics, enabling accurate recovery of future distributions. Experimental results demonstrate solid improvements, validating the effectiveness of the proposed approach."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The paper effectively addresses the non-stationarity issue with a clear structure and a modular design that allows the proposed method to be easily integrated as a plug-in into existing forecasting frameworks.\n\n2. The experimental results are strong, showing that the normalization step significantly improves model performance after application."}, "weaknesses": {"value": "1. Window size selection: As one of the core components, the effectiveness of selecting the optimal window size needs further validation through comprehensive experiments. A more rigorous mathematical justification or theoretical analysis would strengthen the necessity of this design choice.\n2. The loss function used in this work differs from the widely adopted MSE loss commonly employed in baseline methods, which may affect the fairness of comparison. Moreover, the paper lacks ablation studies to quantify the impact of this loss function on the final results. In my view, since the loss design and normalization are relatively independent modules, a dedicated analysis is necessary.\n3. The SWAN module is not entirely novel — similar mechanisms have already been adopted in recent works [1,2].\n4. The overall framework shares certain similarities with existing methods such as FAN, SAN, and DDN [2], especially in using an MLP structure for future distribution prediction. This overlap somewhat weakens the claimed contribution. It is recommended that the authors conduct more detailed comparisons with recent works such as [3] and explicitly clarify the distinctions of their approach.\n\n[1] Disentangling Structured Components: Towards Adaptive, Interpretable and Scalable Time Series Forecasting\n[2] DDN: Dual-domain Dynamic Normalization for Non-stationary Time Series Forecasting\n[3] SIN: Selective and Interpretable Normalization for Long-term Time Series Forecasting"}, "questions": {"value": "see weeknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "B2nhkH8dpy", "forum": "zG6QVv6wGs", "replyto": "zG6QVv6wGs", "signatures": ["ICLR.cc/2026/Conference/Submission15630/Reviewer_PbJh"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15630/Reviewer_PbJh"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission15630/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761717941652, "cdate": 1761717941652, "tmdate": 1762925893857, "mdate": 1762925893857, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper introduces Dual-AN, a model-agnostic normalization framework designed to address non-stationarity in time series forecasting by synergizing both time and frequency domains. The framework builds upon frequency adaptive normalization (FAN) by adding two key components: Sliding Window Adaptive Normalization (SWAN) to handle local non-stationarity in frequency-domain residuals, and Statistical Prediction Module (SPM) to forecast future window-level statistics for de-normalization. The method is evaluated on 8 benchmark datasets with 3 different backbone models, demonstrating consistent improvements over existing normalization approaches."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1 - The paper addresses a genuine limitation in existing methods by identifying that frequency-domain approaches like FAN fail to capture local non-stationarity in residuals. The proposed hierarchical framework that combines coarse-grained frequency decomposition with fine-grained time-domain normalization is conceptually sound and well-motivated.\n\n2 - The experimental evaluation is comprehensive, testing on 8 widely-used datasets with 3 different backbone architectures. The consistent improvements across diverse settings demonstrate the generalizability of the approach.\n\n3 - The paper provides strong implementation details including algorithmic descriptions, computational complexity analysis, and extensive ablation studies. The code availability and clear experimental setup enhance reproducibility."}, "weaknesses": {"value": "1 - The dynamic window size selection criterion (minimizing standard deviation of local standard deviations) lacks theoretical justification. While the paper acknowledges this as a heuristic in Appendix F, the core mechanism relies on an empirically-driven choice that may not generalize well to all time series characteristics.\n\n2 - The method shows diminished performance on datasets with weak trend and seasonality. This suggests the framework may add unnecessary complexity for certain time series types, and the paper lacks clear guidelines for when to apply Dual-AN versus simpler alternatives.\n\n3 - The computational overhead, while analyzed, is non-trivial with O(L·N) additional complexity. The paper doesn't provide runtime comparisons or discuss the practical implications of this overhead, particularly for real-time applications or large-scale deployments.\n\n4 - The limited set of candidate window sizes (12, 24, 48) appears arbitrary and may not be optimal for all frequencies present in the data. The paper doesn't explore adaptive or data-driven approaches to determine these candidates."}, "questions": {"value": "Is this paper developed based on the assumption that the change of the statistics w.r.t. time must be fully predictable, i.e., the changing patterns must be fully encoded in the previous time series data to make SPM work?\n\nHow sensitive is the method to the choice of candidate window sizes, and have you explored learned or adaptive approaches for window size selection?\n\nCan you provide guidance on when practitioners should use Dual-AN versus simpler methods like RevIN based on time series characteristics?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "64XpWgBFCW", "forum": "zG6QVv6wGs", "replyto": "zG6QVv6wGs", "signatures": ["ICLR.cc/2026/Conference/Submission15630/Reviewer_cPjs"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15630/Reviewer_cPjs"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission15630/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761894618688, "cdate": 1761894618688, "tmdate": 1762925893291, "mdate": 1762925893291, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes Dual-domain Adaptive Normalization (Dual-AN) to address non-stationarity in time series forecasting. By combining frequency-domain decomposition with a Sliding Window Adaptive Normalization (SWAN) and a Statistical Prediction Module (SPM), the method effectively handles both global and local non-stationarity. Experiments on multiple datasets show that Dual-AN consistently outperforms existing normalization methods, including FAN, achieving state-of-the-art forecasting accuracy."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 1}, "strengths": {"value": "1.\tThe paper is easy to follow and well written.\n2.\tThe visual examples are complete and clearly presented."}, "weaknesses": {"value": "1.\tThe author claims the residuals often retain local non-stationarity using only the top K dominant components and illustrates with examples in the figure 1. But why these local non-stationarity can’t be extracted by raising the parameter K? Why the dual-domain methods are needed?\n2.\tThe paper lacks a comparison with another dual-domain normalization method, DDN[1], and the sliding window normalization approach, which is presented as a core contribution of this work, has already been proposed in DDN.\n3.\tWhen using the DLinear backbone, the performance of Dual-AN shows almost no improvement compared to FAN. \n\n[1] DDN: Dual-domain Dynamic Normalization for Non-stationary Time Series Forecasting"}, "questions": {"value": "see weaknesses"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "czC9FuGGVd", "forum": "zG6QVv6wGs", "replyto": "zG6QVv6wGs", "signatures": ["ICLR.cc/2026/Conference/Submission15630/Reviewer_wDng"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15630/Reviewer_wDng"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission15630/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761963089014, "cdate": 1761963089014, "tmdate": 1762925892753, "mdate": 1762925892753, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The authors presented a model-agnostic framework that hierarchically addresses non-stationarity in time and frequency domains for time series forecasting. The key advantage is to focus on local non-stationarity in residuals which is not selected by Fourier transform approach.\nTo achieve the goal, they introduce two modules, sliding window adaptive normalization (SWAN) and statistical prediction module (SPM).\nExperiments show that integrating the proposed model yields consistent performance gains across all three backbone models and eight benchmark datasets."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "- Clear problem settings: Frequency adaptive normalization (FAN) alleviates the impact of non-stationarity by focusing only on top-K dominant components in the Fourier domain. In contrast, Dual-AN aims to accurately forecast by applying time-domain normalization to the residual components and predicting future window statistics for denormalization.\n\n- Model-agnostic plug-in design: Dual-AN can be attached to any forecaster.\n\n- Extensive experiments: The authors report results across 8 datasets and 3 backbones, with ablations and analyses, showing consistent gains, especially for long horizons."}, "weaknesses": {"value": "- Lack of novelty: While Dual-AN synergizes time and frequency domains to overcome the limitations of previous methods for non-stationary time series data, the core modules, SWAN and SPM, mainly rely on traditional approaches, so their contributions appear to be incremental.\n\n- Loss function design: SPM predicts future statistics and ${Y_{res}}$ is calculated by denormalization of estimated ${Y_{stat}}$ using them. However, neither statistics $\\sigma,\\mu$ nor ${Y_{res}}$ appears in the loss function. Even if Dual-AN accurately predicts ${Y_{stat}}$, it may fail to forecast ${Y_{res}}$ using suboptimal statistics.\n\n- Limited baselines: The baselines used in the experiments do not include state-of-the-art methods.\n\n- Minor comment: Even if there are multiple best results in the table (e.g., Table 6), the authors highlight only the proposed method, which is misleading."}, "questions": {"value": "- Why do you use sliding window to address non-stationarity in time series data?\n- Could you provide the additional results using state-of-the-art forecasters as backbone models?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 3}, "code_of_conduct": {"value": "Yes"}}, "id": "TrVDNw8quE", "forum": "zG6QVv6wGs", "replyto": "zG6QVv6wGs", "signatures": ["ICLR.cc/2026/Conference/Submission15630/Reviewer_5vcw"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission15630/Reviewer_5vcw"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission15630/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762185429858, "cdate": 1762185429858, "tmdate": 1762925892293, "mdate": 1762925892293, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}