{"id": "zOaKaSMwdn", "number": 8471, "cdate": 1758085257412, "mdate": 1759897782197, "content": {"title": "Post-Quantum Cryptography for Stablecoin Smart Contracts: Future-proofing Against Quantum Attacks", "abstract": "The emergence of quantum computing poses a significant threat to current cryptographic systems securing blockchain-based financial instruments, particularly stablecoins with over $150 billion in market capitalization. This paper investigates the application of post-quantum cryptographic schemes, specifically CRYSTALS-Dilithium lattice-based signatures, to secure stablecoin smart contracts and digital wallets against future quantum attacks. We analyze vulnerabilities of existing elliptic curve cryptography (ECC) and RSA-based systems used\nin popular stablecoin implementations, propose a comprehensive post-quantum security framework, and evaluate performance\nimplications through extensive experimentation. Our experimental results from 50,000 test transactions demonstrate that lattice-based signature schemes can provide equivalent security guarantees with acceptable performance characteristics: 2.34x\nsignature generation overhead, 1.22x verification overhead, and 292 TPS sustained throughput. The proposed framework includes migration strategies, hybrid security models, and implementation guidelines validated through real-world testnet deployment, providing a practical roadmap for stablecoin issuers to prepare for the post-quantum era.\n\nIndex Terms—post-quantum cryptography, stablecoins, smart contracts, lattice-based cryptography, blockchain security, quantum computing, CRYSTALS-Dilithium", "tldr": "", "keywords": ["post-quantum cryptography", "stablecoins", "smart contracts", "lattice-based cryptography", "blockchain security", "quan- tum computing", "CRYSTALS-Dilithium"], "primary_area": "other topics in machine learning (i.e., none of the above)", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/38cb2cc83dfe753eed57b69c47f4709adc4fa58d.pdf", "supplementary_material": "/attachment/820d3fc519e4bb9d5dbb9498c65f866d06376749.zip"}, "replies": [{"content": {"summary": {"value": "The paper proposes a practical roadmap to adopt post-quantum signatures—primarily CRYSTALS-Dilithium—for stablecoin smart contracts and wallets. It outlines an end-to-end architecture, discusses migration stages, and reports empirical results on throughput, latency, storage, and cost over a month-long experiment. The authors argue the approach can “future-proof” stablecoin infrastructure against quantum adversaries and provide operational guidance (key management, hybrid transition, and governance). While the topic is timely and impactful for DeFi practitioners, several methodological and presentation issues limit the reliability and generalizability of the reported findings."}, "soundness": {"value": 2}, "presentation": {"value": 1}, "contribution": {"value": 2}, "strengths": {"value": "1.\tImportant and timely problem: securing widely used stablecoin infrastructure against prospective quantum threats.\n2.\tEnd-to-end perspective that spans algorithm choice, contract design, key management, and migration planning.\n3.\tPractitioner-oriented guidance that could help issuers and wallet providers plan phased adoption."}, "weaknesses": {"value": "1.\tIncomplete citations and academic rigor. The manuscript contains placeholder references (“(?)”, “(??)”) for core background (e.g., blockchain foundations, hash-based signatures, LWE/SIS) and lacks sources for factual claims (e.g., “$150B market cap”). For ICLR standards, these must be replaced with precise, verifiable references; quantitative statements should cite public datasets or authoritative reports.\n2.\tTPS vs. Ethereum constraints lack internal consistency. The paper reports ~292 TPS, ~82 tx per block, and ~187 ms propagation without reconciling these with block times, gas limits, and >3 KB signatures. Clarify whether 292 “TPS” is node-level verification throughput rather than on-chain throughput, and specify chain configuration (block size/gas limit), client versions, and whether custom parameters were used. Provide on-chain evidence (chain ID, block ranges, tx hashes) or re-label metrics (e.g., sig/s) accordingly.\n3.\tAmbiguous “quantum security = 192 bits” statement. Table 3 presents Dilithium-3 as “192-bit quantum security,” conflating NIST’s classical security levels with quantum adversary cost. Clearly distinguish (i) NIST security level, (ii) classical vs. quantum attack models, and (iii) concrete cost assumptions. Revise the table and text to avoid implying unchanged bit-strength against quantum attackers; if using estimates, document the model and uncertainty.\n4.\tNarrow threat model and limited baselines. The evaluation focuses on Dilithium single-sig only. Include systematic comparisons or well-founded estimates for SPHINCS+, Falcon/NTRU-Prime where relevant, threshold/multisig or aggregation schemes, and L2/Rollup data paths. Additionally, quantify high-risk components (bridges/cross-chain) under PQ transition, as they often dominate real-world failure modes."}, "questions": {"value": "See above comments."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "n/a"}, "rating": {"value": 2}, "confidence": {"value": 2}, "code_of_conduct": {"value": "Yes"}}, "id": "kDC8OrZ61m", "forum": "zOaKaSMwdn", "replyto": "zOaKaSMwdn", "signatures": ["ICLR.cc/2026/Conference/Submission8471/Reviewer_eAmK"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8471/Reviewer_eAmK"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission8471/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1760587005830, "cdate": 1760587005830, "tmdate": 1762920352260, "mdate": 1762920352260, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper is fundamentally unsuitable for ICLR. This work is purely an engineering application of an already-standardized NIST cryptographic algorithm with zero novel algorithmic or learning-based contributions. The claimed \"post-quantum framework\" is nothing more than a straightforward combination of existing technologies (CRYSTALS-Dilithium, Ethereum, standard Solidity), making it an implementation report rather than a research contribution. Most critically, the proposal is technically infeasible: a 96.7% reduction in block capacity would render stablecoin systems non-functional, yet the authors casually dismiss this as \"manageable\" without any credible mitigation strategy or honest discussion of the fundamental trade-offs involved. The performance analysis is unreliable, mixing simulations from a custom implementation with contradictory testnet data (claiming 292 TPS throughput while actually achieving 0.019 TPS in practice), and the security claims confuse assumptions about lattice hardness with proven quantum resistance, misrepresenting both ECDSA's vulnerability and Dilithium's actual guarantees. In short, this reads as a flawed technical report that oversells an impractical application of existing cryptography, lacks rigor in analysis, and has no place at a top-tier ML conference—or honestly at any rigorous security venue either."}, "soundness": {"value": 1}, "presentation": {"value": 1}, "contribution": {"value": 1}, "strengths": {"value": "This paper attempts to analyze the broader systemic implications of quantum computing threats across the entire cryptocurrency and blockchain ecosystem."}, "weaknesses": {"value": "This paper just isn’t a fit for ICLR, and it doesn’t really stand out from the many existing papers on PQC migration. On top of that, a lot of the numbers don’t add up. For instance, in Table 2, if an ECDSA tx is 112 B and TPS is 465, you’d need about 112×465×8 = 417 kbps, but the table says 280 kbps. Meanwhile, for Dilithium, 3,405 B × 292 × 8 = 7.95 Mbps, which lines up with the listed 8,512 kbps"}, "questions": {"value": "Does Dilithium-3 actually guarantee \"192-bit security\" against quantum attacks as in Table 3?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "no"}, "rating": {"value": 0}, "confidence": {"value": 5}, "code_of_conduct": {"value": "Yes"}}, "id": "AP0FBjz8Yd", "forum": "zOaKaSMwdn", "replyto": "zOaKaSMwdn", "signatures": ["ICLR.cc/2026/Conference/Submission8471/Reviewer_oUtM"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8471/Reviewer_oUtM"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission8471/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761927068164, "cdate": 1761927068164, "tmdate": 1762920351778, "mdate": 1762920351778, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper addresses the imminent threat posed by Shor's algorithm to the classical cryptographic foundations (like ECDSA and RSA) of stablecoins. The authors present a comprehensive post-quantum cryptographic framework for stablecoin smart contracts and digital wallets, centering on the CRYSTALS-Dilithium scheme. Their primary contribution is the design, implementation on the Ethereum Sepolia Testnet, and extensive performance evaluation (using 50k transactions) of this framework. The results demonstrate that Dilithium3 can provide the requisite 192-bit quantum-resistant security with acceptable overheads, including a 2.34x signature generation time, 1.22x verification time, and a sustained throughput of 292 TPS for transfers."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper focuses on application and robust testing as limited prior work has addressed quantum threats specifically within stablecoin systems. The framework proposes and experimentally validates the integration of CRYSTALS-Dilithium for stablecoin smart contracts, complete with concrete Solidity implementation details and gas optimization strategies. The extensive experimental section, comparing ECDSA and Dilithium across key generation, signature operations, and blockchain metrics (throughput, gas, storage) using 50,000 transactions is a key aspect that grounds the entire proposal in tangible data."}, "weaknesses": {"value": "The primary constructive weakness lies in the performance and storage overheads, which are analyzed but not fully mitigated within the proposed framework. The 51.45x increase in signature size and subsequent 96.7% reduction in block capacity poses a severe scalability challenge that even with the proposed 292 TPS, fundamentally limits the adoption of this solution for high-volume blockchain networks. While the authors mention Layer-2 solutions as future work, the paper could be strengthened by a deeper architectural discussion on how the current on-chain framework could scale (e.g., through block size adjustments or state channel offloading) to fully overcome this dramatic transaction size increase. Also, the economic analysis states a $900,000 development cost but only focuses on two cost factors, development and annual operational increase. A more thorough breakdown of the economic viability, including the projected cost savings from avoiding a quantum attack (i.e., Risk-Adjusted Return on Investment) would enhance the business case."}, "questions": {"value": "1) Given the critical weakness of the $51.45\\times$ signature size and 96.7\\% block capacity reduction, could the authors elaborate on alternative near-term mitigation strategies within the smart contract layer (e.g., proof-of-concept for signature aggregation/batching specifically for Dilithium in a smart contract, or alternative data compression techniques beyond what is mentioned in Section 4.3 and 5.2) to alleviate the on-chain storage burden before resorting to a Layer-2 scaling solution?\n2) In phase 2, hybrid operation plan has a duration of 12-24 months and authors mentions a gradual user migration with 92% completion rate. What specific mechanisms are in place to manage the remaining 8% of users/funds? In the event of a critical quantum threat realization during this hybrid period, what is the protocol for quickly migrating or freezing the assets secured only by the vulnerable classical ECDSA to ensure complete security of the overall stablecoin system?\n3) Authors mention the implementation uses number theoretic transform for polynomial multiplication and optimized storage for large public keys. Could the authors provide a more detailed breakdown of the gas consumption by smart contract function (e.g., separate gas usage for polynomial arithmetic, modular reduction, and hint verification) to pinpoint the largest computational cost driver and focus future optimization efforts?"}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 2}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "e7GXMKgY00", "forum": "zOaKaSMwdn", "replyto": "zOaKaSMwdn", "signatures": ["ICLR.cc/2026/Conference/Submission8471/Reviewer_VNmL"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission8471/Reviewer_VNmL"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission8471/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1762200903521, "cdate": 1762200903521, "tmdate": 1762920351444, "mdate": 1762920351444, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}