{"id": "ZURYrJgigi", "number": 22854, "cdate": 1758336359118, "mdate": 1763741395043, "content": {"title": "Topological Anomaly Quantification for Semi-supervised Graph Anomaly Detection", "abstract": "Semi-supervised graph anomaly detection identifies nodes deviating from normal patterns using a limited set of labeled nodes. This paper specifically addresses the challenging scenario where only normal node labels are available. To address the challenge of anomaly scarcity in real-world graphs, generative-based methods synthesize anomalies by linear/non-linear interpolation or random noise perturbation. However, these methods lack a quantitative assessment of anomalies, hindering the reliability of the generated ones. To overcome this limitation, we propose a generative graph anomaly detection model based on topological anomaly quantification (TAQ-GAD). First, we design a topological anomaly quantification module (TAQ), which quantifies node abnormality through two topological metrics: The node boundary score (NBS) quantifies the boundaryness of a node by evaluating its connectivity to labeled normal neighbors. The node isolation score (NIS) assesses the structural isolation of a node by evaluating its connection strength to other nodes within the same category. This anomaly measurement module dynamically screens nodes with high anomaly scores as pseudo-anomaly nodes. Subsequently, the topological anomaly enhancement (TAE) module generates virtual anomaly center nodes and constructs their topological relationships with other nodes. Finally, the method integrates normal and pseudo-anomaly nodes on the enhanced graph for model training. Extensive experiments on benchmark datasets demonstrate TAQ-GAD’s superiority over state-of-the-art methods and effectively improve anomaly detection performance.", "tldr": "", "keywords": ["Graph neural network", "graph anomaly detection", "semi-supervised graph anomaly detection"], "primary_area": "learning on graphs and other geometries & topologies", "venue": "ICLR 2026 Conference Submission", "pdf": "/pdf/4522869a4ec880edf9be36911193d418eb7b2e9c.pdf", "supplementary_material": ""}, "replies": [{"content": {"summary": {"value": "This paper proposes a generative graph anomaly detection model based on topological anomaly quantification (TAQ-GAD).  A topological anomaly quantification module (TAQ) quantifies node abnormality through two topological metrics: NBS and NIS. This anomaly measurement module dynamically screens nodes with high anomaly scores as pseudo-anomaly nodes. Subsequently, the topological anomaly enhancement (TAE) module generates virtual anomaly center nodes and constructs their topological relationships with other nodes. Finally, the method integrates normal and pseudo-anomaly nodes on the enhanced graph for model training. Extensive experiments on benchmark datasets demonstrate TAQ-GAD’s superiority over state-of-the-art methods and effectively improve anomaly detection performance."}, "soundness": {"value": 3}, "presentation": {"value": 4}, "contribution": {"value": 3}, "strengths": {"value": "+ The manuscript is well-crafted and clearly structured.\n+ The paper presents compelling experimental results supported by rigorous comparisons. \n+ The ablation study offers valuable insights\n+ The comprehensive appendix significantly strengthens the work."}, "weaknesses": {"value": "+ The current study focuses solely on topological anomalies. Please justify this design choice and clarify whether the datasets predominantly contain topological anomalies.\n+ The selection of hyperparameters for the existing methods is not discussed.\n+ In the label flipping strategy, the statement in the paper is \"if the node's neighbors show high confidence in the opposite class\". How is the specific threshold for \"sufficiently large\" determined? Is it a fixed value, a dataset-dependent hyperparameter? \n+ When calculating the class centroids, which nodes are specifically referred to by \"based on the current labeled nodes\"?\n+ Typos issues, e.g., “Where $\\lambda_{1}$and $\\lambda_{2}$ are hyperparameters”."}, "questions": {"value": "Please refer to the Weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 8}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "cwepWeufz7", "forum": "ZURYrJgigi", "replyto": "ZURYrJgigi", "signatures": ["ICLR.cc/2026/Conference/Submission22854/Reviewer_4ajr"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22854/Reviewer_4ajr"], "number": 1, "invitations": ["ICLR.cc/2026/Conference/Submission22854/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761794285862, "cdate": 1761794285862, "tmdate": 1763001681639, "mdate": 1763001681639, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper proposes TAQ-GAD, a semi-supervised graph anomaly detection method designed for scenarios where only normal nodes are labeled. The approach introduces a Topology-Aware Quantification (TAQ) module to measure each node’s boundary and isolation scores, identifying potential anomalies based on structural characteristics. It further employs a Topology-Aware Enhancement (TAE) module that creates virtual anomaly centers and applies risk-aware pseudo-labeling to strengthen anomaly representation. Experiments on multiple benchmark datasets show that TAQ-GAD significantly outperforms existing methods, demonstrating strong robustness and generalization ability."}, "soundness": {"value": 3}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "The paper tackles a challenging semi-supervised graph anomaly detection setting where only normal nodes are labeled; this is a realistic and underexplored problem.\n\nThe proposed TAQ-GAD framework is conceptually clear, combining structural quantification (NBS/NIS/PIS) with topology-aware data augmentation (TAE).\n\nThe TAQ module provides interpretable metrics that capture both boundary proximity and structural isolation, which are intuitive and effective."}, "weaknesses": {"value": "1. Methodological Limitation — Not Realistic for True Anomaly Detection:\n\nThe proposed TAQ-GAD framework heavily relies on neighborhood label statistics, especially through its Node Boundary Score (NBS) and Node Isolation Score (NIS).However, in real anomaly detection scenarios:\n* Anomalies are inherently rare, often less than 1–5% of total nodes.\n* The assumption that “normal nodes cluster together and anomalies cluster together” is unrealistic — in many graphs (e.g., financial fraud, cybersecurity, IoT networks), anomalies are structurally mixed within normal communities.\n* Consequently, computing NBS or NIS using the local density of labeled normal nodes implicitly assumes a strong topological separation between normal and anomalous nodes, which may not exist in practice.\n\nTAQ-GAD is not learning “anomalousness” from data, but rather imposing a strong heuristic constraint that fits specific benchmark graphs.\n\n2. Label Dependency — Not Truly Semi-Supervised\n\nAlthough the paper claims to address the semi-supervised anomaly detection setting, its implementation contradicts this claim:\n\n* The paper uses 60% / 20% / 20% train/validation/test splits, meaning a large fraction of nodes (including many normals) are labeled for training.\n\n* In contrast, GGAD and other baseline works typically use only 15% labeled normal nodes to simulate a truly low-label semi-supervised scenario.\n\n* Furthermore, both works control labeled ratio via the same variable ρ, but ρ in TAQ-GAD refers to a much larger absolute label count, making the comparison unfair.\n\nTAQ-GAD’s strong performance likely stems from having access to far more label information, not from the novelty of its topology quantification.\n\n3. The definitions of NBS and NIS inherently bias the model toward datasets with: Clear community separation between normal and anomalous nodes, homogeneous degree distributions (since both metrics rely on K-hop neighbor density). This structural bias means the method may overfit to benchmark datasets like Amazon or Reddit, which have cleaner topologies, and fail on real-world heterogeneous graphs (e.g., fraud networks, financial transaction graphs).\n\n4. Because both TAQ and TAE modules are built upon graph topology and labeled-normal density, the framework is not agnostic to graph structure. The “topology-aware” quantification might work as a feature engineering trick in specific graphs, but lacks generalizability across: Dynamic or time-evolving graphs, Multi-relation heterogeneous graphs, or Graphs with partial/noisy labeling."}, "questions": {"value": "Factually speaking, datasets in the graph domain often have their own particularities depending on the scenario and task. For example, in the datasets used in this paper, the clear separation between normal and anomalous nodes largely comes from the way researchers artificially define and split the data for different tasks. This setting is far from real-world conditions. Therefore, I believe the authors should consider developing a more general and realistic approach, rather than designing a method that only fits the specific characteristics of these benchmark datasets."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "9J9mz3t01B", "forum": "ZURYrJgigi", "replyto": "ZURYrJgigi", "signatures": ["ICLR.cc/2026/Conference/Submission22854/Reviewer_AXae"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22854/Reviewer_AXae"], "number": 2, "invitations": ["ICLR.cc/2026/Conference/Submission22854/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761892636558, "cdate": 1761892636558, "tmdate": 1762942415215, "mdate": 1762942415215, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "This paper tackles semi-supervised Graph Anomaly Detection (GAD) with only normal node labels. The proposed framework, TAQ-GAD, introduces two topological metrics—Node Boundary Score (NBS) and Proxy Isolation Score (PIS)—to identify pseudo-anomalies and assign pseudo-labels. A Topological Anomaly Enhancement (TAE) module further generates virtual anomaly centers and their topological relations, improving the quality of pseudo-anomaly generation."}, "soundness": {"value": 2}, "presentation": {"value": 3}, "contribution": {"value": 2}, "strengths": {"value": "1. The logical flow of the paper effectively guides the reader through the proposed solution and its evaluation.\n2. Formal definitions and theoretical analysis of the proposed metrics enhance interpretability and reliability. \n3. The experimental evaluation is fairly comprehensive, covering multiple datasets and various baseline methods."}, "weaknesses": {"value": "1. The proposed method is topology-centric, and performance may degrade on graphs with noisy or unreliable structure. Feature-level anomalies may not be captured when the detection relies solely on topology, which could limit robustness in cases where structural information is noisy or uninformative.\n2. While PIS is claimed to be a key component of TAQ-GAD, its weight in the scoring function is set almost negligibly compared to NBS. Specifically, the implementation fixes $\\lambda_{1} = 1$ for NBS and $\\lambda_{2} = 0.001$ for PIS across all datasets. This large imbalance (1000:1 ratio) raises doubts about whether PIS truly contributes to the model. Moreover, no sensitivity analysis on λ₁ and λ₂ is provided, making it unclear if PIS has any substantive impact on performance."}, "questions": {"value": "1. In Table 2, the ablation study reports results for “+NBS”, “+NIS”, and “+NBS+NIS”. However, according to Equation (5), the pseudo-anomaly scoring in TAQ-GAD is actually based on NBS and PIS, rather than NIS. Could you clarify whether the ablation table contains a writing error, or if NIS was intentionally used instead of PIS in the ablation experiments?\n2. Although $\\alpha$ and $\\beta$ show robustness, the selection of $\\tau$ (pseudo-anomaly ratio) can heavily influence performance and may require dataset-specific tuning."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "None"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "KrvpiUAGzP", "forum": "ZURYrJgigi", "replyto": "ZURYrJgigi", "signatures": ["ICLR.cc/2026/Conference/Submission22854/Reviewer_DW3F"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22854/Reviewer_DW3F"], "number": 3, "invitations": ["ICLR.cc/2026/Conference/Submission22854/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761897782426, "cdate": 1761897782426, "tmdate": 1762942414709, "mdate": 1762942414709, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}, {"content": {"summary": {"value": "The paper introduces TAQ-GAD, a semi-supervised graph anomaly detection framework that quantifies node abnormality using two topological metrics: Node Boundary Score (NBS) and Node Isolation Score (NIS). These metrics guide pseudo-anomaly selection, while the Topological Anomaly Enhancement (TAE) module refines them through risk-based label flipping and virtual anomaly centres. The paper achieve significant performance improvement on the selected datasets."}, "soundness": {"value": 2}, "presentation": {"value": 2}, "contribution": {"value": 2}, "strengths": {"value": "1. The proposed method is fairly easy to follow.\n2. The framework plot is informative, making it easier to understand the overall workflow.\n3. The proposed methods achieved competitive performance on the selected dataset."}, "weaknesses": {"value": "1. My understanding is that the proposed method mainly achieves performance gain through pseudo labelling. However, I didn’t find (at least the paper not specifically mentioned) any comparison with training SOTA supervised GAD methods on pseudo labels generated by naïve pseudo labelling strategies. This is essential for evaluating whether the proposed pseudo labelling methods are more effective.\n\n2. The authors mentioned unsupervised methods, “their heavy reliance on intrinsic graph structures to define anomalies introduces fundamental ambiguity, often failing to distinguish genuine semantic anomalies from rare yet normal patterns.” However, the proposed method leverages node degree and graph homophily. Why are these graph properties more robust for GAD?\n\n3. In Eq. 9 the regularisation term is similar to weight decay. Why are two balancing parameters required?\n\n4. The baseline selection, including unsupervised and semi-supervised baselines, adapts some well-known unsupervised methods for semi-supervised evaluation. However, how they are adapted for semi-supervised GAD is not clearly discussed. This is important for fair comparison. In addition, some results appear to be missing in Table 1. Also, most of the baselines are unsupervised methods; it would make the evaluation stronger if supervised and more semi-supervised methods were studied.\n\n5. In the related work section, the semi-supervised methods part mixes methods that use labelled anomalies and those that only use labelled normal training data. They should be discussed separately. Other than BWGNN, there are a lot more recent supervised methods that are not discussed. Also, recent generalist methods have shown promising cross-dataset performance. The relationship of the paper’s setting with those methods' should be discussed.\n\n6. In the references, there are quite a few papers that were listed as arXiv preprints but are actually published papers in well-regarded conferences and journals."}, "questions": {"value": "Please refer to my weaknesses."}, "flag_for_ethics_review": {"value": ["No ethics review needed."]}, "details_of_ethics_concerns": {"value": "N/A"}, "rating": {"value": 4}, "confidence": {"value": 4}, "code_of_conduct": {"value": "Yes"}}, "id": "bvA59cJhiK", "forum": "ZURYrJgigi", "replyto": "ZURYrJgigi", "signatures": ["ICLR.cc/2026/Conference/Submission22854/Reviewer_Ad2j"], "nonreaders": [], "readers": ["everyone"], "writers": ["ICLR.cc/2026/Conference", "ICLR.cc/2026/Conference/Submission22854/Reviewer_Ad2j"], "number": 4, "invitations": ["ICLR.cc/2026/Conference/Submission22854/-/Official_Review", "ICLR.cc/2026/Conference/-/Edit"], "domain": "ICLR.cc/2026/Conference", "tcdate": 1761998970038, "cdate": 1761998970038, "tmdate": 1762942414104, "mdate": 1762942414104, "parentInvitations": "ICLR.cc/2026/Conference/-/Official_Review", "license": "CC BY 4.0", "version": 2}], "withdrawn": false}